#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Ajito_ch0400

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ActionSystem_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Ajito_ch0400.ABP_Ajito_ch0400_C
// 0x09C0 (0x10F0 - 0x0730)
class UABP_Ajito_ch0400_C final : public URSAjitoAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0730(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FASAnimNode_StateMachine               ASAnimGraphNode_StateMachine;                      // 0x0738(0x02B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x09F0(0x00B8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0AA8(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0AC8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0B68(0x0078)()
	bool                                          __CustomProperty_bKawaiiPhysics_4A8383624000D2B6E96D838E9D8AA1ED; // 0x0BE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73E9[0x3];                                     // 0x0BE1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __CustomProperty_PhysicsIdlingSec_4A8383624000D2B6E96D838E9D8AA1ED; // 0x0BE4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __CustomProperty_PhysicsAlpha_4A8383624000D2B6E96D838E9D8AA1ED; // 0x0BE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73EA[0x4];                                     // 0x0BEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x0BF0(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0C90(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x0D50(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0D98(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0DC0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0DE8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0E30(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0EA8(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0F48(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1050(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1070(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x10A0(0x0048)()

public:
	void ExecuteUbergraph_ABP_Ajito_ch0400(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void InitializeFromParentActor();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Ajito_ch0400_C">();
	}
	static class UABP_Ajito_ch0400_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Ajito_ch0400_C>();
	}
};
static_assert(alignof(UABP_Ajito_ch0400_C) == 0x000010, "Wrong alignment on UABP_Ajito_ch0400_C");
static_assert(sizeof(UABP_Ajito_ch0400_C) == 0x0010F0, "Wrong size on UABP_Ajito_ch0400_C");
static_assert(offsetof(UABP_Ajito_ch0400_C, UberGraphFrame) == 0x000730, "Member 'UABP_Ajito_ch0400_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0400_C, ASAnimGraphNode_StateMachine) == 0x000738, "Member 'UABP_Ajito_ch0400_C::ASAnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0400_C, AnimGraphNode_SaveCachedPose) == 0x0009F0, "Member 'UABP_Ajito_ch0400_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0400_C, AnimGraphNode_LocalToComponentSpace) == 0x000AA8, "Member 'UABP_Ajito_ch0400_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0400_C, AnimGraphNode_BlendListByBool_1) == 0x000AC8, "Member 'UABP_Ajito_ch0400_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0400_C, AnimGraphNode_SequencePlayer_1) == 0x000B68, "Member 'UABP_Ajito_ch0400_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0400_C, __CustomProperty_bKawaiiPhysics_4A8383624000D2B6E96D838E9D8AA1ED) == 0x000BE0, "Member 'UABP_Ajito_ch0400_C::__CustomProperty_bKawaiiPhysics_4A8383624000D2B6E96D838E9D8AA1ED' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0400_C, __CustomProperty_PhysicsIdlingSec_4A8383624000D2B6E96D838E9D8AA1ED) == 0x000BE4, "Member 'UABP_Ajito_ch0400_C::__CustomProperty_PhysicsIdlingSec_4A8383624000D2B6E96D838E9D8AA1ED' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0400_C, __CustomProperty_PhysicsAlpha_4A8383624000D2B6E96D838E9D8AA1ED) == 0x000BE8, "Member 'UABP_Ajito_ch0400_C::__CustomProperty_PhysicsAlpha_4A8383624000D2B6E96D838E9D8AA1ED' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0400_C, AnimGraphNode_LinkedAnimGraph) == 0x000BF0, "Member 'UABP_Ajito_ch0400_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0400_C, AnimGraphNode_LayeredBoneBlend) == 0x000C90, "Member 'UABP_Ajito_ch0400_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0400_C, AnimGraphNode_Slot_2) == 0x000D50, "Member 'UABP_Ajito_ch0400_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0400_C, AnimGraphNode_UseCachedPose_1) == 0x000D98, "Member 'UABP_Ajito_ch0400_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0400_C, AnimGraphNode_UseCachedPose) == 0x000DC0, "Member 'UABP_Ajito_ch0400_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0400_C, AnimGraphNode_Slot_1) == 0x000DE8, "Member 'UABP_Ajito_ch0400_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0400_C, AnimGraphNode_SequencePlayer) == 0x000E30, "Member 'UABP_Ajito_ch0400_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0400_C, AnimGraphNode_BlendListByBool) == 0x000EA8, "Member 'UABP_Ajito_ch0400_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0400_C, AnimGraphNode_ModifyBone) == 0x000F48, "Member 'UABP_Ajito_ch0400_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0400_C, AnimGraphNode_ComponentToLocalSpace) == 0x001050, "Member 'UABP_Ajito_ch0400_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0400_C, AnimGraphNode_Root) == 0x001070, "Member 'UABP_Ajito_ch0400_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0400_C, AnimGraphNode_Slot) == 0x0010A0, "Member 'UABP_Ajito_ch0400_C::AnimGraphNode_Slot' has a wrong offset!");

}

