#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_wp0400

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_wp0400.ABP_wp0400_C
// 0x1720 (0x1CB0 - 0x0590)
class UABP_wp0400_C final : public UWp0400AnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0598(0x0030)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_21;                       // 0x05C8(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x06D0(0x0020)()
	struct FAnimNode_MeshSpaceRefPose             AnimGraphNode_MeshRefPose;                         // 0x06F0(0x0010)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_20;                       // 0x0700(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_19;                       // 0x0808(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_18;                       // 0x0910(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_17;                       // 0x0A18(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_16;                       // 0x0B20(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_15;                       // 0x0C28(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_14;                       // 0x0D30(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_13;                       // 0x0E38(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_12;                       // 0x0F40(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x1048(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x1150(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x1258(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x1360(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x1468(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x1570(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x1678(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x1780(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x1888(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1990(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1A98(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1BA0(0x0108)()

public:
	void ExecuteUbergraph_ABP_wp0400(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_wp0400_C">();
	}
	static class UABP_wp0400_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_wp0400_C>();
	}
};
static_assert(alignof(UABP_wp0400_C) == 0x000010, "Wrong alignment on UABP_wp0400_C");
static_assert(sizeof(UABP_wp0400_C) == 0x001CB0, "Wrong size on UABP_wp0400_C");
static_assert(offsetof(UABP_wp0400_C, UberGraphFrame) == 0x000590, "Member 'UABP_wp0400_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_Root) == 0x000598, "Member 'UABP_wp0400_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_ModifyBone_21) == 0x0005C8, "Member 'UABP_wp0400_C::AnimGraphNode_ModifyBone_21' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_ComponentToLocalSpace) == 0x0006D0, "Member 'UABP_wp0400_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_MeshRefPose) == 0x0006F0, "Member 'UABP_wp0400_C::AnimGraphNode_MeshRefPose' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_ModifyBone_20) == 0x000700, "Member 'UABP_wp0400_C::AnimGraphNode_ModifyBone_20' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_ModifyBone_19) == 0x000808, "Member 'UABP_wp0400_C::AnimGraphNode_ModifyBone_19' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_ModifyBone_18) == 0x000910, "Member 'UABP_wp0400_C::AnimGraphNode_ModifyBone_18' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_ModifyBone_17) == 0x000A18, "Member 'UABP_wp0400_C::AnimGraphNode_ModifyBone_17' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_ModifyBone_16) == 0x000B20, "Member 'UABP_wp0400_C::AnimGraphNode_ModifyBone_16' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_ModifyBone_15) == 0x000C28, "Member 'UABP_wp0400_C::AnimGraphNode_ModifyBone_15' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_ModifyBone_14) == 0x000D30, "Member 'UABP_wp0400_C::AnimGraphNode_ModifyBone_14' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_ModifyBone_13) == 0x000E38, "Member 'UABP_wp0400_C::AnimGraphNode_ModifyBone_13' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_ModifyBone_12) == 0x000F40, "Member 'UABP_wp0400_C::AnimGraphNode_ModifyBone_12' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_ModifyBone_11) == 0x001048, "Member 'UABP_wp0400_C::AnimGraphNode_ModifyBone_11' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_ModifyBone_10) == 0x001150, "Member 'UABP_wp0400_C::AnimGraphNode_ModifyBone_10' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_ModifyBone_9) == 0x001258, "Member 'UABP_wp0400_C::AnimGraphNode_ModifyBone_9' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_ModifyBone_8) == 0x001360, "Member 'UABP_wp0400_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_ModifyBone_7) == 0x001468, "Member 'UABP_wp0400_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_ModifyBone_6) == 0x001570, "Member 'UABP_wp0400_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_ModifyBone_5) == 0x001678, "Member 'UABP_wp0400_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_ModifyBone_4) == 0x001780, "Member 'UABP_wp0400_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_ModifyBone_3) == 0x001888, "Member 'UABP_wp0400_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_ModifyBone_2) == 0x001990, "Member 'UABP_wp0400_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_ModifyBone_1) == 0x001A98, "Member 'UABP_wp0400_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_wp0400_C, AnimGraphNode_ModifyBone) == 0x001BA0, "Member 'UABP_wp0400_C::AnimGraphNode_ModifyBone' has a wrong offset!");

}

