#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_HologramCh0600

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_HologramCh0600.ABP_HologramCh0600_C.ExecuteUbergraph_ABP_HologramCh0600
// 0x0004 (0x0004 - 0x0000)
struct ABP_HologramCh0600_C_ExecuteUbergraph_ABP_HologramCh0600 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_HologramCh0600_C_ExecuteUbergraph_ABP_HologramCh0600) == 0x000004, "Wrong alignment on ABP_HologramCh0600_C_ExecuteUbergraph_ABP_HologramCh0600");
static_assert(sizeof(ABP_HologramCh0600_C_ExecuteUbergraph_ABP_HologramCh0600) == 0x000004, "Wrong size on ABP_HologramCh0600_C_ExecuteUbergraph_ABP_HologramCh0600");
static_assert(offsetof(ABP_HologramCh0600_C_ExecuteUbergraph_ABP_HologramCh0600, EntryPoint) == 0x000000, "Member 'ABP_HologramCh0600_C_ExecuteUbergraph_ABP_HologramCh0600::EntryPoint' has a wrong offset!");

// Function ABP_HologramCh0600.ABP_HologramCh0600_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_HologramCh0600_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_HologramCh0600_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_HologramCh0600_C_AnimGraph");
static_assert(sizeof(ABP_HologramCh0600_C_AnimGraph) == 0x000010, "Wrong size on ABP_HologramCh0600_C_AnimGraph");
static_assert(offsetof(ABP_HologramCh0600_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ABP_HologramCh0600_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

