#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_om0664_Ajito

#include "Basic.hpp"

#include "ActionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_om0664_Ajito.ABP_om0664_Ajito_C
// 0x02F0 (0x0A20 - 0x0730)
class UABP_om0664_Ajito_C final : public URSAjitoAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0730(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0738(0x0030)()
	struct FASAnimNode_StateMachine               ASAnimGraphNode_StateMachine;                      // 0x0768(0x02B8)()

public:
	void ExecuteUbergraph_ABP_om0664_Ajito(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_om0664_Ajito_C">();
	}
	static class UABP_om0664_Ajito_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_om0664_Ajito_C>();
	}
};
static_assert(alignof(UABP_om0664_Ajito_C) == 0x000010, "Wrong alignment on UABP_om0664_Ajito_C");
static_assert(sizeof(UABP_om0664_Ajito_C) == 0x000A20, "Wrong size on UABP_om0664_Ajito_C");
static_assert(offsetof(UABP_om0664_Ajito_C, UberGraphFrame) == 0x000730, "Member 'UABP_om0664_Ajito_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_om0664_Ajito_C, AnimGraphNode_Root) == 0x000738, "Member 'UABP_om0664_Ajito_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_om0664_Ajito_C, ASAnimGraphNode_StateMachine) == 0x000768, "Member 'UABP_om0664_Ajito_C::ASAnimGraphNode_StateMachine' has a wrong offset!");

}

