#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_ch0700_Sub_Physics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_ch0700_Sub_Physics.ABP_ch0700_Sub_Physics_C
// 0x5820 (0x5AA0 - 0x0280)
class UABP_ch0700_Sub_Physics_C final : public URSPlayerSubAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0288(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0300(0x0030)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_37;                    // 0x0330(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_36;                    // 0x0570(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_35;                    // 0x07B0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_34;                    // 0x09F0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_33;                    // 0x0C30(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_32;                    // 0x0E70(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_31;                    // 0x10B0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_30;                    // 0x12F0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_29;                    // 0x1530(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_28;                    // 0x1770(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_27;                    // 0x19B0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_26;                    // 0x1BF0(0x0240)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1E30(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1E50(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_25;                    // 0x1E70(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_24;                    // 0x20B0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_23;                    // 0x22F0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_22;                    // 0x2530(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_21;                    // 0x2770(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_20;                    // 0x29B0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0x2BF0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0x2E30(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0x3070(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0x32B0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0x34F0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x3730(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x3970(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x3BB0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x3DF0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x4030(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x4270(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x44B0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x46F0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x4930(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x4B70(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x4DB0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x4FF0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x5230(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x5470(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x56B0(0x0240)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x58F0(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x59A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x59D0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x59F8(0x00A0)()

public:
	void ExecuteUbergraph_ABP_ch0700_Sub_Physics(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0700_Sub_Physics_AnimGraphNode_KawaiiPhysics_2927CBFA439597280593D38030CF3877();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0700_Sub_Physics_AnimGraphNode_KawaiiPhysics_BAB843CF49E671643AF310A6B15090BF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0700_Sub_Physics_AnimGraphNode_KawaiiPhysics_56D9AABE4797619FEFCEB9ADA78CE7CB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0700_Sub_Physics_AnimGraphNode_KawaiiPhysics_22BAC8114A6F93E766B5A6AA28F84799();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0700_Sub_Physics_AnimGraphNode_KawaiiPhysics_E5C355A142CEC83D256FEA9ECE310F17();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0700_Sub_Physics_AnimGraphNode_KawaiiPhysics_2DE4C9F8465AD70C0857C482F2D253F2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0700_Sub_Physics_AnimGraphNode_KawaiiPhysics_EA30BE1B4CDD673E89E43AB3A23788A1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0700_Sub_Physics_AnimGraphNode_KawaiiPhysics_30E9690C45159440F9FAE08927050E68();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0700_Sub_Physics_AnimGraphNode_KawaiiPhysics_65DF1530413EFB02DC5076B152B5D12A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0700_Sub_Physics_AnimGraphNode_KawaiiPhysics_3477EF8142F4FF053AA5D7994A6DF0CA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0700_Sub_Physics_AnimGraphNode_KawaiiPhysics_1CDF0BDE447B672D4710FDA828441F88();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0700_Sub_Physics_AnimGraphNode_KawaiiPhysics_400F20044D66136A15CB19B4EE99E9FE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0700_Sub_Physics_AnimGraphNode_KawaiiPhysics_C09DE66C4FF9C2BA917403851C73019D();
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_ch0700_Sub_Physics_C">();
	}
	static class UABP_ch0700_Sub_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_ch0700_Sub_Physics_C>();
	}
};
static_assert(alignof(UABP_ch0700_Sub_Physics_C) == 0x000010, "Wrong alignment on UABP_ch0700_Sub_Physics_C");
static_assert(sizeof(UABP_ch0700_Sub_Physics_C) == 0x005AA0, "Wrong size on UABP_ch0700_Sub_Physics_C");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, UberGraphFrame) == 0x000280, "Member 'UABP_ch0700_Sub_Physics_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_SubInput) == 0x000288, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_Root) == 0x000300, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_37) == 0x000330, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_37' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_36) == 0x000570, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_36' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_35) == 0x0007B0, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_35' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_34) == 0x0009F0, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_34' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_33) == 0x000C30, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_33' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_32) == 0x000E70, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_32' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_31) == 0x0010B0, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_31' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_30) == 0x0012F0, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_30' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_29) == 0x001530, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_29' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_28) == 0x001770, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_28' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_27) == 0x0019B0, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_27' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_26) == 0x001BF0, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_26' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_ComponentToLocalSpace) == 0x001E30, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_LocalToComponentSpace) == 0x001E50, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_25) == 0x001E70, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_25' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_24) == 0x0020B0, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_24' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_23) == 0x0022F0, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_23' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_22) == 0x002530, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_22' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_21) == 0x002770, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_21' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_20) == 0x0029B0, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_20' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_19) == 0x002BF0, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_19' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_18) == 0x002E30, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_18' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_17) == 0x003070, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_17' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_16) == 0x0032B0, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_16' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_15) == 0x0034F0, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_15' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_14) == 0x003730, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_14' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_13) == 0x003970, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_13' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_12) == 0x003BB0, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_12' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_11) == 0x003DF0, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_11' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_10) == 0x004030, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_10' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_9) == 0x004270, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_8) == 0x0044B0, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_7) == 0x0046F0, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_6) == 0x004930, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_5) == 0x004B70, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_4) == 0x004DB0, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_3) == 0x004FF0, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_2) == 0x005230, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_1) == 0x005470, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_KawaiiPhysics) == 0x0056B0, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_SaveCachedPose) == 0x0058F0, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_UseCachedPose_1) == 0x0059A8, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_UseCachedPose) == 0x0059D0, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_ch0700_Sub_Physics_C, AnimGraphNode_BlendListByBool) == 0x0059F8, "Member 'UABP_ch0700_Sub_Physics_C::AnimGraphNode_BlendListByBool' has a wrong offset!");

}

