#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_HologramCh0600

#include "Basic.hpp"

#include "ActionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_HologramCh0600.ABP_HologramCh0600_C
// 0x0490 (0x0730 - 0x02A0)
class UABP_HologramCh0600_C final : public URSPlayerHologramAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02A8(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x02D8(0x0048)()
	struct FASAnimNode_StateMachine               ASAnimGraphNode_StateMachine;                      // 0x0320(0x02B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x05D8(0x00A0)()
	bool                                          __CustomProperty_bKawaiiPhysics_09BCBCB5416D40D9B6056BAAEA53A7DB; // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87A2[0x3];                                     // 0x0679(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __CustomProperty_PhysicsIdlingSec_09BCBCB5416D40D9B6056BAAEA53A7DB; // 0x067C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __CustomProperty_PhysicsAlpha_09BCBCB5416D40D9B6056BAAEA53A7DB; // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87A3[0x4];                                     // 0x0684(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_SubInstance;                         // 0x0688(0x00A0)()

public:
	void ExecuteUbergraph_ABP_HologramCh0600(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_HologramCh0600_C">();
	}
	static class UABP_HologramCh0600_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_HologramCh0600_C>();
	}
};
static_assert(alignof(UABP_HologramCh0600_C) == 0x000010, "Wrong alignment on UABP_HologramCh0600_C");
static_assert(sizeof(UABP_HologramCh0600_C) == 0x000730, "Wrong size on UABP_HologramCh0600_C");
static_assert(offsetof(UABP_HologramCh0600_C, UberGraphFrame) == 0x0002A0, "Member 'UABP_HologramCh0600_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0600_C, AnimGraphNode_Root) == 0x0002A8, "Member 'UABP_HologramCh0600_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0600_C, AnimGraphNode_Slot) == 0x0002D8, "Member 'UABP_HologramCh0600_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0600_C, ASAnimGraphNode_StateMachine) == 0x000320, "Member 'UABP_HologramCh0600_C::ASAnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0600_C, AnimGraphNode_BlendListByBool) == 0x0005D8, "Member 'UABP_HologramCh0600_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0600_C, __CustomProperty_bKawaiiPhysics_09BCBCB5416D40D9B6056BAAEA53A7DB) == 0x000678, "Member 'UABP_HologramCh0600_C::__CustomProperty_bKawaiiPhysics_09BCBCB5416D40D9B6056BAAEA53A7DB' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0600_C, __CustomProperty_PhysicsIdlingSec_09BCBCB5416D40D9B6056BAAEA53A7DB) == 0x00067C, "Member 'UABP_HologramCh0600_C::__CustomProperty_PhysicsIdlingSec_09BCBCB5416D40D9B6056BAAEA53A7DB' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0600_C, __CustomProperty_PhysicsAlpha_09BCBCB5416D40D9B6056BAAEA53A7DB) == 0x000680, "Member 'UABP_HologramCh0600_C::__CustomProperty_PhysicsAlpha_09BCBCB5416D40D9B6056BAAEA53A7DB' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0600_C, AnimGraphNode_SubInstance) == 0x000688, "Member 'UABP_HologramCh0600_C::AnimGraphNode_SubInstance' has a wrong offset!");

}

