#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_co0300

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_co0300.ABP_co0300_C
// 0x0450 (0x06C0 - 0x0270)
class UABP_co0300_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0278(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x02A8(0x0048)()
	struct FAnimNode_MeshSpaceRefPose             AnimGraphNode_MeshRefPose;                         // 0x02F0(0x0010)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0300(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0320(0x0108)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0428(0x00B8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x04E0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0528(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0550(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0578(0x00C0)()
	class UAnimMontage*                           CurrentMontage;                                    // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             SocketTransform;                                   // 0x0640(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UCurveFloat*                            Curve;                                             // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsResetBoneTransform;                              // 0x0678(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42DC[0x7];                                     // 0x0679(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             DefaultSocketTransform;                            // 0x0680(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         SetBoneTransformCorrectionAlpha;                   // 0x06B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlendWeight;                                       // 0x06B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_co0300(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintBeginPlay();
	void AnimNotify_StartResetBoneTransform();
	void EventMontageBlendingOut(class UAnimMontage* Montage, bool bInterrupted);
	void BlueprintInitializeAnimation();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_co0300_AnimGraphNode_ModifyBone_333911AB464D2289FFC343B79B97D0F7();
	void SetPhaseChangeCameraTransform(class ABP_SpecialStaticNodeActor_C* SpecialStaticNodeActor);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_co0300_C">();
	}
	static class UABP_co0300_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_co0300_C>();
	}
};
static_assert(alignof(UABP_co0300_C) == 0x000010, "Wrong alignment on UABP_co0300_C");
static_assert(sizeof(UABP_co0300_C) == 0x0006C0, "Wrong size on UABP_co0300_C");
static_assert(offsetof(UABP_co0300_C, UberGraphFrame) == 0x000270, "Member 'UABP_co0300_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_co0300_C, AnimGraphNode_Root) == 0x000278, "Member 'UABP_co0300_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_co0300_C, AnimGraphNode_Slot_1) == 0x0002A8, "Member 'UABP_co0300_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_co0300_C, AnimGraphNode_MeshRefPose) == 0x0002F0, "Member 'UABP_co0300_C::AnimGraphNode_MeshRefPose' has a wrong offset!");
static_assert(offsetof(UABP_co0300_C, AnimGraphNode_ComponentToLocalSpace) == 0x000300, "Member 'UABP_co0300_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_co0300_C, AnimGraphNode_ModifyBone) == 0x000320, "Member 'UABP_co0300_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_co0300_C, AnimGraphNode_SaveCachedPose) == 0x000428, "Member 'UABP_co0300_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_co0300_C, AnimGraphNode_Slot) == 0x0004E0, "Member 'UABP_co0300_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_co0300_C, AnimGraphNode_UseCachedPose_1) == 0x000528, "Member 'UABP_co0300_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_co0300_C, AnimGraphNode_UseCachedPose) == 0x000550, "Member 'UABP_co0300_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_co0300_C, AnimGraphNode_LayeredBoneBlend) == 0x000578, "Member 'UABP_co0300_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_co0300_C, CurrentMontage) == 0x000638, "Member 'UABP_co0300_C::CurrentMontage' has a wrong offset!");
static_assert(offsetof(UABP_co0300_C, SocketTransform) == 0x000640, "Member 'UABP_co0300_C::SocketTransform' has a wrong offset!");
static_assert(offsetof(UABP_co0300_C, Curve) == 0x000670, "Member 'UABP_co0300_C::Curve' has a wrong offset!");
static_assert(offsetof(UABP_co0300_C, IsResetBoneTransform) == 0x000678, "Member 'UABP_co0300_C::IsResetBoneTransform' has a wrong offset!");
static_assert(offsetof(UABP_co0300_C, DefaultSocketTransform) == 0x000680, "Member 'UABP_co0300_C::DefaultSocketTransform' has a wrong offset!");
static_assert(offsetof(UABP_co0300_C, SetBoneTransformCorrectionAlpha) == 0x0006B0, "Member 'UABP_co0300_C::SetBoneTransformCorrectionAlpha' has a wrong offset!");
static_assert(offsetof(UABP_co0300_C, BlendWeight) == 0x0006B4, "Member 'UABP_co0300_C::BlendWeight' has a wrong offset!");

}

