#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_ch0600_Sub_Physics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_ch0600_Sub_Physics.ABP_ch0600_Sub_Physics_C
// 0x3660 (0x38E0 - 0x0280)
class UABP_ch0600_Sub_Physics_C final : public URSPlayerSubAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0288(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x02B8(0x0078)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_22;                    // 0x0330(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_21;                    // 0x0570(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_20;                    // 0x07B0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0x09F0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0x0C30(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0x0E70(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0x10B0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0x12F0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x1530(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x1770(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x19B0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x1BF0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x1E30(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x2070(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x22B0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x24F0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x2730(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x2970(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x2BB0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x2DF0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x3030(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x3270(0x0240)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x34B0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x34D0(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x34F0(0x0240)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x3730(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x37E8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x3810(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x3838(0x00A0)()

public:
	void ExecuteUbergraph_ABP_ch0600_Sub_Physics(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_ch0600_Sub_Physics_C">();
	}
	static class UABP_ch0600_Sub_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_ch0600_Sub_Physics_C>();
	}
};
static_assert(alignof(UABP_ch0600_Sub_Physics_C) == 0x000010, "Wrong alignment on UABP_ch0600_Sub_Physics_C");
static_assert(sizeof(UABP_ch0600_Sub_Physics_C) == 0x0038E0, "Wrong size on UABP_ch0600_Sub_Physics_C");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, UberGraphFrame) == 0x000280, "Member 'UABP_ch0600_Sub_Physics_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_Root) == 0x000288, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_SubInput) == 0x0002B8, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_22) == 0x000330, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_22' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_21) == 0x000570, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_21' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_20) == 0x0007B0, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_20' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_19) == 0x0009F0, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_19' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_18) == 0x000C30, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_18' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_17) == 0x000E70, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_17' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_16) == 0x0010B0, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_16' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_15) == 0x0012F0, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_15' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_14) == 0x001530, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_14' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_13) == 0x001770, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_13' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_12) == 0x0019B0, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_12' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_11) == 0x001BF0, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_11' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_10) == 0x001E30, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_10' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_9) == 0x002070, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_8) == 0x0022B0, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_7) == 0x0024F0, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_6) == 0x002730, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_5) == 0x002970, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_4) == 0x002BB0, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_3) == 0x002DF0, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_2) == 0x003030, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_1) == 0x003270, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_LocalToComponentSpace) == 0x0034B0, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_ComponentToLocalSpace) == 0x0034D0, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_KawaiiPhysics) == 0x0034F0, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_SaveCachedPose) == 0x003730, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_UseCachedPose_1) == 0x0037E8, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_UseCachedPose) == 0x003810, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_ch0600_Sub_Physics_C, AnimGraphNode_BlendListByBool) == 0x003838, "Member 'UABP_ch0600_Sub_Physics_C::AnimGraphNode_BlendListByBool' has a wrong offset!");

}

