#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_ch0100_Sub_Physics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function ABP_ch0100_Sub_Physics.ABP_ch0100_Sub_Physics_C.ExecuteUbergraph_ABP_ch0100_Sub_Physics
// 0x0038 (0x0038 - 0x0000)
struct ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45E3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IPlayerInterface>      K2Node_DynamicCast_AsPlayer_Interface;             // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45E4[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45E5[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics) == 0x000008, "Wrong alignment on ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics");
static_assert(sizeof(ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics) == 0x000038, "Wrong size on ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics");
static_assert(offsetof(ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics, EntryPoint) == 0x000000, "Member 'ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics, K2Node_DynamicCast_AsPlayer_Interface) == 0x000010, "Member 'ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics::K2Node_DynamicCast_AsPlayer_Interface' has a wrong offset!");
static_assert(offsetof(ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics, CallFunc_GetPlayerID_ReturnValue) == 0x000021, "Member 'ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics::CallFunc_GetPlayerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000024, "Member 'ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics, Temp_byte_Variable) == 0x000028, "Member 'ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000029, "Member 'ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics, CallFunc_GetCurveValue_ReturnValue) == 0x00002C, "Member 'ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000030, "Member 'ABP_ch0100_Sub_Physics_C_ExecuteUbergraph_ABP_ch0100_Sub_Physics::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function ABP_ch0100_Sub_Physics.ABP_ch0100_Sub_Physics_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct ABP_ch0100_Sub_Physics_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_ch0100_Sub_Physics_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_ch0100_Sub_Physics_C_AnimGraph");
static_assert(sizeof(ABP_ch0100_Sub_Physics_C_AnimGraph) == 0x000020, "Wrong size on ABP_ch0100_Sub_Physics_C_AnimGraph");
static_assert(offsetof(ABP_ch0100_Sub_Physics_C_AnimGraph, InPose) == 0x000000, "Member 'ABP_ch0100_Sub_Physics_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(ABP_ch0100_Sub_Physics_C_AnimGraph, Param_AnimGraph) == 0x000010, "Member 'ABP_ch0100_Sub_Physics_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

