#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_ch1000_Sub_Physics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_ch1000_Sub_Physics.ABP_ch1000_Sub_Physics_C
// 0x2460 (0x26E0 - 0x0280)
class UABP_ch1000_Sub_Physics_C final : public URSPlayerSubAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0288(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0300(0x0030)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0330(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0350(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x0370(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x05B0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x07F0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x0A30(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x0C70(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x0EB0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x10F0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x1330(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x1570(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x17B0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x19F0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x1C30(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x1E70(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x20B0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x22F0(0x0240)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x2530(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x25E8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x2610(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x2638(0x00A0)()

public:
	void ExecuteUbergraph_ABP_ch1000_Sub_Physics(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch1000_Sub_Physics_AnimGraphNode_KawaiiPhysics_2464CD9D4FBA5985B290B8BE36FE8F94();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch1000_Sub_Physics_AnimGraphNode_KawaiiPhysics_E11F0C134AB900DB6D126F93E2268E4D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch1000_Sub_Physics_AnimGraphNode_KawaiiPhysics_F1894148426CC729AB44A393AF284928();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch1000_Sub_Physics_AnimGraphNode_KawaiiPhysics_80CA98724F17BA9EABE0E09F56E48BE5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch1000_Sub_Physics_AnimGraphNode_KawaiiPhysics_D321EFB846C393CF23E2D0BAD0FB6AEF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch1000_Sub_Physics_AnimGraphNode_KawaiiPhysics_BFC06CA849CE3934B94266AC100E3E89();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch1000_Sub_Physics_AnimGraphNode_KawaiiPhysics_670FAACB4C1112F220DAA8A9B3D4D2BC();
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_ch1000_Sub_Physics_C">();
	}
	static class UABP_ch1000_Sub_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_ch1000_Sub_Physics_C>();
	}
};
static_assert(alignof(UABP_ch1000_Sub_Physics_C) == 0x000010, "Wrong alignment on UABP_ch1000_Sub_Physics_C");
static_assert(sizeof(UABP_ch1000_Sub_Physics_C) == 0x0026E0, "Wrong size on UABP_ch1000_Sub_Physics_C");
static_assert(offsetof(UABP_ch1000_Sub_Physics_C, UberGraphFrame) == 0x000280, "Member 'UABP_ch1000_Sub_Physics_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_ch1000_Sub_Physics_C, AnimGraphNode_SubInput) == 0x000288, "Member 'UABP_ch1000_Sub_Physics_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UABP_ch1000_Sub_Physics_C, AnimGraphNode_Root) == 0x000300, "Member 'UABP_ch1000_Sub_Physics_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_ch1000_Sub_Physics_C, AnimGraphNode_LocalToComponentSpace) == 0x000330, "Member 'UABP_ch1000_Sub_Physics_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_ch1000_Sub_Physics_C, AnimGraphNode_ComponentToLocalSpace) == 0x000350, "Member 'UABP_ch1000_Sub_Physics_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_ch1000_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_14) == 0x000370, "Member 'UABP_ch1000_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_14' has a wrong offset!");
static_assert(offsetof(UABP_ch1000_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_13) == 0x0005B0, "Member 'UABP_ch1000_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_13' has a wrong offset!");
static_assert(offsetof(UABP_ch1000_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_12) == 0x0007F0, "Member 'UABP_ch1000_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_12' has a wrong offset!");
static_assert(offsetof(UABP_ch1000_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_11) == 0x000A30, "Member 'UABP_ch1000_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_11' has a wrong offset!");
static_assert(offsetof(UABP_ch1000_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_10) == 0x000C70, "Member 'UABP_ch1000_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_10' has a wrong offset!");
static_assert(offsetof(UABP_ch1000_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_9) == 0x000EB0, "Member 'UABP_ch1000_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UABP_ch1000_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_8) == 0x0010F0, "Member 'UABP_ch1000_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UABP_ch1000_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_7) == 0x001330, "Member 'UABP_ch1000_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UABP_ch1000_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_6) == 0x001570, "Member 'UABP_ch1000_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UABP_ch1000_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_5) == 0x0017B0, "Member 'UABP_ch1000_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UABP_ch1000_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_4) == 0x0019F0, "Member 'UABP_ch1000_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UABP_ch1000_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_3) == 0x001C30, "Member 'UABP_ch1000_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_ch1000_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_2) == 0x001E70, "Member 'UABP_ch1000_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_ch1000_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_1) == 0x0020B0, "Member 'UABP_ch1000_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_ch1000_Sub_Physics_C, AnimGraphNode_KawaiiPhysics) == 0x0022F0, "Member 'UABP_ch1000_Sub_Physics_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UABP_ch1000_Sub_Physics_C, AnimGraphNode_SaveCachedPose) == 0x002530, "Member 'UABP_ch1000_Sub_Physics_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_ch1000_Sub_Physics_C, AnimGraphNode_UseCachedPose_1) == 0x0025E8, "Member 'UABP_ch1000_Sub_Physics_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_ch1000_Sub_Physics_C, AnimGraphNode_UseCachedPose) == 0x002610, "Member 'UABP_ch1000_Sub_Physics_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_ch1000_Sub_Physics_C, AnimGraphNode_BlendListByBool) == 0x002638, "Member 'UABP_ch1000_Sub_Physics_C::AnimGraphNode_BlendListByBool' has a wrong offset!");

}

