#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Ajito_ch0100

#include "Basic.hpp"

#include "ActionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Ajito_ch0100.ABP_Ajito_ch0100_C
// 0x0D20 (0x1450 - 0x0730)
class UABP_Ajito_ch0100_C final : public URSAjitoAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0730(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0738(0x00B8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x07F0(0x0020)()
	struct FASAnimNode_StateMachine               ASAnimGraphNode_StateMachine;                      // 0x0810(0x02B8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0AC8(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0B40(0x00A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0BE0(0x0030)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x0C10(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0C30(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0CD0(0x0078)()
	bool                                          __CustomProperty_bKawaiiPhysics_EAFF55494766C4924566A286457FC311; // 0x0D48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7400[0x3];                                     // 0x0D49(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __CustomProperty_PhysicsIdlingSec_EAFF55494766C4924566A286457FC311; // 0x0D4C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __CustomProperty_PhysicsAlpha_EAFF55494766C4924566A286457FC311; // 0x0D50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7401[0x4];                                     // 0x0D54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x0D58(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0DF8(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x0EB8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0F00(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0F28(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0F50(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0F98(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x10A0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x11A8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x12B0(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x13B8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x13D8(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x13F8(0x0048)()
	class UAnimSequence*                          OverrideAnim_0;                                    // 0x1440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UASStateMachine*                        StateMachine;                                      // 0x1448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_Ajito_ch0100(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	bool SetASStateMachine(class UASStateMachine* Param_StateMachine);
	bool SetASAnimationSet(class UASAnimationSet* Param_AnimationSet);
	void InitializeFromParentActor();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Ajito_ch0100_C">();
	}
	static class UABP_Ajito_ch0100_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Ajito_ch0100_C>();
	}
};
static_assert(alignof(UABP_Ajito_ch0100_C) == 0x000010, "Wrong alignment on UABP_Ajito_ch0100_C");
static_assert(sizeof(UABP_Ajito_ch0100_C) == 0x001450, "Wrong size on UABP_Ajito_ch0100_C");
static_assert(offsetof(UABP_Ajito_ch0100_C, UberGraphFrame) == 0x000730, "Member 'UABP_Ajito_ch0100_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, AnimGraphNode_SaveCachedPose) == 0x000738, "Member 'UABP_Ajito_ch0100_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, AnimGraphNode_LocalToComponentSpace_1) == 0x0007F0, "Member 'UABP_Ajito_ch0100_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, ASAnimGraphNode_StateMachine) == 0x000810, "Member 'UABP_Ajito_ch0100_C::ASAnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, AnimGraphNode_SequencePlayer_1) == 0x000AC8, "Member 'UABP_Ajito_ch0100_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, AnimGraphNode_BlendListByBool_1) == 0x000B40, "Member 'UABP_Ajito_ch0100_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, AnimGraphNode_Root) == 0x000BE0, "Member 'UABP_Ajito_ch0100_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x000C10, "Member 'UABP_Ajito_ch0100_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, AnimGraphNode_BlendListByBool) == 0x000C30, "Member 'UABP_Ajito_ch0100_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, AnimGraphNode_SequencePlayer) == 0x000CD0, "Member 'UABP_Ajito_ch0100_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, __CustomProperty_bKawaiiPhysics_EAFF55494766C4924566A286457FC311) == 0x000D48, "Member 'UABP_Ajito_ch0100_C::__CustomProperty_bKawaiiPhysics_EAFF55494766C4924566A286457FC311' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, __CustomProperty_PhysicsIdlingSec_EAFF55494766C4924566A286457FC311) == 0x000D4C, "Member 'UABP_Ajito_ch0100_C::__CustomProperty_PhysicsIdlingSec_EAFF55494766C4924566A286457FC311' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, __CustomProperty_PhysicsAlpha_EAFF55494766C4924566A286457FC311) == 0x000D50, "Member 'UABP_Ajito_ch0100_C::__CustomProperty_PhysicsAlpha_EAFF55494766C4924566A286457FC311' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, AnimGraphNode_LinkedAnimGraph) == 0x000D58, "Member 'UABP_Ajito_ch0100_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, AnimGraphNode_LayeredBoneBlend) == 0x000DF8, "Member 'UABP_Ajito_ch0100_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, AnimGraphNode_Slot_2) == 0x000EB8, "Member 'UABP_Ajito_ch0100_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, AnimGraphNode_UseCachedPose_1) == 0x000F00, "Member 'UABP_Ajito_ch0100_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, AnimGraphNode_UseCachedPose) == 0x000F28, "Member 'UABP_Ajito_ch0100_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, AnimGraphNode_Slot_1) == 0x000F50, "Member 'UABP_Ajito_ch0100_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, AnimGraphNode_ModifyBone_3) == 0x000F98, "Member 'UABP_Ajito_ch0100_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, AnimGraphNode_ModifyBone_2) == 0x0010A0, "Member 'UABP_Ajito_ch0100_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, AnimGraphNode_ModifyBone_1) == 0x0011A8, "Member 'UABP_Ajito_ch0100_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, AnimGraphNode_ModifyBone) == 0x0012B0, "Member 'UABP_Ajito_ch0100_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, AnimGraphNode_LocalToComponentSpace) == 0x0013B8, "Member 'UABP_Ajito_ch0100_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, AnimGraphNode_ComponentToLocalSpace) == 0x0013D8, "Member 'UABP_Ajito_ch0100_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, AnimGraphNode_Slot) == 0x0013F8, "Member 'UABP_Ajito_ch0100_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, OverrideAnim_0) == 0x001440, "Member 'UABP_Ajito_ch0100_C::OverrideAnim_0' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0100_C, StateMachine) == 0x001448, "Member 'UABP_Ajito_ch0100_C::StateMachine' has a wrong offset!");

}

