#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_ch0400_Sub_Physics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_ch0400_Sub_Physics.ABP_ch0400_Sub_Physics_C
// 0x0960 (0x0BE0 - 0x0280)
class UABP_ch0400_Sub_Physics_C final : public URSPlayerSubAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0288(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0300(0x0030)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x0330(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x0570(0x0240)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x07B0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x07D0(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x07F0(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x08A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x08D0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x08F8(0x00A0)()
	uint8                                         Pad_4FCE[0x8];                                     // 0x0998(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x09A0(0x0240)()

public:
	void ExecuteUbergraph_ABP_ch0400_Sub_Physics(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_ch0400_Sub_Physics_C">();
	}
	static class UABP_ch0400_Sub_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_ch0400_Sub_Physics_C>();
	}
};
static_assert(alignof(UABP_ch0400_Sub_Physics_C) == 0x000010, "Wrong alignment on UABP_ch0400_Sub_Physics_C");
static_assert(sizeof(UABP_ch0400_Sub_Physics_C) == 0x000BE0, "Wrong size on UABP_ch0400_Sub_Physics_C");
static_assert(offsetof(UABP_ch0400_Sub_Physics_C, UberGraphFrame) == 0x000280, "Member 'UABP_ch0400_Sub_Physics_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_ch0400_Sub_Physics_C, AnimGraphNode_SubInput) == 0x000288, "Member 'UABP_ch0400_Sub_Physics_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UABP_ch0400_Sub_Physics_C, AnimGraphNode_Root) == 0x000300, "Member 'UABP_ch0400_Sub_Physics_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_ch0400_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_2) == 0x000330, "Member 'UABP_ch0400_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_ch0400_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_1) == 0x000570, "Member 'UABP_ch0400_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_ch0400_Sub_Physics_C, AnimGraphNode_LocalToComponentSpace) == 0x0007B0, "Member 'UABP_ch0400_Sub_Physics_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_ch0400_Sub_Physics_C, AnimGraphNode_ComponentToLocalSpace) == 0x0007D0, "Member 'UABP_ch0400_Sub_Physics_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_ch0400_Sub_Physics_C, AnimGraphNode_SaveCachedPose) == 0x0007F0, "Member 'UABP_ch0400_Sub_Physics_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_ch0400_Sub_Physics_C, AnimGraphNode_UseCachedPose_1) == 0x0008A8, "Member 'UABP_ch0400_Sub_Physics_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_ch0400_Sub_Physics_C, AnimGraphNode_UseCachedPose) == 0x0008D0, "Member 'UABP_ch0400_Sub_Physics_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_ch0400_Sub_Physics_C, AnimGraphNode_BlendListByBool) == 0x0008F8, "Member 'UABP_ch0400_Sub_Physics_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_ch0400_Sub_Physics_C, AnimGraphNode_KawaiiPhysics) == 0x0009A0, "Member 'UABP_ch0400_Sub_Physics_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");

}

