#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Ajito_ch0200

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ActionSystem_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Ajito_ch0200.ABP_Ajito_ch0200_C
// 0x09C0 (0x10F0 - 0x0730)
class UABP_Ajito_ch0200_C final : public URSAjitoAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0730(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0738(0x0030)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0768(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0788(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0828(0x0078)()
	struct FASAnimNode_StateMachine               ASAnimGraphNode_StateMachine;                      // 0x08A0(0x02B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0B58(0x00B8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0C10(0x0020)()
	bool                                          __CustomProperty_bKawaiiPhysics_7AFEDF7446F12DF2DA4E9EAA2AC17289; // 0x0C30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6484[0x3];                                     // 0x0C31(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __CustomProperty_PhysicsIdlingSec_7AFEDF7446F12DF2DA4E9EAA2AC17289; // 0x0C34(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __CustomProperty_PhysicsAlpha_7AFEDF7446F12DF2DA4E9EAA2AC17289; // 0x0C38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6485[0x4];                                     // 0x0C3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_SubInstance;                         // 0x0C40(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0CE0(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0D80(0x0078)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0DF8(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x0EB8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0F00(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0F28(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0F50(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0F98(0x0108)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x10A0(0x0048)()

public:
	void ExecuteUbergraph_ABP_Ajito_ch0200(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void InitializeFromParentActor();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Ajito_ch0200_C">();
	}
	static class UABP_Ajito_ch0200_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Ajito_ch0200_C>();
	}
};
static_assert(alignof(UABP_Ajito_ch0200_C) == 0x000010, "Wrong alignment on UABP_Ajito_ch0200_C");
static_assert(sizeof(UABP_Ajito_ch0200_C) == 0x0010F0, "Wrong size on UABP_Ajito_ch0200_C");
static_assert(offsetof(UABP_Ajito_ch0200_C, UberGraphFrame) == 0x000730, "Member 'UABP_Ajito_ch0200_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0200_C, AnimGraphNode_Root) == 0x000738, "Member 'UABP_Ajito_ch0200_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0200_C, AnimGraphNode_ComponentToLocalSpace) == 0x000768, "Member 'UABP_Ajito_ch0200_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0200_C, AnimGraphNode_BlendListByBool_1) == 0x000788, "Member 'UABP_Ajito_ch0200_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0200_C, AnimGraphNode_SequencePlayer_1) == 0x000828, "Member 'UABP_Ajito_ch0200_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0200_C, ASAnimGraphNode_StateMachine) == 0x0008A0, "Member 'UABP_Ajito_ch0200_C::ASAnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0200_C, AnimGraphNode_SaveCachedPose) == 0x000B58, "Member 'UABP_Ajito_ch0200_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0200_C, AnimGraphNode_LocalToComponentSpace) == 0x000C10, "Member 'UABP_Ajito_ch0200_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0200_C, __CustomProperty_bKawaiiPhysics_7AFEDF7446F12DF2DA4E9EAA2AC17289) == 0x000C30, "Member 'UABP_Ajito_ch0200_C::__CustomProperty_bKawaiiPhysics_7AFEDF7446F12DF2DA4E9EAA2AC17289' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0200_C, __CustomProperty_PhysicsIdlingSec_7AFEDF7446F12DF2DA4E9EAA2AC17289) == 0x000C34, "Member 'UABP_Ajito_ch0200_C::__CustomProperty_PhysicsIdlingSec_7AFEDF7446F12DF2DA4E9EAA2AC17289' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0200_C, __CustomProperty_PhysicsAlpha_7AFEDF7446F12DF2DA4E9EAA2AC17289) == 0x000C38, "Member 'UABP_Ajito_ch0200_C::__CustomProperty_PhysicsAlpha_7AFEDF7446F12DF2DA4E9EAA2AC17289' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0200_C, AnimGraphNode_SubInstance) == 0x000C40, "Member 'UABP_Ajito_ch0200_C::AnimGraphNode_SubInstance' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0200_C, AnimGraphNode_BlendListByBool) == 0x000CE0, "Member 'UABP_Ajito_ch0200_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0200_C, AnimGraphNode_SequencePlayer) == 0x000D80, "Member 'UABP_Ajito_ch0200_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0200_C, AnimGraphNode_LayeredBoneBlend) == 0x000DF8, "Member 'UABP_Ajito_ch0200_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0200_C, AnimGraphNode_Slot_2) == 0x000EB8, "Member 'UABP_Ajito_ch0200_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0200_C, AnimGraphNode_UseCachedPose_1) == 0x000F00, "Member 'UABP_Ajito_ch0200_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0200_C, AnimGraphNode_UseCachedPose) == 0x000F28, "Member 'UABP_Ajito_ch0200_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0200_C, AnimGraphNode_Slot_1) == 0x000F50, "Member 'UABP_Ajito_ch0200_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0200_C, AnimGraphNode_ModifyBone) == 0x000F98, "Member 'UABP_Ajito_ch0200_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_Ajito_ch0200_C, AnimGraphNode_Slot) == 0x0010A0, "Member 'UABP_Ajito_ch0200_C::AnimGraphNode_Slot' has a wrong offset!");

}

