#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_HologramCh0100

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ActionSystem_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "BattlePrototype_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_HologramCh0100.ABP_HologramCh0100_C
// 0x0900 (0x0BA0 - 0x02A0)
class UABP_HologramCh0100_C final : public URSPlayerHologramAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02A8(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x02D8(0x0048)()
	struct FASAnimNode_StateMachine               ASAnimGraphNode_StateMachine;                      // 0x0320(0x02B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x05D8(0x00A0)()
	bool                                          __CustomProperty_bKawaiiPhysics_7419C3C64EEEECD9F27833AB5711FE6C; // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_683B[0x3];                                     // 0x0679(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __CustomProperty_PhysicsIdlingSec_7419C3C64EEEECD9F27833AB5711FE6C; // 0x067C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __CustomProperty_PhysicsAlpha_7419C3C64EEEECD9F27833AB5711FE6C; // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_ch0100Mesh_7419C3C64EEEECD9F27833AB5711FE6C; // 0x0684(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_683C[0x3];                                     // 0x0685(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_SubInstance;                         // 0x0688(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0728(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0830(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0850(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0958(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0A60(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0A80(0x0108)()
	struct FVector                                WeaponStringScale;                                 // 0x0B88(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisableStringWeapon;                              // 0x0B94(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_HologramCh0100(int32 EntryPoint);
	void CheckSheathMesh(class USkeletalMesh* SheathMesh, bool Param_bDisableStringWeapon);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void DispWeaponString(bool bDisp);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_HologramCh0100_C">();
	}
	static class UABP_HologramCh0100_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_HologramCh0100_C>();
	}
};
static_assert(alignof(UABP_HologramCh0100_C) == 0x000010, "Wrong alignment on UABP_HologramCh0100_C");
static_assert(sizeof(UABP_HologramCh0100_C) == 0x000BA0, "Wrong size on UABP_HologramCh0100_C");
static_assert(offsetof(UABP_HologramCh0100_C, UberGraphFrame) == 0x0002A0, "Member 'UABP_HologramCh0100_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0100_C, AnimGraphNode_Root) == 0x0002A8, "Member 'UABP_HologramCh0100_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0100_C, AnimGraphNode_Slot) == 0x0002D8, "Member 'UABP_HologramCh0100_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0100_C, ASAnimGraphNode_StateMachine) == 0x000320, "Member 'UABP_HologramCh0100_C::ASAnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0100_C, AnimGraphNode_BlendListByBool) == 0x0005D8, "Member 'UABP_HologramCh0100_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0100_C, __CustomProperty_bKawaiiPhysics_7419C3C64EEEECD9F27833AB5711FE6C) == 0x000678, "Member 'UABP_HologramCh0100_C::__CustomProperty_bKawaiiPhysics_7419C3C64EEEECD9F27833AB5711FE6C' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0100_C, __CustomProperty_PhysicsIdlingSec_7419C3C64EEEECD9F27833AB5711FE6C) == 0x00067C, "Member 'UABP_HologramCh0100_C::__CustomProperty_PhysicsIdlingSec_7419C3C64EEEECD9F27833AB5711FE6C' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0100_C, __CustomProperty_PhysicsAlpha_7419C3C64EEEECD9F27833AB5711FE6C) == 0x000680, "Member 'UABP_HologramCh0100_C::__CustomProperty_PhysicsAlpha_7419C3C64EEEECD9F27833AB5711FE6C' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0100_C, __CustomProperty_ch0100Mesh_7419C3C64EEEECD9F27833AB5711FE6C) == 0x000684, "Member 'UABP_HologramCh0100_C::__CustomProperty_ch0100Mesh_7419C3C64EEEECD9F27833AB5711FE6C' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0100_C, AnimGraphNode_SubInstance) == 0x000688, "Member 'UABP_HologramCh0100_C::AnimGraphNode_SubInstance' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0100_C, AnimGraphNode_ModifyBone_3) == 0x000728, "Member 'UABP_HologramCh0100_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0100_C, AnimGraphNode_LocalToComponentSpace) == 0x000830, "Member 'UABP_HologramCh0100_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0100_C, AnimGraphNode_ModifyBone_2) == 0x000850, "Member 'UABP_HologramCh0100_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0100_C, AnimGraphNode_ModifyBone_1) == 0x000958, "Member 'UABP_HologramCh0100_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0100_C, AnimGraphNode_ComponentToLocalSpace) == 0x000A60, "Member 'UABP_HologramCh0100_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0100_C, AnimGraphNode_ModifyBone) == 0x000A80, "Member 'UABP_HologramCh0100_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0100_C, WeaponStringScale) == 0x000B88, "Member 'UABP_HologramCh0100_C::WeaponStringScale' has a wrong offset!");
static_assert(offsetof(UABP_HologramCh0100_C, bDisableStringWeapon) == 0x000B94, "Member 'UABP_HologramCh0100_C::bDisableStringWeapon' has a wrong offset!");

}

