#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_ch0300_Sub_Physics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_ch0300_Sub_Physics.ABP_ch0300_Sub_Physics_C
// 0x4860 (0x4AE0 - 0x0280)
class UABP_ch0300_Sub_Physics_C final : public URSPlayerSubAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0288(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0300(0x0030)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0330(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0350(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_30;                    // 0x0370(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_29;                    // 0x05B0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_28;                    // 0x07F0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_27;                    // 0x0A30(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_26;                    // 0x0C70(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_25;                    // 0x0EB0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_24;                    // 0x10F0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_23;                    // 0x1330(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_22;                    // 0x1570(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_21;                    // 0x17B0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_20;                    // 0x19F0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0x1C30(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0x1E70(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0x20B0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0x22F0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0x2530(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x2770(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x29B0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x2BF0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x2E30(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x3070(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x32B0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x34F0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x3730(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x3970(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x3BB0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x3DF0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x4030(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x4270(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x44B0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x46F0(0x0240)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x4930(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x49E8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x4A10(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x4A38(0x00A0)()

public:
	void ExecuteUbergraph_ABP_ch0300_Sub_Physics(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0300_Sub_Physics_AnimGraphNode_KawaiiPhysics_05DC7A4041B22C634054FFA80A5F2F1C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0300_Sub_Physics_AnimGraphNode_KawaiiPhysics_3BC13A9D48196BFBE04C3784CFE8DECA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0300_Sub_Physics_AnimGraphNode_KawaiiPhysics_7256E0AC4DD4BD1752394F801AF005ED();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0300_Sub_Physics_AnimGraphNode_KawaiiPhysics_248B9195424DD307F6775B8F32CD71FC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0300_Sub_Physics_AnimGraphNode_KawaiiPhysics_FC8433AE43805571D916FFAB2B13D63F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0300_Sub_Physics_AnimGraphNode_KawaiiPhysics_652CDB66448C1040C5FD5D9A379F2649();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0300_Sub_Physics_AnimGraphNode_KawaiiPhysics_4C5CC26742516414654BA29E2D97D6F9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0300_Sub_Physics_AnimGraphNode_KawaiiPhysics_95A8B8684D8D04757B656B82F64D44E6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0300_Sub_Physics_AnimGraphNode_KawaiiPhysics_CFA3B8C84AD00E71462F1E80B744640C();
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_ch0300_Sub_Physics_C">();
	}
	static class UABP_ch0300_Sub_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_ch0300_Sub_Physics_C>();
	}
};
static_assert(alignof(UABP_ch0300_Sub_Physics_C) == 0x000010, "Wrong alignment on UABP_ch0300_Sub_Physics_C");
static_assert(sizeof(UABP_ch0300_Sub_Physics_C) == 0x004AE0, "Wrong size on UABP_ch0300_Sub_Physics_C");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, UberGraphFrame) == 0x000280, "Member 'UABP_ch0300_Sub_Physics_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_SubInput) == 0x000288, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_Root) == 0x000300, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_LocalToComponentSpace) == 0x000330, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_ComponentToLocalSpace) == 0x000350, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_30) == 0x000370, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_30' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_29) == 0x0005B0, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_29' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_28) == 0x0007F0, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_28' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_27) == 0x000A30, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_27' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_26) == 0x000C70, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_26' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_25) == 0x000EB0, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_25' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_24) == 0x0010F0, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_24' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_23) == 0x001330, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_23' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_22) == 0x001570, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_22' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_21) == 0x0017B0, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_21' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_20) == 0x0019F0, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_20' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_19) == 0x001C30, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_19' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_18) == 0x001E70, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_18' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_17) == 0x0020B0, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_17' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_16) == 0x0022F0, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_16' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_15) == 0x002530, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_15' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_14) == 0x002770, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_14' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_13) == 0x0029B0, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_13' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_12) == 0x002BF0, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_12' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_11) == 0x002E30, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_11' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_10) == 0x003070, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_10' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_9) == 0x0032B0, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_8) == 0x0034F0, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_7) == 0x003730, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_6) == 0x003970, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_5) == 0x003BB0, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_4) == 0x003DF0, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_3) == 0x004030, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_2) == 0x004270, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_1) == 0x0044B0, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_KawaiiPhysics) == 0x0046F0, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_SaveCachedPose) == 0x004930, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_UseCachedPose_1) == 0x0049E8, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_UseCachedPose) == 0x004A10, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_ch0300_Sub_Physics_C, AnimGraphNode_BlendListByBool) == 0x004A38, "Member 'UABP_ch0300_Sub_Physics_C::AnimGraphNode_BlendListByBool' has a wrong offset!");

}

