#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_om0404

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_om0404.ABP_om0404_C
// 0x00A0 (0x0310 - 0x0270)
class UABP_om0404_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0278(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x02A8(0x0018)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x02C0(0x0048)()

public:
	void ExecuteUbergraph_ABP_om0404(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_om0404_C">();
	}
	static class UABP_om0404_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_om0404_C>();
	}
};
static_assert(alignof(UABP_om0404_C) == 0x000010, "Wrong alignment on UABP_om0404_C");
static_assert(sizeof(UABP_om0404_C) == 0x000310, "Wrong size on UABP_om0404_C");
static_assert(offsetof(UABP_om0404_C, UberGraphFrame) == 0x000270, "Member 'UABP_om0404_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_om0404_C, AnimGraphNode_Root) == 0x000278, "Member 'UABP_om0404_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_om0404_C, AnimGraphNode_LocalRefPose) == 0x0002A8, "Member 'UABP_om0404_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UABP_om0404_C, AnimGraphNode_Slot) == 0x0002C0, "Member 'UABP_om0404_C::AnimGraphNode_Slot' has a wrong offset!");

}

