#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_ch0500_Sub_Physics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_ch0500_Sub_Physics.ABP_ch0500_Sub_Physics_C
// 0x31E0 (0x3460 - 0x0280)
class UABP_ch0500_Sub_Physics_C final : public URSPlayerSubAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0288(0x0078)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_20;                    // 0x0300(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0x0540(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0x0780(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0x09C0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0x0C00(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0x0E40(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x1080(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x12C0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x1500(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x1740(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x1980(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x1BC0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x1E00(0x0240)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2040(0x0030)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x2070(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x22B0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x24F0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x2730(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x2970(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x2BB0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x2DF0(0x0240)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x3030(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x3050(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x3070(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x3128(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x3150(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x3178(0x00A0)()
	uint8                                         Pad_4787[0x8];                                     // 0x3218(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x3220(0x0240)()

public:
	void ExecuteUbergraph_ABP_ch0500_Sub_Physics(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0500_Sub_Physics_AnimGraphNode_KawaiiPhysics_923F5963443D1DEA4B546C9D9262FF09();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0500_Sub_Physics_AnimGraphNode_KawaiiPhysics_091A4B9D47B8FA5E1278AA83E8C6D131();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0500_Sub_Physics_AnimGraphNode_KawaiiPhysics_F0E614BD4284A5D1796814A08F945E7F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0500_Sub_Physics_AnimGraphNode_KawaiiPhysics_3FCBFA8D499D6C072D4E8D9358D11729();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0500_Sub_Physics_AnimGraphNode_KawaiiPhysics_910E23564FD49834F4FC06BCBBC44EBC();
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_ch0500_Sub_Physics_C">();
	}
	static class UABP_ch0500_Sub_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_ch0500_Sub_Physics_C>();
	}
};
static_assert(alignof(UABP_ch0500_Sub_Physics_C) == 0x000010, "Wrong alignment on UABP_ch0500_Sub_Physics_C");
static_assert(sizeof(UABP_ch0500_Sub_Physics_C) == 0x003460, "Wrong size on UABP_ch0500_Sub_Physics_C");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, UberGraphFrame) == 0x000280, "Member 'UABP_ch0500_Sub_Physics_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_SubInput) == 0x000288, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_20) == 0x000300, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_20' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_19) == 0x000540, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_19' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_18) == 0x000780, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_18' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_17) == 0x0009C0, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_17' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_16) == 0x000C00, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_16' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_15) == 0x000E40, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_15' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_14) == 0x001080, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_14' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_13) == 0x0012C0, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_13' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_12) == 0x001500, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_12' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_11) == 0x001740, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_11' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_10) == 0x001980, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_10' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_9) == 0x001BC0, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_8) == 0x001E00, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_Root) == 0x002040, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_7) == 0x002070, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_6) == 0x0022B0, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_5) == 0x0024F0, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_4) == 0x002730, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_3) == 0x002970, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_2) == 0x002BB0, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_1) == 0x002DF0, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_LocalToComponentSpace) == 0x003030, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_ComponentToLocalSpace) == 0x003050, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_SaveCachedPose) == 0x003070, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_UseCachedPose_1) == 0x003128, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_UseCachedPose) == 0x003150, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_BlendListByBool) == 0x003178, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_ch0500_Sub_Physics_C, AnimGraphNode_KawaiiPhysics) == 0x003220, "Member 'UABP_ch0500_Sub_Physics_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");

}

