#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_ch0100_Sub_Physics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_ch0100_Sub_Physics.ABP_ch0100_Sub_Physics_C
// 0x4880 (0x4B00 - 0x0280)
class UABP_ch0100_Sub_Physics_C final : public URSPlayerSubAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0288(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0300(0x0030)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_29;                    // 0x0330(0x0240)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x0570(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_28;                    // 0x0590(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_27;                    // 0x07D0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_26;                    // 0x0A10(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_25;                    // 0x0C50(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_24;                    // 0x0E90(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_23;                    // 0x10D0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_22;                    // 0x1310(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_21;                    // 0x1550(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_20;                    // 0x1790(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0x19D0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0x1C10(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0x1E50(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0x2090(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0x22D0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x2510(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x2750(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x2990(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x2BD0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x2E10(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x3050(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x3290(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x34D0(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x3710(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x3950(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x3B90(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x3DD0(0x0240)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x4010(0x00B8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x40C8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x40E8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x4110(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x4138(0x0020)()
	uint8                                         Pad_45E2[0x8];                                     // 0x4158(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x4160(0x0240)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x43A0(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x43C0(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x4460(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x4480(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x44A0(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x4558(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x4580(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x45A8(0x00C8)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x4670(0x0240)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x48B0(0x0240)()
	bool                                          Ch0100Mesh;                                        // 0x4AF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_ch0100_Sub_Physics(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0100_Sub_Physics_AnimGraphNode_TwoWayBlend_B3E6F7144B9FD41EADEC9B9139E4AE0F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0100_Sub_Physics_AnimGraphNode_KawaiiPhysics_E241C2C04D8DF73C5CEBCA83ECDBF989();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0100_Sub_Physics_AnimGraphNode_KawaiiPhysics_98368DFF4CC916AF90D60A9C15DE40D9();
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_ch0100_Sub_Physics_C">();
	}
	static class UABP_ch0100_Sub_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_ch0100_Sub_Physics_C>();
	}
};
static_assert(alignof(UABP_ch0100_Sub_Physics_C) == 0x000010, "Wrong alignment on UABP_ch0100_Sub_Physics_C");
static_assert(sizeof(UABP_ch0100_Sub_Physics_C) == 0x004B00, "Wrong size on UABP_ch0100_Sub_Physics_C");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, UberGraphFrame) == 0x000280, "Member 'UABP_ch0100_Sub_Physics_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_SubInput) == 0x000288, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_Root) == 0x000300, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_29) == 0x000330, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_29' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_LocalToComponentSpace_2) == 0x000570, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_28) == 0x000590, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_28' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_27) == 0x0007D0, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_27' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_26) == 0x000A10, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_26' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_25) == 0x000C50, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_25' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_24) == 0x000E90, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_24' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_23) == 0x0010D0, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_23' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_22) == 0x001310, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_22' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_21) == 0x001550, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_21' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_20) == 0x001790, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_20' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_19) == 0x0019D0, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_19' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_18) == 0x001C10, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_18' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_17) == 0x001E50, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_17' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_16) == 0x002090, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_16' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_15) == 0x0022D0, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_15' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_14) == 0x002510, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_14' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_13) == 0x002750, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_13' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_12) == 0x002990, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_12' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_11) == 0x002BD0, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_11' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_10) == 0x002E10, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_10' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_9) == 0x003050, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_8) == 0x003290, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_7) == 0x0034D0, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_6) == 0x003710, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_5) == 0x003950, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_4) == 0x003B90, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_3) == 0x003DD0, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_SaveCachedPose_1) == 0x004010, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x0040C8, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_UseCachedPose_3) == 0x0040E8, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_UseCachedPose_2) == 0x004110, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_LocalToComponentSpace_1) == 0x004138, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_2) == 0x004160, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_LocalToComponentSpace) == 0x0043A0, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_BlendListByBool) == 0x0043C0, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x004460, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_ComponentToLocalSpace) == 0x004480, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_SaveCachedPose) == 0x0044A0, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_UseCachedPose_1) == 0x004558, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_UseCachedPose) == 0x004580, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_TwoWayBlend) == 0x0045A8, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics_1) == 0x004670, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, AnimGraphNode_KawaiiPhysics) == 0x0048B0, "Member 'UABP_ch0100_Sub_Physics_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UABP_ch0100_Sub_Physics_C, Ch0100Mesh) == 0x004AF0, "Member 'UABP_ch0100_Sub_Physics_C::Ch0100Mesh' has a wrong offset!");

}

