#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABPI_at4500

#include "Basic.hpp"


namespace SDK::Params
{

// Function ABPI_at4500.ABPI_at4500_C.SetBattle
// 0x0001 (0x0001 - 0x0000)
struct ABPI_at4500_C_SetBattle final
{
public:
	bool                                          bBattle;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABPI_at4500_C_SetBattle) == 0x000001, "Wrong alignment on ABPI_at4500_C_SetBattle");
static_assert(sizeof(ABPI_at4500_C_SetBattle) == 0x000001, "Wrong size on ABPI_at4500_C_SetBattle");
static_assert(offsetof(ABPI_at4500_C_SetBattle, bBattle) == 0x000000, "Member 'ABPI_at4500_C_SetBattle::bBattle' has a wrong offset!");

// Function ABPI_at4500.ABPI_at4500_C.SetEvent
// 0x0001 (0x0001 - 0x0000)
struct ABPI_at4500_C_SetEvent final
{
public:
	bool                                          bEvent;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABPI_at4500_C_SetEvent) == 0x000001, "Wrong alignment on ABPI_at4500_C_SetEvent");
static_assert(sizeof(ABPI_at4500_C_SetEvent) == 0x000001, "Wrong size on ABPI_at4500_C_SetEvent");
static_assert(offsetof(ABPI_at4500_C_SetEvent, bEvent) == 0x000000, "Member 'ABPI_at4500_C_SetEvent::bEvent' has a wrong offset!");

// Function ABPI_at4500.ABPI_at4500_C.SetAttachMesh
// 0x0008 (0x0008 - 0x0000)
struct ABPI_at4500_C_SetAttachMesh final
{
public:
	class USkeletalMeshComponent*                 AttachMesh;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABPI_at4500_C_SetAttachMesh) == 0x000008, "Wrong alignment on ABPI_at4500_C_SetAttachMesh");
static_assert(sizeof(ABPI_at4500_C_SetAttachMesh) == 0x000008, "Wrong size on ABPI_at4500_C_SetAttachMesh");
static_assert(offsetof(ABPI_at4500_C_SetAttachMesh, AttachMesh) == 0x000000, "Member 'ABPI_at4500_C_SetAttachMesh::AttachMesh' has a wrong offset!");

}

