#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIAttackedInfoComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function AIAttackedInfoComponent.AIAttackedInfoComponent_C.SetAttackedActor
// 0x0010 (0x0010 - 0x0000)
struct AIAttackedInfoComponent_C_SetAttackedActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIAttackedInfoComponent_C_SetAttackedActor) == 0x000008, "Wrong alignment on AIAttackedInfoComponent_C_SetAttackedActor");
static_assert(sizeof(AIAttackedInfoComponent_C_SetAttackedActor) == 0x000010, "Wrong size on AIAttackedInfoComponent_C_SetAttackedActor");
static_assert(offsetof(AIAttackedInfoComponent_C_SetAttackedActor, Actor) == 0x000000, "Member 'AIAttackedInfoComponent_C_SetAttackedActor::Actor' has a wrong offset!");
static_assert(offsetof(AIAttackedInfoComponent_C_SetAttackedActor, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'AIAttackedInfoComponent_C_SetAttackedActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AIAttackedInfoComponent.AIAttackedInfoComponent_C.GetAttackedActor
// 0x0008 (0x0008 - 0x0000)
struct AIAttackedInfoComponent_C_GetAttackedActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIAttackedInfoComponent_C_GetAttackedActor) == 0x000008, "Wrong alignment on AIAttackedInfoComponent_C_GetAttackedActor");
static_assert(sizeof(AIAttackedInfoComponent_C_GetAttackedActor) == 0x000008, "Wrong size on AIAttackedInfoComponent_C_GetAttackedActor");
static_assert(offsetof(AIAttackedInfoComponent_C_GetAttackedActor, Actor) == 0x000000, "Member 'AIAttackedInfoComponent_C_GetAttackedActor::Actor' has a wrong offset!");

}

