#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIC_Player

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AIC_Player.AIC_Player_C
// 0x0028 (0x0360 - 0x0338)
class AAIC_Player_C final : public AAIController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBlackboardData*                        AssetBlackBoard;                                   // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBehaviorTree*                          AssetBehaviorTree;                                 // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   HomeLocation;                                      // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SelfActor;                                         // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AIC_Player(int32 EntryPoint);
	void ReceiveBeginPlay();
	void BeginBehaviorTree();

	void IsAI(bool* bAI) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AIC_Player_C">();
	}
	static class AAIC_Player_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAIC_Player_C>();
	}
};
static_assert(alignof(AAIC_Player_C) == 0x000008, "Wrong alignment on AAIC_Player_C");
static_assert(sizeof(AAIC_Player_C) == 0x000360, "Wrong size on AAIC_Player_C");
static_assert(offsetof(AAIC_Player_C, UberGraphFrame) == 0x000338, "Member 'AAIC_Player_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAIC_Player_C, AssetBlackBoard) == 0x000340, "Member 'AAIC_Player_C::AssetBlackBoard' has a wrong offset!");
static_assert(offsetof(AAIC_Player_C, AssetBehaviorTree) == 0x000348, "Member 'AAIC_Player_C::AssetBehaviorTree' has a wrong offset!");
static_assert(offsetof(AAIC_Player_C, HomeLocation) == 0x000350, "Member 'AAIC_Player_C::HomeLocation' has a wrong offset!");
static_assert(offsetof(AAIC_Player_C, SelfActor) == 0x000358, "Member 'AAIC_Player_C::SelfActor' has a wrong offset!");

}

