#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIC_Player

#include "Basic.hpp"


namespace SDK::Params
{

// Function AIC_Player.AIC_Player_C.ExecuteUbergraph_AIC_Player
// 0x0004 (0x0004 - 0x0000)
struct AIC_Player_C_ExecuteUbergraph_AIC_Player final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIC_Player_C_ExecuteUbergraph_AIC_Player) == 0x000004, "Wrong alignment on AIC_Player_C_ExecuteUbergraph_AIC_Player");
static_assert(sizeof(AIC_Player_C_ExecuteUbergraph_AIC_Player) == 0x000004, "Wrong size on AIC_Player_C_ExecuteUbergraph_AIC_Player");
static_assert(offsetof(AIC_Player_C_ExecuteUbergraph_AIC_Player, EntryPoint) == 0x000000, "Member 'AIC_Player_C_ExecuteUbergraph_AIC_Player::EntryPoint' has a wrong offset!");

// Function AIC_Player.AIC_Player_C.BeginBehaviorTree
// 0x0020 (0x0020 - 0x0000)
struct AIC_Player_C_BeginBehaviorTree final
{
public:
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RunBehaviorTree_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6637[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_UseBlackboard_BlackboardComponent;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseBlackboard_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIC_Player_C_BeginBehaviorTree) == 0x000008, "Wrong alignment on AIC_Player_C_BeginBehaviorTree");
static_assert(sizeof(AIC_Player_C_BeginBehaviorTree) == 0x000020, "Wrong size on AIC_Player_C_BeginBehaviorTree");
static_assert(offsetof(AIC_Player_C_BeginBehaviorTree, CallFunc_K2_GetPawn_ReturnValue) == 0x000000, "Member 'AIC_Player_C_BeginBehaviorTree::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Player_C_BeginBehaviorTree, CallFunc_RunBehaviorTree_ReturnValue) == 0x000008, "Member 'AIC_Player_C_BeginBehaviorTree::CallFunc_RunBehaviorTree_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Player_C_BeginBehaviorTree, CallFunc_UseBlackboard_BlackboardComponent) == 0x000010, "Member 'AIC_Player_C_BeginBehaviorTree::CallFunc_UseBlackboard_BlackboardComponent' has a wrong offset!");
static_assert(offsetof(AIC_Player_C_BeginBehaviorTree, CallFunc_UseBlackboard_ReturnValue) == 0x000018, "Member 'AIC_Player_C_BeginBehaviorTree::CallFunc_UseBlackboard_ReturnValue' has a wrong offset!");

// Function AIC_Player.AIC_Player_C.IsAI
// 0x0001 (0x0001 - 0x0000)
struct AIC_Player_C_IsAI final
{
public:
	bool                                          bAI;                                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIC_Player_C_IsAI) == 0x000001, "Wrong alignment on AIC_Player_C_IsAI");
static_assert(sizeof(AIC_Player_C_IsAI) == 0x000001, "Wrong size on AIC_Player_C_IsAI");
static_assert(offsetof(AIC_Player_C_IsAI, bAI) == 0x000000, "Member 'AIC_Player_C_IsAI::bAI' has a wrong offset!");

}

