#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_PsyObjAttackThrow

#include "Basic.hpp"


namespace SDK::Params
{

// Function AnimNotify_PsyObjAttackThrow.AnimNotify_PsyObjAttackThrow_C.Received_Notify
// 0x0078 (0x0078 - 0x0000)
struct AnimNotify_PsyObjAttackThrow_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_327D[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimMontageStoped_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_327E[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APsychicAnimObject_C*                   K2Node_DynamicCast_AsPsychic_Anim_Object;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_327F[0x5];                                     // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_AnimNotifyExecuteCheck_C> CallFunc_CheckExecuteAnimNotifyCharacterKind_self_CastInput; // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckExecuteAnimNotifyCharacterKind_bExecute; // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimNotify_PsyObjAttackThrow_C_Received_Notify) == 0x000008, "Wrong alignment on AnimNotify_PsyObjAttackThrow_C_Received_Notify");
static_assert(sizeof(AnimNotify_PsyObjAttackThrow_C_Received_Notify) == 0x000078, "Wrong size on AnimNotify_PsyObjAttackThrow_C_Received_Notify");
static_assert(offsetof(AnimNotify_PsyObjAttackThrow_C_Received_Notify, MeshComp) == 0x000000, "Member 'AnimNotify_PsyObjAttackThrow_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotify_PsyObjAttackThrow_C_Received_Notify, Animation) == 0x000008, "Member 'AnimNotify_PsyObjAttackThrow_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotify_PsyObjAttackThrow_C_Received_Notify, ReturnValue) == 0x000010, "Member 'AnimNotify_PsyObjAttackThrow_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PsyObjAttackThrow_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'AnimNotify_PsyObjAttackThrow_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PsyObjAttackThrow_C_Received_Notify, CallFunc_GetDisplayName_ReturnValue) == 0x000018, "Member 'AnimNotify_PsyObjAttackThrow_C_Received_Notify::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PsyObjAttackThrow_C_Received_Notify, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'AnimNotify_PsyObjAttackThrow_C_Received_Notify::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PsyObjAttackThrow_C_Received_Notify, CallFunc_GetAnimInstance_ReturnValue) == 0x000038, "Member 'AnimNotify_PsyObjAttackThrow_C_Received_Notify::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PsyObjAttackThrow_C_Received_Notify, CallFunc_IsAnimMontageStoped_ReturnValue) == 0x000040, "Member 'AnimNotify_PsyObjAttackThrow_C_Received_Notify::CallFunc_IsAnimMontageStoped_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PsyObjAttackThrow_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'AnimNotify_PsyObjAttackThrow_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PsyObjAttackThrow_C_Received_Notify, K2Node_DynamicCast_AsPsychic_Anim_Object) == 0x000050, "Member 'AnimNotify_PsyObjAttackThrow_C_Received_Notify::K2Node_DynamicCast_AsPsychic_Anim_Object' has a wrong offset!");
static_assert(offsetof(AnimNotify_PsyObjAttackThrow_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'AnimNotify_PsyObjAttackThrow_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AnimNotify_PsyObjAttackThrow_C_Received_Notify, CallFunc_IsValid_ReturnValue_1) == 0x000059, "Member 'AnimNotify_PsyObjAttackThrow_C_Received_Notify::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_PsyObjAttackThrow_C_Received_Notify, CallFunc_IsValid_ReturnValue_2) == 0x00005A, "Member 'AnimNotify_PsyObjAttackThrow_C_Received_Notify::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AnimNotify_PsyObjAttackThrow_C_Received_Notify, CallFunc_CheckExecuteAnimNotifyCharacterKind_self_CastInput) == 0x000060, "Member 'AnimNotify_PsyObjAttackThrow_C_Received_Notify::CallFunc_CheckExecuteAnimNotifyCharacterKind_self_CastInput' has a wrong offset!");
static_assert(offsetof(AnimNotify_PsyObjAttackThrow_C_Received_Notify, CallFunc_CheckExecuteAnimNotifyCharacterKind_bExecute) == 0x000070, "Member 'AnimNotify_PsyObjAttackThrow_C_Received_Notify::CallFunc_CheckExecuteAnimNotifyCharacterKind_bExecute' has a wrong offset!");

}

