#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_PlayFootStep_Sound

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ST_DoubleString_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AnimNotify_PlayFootStep_Sound.AnimNotify_PlayFootStep_Sound_C
// 0x0048 (0x0080 - 0x0038)
class UAnimNotify_PlayFootStep_Sound_C final : public UAnimNotify
{
public:
	struct FVector                                HitSegmentOffset;                                  // 0x0038(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName;                                        // 0x0044(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGroundAttributeCheck;                            // 0x004C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DAC[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActionTypeName;                                    // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlaySocketPosition;                              // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DAD[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FST_DoubleString>               BpName_ActionName;                                 // 0x0060(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          IsOwnerRotation;                                   // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DAE[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               AddRotator;                                        // 0x0074(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation) const;
	void GetBoneLocation(class USceneComponent* Component, class AActor* Actor, class FName BoneName, struct FVector* Location) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimNotify_PlayFootStep_Sound_C">();
	}
	static class UAnimNotify_PlayFootStep_Sound_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_PlayFootStep_Sound_C>();
	}
};
static_assert(alignof(UAnimNotify_PlayFootStep_Sound_C) == 0x000008, "Wrong alignment on UAnimNotify_PlayFootStep_Sound_C");
static_assert(sizeof(UAnimNotify_PlayFootStep_Sound_C) == 0x000080, "Wrong size on UAnimNotify_PlayFootStep_Sound_C");
static_assert(offsetof(UAnimNotify_PlayFootStep_Sound_C, HitSegmentOffset) == 0x000038, "Member 'UAnimNotify_PlayFootStep_Sound_C::HitSegmentOffset' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayFootStep_Sound_C, SocketName) == 0x000044, "Member 'UAnimNotify_PlayFootStep_Sound_C::SocketName' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayFootStep_Sound_C, IsGroundAttributeCheck) == 0x00004C, "Member 'UAnimNotify_PlayFootStep_Sound_C::IsGroundAttributeCheck' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayFootStep_Sound_C, ActionTypeName) == 0x000050, "Member 'UAnimNotify_PlayFootStep_Sound_C::ActionTypeName' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayFootStep_Sound_C, IsPlaySocketPosition) == 0x000058, "Member 'UAnimNotify_PlayFootStep_Sound_C::IsPlaySocketPosition' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayFootStep_Sound_C, BpName_ActionName) == 0x000060, "Member 'UAnimNotify_PlayFootStep_Sound_C::BpName_ActionName' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayFootStep_Sound_C, IsOwnerRotation) == 0x000070, "Member 'UAnimNotify_PlayFootStep_Sound_C::IsOwnerRotation' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayFootStep_Sound_C, AddRotator) == 0x000074, "Member 'UAnimNotify_PlayFootStep_Sound_C::AddRotator' has a wrong offset!");

}

