#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimScaleHitStopEnemy

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct AnimScaleHitStopEnemy.AnimScaleHitStopEnemy
// 0x000C (0x000C - 0x0000)
struct FAnimScaleHitStopEnemy final
{
public:
	float                                         FastScale_4_848770EF41C234FF429EB6A7F080B6A1;      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FastSecond_5_0C3284A440FC8E60DE8CAB8C1C265C22;     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SlowScale_6_EFEBE8C74180C9912A9338B467BC8C42;      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FAnimScaleHitStopEnemy) == 0x000004, "Wrong alignment on FAnimScaleHitStopEnemy");
static_assert(sizeof(FAnimScaleHitStopEnemy) == 0x00000C, "Wrong size on FAnimScaleHitStopEnemy");
static_assert(offsetof(FAnimScaleHitStopEnemy, FastScale_4_848770EF41C234FF429EB6A7F080B6A1) == 0x000000, "Member 'FAnimScaleHitStopEnemy::FastScale_4_848770EF41C234FF429EB6A7F080B6A1' has a wrong offset!");
static_assert(offsetof(FAnimScaleHitStopEnemy, FastSecond_5_0C3284A440FC8E60DE8CAB8C1C265C22) == 0x000004, "Member 'FAnimScaleHitStopEnemy::FastSecond_5_0C3284A440FC8E60DE8CAB8C1C265C22' has a wrong offset!");
static_assert(offsetof(FAnimScaleHitStopEnemy, SlowScale_6_EFEBE8C74180C9912A9338B467BC8C42) == 0x000008, "Member 'FAnimScaleHitStopEnemy::SlowScale_6_EFEBE8C74180C9912A9338B467BC8C42' has a wrong offset!");

}

