#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_PlayFootStep_Effect

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AnimNotify_PlayFootStep_Effect.AnimNotify_PlayFootStep_Effect_C.Received_Notify
// 0x0220 (0x0220 - 0x0000)
struct AnimNotify_PlayFootStep_Effect_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C66[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               OwnerRotation;                                     // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                TransformLocation;                                 // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGamePhysicalSurfaceType                      PhysicsType;                                       // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C67[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      HitTypes;                                          // 0x0038(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FVector                                BoneLocation;                                      // 0x0048(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C68[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C69[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00B8(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TScriptInterface<class IFootStepInterface>    K2Node_DynamicCast_AsFoot_Step_Interface;          // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FootStepPlayEffect_ReturnValue;           // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C6A[0x2];                                     // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x00F4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x017E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C6B[0x1];                                     // 0x017F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBoneLocation_Location;                 // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGamePhysicalSurfaceType                      CallFunc_ConvertPhysicalSurfaceToGamePhysicalSurface_ReturnValue; // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0206(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C6C[0x1];                                     // 0x0207(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimMontageStoped_ReturnValue;          // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimNotify_PlayFootStep_Effect_C_Received_Notify) == 0x000010, "Wrong alignment on AnimNotify_PlayFootStep_Effect_C_Received_Notify");
static_assert(sizeof(AnimNotify_PlayFootStep_Effect_C_Received_Notify) == 0x000220, "Wrong size on AnimNotify_PlayFootStep_Effect_C_Received_Notify");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, MeshComp) == 0x000000, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, Animation) == 0x000008, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, ReturnValue) == 0x000010, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, OwnerRotation) == 0x000014, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::OwnerRotation' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, TransformLocation) == 0x000020, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::TransformLocation' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, PhysicsType) == 0x00002C, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::PhysicsType' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, Owner) == 0x000030, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::Owner' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, HitTypes) == 0x000038, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::HitTypes' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, BoneLocation) == 0x000048, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::BoneLocation' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, K2Node_MakeArray_Array) == 0x000058, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_ComposeRotators_ReturnValue) == 0x000068, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000074, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, Temp_object_Variable) == 0x0000B8, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, K2Node_DynamicCast_AsFoot_Step_Interface) == 0x0000C8, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::K2Node_DynamicCast_AsFoot_Step_Interface' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_FootStepPlayEffect_ReturnValue) == 0x0000D9, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_FootStepPlayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000DC, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_Add_VectorVector_ReturnValue) == 0x0000E8, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0000F4, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x00017C, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_BreakHitResult_bBlockingHit) == 0x00017D, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_BreakHitResult_bInitialOverlap) == 0x00017E, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_BreakHitResult_Time) == 0x000180, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_BreakHitResult_Distance) == 0x000184, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_BreakHitResult_Location) == 0x000188, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_BreakHitResult_ImpactPoint) == 0x000194, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_BreakHitResult_Normal) == 0x0001A0, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_BreakHitResult_ImpactNormal) == 0x0001AC, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_BreakHitResult_PhysMat) == 0x0001B8, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_BreakHitResult_HitActor) == 0x0001C0, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_BreakHitResult_HitComponent) == 0x0001C8, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_BreakHitResult_HitBoneName) == 0x0001D0, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_BreakHitResult_HitItem) == 0x0001D8, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_BreakHitResult_FaceIndex) == 0x0001DC, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_BreakHitResult_TraceStart) == 0x0001E0, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_BreakHitResult_TraceEnd) == 0x0001EC, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_GetBoneLocation_Location) == 0x0001F8, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_GetBoneLocation_Location' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_ConvertPhysicalSurfaceToGamePhysicalSurface_ReturnValue) == 0x000204, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_ConvertPhysicalSurfaceToGamePhysicalSurface_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_MakeLiteralByte_ReturnValue) == 0x000205, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_IsValid_ReturnValue_1) == 0x000206, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_GetAnimInstance_ReturnValue) == 0x000208, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000210, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_Received_Notify, CallFunc_IsAnimMontageStoped_ReturnValue) == 0x000218, "Member 'AnimNotify_PlayFootStep_Effect_C_Received_Notify::CallFunc_IsAnimMontageStoped_ReturnValue' has a wrong offset!");

// Function AnimNotify_PlayFootStep_Effect.AnimNotify_PlayFootStep_Effect_C.GetBoneLocation
// 0x0040 (0x0040 - 0x0000)
struct AnimNotify_PlayFootStep_Effect_C_GetBoneLocation final
{
public:
	class USceneComponent*                        Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSocketExist_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C6D[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimNotify_PlayFootStep_Effect_C_GetBoneLocation) == 0x000008, "Wrong alignment on AnimNotify_PlayFootStep_Effect_C_GetBoneLocation");
static_assert(sizeof(AnimNotify_PlayFootStep_Effect_C_GetBoneLocation) == 0x000040, "Wrong size on AnimNotify_PlayFootStep_Effect_C_GetBoneLocation");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_GetBoneLocation, Component) == 0x000000, "Member 'AnimNotify_PlayFootStep_Effect_C_GetBoneLocation::Component' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_GetBoneLocation, Actor) == 0x000008, "Member 'AnimNotify_PlayFootStep_Effect_C_GetBoneLocation::Actor' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_GetBoneLocation, BoneName) == 0x000010, "Member 'AnimNotify_PlayFootStep_Effect_C_GetBoneLocation::BoneName' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_GetBoneLocation, Location) == 0x000018, "Member 'AnimNotify_PlayFootStep_Effect_C_GetBoneLocation::Location' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_GetBoneLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000024, "Member 'AnimNotify_PlayFootStep_Effect_C_GetBoneLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_GetBoneLocation, CallFunc_DoesSocketExist_ReturnValue) == 0x000030, "Member 'AnimNotify_PlayFootStep_Effect_C_GetBoneLocation::CallFunc_DoesSocketExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Effect_C_GetBoneLocation, CallFunc_GetSocketLocation_ReturnValue) == 0x000034, "Member 'AnimNotify_PlayFootStep_Effect_C_GetBoneLocation::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");

}

