#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_PlayFootStep_Sound

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AnimNotify_PlayFootStep_Sound.AnimNotify_PlayFootStep_Sound_C.Received_Notify
// 0x02D0 (0x02D0 - 0x0000)
struct AnimNotify_PlayFootStep_Sound_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DAF[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               OwnerRotation;                                     // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                TransformLocation;                                 // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGamePhysicalSurfaceType                      PhysicsType;                                       // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DB0[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      HitTypes;                                          // 0x0038(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FVector                                BoneLocation;                                      // 0x0048(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_1;            // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DB1[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	TScriptInterface<class IFootStepInterface>    K2Node_DynamicCast_AsFoot_Step_Interface;          // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DB2[0x2];                                     // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FootStepPlaySound_ReturnValue;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DB3[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_LeftChop_ReturnValue;                     // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DB4[0xF];                                     // 0x0111(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0120(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DB5[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0158(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DB6[0x3];                                     // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DB7[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFootStepInterface>    K2Node_DynamicCast_AsFoot_Step_Interface_1;        // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FootStepPlaySound_ReturnValue_1;          // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DB8[0x2];                                     // 0x018A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x01A4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x022D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x022E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DB9[0x1];                                     // 0x022F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x029C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBoneLocation_Location;                 // 0x02A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGamePhysicalSurfaceType                      CallFunc_ConvertPhysicalSurfaceToGamePhysicalSurface_ReturnValue; // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x02B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DBA[0x1];                                     // 0x02B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimMontageStoped_ReturnValue;          // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimNotify_PlayFootStep_Sound_C_Received_Notify) == 0x000010, "Wrong alignment on AnimNotify_PlayFootStep_Sound_C_Received_Notify");
static_assert(sizeof(AnimNotify_PlayFootStep_Sound_C_Received_Notify) == 0x0002D0, "Wrong size on AnimNotify_PlayFootStep_Sound_C_Received_Notify");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, MeshComp) == 0x000000, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, Animation) == 0x000008, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, ReturnValue) == 0x000010, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, OwnerRotation) == 0x000014, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::OwnerRotation' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, TransformLocation) == 0x000020, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::TransformLocation' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, PhysicsType) == 0x00002C, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::PhysicsType' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, Owner) == 0x000030, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::Owner' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, HitTypes) == 0x000038, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::HitTypes' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, BoneLocation) == 0x000048, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::BoneLocation' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_ComposeRotators_ReturnValue) == 0x000054, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, Temp_int_Array_Index_Variable) == 0x000060, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_ComposeRotators_ReturnValue_1) == 0x000064, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_ComposeRotators_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000070, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, K2Node_MakeArray_Array) == 0x000080, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, K2Node_DynamicCast_AsFoot_Step_Interface) == 0x0000C0, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::K2Node_DynamicCast_AsFoot_Step_Interface' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x0000D1, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_Array_Length_ReturnValue) == 0x0000D4, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_Conv_StringToName_ReturnValue) == 0x0000D8, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_GetObjectClass_ReturnValue) == 0x0000E0, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_FootStepPlaySound_ReturnValue) == 0x0000E8, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_FootStepPlaySound_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_GetClassDisplayName_ReturnValue) == 0x0000F0, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_LeftChop_ReturnValue) == 0x000100, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_LeftChop_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000110, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_MakeTransform_ReturnValue_1) == 0x000120, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_IsValid_ReturnValue_1) == 0x000150, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, Temp_object_Variable) == 0x000158, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, Temp_int_Loop_Counter_Variable) == 0x000168, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_Less_IntInt_ReturnValue) == 0x00016C, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_Add_IntInt_ReturnValue) == 0x000170, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, K2Node_DynamicCast_AsFoot_Step_Interface_1) == 0x000178, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::K2Node_DynamicCast_AsFoot_Step_Interface_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, K2Node_DynamicCast_bSuccess_1) == 0x000188, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_FootStepPlaySound_ReturnValue_1) == 0x000189, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_FootStepPlaySound_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00018C, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_Add_VectorVector_ReturnValue) == 0x000198, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0001A4, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x00022C, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_BreakHitResult_bBlockingHit) == 0x00022D, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_BreakHitResult_bInitialOverlap) == 0x00022E, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_BreakHitResult_Time) == 0x000230, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_BreakHitResult_Distance) == 0x000234, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_BreakHitResult_Location) == 0x000238, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_BreakHitResult_ImpactPoint) == 0x000244, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_BreakHitResult_Normal) == 0x000250, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_BreakHitResult_ImpactNormal) == 0x00025C, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_BreakHitResult_PhysMat) == 0x000268, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_BreakHitResult_HitActor) == 0x000270, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_BreakHitResult_HitComponent) == 0x000278, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_BreakHitResult_HitBoneName) == 0x000280, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_BreakHitResult_HitItem) == 0x000288, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_BreakHitResult_FaceIndex) == 0x00028C, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_BreakHitResult_TraceStart) == 0x000290, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_BreakHitResult_TraceEnd) == 0x00029C, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_GetBoneLocation_Location) == 0x0002A8, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_GetBoneLocation_Location' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_ConvertPhysicalSurfaceToGamePhysicalSurface_ReturnValue) == 0x0002B4, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_ConvertPhysicalSurfaceToGamePhysicalSurface_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_MakeLiteralByte_ReturnValue) == 0x0002B5, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_IsValid_ReturnValue_2) == 0x0002B6, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_GetAnimInstance_ReturnValue) == 0x0002B8, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x0002C0, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_Received_Notify, CallFunc_IsAnimMontageStoped_ReturnValue) == 0x0002C8, "Member 'AnimNotify_PlayFootStep_Sound_C_Received_Notify::CallFunc_IsAnimMontageStoped_ReturnValue' has a wrong offset!");

// Function AnimNotify_PlayFootStep_Sound.AnimNotify_PlayFootStep_Sound_C.GetBoneLocation
// 0x0040 (0x0040 - 0x0000)
struct AnimNotify_PlayFootStep_Sound_C_GetBoneLocation final
{
public:
	class USceneComponent*                        Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSocketExist_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DBB[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimNotify_PlayFootStep_Sound_C_GetBoneLocation) == 0x000008, "Wrong alignment on AnimNotify_PlayFootStep_Sound_C_GetBoneLocation");
static_assert(sizeof(AnimNotify_PlayFootStep_Sound_C_GetBoneLocation) == 0x000040, "Wrong size on AnimNotify_PlayFootStep_Sound_C_GetBoneLocation");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_GetBoneLocation, Component) == 0x000000, "Member 'AnimNotify_PlayFootStep_Sound_C_GetBoneLocation::Component' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_GetBoneLocation, Actor) == 0x000008, "Member 'AnimNotify_PlayFootStep_Sound_C_GetBoneLocation::Actor' has a wrong offset!");
static_assert(offsetof(AnimNotify_PlayFootStep_Sound_C_GetBoneLocation, BoneName) == 0x000010, "Member 'AnimNotify_PlayFootStep_Sound_C_GetBoneLocation::BoneName' has a wrong offset!");
