#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotifyState_AutoAimBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AnimNotifyState_AutoAimBP.AnimNotifyState_AutoAimBP_C.Received_NotifyBegin
// 0x0188 (0x0188 - 0x0000)
struct AnimNotifyState_AutoAimBP_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          LbIsInternalLock;                                  // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5127[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LCurAimSpeedInternalLock;                          // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LCurAimSpeed;                                      // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Owner;                                             // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattleCharacter_C*                   LAimCharacter;                                     // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 LTargetActor;                                      // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5128[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         Temp_object_Variable_1;                            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5129[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface;         // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_512A[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_AnimNotifyExecuteCheck_C> K2Node_DynamicCast_AsBPI_Anim_Notify_Execute_Check; // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOverwriteAttackAutoAimSpeed_bOverwrite; // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_512B[0x2];                                     // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_IsOverwriteAttackAutoAimSpeed_Speed;      // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_512C[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> CallFunc_GetBattleTargetActor_self_CastInput;      // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetBattleTargetActor_TargetActor;         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_IsEnemyPlayer_self_CastInput;             // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemyPlayer_bEnemyPlayer;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_512D[0x6];                                     // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerProxyAttacker_C> K2Node_DynamicCast_AsBPI_Player_Proxy_Attacker;    // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_512E[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      CallFunc_GetProxyRequestedPlayer_Player;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_512F[0x3];                                     // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattleCharacter_C*                   K2Node_DynamicCast_AsRSBattle_Character;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5130[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleCharacterInterface_C> CallFunc_GetAutoAimRate_self_CastInput;            // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetAutoAimRate_Rate;                      // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5131[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattleCharacter_C*                   K2Node_DynamicCast_AsRSBattle_Character_1;         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5132[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharacterParamater_C> K2Node_DynamicCast_AsBPI_Character_Paramater;      // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBadStatusConfusion_bBadStatus;          // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckExecuteAnimNotifyCharacterKind_bExecute; // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5133[0x5];                                     // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         K2Node_Select_Default;                             // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface_1;       // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetTalkLookAtLocation_bTalkLookAt;        // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5134[0x2];                                     // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetTalkLookAtLocation_Location;           // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5135[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         K2Node_Select_Default_1;                           // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin) == 0x000008, "Wrong alignment on AnimNotifyState_AutoAimBP_C_Received_NotifyBegin");
static_assert(sizeof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin) == 0x000188, "Wrong size on AnimNotifyState_AutoAimBP_C_Received_NotifyBegin");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, TotalDuration) == 0x000010, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, ReturnValue) == 0x000014, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, LbIsInternalLock) == 0x000015, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::LbIsInternalLock' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, LCurAimSpeedInternalLock) == 0x000018, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::LCurAimSpeedInternalLock' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, LCurAimSpeed) == 0x00001C, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::LCurAimSpeed' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, Owner) == 0x000020, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::Owner' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, LAimCharacter) == 0x000028, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::LAimCharacter' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, LTargetActor) == 0x000030, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::LTargetActor' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, Temp_object_Variable) == 0x000038, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, Temp_bool_Variable) == 0x000048, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, Temp_object_Variable_1) == 0x000050, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000058, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, Temp_bool_Variable_1) == 0x000059, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, K2Node_DynamicCast_AsBPI_Player_Interface) == 0x000060, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::K2Node_DynamicCast_AsBPI_Player_Interface' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, K2Node_DynamicCast_AsBPI_Anim_Notify_Execute_Check) == 0x000078, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::K2Node_DynamicCast_AsBPI_Anim_Notify_Execute_Check' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, CallFunc_IsOverwriteAttackAutoAimSpeed_bOverwrite) == 0x000089, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::CallFunc_IsOverwriteAttackAutoAimSpeed_bOverwrite' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, CallFunc_IsOverwriteAttackAutoAimSpeed_Speed) == 0x00008C, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::CallFunc_IsOverwriteAttackAutoAimSpeed_Speed' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, K2Node_DynamicCast_AsRSBattle_Player) == 0x000090, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, CallFunc_GetBattleTargetActor_self_CastInput) == 0x0000A0, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::CallFunc_GetBattleTargetActor_self_CastInput' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, CallFunc_GetBattleTargetActor_TargetActor) == 0x0000B0, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::CallFunc_GetBattleTargetActor_TargetActor' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, CallFunc_IsEnemyPlayer_self_CastInput) == 0x0000B8, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::CallFunc_IsEnemyPlayer_self_CastInput' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, CallFunc_IsEnemyPlayer_bEnemyPlayer) == 0x0000C8, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::CallFunc_IsEnemyPlayer_bEnemyPlayer' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, CallFunc_IsValid_ReturnValue) == 0x0000C9, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, K2Node_DynamicCast_AsBPI_Player_Proxy_Attacker) == 0x0000D0, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::K2Node_DynamicCast_AsBPI_Player_Proxy_Attacker' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, K2Node_DynamicCast_bSuccess_3) == 0x0000E0, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, CallFunc_GetProxyRequestedPlayer_Player) == 0x0000E8, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::CallFunc_GetProxyRequestedPlayer_Player' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000F0, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, CallFunc_SelectFloat_ReturnValue) == 0x0000F4, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, K2Node_DynamicCast_AsRSBattle_Character) == 0x0000F8, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::K2Node_DynamicCast_AsRSBattle_Character' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, K2Node_DynamicCast_bSuccess_4) == 0x000100, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, CallFunc_GetAutoAimRate_self_CastInput) == 0x000108, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::CallFunc_GetAutoAimRate_self_CastInput' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, CallFunc_GetAutoAimRate_Rate) == 0x000118, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::CallFunc_GetAutoAimRate_Rate' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00011C, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000120, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, K2Node_DynamicCast_AsRSBattle_Character_1) == 0x000128, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::K2Node_DynamicCast_AsRSBattle_Character_1' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, K2Node_DynamicCast_bSuccess_5) == 0x000130, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, K2Node_DynamicCast_AsBPI_Character_Paramater) == 0x000138, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::K2Node_DynamicCast_AsBPI_Character_Paramater' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, K2Node_DynamicCast_bSuccess_6) == 0x000148, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, CallFunc_IsBadStatusConfusion_bBadStatus) == 0x000149, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::CallFunc_IsBadStatusConfusion_bBadStatus' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, CallFunc_CheckExecuteAnimNotifyCharacterKind_bExecute) == 0x00014A, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::CallFunc_CheckExecuteAnimNotifyCharacterKind_bExecute' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, K2Node_Select_Default) == 0x000150, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, K2Node_DynamicCast_AsBPI_Player_Interface_1) == 0x000158, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::K2Node_DynamicCast_AsBPI_Player_Interface_1' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, K2Node_DynamicCast_bSuccess_7) == 0x000168, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, CallFunc_GetTalkLookAtLocation_bTalkLookAt) == 0x000169, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::CallFunc_GetTalkLookAtLocation_bTalkLookAt' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, CallFunc_GetTalkLookAtLocation_Location) == 0x00016C, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::CallFunc_GetTalkLookAtLocation_Location' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, CallFunc_IsValid_ReturnValue_1) == 0x000178, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyBegin, K2Node_Select_Default_1) == 0x000180, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyBegin::K2Node_Select_Default_1' has a wrong offset!");

// Function AnimNotifyState_AutoAimBP.AnimNotifyState_AutoAimBP_C.Received_NotifyEnd
// 0x0080 (0x0080 - 0x0000)
struct AnimNotifyState_AutoAimBP_C_Received_NotifyEnd final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5136[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattleCharacter_C*                   LAimCharacter;                                     // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_AnimNotifyExecuteCheck_C> K2Node_DynamicCast_AsBPI_Anim_Notify_Execute_Check; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5137[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattleCharacter_C*                   K2Node_DynamicCast_AsRSBattle_Character;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5138[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerProxyAttacker_C> K2Node_DynamicCast_AsBPI_Player_Proxy_Attacker;    // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5139[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      CallFunc_GetProxyRequestedPlayer_Player;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckExecuteAnimNotifyCharacterKind_bExecute; // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimNotifyState_AutoAimBP_C_Received_NotifyEnd) == 0x000008, "Wrong alignment on AnimNotifyState_AutoAimBP_C_Received_NotifyEnd");
static_assert(sizeof(AnimNotifyState_AutoAimBP_C_Received_NotifyEnd) == 0x000080, "Wrong size on AnimNotifyState_AutoAimBP_C_Received_NotifyEnd");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyEnd, MeshComp) == 0x000000, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyEnd::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyEnd, Animation) == 0x000008, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyEnd::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_AutoAimBP_C_Received_NotifyEnd, ReturnValue) == 0x000010, "Member 'AnimNotifyState_AutoAimBP_C_Received_NotifyEnd::ReturnValue' has a wrong offset!");
