#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ASS_AjitoTalk

#include "Basic.hpp"


namespace SDK::Params
{

// Function ASS_AjitoTalk.ASS_AjitoTalk_C.ExecuteUbergraph_ASS_AjitoTalk
// 0x0010 (0x0010 - 0x0000)
struct ASS_AjitoTalk_C_ExecuteUbergraph_ASS_AjitoTalk final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          K2Node_Event_AnimInstance;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ASS_AjitoTalk_C_ExecuteUbergraph_ASS_AjitoTalk) == 0x000008, "Wrong alignment on ASS_AjitoTalk_C_ExecuteUbergraph_ASS_AjitoTalk");
static_assert(sizeof(ASS_AjitoTalk_C_ExecuteUbergraph_ASS_AjitoTalk) == 0x000010, "Wrong size on ASS_AjitoTalk_C_ExecuteUbergraph_ASS_AjitoTalk");
static_assert(offsetof(ASS_AjitoTalk_C_ExecuteUbergraph_ASS_AjitoTalk, EntryPoint) == 0x000000, "Member 'ASS_AjitoTalk_C_ExecuteUbergraph_ASS_AjitoTalk::EntryPoint' has a wrong offset!");
static_assert(offsetof(ASS_AjitoTalk_C_ExecuteUbergraph_ASS_AjitoTalk, K2Node_Event_DeltaTime) == 0x000004, "Member 'ASS_AjitoTalk_C_ExecuteUbergraph_ASS_AjitoTalk::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(ASS_AjitoTalk_C_ExecuteUbergraph_ASS_AjitoTalk, K2Node_Event_AnimInstance) == 0x000008, "Member 'ASS_AjitoTalk_C_ExecuteUbergraph_ASS_AjitoTalk::K2Node_Event_AnimInstance' has a wrong offset!");

// Function ASS_AjitoTalk.ASS_AjitoTalk_C.ReceiveTick
// 0x0010 (0x0010 - 0x0000)
struct ASS_AjitoTalk_C_ReceiveTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F6E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          AnimInstance;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ASS_AjitoTalk_C_ReceiveTick) == 0x000008, "Wrong alignment on ASS_AjitoTalk_C_ReceiveTick");
static_assert(sizeof(ASS_AjitoTalk_C_ReceiveTick) == 0x000010, "Wrong size on ASS_AjitoTalk_C_ReceiveTick");
static_assert(offsetof(ASS_AjitoTalk_C_ReceiveTick, DeltaTime) == 0x000000, "Member 'ASS_AjitoTalk_C_ReceiveTick::DeltaTime' has a wrong offset!");
static_assert(offsetof(ASS_AjitoTalk_C_ReceiveTick, AnimInstance) == 0x000008, "Member 'ASS_AjitoTalk_C_ReceiveTick::AnimInstance' has a wrong offset!");

}

