#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AST_AjitoIsReadyToTransitionIdle

#include "Basic.hpp"


namespace SDK::Params
{

// Function AST_AjitoIsReadyToTransitionIdle.AST_AjitoIsReadyToTransitionIdle_C.ReceiveCanEnter
// 0x0028 (0x0028 - 0x0000)
struct AST_AjitoIsReadyToTransitionIdle_C_ReceiveCanEnter final
{
public:
	class UAnimInstance*                          AnimInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4179[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAjitoAnimInstance*                   Inst;                                              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSAjitoAnimInstance*                   K2Node_DynamicCast_AsRSAjito_Anim_Instance;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWaitTransitionToIdle_ReturnValue;       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AST_AjitoIsReadyToTransitionIdle_C_ReceiveCanEnter) == 0x000008, "Wrong alignment on AST_AjitoIsReadyToTransitionIdle_C_ReceiveCanEnter");
static_assert(sizeof(AST_AjitoIsReadyToTransitionIdle_C_ReceiveCanEnter) == 0x000028, "Wrong size on AST_AjitoIsReadyToTransitionIdle_C_ReceiveCanEnter");
static_assert(offsetof(AST_AjitoIsReadyToTransitionIdle_C_ReceiveCanEnter, AnimInstance) == 0x000000, "Member 'AST_AjitoIsReadyToTransitionIdle_C_ReceiveCanEnter::AnimInstance' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsReadyToTransitionIdle_C_ReceiveCanEnter, ReturnValue) == 0x000008, "Member 'AST_AjitoIsReadyToTransitionIdle_C_ReceiveCanEnter::ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsReadyToTransitionIdle_C_ReceiveCanEnter, Inst) == 0x000010, "Member 'AST_AjitoIsReadyToTransitionIdle_C_ReceiveCanEnter::Inst' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsReadyToTransitionIdle_C_ReceiveCanEnter, K2Node_DynamicCast_AsRSAjito_Anim_Instance) == 0x000018, "Member 'AST_AjitoIsReadyToTransitionIdle_C_ReceiveCanEnter::K2Node_DynamicCast_AsRSAjito_Anim_Instance' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsReadyToTransitionIdle_C_ReceiveCanEnter, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AST_AjitoIsReadyToTransitionIdle_C_ReceiveCanEnter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsReadyToTransitionIdle_C_ReceiveCanEnter, CallFunc_IsWaitTransitionToIdle_ReturnValue) == 0x000021, "Member 'AST_AjitoIsReadyToTransitionIdle_C_ReceiveCanEnter::CallFunc_IsWaitTransitionToIdle_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsReadyToTransitionIdle_C_ReceiveCanEnter, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'AST_AjitoIsReadyToTransitionIdle_C_ReceiveCanEnter::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

