#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AST_AjitoIsReadyToTransitionTalk

#include "Basic.hpp"


namespace SDK::Params
{

// Function AST_AjitoIsReadyToTransitionTalk.AST_AjitoIsReadyToTransitionTalk_C.ReceiveCanEnter
// 0x0060 (0x0060 - 0x0000)
struct AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter final
{
public:
	class UAnimInstance*                          AnimInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EB3[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAjitoAnimInstance*                   Inst;                                              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSAjitoAnimInstance*                   K2Node_DynamicCast_AsRSAjito_Anim_Instance;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EB4[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWaitTransitionToTalk_ReturnValue;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EB5[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EB6[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AjitoMember_C*                      K2Node_DynamicCast_AsBP_Ajito_Member;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter) == 0x000008, "Wrong alignment on AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter");
static_assert(sizeof(AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter) == 0x000060, "Wrong size on AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter");
static_assert(offsetof(AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter, AnimInstance) == 0x000000, "Member 'AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter::AnimInstance' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter, ReturnValue) == 0x000008, "Member 'AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter::ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter, Inst) == 0x000010, "Member 'AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter::Inst' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter, K2Node_DynamicCast_AsRSAjito_Anim_Instance) == 0x000018, "Member 'AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter::K2Node_DynamicCast_AsRSAjito_Anim_Instance' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter, CallFunc_GetOwningActor_ReturnValue) == 0x000028, "Member 'AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter, CallFunc_IsWaitTransitionToTalk_ReturnValue) == 0x000030, "Member 'AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter::CallFunc_IsWaitTransitionToTalk_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter, CallFunc_GetObjectName_ReturnValue) == 0x000038, "Member 'AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter, CallFunc_Not_PreBool_ReturnValue_1) == 0x000048, "Member 'AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter, CallFunc_Contains_ReturnValue) == 0x000049, "Member 'AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter, K2Node_DynamicCast_AsBP_Ajito_Member) == 0x000050, "Member 'AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter::K2Node_DynamicCast_AsBP_Ajito_Member' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000059, "Member 'AST_AjitoIsReadyToTransitionTalk_C_ReceiveCanEnter::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

