#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AST_AjitoIsStateIdle

#include "Basic.hpp"


namespace SDK::Params
{

// Function AST_AjitoIsStateIdle.AST_AjitoIsStateIdle_C.ReceiveCanEnter
// 0x0038 (0x0038 - 0x0000)
struct AST_AjitoIsStateIdle_C_ReceiveCanEnter final
{
public:
	class UAnimInstance*                          AnimInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F6C[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WaitTransitionToTalkTime;                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSAjitoAnimInstance*                   K2Node_DynamicCast_AsRSAjito_Anim_Instance;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWaitTransitionToIdle_ReturnValue;       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F6D[0x5];                                     // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AST_AjitoIsStateIdle_C_ReceiveCanEnter) == 0x000008, "Wrong alignment on AST_AjitoIsStateIdle_C_ReceiveCanEnter");
static_assert(sizeof(AST_AjitoIsStateIdle_C_ReceiveCanEnter) == 0x000038, "Wrong size on AST_AjitoIsStateIdle_C_ReceiveCanEnter");
static_assert(offsetof(AST_AjitoIsStateIdle_C_ReceiveCanEnter, AnimInstance) == 0x000000, "Member 'AST_AjitoIsStateIdle_C_ReceiveCanEnter::AnimInstance' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsStateIdle_C_ReceiveCanEnter, ReturnValue) == 0x000008, "Member 'AST_AjitoIsStateIdle_C_ReceiveCanEnter::ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsStateIdle_C_ReceiveCanEnter, WaitTransitionToTalkTime) == 0x00000C, "Member 'AST_AjitoIsStateIdle_C_ReceiveCanEnter::WaitTransitionToTalkTime' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsStateIdle_C_ReceiveCanEnter, K2Node_DynamicCast_AsRSAjito_Anim_Instance) == 0x000010, "Member 'AST_AjitoIsStateIdle_C_ReceiveCanEnter::K2Node_DynamicCast_AsRSAjito_Anim_Instance' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsStateIdle_C_ReceiveCanEnter, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AST_AjitoIsStateIdle_C_ReceiveCanEnter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsStateIdle_C_ReceiveCanEnter, CallFunc_IsWaitTransitionToIdle_ReturnValue) == 0x000019, "Member 'AST_AjitoIsStateIdle_C_ReceiveCanEnter::CallFunc_IsWaitTransitionToIdle_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsStateIdle_C_ReceiveCanEnter, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'AST_AjitoIsStateIdle_C_ReceiveCanEnter::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsStateIdle_C_ReceiveCanEnter, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000020, "Member 'AST_AjitoIsStateIdle_C_ReceiveCanEnter::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_AjitoIsStateIdle_C_ReceiveCanEnter, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000030, "Member 'AST_AjitoIsStateIdle_C_ReceiveCanEnter::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

