#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AttackCollisionInfoBP

#include "Basic.hpp"

#include "CollisionCommonInfoBP_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK
{

// UserDefinedStruct AttackCollisionInfoBP.AttackCollisionInfoBP
// 0x00C0 (0x00C0 - 0x0000)
struct FAttackCollisionInfoBP final
{
public:
	class FName                                   RootSocketName_24_3EEEE927414150D25963009A398E0207; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TopSocketName_26_DB742762423CF879CFC380B969332A1F; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius_9_589248E74C0804A5312CCAAAFF97D109;         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RootOffset_57_D72D38194D55C7F8C822C5B4CCE42E44;    // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TopOffset_59_010C8A794FE03130163194B023E0CBD3;     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LimitHeight_76_5A8C44C642F2E3F807E7C7BB5C513D82;   // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCollisionCommonInfoBP                 Common_45_33AB12FB401DEFC93743E28B03FE3EF9;        // 0x0020(0x0078)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UDataTable*                             SkillTable_62_E5EA266A4AFE8A57BD33F1B85C035BC0;    // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SkillName_54_907CE78A4CEAD15A5637449C84958305;     // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EffectiveRangeMin_68_1C84328549F6518703FBDD8FEC2035A3; // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EffectiveRangeMax_70_D394897A404B8485F2FFC1854DA2BBE5; // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   OutEffectiveRangeSkillName_73_DD13176146FF7894347B0A89294BA21F; // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHCHitEffectInfo                       EffectInfo_65_5701B8F34D5327BE8835258ABCBF1BE4;    // 0x00B8(0x0008)(Edit, BlueprintVisible, NoDestructor)
};
static_assert(alignof(FAttackCollisionInfoBP) == 0x000008, "Wrong alignment on FAttackCollisionInfoBP");
static_assert(sizeof(FAttackCollisionInfoBP) == 0x0000C0, "Wrong size on FAttackCollisionInfoBP");
static_assert(offsetof(FAttackCollisionInfoBP, RootSocketName_24_3EEEE927414150D25963009A398E0207) == 0x000000, "Member 'FAttackCollisionInfoBP::RootSocketName_24_3EEEE927414150D25963009A398E0207' has a wrong offset!");
static_assert(offsetof(FAttackCollisionInfoBP, TopSocketName_26_DB742762423CF879CFC380B969332A1F) == 0x000008, "Member 'FAttackCollisionInfoBP::TopSocketName_26_DB742762423CF879CFC380B969332A1F' has a wrong offset!");
static_assert(offsetof(FAttackCollisionInfoBP, Radius_9_589248E74C0804A5312CCAAAFF97D109) == 0x000010, "Member 'FAttackCollisionInfoBP::Radius_9_589248E74C0804A5312CCAAAFF97D109' has a wrong offset!");
static_assert(offsetof(FAttackCollisionInfoBP, RootOffset_57_D72D38194D55C7F8C822C5B4CCE42E44) == 0x000014, "Member 'FAttackCollisionInfoBP::RootOffset_57_D72D38194D55C7F8C822C5B4CCE42E44' has a wrong offset!");
static_assert(offsetof(FAttackCollisionInfoBP, TopOffset_59_010C8A794FE03130163194B023E0CBD3) == 0x000018, "Member 'FAttackCollisionInfoBP::TopOffset_59_010C8A794FE03130163194B023E0CBD3' has a wrong offset!");
static_assert(offsetof(FAttackCollisionInfoBP, LimitHeight_76_5A8C44C642F2E3F807E7C7BB5C513D82) == 0x00001C, "Member 'FAttackCollisionInfoBP::LimitHeight_76_5A8C44C642F2E3F807E7C7BB5C513D82' has a wrong offset!");
static_assert(offsetof(FAttackCollisionInfoBP, Common_45_33AB12FB401DEFC93743E28B03FE3EF9) == 0x000020, "Member 'FAttackCollisionInfoBP::Common_45_33AB12FB401DEFC93743E28B03FE3EF9' has a wrong offset!");
static_assert(offsetof(FAttackCollisionInfoBP, SkillTable_62_E5EA266A4AFE8A57BD33F1B85C035BC0) == 0x000098, "Member 'FAttackCollisionInfoBP::SkillTable_62_E5EA266A4AFE8A57BD33F1B85C035BC0' has a wrong offset!");
static_assert(offsetof(FAttackCollisionInfoBP, SkillName_54_907CE78A4CEAD15A5637449C84958305) == 0x0000A0, "Member 'FAttackCollisionInfoBP::SkillName_54_907CE78A4CEAD15A5637449C84958305' has a wrong offset!");
static_assert(offsetof(FAttackCollisionInfoBP, EffectiveRangeMin_68_1C84328549F6518703FBDD8FEC2035A3) == 0x0000A8, "Member 'FAttackCollisionInfoBP::EffectiveRangeMin_68_1C84328549F6518703FBDD8FEC2035A3' has a wrong offset!");
static_assert(offsetof(FAttackCollisionInfoBP, EffectiveRangeMax_70_D394897A404B8485F2FFC1854DA2BBE5) == 0x0000AC, "Member 'FAttackCollisionInfoBP::EffectiveRangeMax_70_D394897A404B8485F2FFC1854DA2BBE5' has a wrong offset!");
static_assert(offsetof(FAttackCollisionInfoBP, OutEffectiveRangeSkillName_73_DD13176146FF7894347B0A89294BA21F) == 0x0000B0, "Member 'FAttackCollisionInfoBP::OutEffectiveRangeSkillName_73_DD13176146FF7894347B0A89294BA21F' has a wrong offset!");
static_assert(offsetof(FAttackCollisionInfoBP, EffectInfo_65_5701B8F34D5327BE8835258ABCBF1BE4) == 0x0000B8, "Member 'FAttackCollisionInfoBP::EffectInfo_65_5701B8F34D5327BE8835258ABCBF1BE4' has a wrong offset!");

}

