#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BadStateAddParticleData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct BadStateAddParticleData.BadStateAddParticleData
// 0x0028 (0x0028 - 0x0000)
struct FBadStateAddParticleData final
{
public:
	class UParticleSystem*                        Particle_2_C097B4D343EF2B7603598AB72745BC48;       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName_13_90706B514E3E6B1DD7FF50AD96D7B880;    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location_8_AA38289F43FE9B431B58BBB26CA4C096;       // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Scale_10_ACE8389743B3B721936BBD88D9AA0C55;         // 0x001C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FBadStateAddParticleData) == 0x000008, "Wrong alignment on FBadStateAddParticleData");
static_assert(sizeof(FBadStateAddParticleData) == 0x000028, "Wrong size on FBadStateAddParticleData");
static_assert(offsetof(FBadStateAddParticleData, Particle_2_C097B4D343EF2B7603598AB72745BC48) == 0x000000, "Member 'FBadStateAddParticleData::Particle_2_C097B4D343EF2B7603598AB72745BC48' has a wrong offset!");
static_assert(offsetof(FBadStateAddParticleData, SocketName_13_90706B514E3E6B1DD7FF50AD96D7B880) == 0x000008, "Member 'FBadStateAddParticleData::SocketName_13_90706B514E3E6B1DD7FF50AD96D7B880' has a wrong offset!");
static_assert(offsetof(FBadStateAddParticleData, Location_8_AA38289F43FE9B431B58BBB26CA4C096) == 0x000010, "Member 'FBadStateAddParticleData::Location_8_AA38289F43FE9B431B58BBB26CA4C096' has a wrong offset!");
static_assert(offsetof(FBadStateAddParticleData, Scale_10_ACE8389743B3B721936BBD88D9AA0C55) == 0x00001C, "Member 'FBadStateAddParticleData::Scale_10_ACE8389743B3B721936BBD88D9AA0C55' has a wrong offset!");

}

