#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePrototype

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "BattlePrototype_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "ActionSystem_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"
#include "HorizonUI_classes.hpp"
#include "AssetRegistry_structs.hpp"
#include "CriWareRuntime_structs.hpp"
#include "CriWareRuntime_classes.hpp"
#include "REDAnimationNode_structs.hpp"
#include "NavigationSystem_classes.hpp"
#include "InputCore_structs.hpp"
#include "LevelSequence_classes.hpp"


namespace SDK
{

// Class BattlePrototype.BattleCharacterInterface
// 0x0000 (0x0028 - 0x0028)
class IBattleCharacterInterface final : public IInterface
{
public:
	bool AddScarFromHitDamageInfoInterface(class AActor* Actor, const struct FHitDamageInfo& HitDamageInfo);
	float CalcUniqueDamage(const struct FHCHitResult& HitResult, float BaseDamage);
	bool CheckEmphasisCrashGauge(const struct FHCHitResult& HitResult);
	void DisEnableNoDeadTutorial();
	void EndNoDeadNoCrashChanceEvent();
	bool EventStartForceEndBadStatus();
	struct FVector GetAutoAimTargetLocation();
	void GetCameraStabilizeParameter(float* DistLockHz, float* DistRestoreHz, float* DistLockVt, float* DistRestoreVt);
	ECharacterHitPriority GetCharacterHitPriorityInterface();
	struct FVector GetDamageReactionDirInterface(const struct FHCHitResult& HitResult);
	struct FVector GetLookAtTargetLocation();
	bool IsBadStatusConfusionCPP();
	bool IsBadStatusElectricCPP();
	bool IsBadStatusFlameCPP();
	bool IsBadStatusFloodedCPP();
	bool IsBadStatusOilCPP();
	bool IsCounterWaitInterface();
	bool IsDisableAtomCuePlayInterface();
	bool IsEnableSlashEffectInterface(const struct FHCHitResult& HitResult);
	bool IsHitWeakChangeDefaultEffectInterface();
	bool IsSuperArmorInterface();
	bool RestartBehaviorTree(bool bTickEnable);
	bool SetActorAllTickEnabled(bool bEnabled);
	bool SetBehaviorTreeTickEnable(bool bEnable);
	bool SetCounterInterface();
	bool SetHiddenCharacterAttachment(bool NewHidden);
	void SetInfinityCrashChance(bool bEnable);
	void SetInvalidDamageInterface(bool bInvalidDamage, class FName ClaimantName, int32 Param);
	void SetNoCrashChanceByUseGuts(bool bEnable);
	void SetNoCrashChanceEvent(bool NoCrashChanceEvent);
	void SetNoDeadEvent(bool NoDeadEvent);
	bool SetRareSpawnEnemyHpRateCPP(float HpRate, class AActor* RareSpawnEnemy);
	void SetUseGuts(bool bUse);
	bool ShakeCameraInDamageInterface(const struct FHCHitResult& HitResult);
	bool StopBehaviorTree(bool bTickDisable);
	bool SufferDamageAfterInterface(const struct FHCHitResult& HitResult, int32 Damage, int32 TakedDamage);
	bool SufferDamageBeforeInterface(const struct FHCHitResult& HitResult, int32 Damage);
	bool VibrationControllerInDamageInterface(const struct FHCHitResult& HitResult);

	bool CheckRareSpawnHpRateCPP() const;
	EAssassinAttackHit GetAssasinAttackHitType() const;
	int32 GetCharaKind() const;
	struct FVector GetWeakTargetPointInterface(const struct FVector& AttackerPos) const;
	bool IsAbsoluteVisibilityTrace() const;
	bool IsAttackerTargetSelf(const struct FHCHitResult& HitResult) const;
	bool IsAttractSelfInterface() const;
	bool IsCrashMaxWithGuts() const;
	bool IsDeadBrainCrashOnly() const;
	bool IsDeadChaseAttackOnly() const;
	bool IsDeadLaunchAttackOnly() const;
	bool IsDeadPhysicsAttackOnly() const;
	bool IsDeadPsychicObjComboOnly() const;
	bool IsDeadPsychicObjOnly() const;
	bool IsEnableReactionCoefficientInterface(float* OutReactionSRate, float* OutReactionLRate, float* OutDownRate, float* OutCrashRate, bool* OutAcceptAll) const;
	bool IsEventCondition() const;
	bool IsInfinityCrashChance() const;
	bool IsNoCrashChanceByUseGuts() const;
	bool IsNoCrashChanceEvent() const;
	bool IsNoDeadEvent() const;
	bool IsNoDeadTutorial() const;
	bool IsNotAbleBrainCrashTarget() const;
	bool IsRareSpawnEnemy() const;
	bool IsUniqueNoDead() const;
	bool IsUseGuts() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattleCharacterInterface">();
	}
	static class IBattleCharacterInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IBattleCharacterInterface>();
	}
};
static_assert(alignof(IBattleCharacterInterface) == 0x000008, "Wrong alignment on IBattleCharacterInterface");
static_assert(sizeof(IBattleCharacterInterface) == 0x000028, "Wrong size on IBattleCharacterInterface");

// Class BattlePrototype.REDUserTextWidget
// 0x0018 (0x0248 - 0x0230)
class UREDUserTextWidget : public UUserWidget
{
public:
	uint8                                         Pad_1C0C[0x18];                                    // 0x0230(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ApplyTextFormatFromBase(int32 StringIndex);
	void ChangeFont(int32 StringIndex, class UObject* Font);
	void ChangeRubyProperty(int32 StringIndex, float RubySizeRate, float RubyAdjustY);
	void ClearString(int32 StringIndex);
	void Destroy(int32 StringIndex);
	float GetGeometryScale();
	void GetTextRect(int32 StringIndex, struct FVector4* Rect);
	void GetTextRectLight(int32 StringIndex, struct FVector4* Rect);
	void InitializeString(int32 StringIndex, class UTextBlock* baseTextBlock, int32 TextBlockNum, class UImage* baseIconFont, int32 IconFontNum, bool IsUseRuby);
	void InitializeStringForKeyGuide(int32 StringIndex, int32 GuideNum, class UTextBlock* baseTextBlock, class UImage* baseIconFont);
	void MoveAll(int32 StringIndex, float FMoveX, float FMoveY);
	void ResetString();
	void SetApplyGeometryScale(bool IsApply);
	void SetString(int32 StringIndex, const class FString& String, bool bIsAnalyzeTag);
	void SetStringSlotVersion(int32 StringIndex, const class FString& String);

	class UTextBlock* GetBaseTextBlock(int32 StringIndex) const;
	struct FVector2D GetDefaultViewportSize() const;
	class UWidget* GetRootWidget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"REDUserTextWidget">();
	}
	static class UREDUserTextWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UREDUserTextWidget>();
	}
};
static_assert(alignof(UREDUserTextWidget) == 0x000008, "Wrong alignment on UREDUserTextWidget");
static_assert(sizeof(UREDUserTextWidget) == 0x000248, "Wrong size on UREDUserTextWidget");

// Class BattlePrototype.UIBase
// 0x0140 (0x0388 - 0x0248)
class UUIBase : public UREDUserTextWidget
{
public:
	bool                                          FlagPlay;                                          // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FlagMouse;                                         // 0x0249(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C17[0x2];                                     // 0x024A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRedMouseArgument                      MouseCallArgument;                                 // 0x024C(0x000C)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector2D                              MouseHitOffsetPos;                                 // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              MouseHitOffsetSize;                                // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EUIMouseHitType                               MouseHitType;                                      // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          DebugMouseHitDisp;                                 // 0x0269(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C18[0x6];                                     // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             M_BaseFocusMouse;                                  // 0x0270(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, InstancedReference, BlueprintAssignable, Protected, BlueprintCallable, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             M_BaseUnFocusMouse;                                // 0x0280(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, InstancedReference, BlueprintAssignable, Protected, BlueprintCallable, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             M_BaseDownMouse;                                   // 0x0290(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, InstancedReference, BlueprintAssignable, Protected, BlueprintCallable, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C19[0x1];                                     // 0x02A0(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          FlagRemove;                                        // 0x02A1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          FlagNotRemoveHud;                                  // 0x02A2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C1A[0x1];                                     // 0x02A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentState;                                      // 0x02A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NextState;                                         // 0x02A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentSubState;                                   // 0x02AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NextSubState;                                      // 0x02B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C1B[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidgetAnimation*>               AnimationList;                                     // 0x02B8(0x0010)(BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         PlayIndex;                                         // 0x02C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EUIViewPrio                                   ViewPortPrio;                                      // 0x02CC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C1C[0x3];                                     // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIChromaticAberration*                 ChromaticAberration;                               // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UWidget*>                        CA_WorkObject;                                     // 0x02D8(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UUIChromaticAberration*>         ListChromaticAberration;                           // 0x02E8(0x0010)(BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UREDRetainerBox*>                ListControlRetainerBox;                            // 0x02F8(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         StateControlRetainerBox;                           // 0x0308(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C1D[0x4];                                     // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            ControlWidget;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESlateVisibility                              LocalVisibility;                                   // 0x0318(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C1E[0x3];                                     // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InputLevel;                                        // 0x031C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BaseScrollSpeed;                                   // 0x0320(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C1F[0x1C];                                    // 0x0324(0x001C)(Fixing Size After Last Property [ Dumper-7 ])
	class UREDebugLines*                          M_DebugDraw;                                       // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGeometry                              M_MyGeometry;                                      // 0x0348(0x0038)(IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C20[0x8];                                     // 0x0380(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddToSetViewPortPrio(EUIViewPrio Viewprio);
	void AddViewPortPrio();
	void ChangeState(int32 NewState);
	void ChangeStateAllDirect(int32 NewState, int32 NewSubState);
	void ChangeStateDirect(int32 NewState);
	void ChangeSubState(int32 NewSubState);
	bool CheckAnyInput();
	bool CheckCircle();
	bool CheckCircleCore(const struct FVector2D& Position);
	bool CheckEqualName(const class FString& BaseString, const class FString& CheckString);
	void CheckInput(EUIInputButton KeyType, EUIInputType InputType, bool* IsInput);
	bool CheckRectangle();
	bool CheckRectangleCore(const struct FVector2D& Position);
	void Close();
	void CloseDirect();
	void DebugDrawLastAnimation(float DeltaSecond);
	void DebugDrawPlayingAnimation(float DeltaSecond);
	struct FVector2D GetAbsolutePosition();
	void GetAbsoluteScreenOfffset(const struct FVector2D& baseOffset, struct FVector2D* CalcOffset);
	struct FVector2D GetAbsoluteSize();
	void GetIconLimitLU(struct FVector2D* LimitPosition);
	void GetIconLimitRD(struct FVector2D* LimitPosition);
	class FText GetMenuCommonMessage(class UDatabaseManager* PDatabaseManager, class FName Param_Name);
	void GetScreenOffset(const struct FVector2D& baseOffset, struct FVector2D* CalcOffset);
	void GetScreenOffsetReverse(const struct FVector2D& baseOffset, struct FVector2D* CalcOffset);
	void GetViewportOffset(const struct FVector2D& AbsolutePosition, struct FVector2D* CalcOffset);
	void InitChromaticAberration();
	void InitControlRetainerBox();
	bool IsLoopSE(class FName LoopSeName);
	void Open();
	void OpenDirect();
	void PlayLoopSe(EUI_SE SeType, class FName LoopSeName);
	class URSAtomComponentBase* PlaySE(EUI_SE SeType);
	class URSAtomComponentBase* PlaySEAtLocation(EUI_SE SeType, const struct FVector& Location);
	void PlayUIAnimation(int32 Param_Index, float Speed, bool IsLoop);
	void ProjectWorldToScreen2(const struct FVector& WorldPosition, struct FVector2D* ScreenPosition);
	void RedWidgetDown__DelegateSignature(const struct FRedMouseArgument& Argument, class UUserWidget* PWidget);
	void RedWidgetFocus__DelegateSignature(const struct FRedMouseArgument& Argument, class UUserWidget* PWidget);
	void RedWidgetUnFocus__DelegateSignature(const struct FRedMouseArgument& Argument, class UUserWidget* PWidget);
	void RemoveFromParentRED();
	void SearchControlRetainerBox(class UWidget* Widget);
	void SetAnimation(int32 Param_Index, class UWidgetAnimation* Animation);
	void SetAnimationNum(int32 Num);
	void SetControlWidget(class UUserWidget* Widget);
	void SetDebugInvisible(bool IsInvisible);
	void SetFlagUpdateAlways(bool Flag);
	void SetImageFromSprite(class UImage* Image, class UPaperSprite* Sprite);
	void SetInputLevel(int32 Param_InputLevel);
	void SetMouseDisable(bool Flag);
	void SetMouseMode(bool Mousemode, int32 Param_InputLevel);
	void SetUIAnimationFrame(int32 Param_Index, float Time);
	void SetupChromaticAberrationImage(class UPanelWidget* Base);
	void SetupChromaticAberrationRetainerBox(class UPanelWidget* Base);
	void SetViewPortPrio(EUIViewPrio Viewprio);
	void SetVisible(ESlateVisibility Visiblity);
	void StopLoopSe(class FName LoopSeName);
	void StopUIAllAnimation();
	void StopUIAnimation(int32 Param_Index);
	void StopUICurrentAnimation();
	void Update(float InDeltaTime);
	void UpdateChromaticAberration();
	void UpdateControlRetainerBox();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void UpdateVisible();

	void GetAnimation(int32 Param_Index, class UWidgetAnimation** Animation) const;
	void GetCurrentState(int32* State) const;
	void GetFlagUpdateAlways(bool* Flag) const;
	void GetInputLevel(int32* Param_InputLevel) const;
	bool GetMouseDisable() const;
	void GetUICurrentAnimationIndex(int32* Param_Index) const;
	class FString IntToString(int32 Value, int32 MinLength, int32 MaxLength) const;
	void IsPlaying(bool* Param_IsPlaying) const;
	void IsPlayUIAnimation(int32 Param_Index, bool* IsPlay) const;
	void IsPlayUIAnyAnimation(bool* IsPlay) const;
	void IsPlayUICurrentAnimation(bool* IsPlay) const;
	void IsStatePlay(bool* IsPlay) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIBase">();
	}
	static class UUIBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIBase>();
	}
};
static_assert(alignof(UUIBase) == 0x000008, "Wrong alignment on UUIBase");
static_assert(sizeof(UUIBase) == 0x000388, "Wrong size on UUIBase");
static_assert(offsetof(UUIBase, FlagPlay) == 0x000248, "Member 'UUIBase::FlagPlay' has a wrong offset!");
static_assert(offsetof(UUIBase, FlagMouse) == 0x000249, "Member 'UUIBase::FlagMouse' has a wrong offset!");
static_assert(offsetof(UUIBase, MouseCallArgument) == 0x00024C, "Member 'UUIBase::MouseCallArgument' has a wrong offset!");
static_assert(offsetof(UUIBase, MouseHitOffsetPos) == 0x000258, "Member 'UUIBase::MouseHitOffsetPos' has a wrong offset!");
static_assert(offsetof(UUIBase, MouseHitOffsetSize) == 0x000260, "Member 'UUIBase::MouseHitOffsetSize' has a wrong offset!");
static_assert(offsetof(UUIBase, MouseHitType) == 0x000268, "Member 'UUIBase::MouseHitType' has a wrong offset!");
static_assert(offsetof(UUIBase, DebugMouseHitDisp) == 0x000269, "Member 'UUIBase::DebugMouseHitDisp' has a wrong offset!");
static_assert(offsetof(UUIBase, M_BaseFocusMouse) == 0x000270, "Member 'UUIBase::M_BaseFocusMouse' has a wrong offset!");
static_assert(offsetof(UUIBase, M_BaseUnFocusMouse) == 0x000280, "Member 'UUIBase::M_BaseUnFocusMouse' has a wrong offset!");
static_assert(offsetof(UUIBase, M_BaseDownMouse) == 0x000290, "Member 'UUIBase::M_BaseDownMouse' has a wrong offset!");
static_assert(offsetof(UUIBase, FlagRemove) == 0x0002A1, "Member 'UUIBase::FlagRemove' has a wrong offset!");
static_assert(offsetof(UUIBase, FlagNotRemoveHud) == 0x0002A2, "Member 'UUIBase::FlagNotRemoveHud' has a wrong offset!");
static_assert(offsetof(UUIBase, CurrentState) == 0x0002A4, "Member 'UUIBase::CurrentState' has a wrong offset!");
static_assert(offsetof(UUIBase, NextState) == 0x0002A8, "Member 'UUIBase::NextState' has a wrong offset!");
static_assert(offsetof(UUIBase, CurrentSubState) == 0x0002AC, "Member 'UUIBase::CurrentSubState' has a wrong offset!");
static_assert(offsetof(UUIBase, NextSubState) == 0x0002B0, "Member 'UUIBase::NextSubState' has a wrong offset!");
static_assert(offsetof(UUIBase, AnimationList) == 0x0002B8, "Member 'UUIBase::AnimationList' has a wrong offset!");
static_assert(offsetof(UUIBase, PlayIndex) == 0x0002C8, "Member 'UUIBase::PlayIndex' has a wrong offset!");
static_assert(offsetof(UUIBase, ViewPortPrio) == 0x0002CC, "Member 'UUIBase::ViewPortPrio' has a wrong offset!");
static_assert(offsetof(UUIBase, ChromaticAberration) == 0x0002D0, "Member 'UUIBase::ChromaticAberration' has a wrong offset!");
static_assert(offsetof(UUIBase, CA_WorkObject) == 0x0002D8, "Member 'UUIBase::CA_WorkObject' has a wrong offset!");
static_assert(offsetof(UUIBase, ListChromaticAberration) == 0x0002E8, "Member 'UUIBase::ListChromaticAberration' has a wrong offset!");
static_assert(offsetof(UUIBase, ListControlRetainerBox) == 0x0002F8, "Member 'UUIBase::ListControlRetainerBox' has a wrong offset!");
static_assert(offsetof(UUIBase, StateControlRetainerBox) == 0x000308, "Member 'UUIBase::StateControlRetainerBox' has a wrong offset!");
static_assert(offsetof(UUIBase, ControlWidget) == 0x000310, "Member 'UUIBase::ControlWidget' has a wrong offset!");
static_assert(offsetof(UUIBase, LocalVisibility) == 0x000318, "Member 'UUIBase::LocalVisibility' has a wrong offset!");
static_assert(offsetof(UUIBase, InputLevel) == 0x00031C, "Member 'UUIBase::InputLevel' has a wrong offset!");
static_assert(offsetof(UUIBase, BaseScrollSpeed) == 0x000320, "Member 'UUIBase::BaseScrollSpeed' has a wrong offset!");
static_assert(offsetof(UUIBase, M_DebugDraw) == 0x000340, "Member 'UUIBase::M_DebugDraw' has a wrong offset!");
static_assert(offsetof(UUIBase, M_MyGeometry) == 0x000348, "Member 'UUIBase::M_MyGeometry' has a wrong offset!");

// Class BattlePrototype.UITargetBrain
// 0x0088 (0x0410 - 0x0388)
class UUITargetBrain : public UUIBase
{
public:
	uint8                                         Pad_1C31[0x88];                                    // 0x0388(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CloseThis();
	void Decide();
	void InitializeThis(class UWidgetAnimation* AnimDefaultNone, class UWidgetAnimation* AnimDefault, class UWidgetAnimation* AnimIn, class UWidgetAnimation* AnimOut, class UWidgetAnimation* AnimDecision, class UWidgetAnimation* AnimDefault2, class UWidgetAnimation* AnimIn2, class UWidgetAnimation* AnimOut2, class UWidgetAnimation* AnimChange1_2, class UWidgetAnimation* AnimChange2_1, class UBorder* borderButtonSet);
	void SetEnable(bool IsEnable);
	bool UpdateButton();
	void UpdateStateThis(int32 State, int32 SubState, float DeltaSeconds);

	bool IsEnableDecide() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UITargetBrain">();
	}
	static class UUITargetBrain* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUITargetBrain>();
	}
};
static_assert(alignof(UUITargetBrain) == 0x000008, "Wrong alignment on UUITargetBrain");
static_assert(sizeof(UUITargetBrain) == 0x000410, "Wrong size on UUITargetBrain");

// Class BattlePrototype.BP_SM_MapModel_Base
// 0x00A8 (0x02E8 - 0x0240)
class ABP_SM_MapModel_Base : public AStaticMeshActor
{
public:
	bool                                          IsDetaileMap;                                      // 0x0240(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsScale;                                           // 0x0241(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C32[0x2];                                     // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Playerrate;                                        // 0x0244(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinimapGradationValue;                             // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MapIconScaleRate;                                  // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MapIconDetail_ZOffset;                             // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinimapOnlyIconGradationValue;                     // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          MinimapOnlyIconGradationValueFlag;                 // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C33[0x7];                                     // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               M_MaterialDynamicMinimap;                          // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               M_MaterialDynamicDetail;                           // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UStaticMeshComponent*>           M_SubMapData;                                      // 0x0270(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C34[0x8];                                     // 0x0280(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FUIMapFloorAdjustData>          PGAdjuster;                                        // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          M_pgAdjusterFlag;                                  // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C35[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 PgHeightData;                                      // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          M_pgIconHeightFlag;                                // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          M_isCenterOffsetProc;                              // 0x02B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C36[0x6];                                     // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FUIDetaileMapSubAreaCenterPosition> M_AreaCenterPos;                                   // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          M_FloorWidthDataCheck;                             // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C37[0x3];                                     // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         M_FloorWidthIndex;                                 // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<float>                                 M_FloorWidthData;                                  // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C38[0x8];                                     // 0x02E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CalcMaterialUpDateParam(float RateHeight, float Width);
	struct FVector GetAreaCenterPos();
	TArray<struct FUIDetaileMapSubAreaCenterPosition> GetAreaCenterPosArray();
	class UCapsuleComponent* GetCollisitonData();
	float GetDirectionRotate();
	TArray<struct FUIDetaileMapFloorData> GetFloorData();
	int32 GetFloorIndextoGameWidth();
	float GetFloorIndextoGameWidthData(int32 Floorindex);
	bool GetFloorIndextoGameWidthFlag();
	int32 GetFloorIndextoGameWidthNum();
	TArray<struct FUIMapFloorAdjustData> GetFloorPGAdjuster();
	float GetMapIconDetail_ZOffset();
	float GetMapIconScaleRate();
	float GetMinimapGradationValue();
	float GetMinimapOnlyIconGradationValue();
	TArray<float> GetPgIconHeightFlag();
	float GetZoomMax();
	float GetZoomMin();
	bool IsAdjusterFlag();
	bool IsBrainField();
	bool IsCenterOffsetProc();
	bool IsMinimapOnlyIconGradationValue();
	bool IsPgIconHeightFlag();
	bool IsVisionSimulator();
	bool MaterialUpdate();
	void SetBrainField(bool Flag);
	void SetDetaileMap(bool DetaileMap);
	bool SetFloorIndex(int32 Floorindex);
	void SetFloorIndextoGame(int32 Floorindex);
	void SetFloorPGAdjuster(const TArray<struct FUIMapFloorAdjustData>& Update);
	void SetGradationValue(float Gradation);
	void SetPersSwitch(bool Pers);
	void SetPlayerRate(float Param_Playerrate);
	void SetScale(bool Scale);
	void SetSubModelVisible(class FName SubName, bool Flag);
	void SetVisionSimulator(bool Flag);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BP_SM_MapModel_Base">();
	}
	static class ABP_SM_MapModel_Base* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SM_MapModel_Base>();
	}
};
static_assert(alignof(ABP_SM_MapModel_Base) == 0x000008, "Wrong alignment on ABP_SM_MapModel_Base");
static_assert(sizeof(ABP_SM_MapModel_Base) == 0x0002E8, "Wrong size on ABP_SM_MapModel_Base");
static_assert(offsetof(ABP_SM_MapModel_Base, IsDetaileMap) == 0x000240, "Member 'ABP_SM_MapModel_Base::IsDetaileMap' has a wrong offset!");
static_assert(offsetof(ABP_SM_MapModel_Base, IsScale) == 0x000241, "Member 'ABP_SM_MapModel_Base::IsScale' has a wrong offset!");
static_assert(offsetof(ABP_SM_MapModel_Base, Playerrate) == 0x000244, "Member 'ABP_SM_MapModel_Base::Playerrate' has a wrong offset!");
static_assert(offsetof(ABP_SM_MapModel_Base, MinimapGradationValue) == 0x000248, "Member 'ABP_SM_MapModel_Base::MinimapGradationValue' has a wrong offset!");
static_assert(offsetof(ABP_SM_MapModel_Base, MapIconScaleRate) == 0x00024C, "Member 'ABP_SM_MapModel_Base::MapIconScaleRate' has a wrong offset!");
static_assert(offsetof(ABP_SM_MapModel_Base, MapIconDetail_ZOffset) == 0x000250, "Member 'ABP_SM_MapModel_Base::MapIconDetail_ZOffset' has a wrong offset!");
static_assert(offsetof(ABP_SM_MapModel_Base, MinimapOnlyIconGradationValue) == 0x000254, "Member 'ABP_SM_MapModel_Base::MinimapOnlyIconGradationValue' has a wrong offset!");
static_assert(offsetof(ABP_SM_MapModel_Base, MinimapOnlyIconGradationValueFlag) == 0x000258, "Member 'ABP_SM_MapModel_Base::MinimapOnlyIconGradationValueFlag' has a wrong offset!");
static_assert(offsetof(ABP_SM_MapModel_Base, M_MaterialDynamicMinimap) == 0x000260, "Member 'ABP_SM_MapModel_Base::M_MaterialDynamicMinimap' has a wrong offset!");
static_assert(offsetof(ABP_SM_MapModel_Base, M_MaterialDynamicDetail) == 0x000268, "Member 'ABP_SM_MapModel_Base::M_MaterialDynamicDetail' has a wrong offset!");
static_assert(offsetof(ABP_SM_MapModel_Base, M_SubMapData) == 0x000270, "Member 'ABP_SM_MapModel_Base::M_SubMapData' has a wrong offset!");
static_assert(offsetof(ABP_SM_MapModel_Base, PGAdjuster) == 0x000288, "Member 'ABP_SM_MapModel_Base::PGAdjuster' has a wrong offset!");
static_assert(offsetof(ABP_SM_MapModel_Base, M_pgAdjusterFlag) == 0x000298, "Member 'ABP_SM_MapModel_Base::M_pgAdjusterFlag' has a wrong offset!");
static_assert(offsetof(ABP_SM_MapModel_Base, PgHeightData) == 0x0002A0, "Member 'ABP_SM_MapModel_Base::PgHeightData' has a wrong offset!");
static_assert(offsetof(ABP_SM_MapModel_Base, M_pgIconHeightFlag) == 0x0002B0, "Member 'ABP_SM_MapModel_Base::M_pgIconHeightFlag' has a wrong offset!");
static_assert(offsetof(ABP_SM_MapModel_Base, M_isCenterOffsetProc) == 0x0002B1, "Member 'ABP_SM_MapModel_Base::M_isCenterOffsetProc' has a wrong offset!");
static_assert(offsetof(ABP_SM_MapModel_Base, M_AreaCenterPos) == 0x0002B8, "Member 'ABP_SM_MapModel_Base::M_AreaCenterPos' has a wrong offset!");
static_assert(offsetof(ABP_SM_MapModel_Base, M_FloorWidthDataCheck) == 0x0002C8, "Member 'ABP_SM_MapModel_Base::M_FloorWidthDataCheck' has a wrong offset!");
static_assert(offsetof(ABP_SM_MapModel_Base, M_FloorWidthIndex) == 0x0002CC, "Member 'ABP_SM_MapModel_Base::M_FloorWidthIndex' has a wrong offset!");
static_assert(offsetof(ABP_SM_MapModel_Base, M_FloorWidthData) == 0x0002D0, "Member 'ABP_SM_MapModel_Base::M_FloorWidthData' has a wrong offset!");

// Class BattlePrototype.BattleEnemyInterface
// 0x0000 (0x0028 - 0x0028)
class IBattleEnemyInterface final : public IInterface
{
public:
	bool BrainCrashLock_Native();
	bool CallDead_Native();
	bool CallFuncDamageDownEnd_Native();
	bool CallFuncDamageDownLoop_Native();
	bool CallFuncDamageDownStart_Native();
	bool CameraAttentionEnd_Native(class UCurveFloat* FovCurveOut);
	bool CheckNpcDrive_Native(ENpcDriveCheckType CheckType, class AActor* EnemyActor);
	bool CheckSASHologramAttack_Native(ESASHologramAttackTiming Timing, class ARSCharacterBase* RequestCharacter);
	bool DamageFloatEnd_Native();
	bool DamageMotionEnd_Native(float DeltaTime);
	bool DeadStart_Native();
	bool DisableFitGroundTmp_Native();
	bool DropFlyingEnemy_Native(class AActor* Enemy);
	bool EnableAllWeak_Native(bool bEnable);
	bool EnableFitGroundTmp_Native();
	bool EndDamageFloating_Native();
	bool EnemyEndEvDitherNative(bool bDisp);
	bool EnemyStartEvDitherNative(bool bDisp, float DitherTime);
	bool EnemyUpdateEvDitherNative(float DeltaSec);
	bool EntryBrainCrashAccess_Native(class ARSCharacterBase* Character);
	void FlyDown_Native(bool* IsEnd);
	void GetCurrentActionTime_Native(float* ActionTime);
	EEnemyTribe GetEnemyTribe();
	bool GetFailedFall_Native();
	bool GetFall_Native();
	void GetHitObjectType_Native(TArray<EObjectTypeQuery>* ObjectType);
	void GetLostData_Native(float* LostMoveTimeMin, float* LostMoveTimeMax, float* LostMoveRotationRate, float* SpeedScale, bool* IsNoMoveAnim);
	class USearchingComponent* GetSearchingComponent_Native();
	void IsBrainCrashMiss_Native(bool* IsMiss);
	bool IsCheckLookScrollTick(const struct FVector& Start, const struct FVector& End);
	bool IsCheckSameCompareGroundLoaction();
	bool IsEnemyDamageDown_CallFromCPP();
	void IsEnemyLandingCheck_Native(bool* bHit);
	bool IsEnemyStateAttack_CallFromCPP();
	bool IsFlyEnemyCheck_Native();
	void IsIgnoreLandingCheck_Native(bool* bIgnoreLandingCheck);
	void IsMotionEnd_Native(bool* ReturnValue);
	bool IsPossibleTargetAttack_CallFromCPP(class AActor* Actor);
	bool KickCrashChanceLoopEffect_Native();
	void LaunchDown_Native(bool* IsEnd);
	bool LeaveBrainCrashAccess_Native(class ARSCharacterBase* Character);
	bool OnCrashVisionDead();
	void OnEndAnimDieIF(bool* bDummy);
	bool OnEndCrashChance_Native();
	void OnHitCrashVisionAttack();
	bool OnNotifyPlayerDead();
	bool OutputLogCrashChanceEnd_Native();
	void ReceivedNotifyAnimEnd_Native(bool* Received);
	bool ResetAction_Native();
	bool ResetCore_Native(class AActor* Enemy, bool RemoveCore);
	bool ResetStateReceivedExecuteAi_Native();
	bool RestoreWeakEmissive_Native(const class FString& WeakSlotName);
	bool RestoreWeakState_Native();
	bool SafeDestroy_Native(class AActor* Actor);
	bool SetDamageCollisionDisable_Native(const class FName& ClaimantName);
	bool SetDownTimer_Native(float NewTime);
	bool SetEnemyConsiderDownDead(bool bEnable);
	bool SetHp_Native(int32 HP);
	bool SetIdleMove_Native(bool IsIdle);
	bool SetIsBrainAccess_Native(bool NewIsBrainAccess);
	bool SetIsLandCheck_Native(bool NewIsLandCheck);
	bool SetIsLaunchDown_Native(bool NewIsLaunchDown);
	bool SetIsMoveAnim_Native(bool NewIsMoveAnim);
	bool SetLanding_Native(bool bLanding);
	bool SetReserveAction_Native(uint8 Action, float Param00, float Param01);
	bool SetTickEnableMeshOnly(bool bMeshOnly);
	bool SetUseWaitNoInterpolation_Native(bool Use);
	bool SetWeakEmissiveOff_Native(const class FString& WeakSlotName);
	bool StartDamageFloating_Native();
	void StartFallIfFlyingIF(bool* bDummy);
	bool StartReactionDilation_CallFromCPP(uint8 ReactionKind, bool bAddDamage);
	bool StartVanish_Native(float VanishSec, float StartVanish, float EndVanish);
	bool StopCrashChanceLoopEffect_Native();
	bool StoreWeakState_Native();
	bool SwitchDispCore_Native(bool DisplayOn);
	void UpdateDamageAnim_Native(bool* DamageEnd, bool* DamageDownEnd);
	bool UpdateFall_Native();
	bool UpdateMoveMaxSpeed();
	void UpdateOutRangeFade_Native(float ToTargetLenge, bool ForceDisp);

	class UCapsuleComponent* GetCapsuleComponent_Native() const;
	class AActor* GetCurrentTarget() const;
	struct FVector GetDamageHitDirectionIF() const;
	bool GetDebugEnemyDownInfinity_Native() const;
	float GetDownTimer_Native() const;
	EnemyMoveAnimKind GetDownUpMoveAnimKind_Native() const;
	class UEnemyAiComponentBase* GetEnemyAiComponent() const;
	class UEnemyAnimControllerComponent* GetEnemyAnimControllerComponent() const;
	class UEnemyScriptComponent* GetEnemyScriptComponent() const;
	class UHateTargetComponent* GetHateTarget_Native() const;
	bool GetIsJumpEnd() const;
	bool GetIsLandCheck() const;
	void GetLostActionInfoList_Native(TArray<struct FEmLostActionInfo>* LostActionInfo) const;
	bool GetNewDamageFloating_Native() const;
	bool GetPressDownLoop_Native() const;
	class AActor* GetTargetCharacter_Native() const;
	struct FVector GetTopHeightLocation() const;
	float GetUniqueTickEnableRange() const;
	bool IsBossEnemy_CallFromCPP() const;
	bool IsBrainSuccess_Native() const;
	bool IsCheckHeightChangeTick() const;
	bool IsCheckLookTargetTick(const struct FVector& Start, const struct FVector& End) const;
	bool IsDamageMotionEnd_Native() const;
	bool IsDisableDownMotionInterface() const;
	bool IsDisableUroAction_Interface() const;
	bool IsEnemyConsiderDownDead() const;
	bool IsEnemyFalling_Interface() const;
	bool IsEnemySpawn_Interface() const;
	bool IsExecLowProcess() const;
	bool IsInvincible_Native() const;
	bool IsLaunchDown_Native() const;
	bool IsNotFindPlayer_CallFromCPP() const;
	bool IsPressDown_Native() const;
	bool IsReflectContainer() const;
	bool IsSpawned() const;
	bool IsSuspendFollowAttackInterface() const;
	bool IsTickDisableCondition() const;
	bool IsUniqueAroundEffectPause() const;
	bool IsUpdateEnemySpawn() const;
	bool IsUpdateEnemyTickEnable() const;
	bool IsWeakUiDamageHit_CallFromCPP() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattleEnemyInterface">();
	}
	static class IBattleEnemyInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IBattleEnemyInterface>();
	}
};
static_assert(alignof(IBattleEnemyInterface) == 0x000008, "Wrong alignment on IBattleEnemyInterface");
static_assert(sizeof(IBattleEnemyInterface) == 0x000028, "Wrong size on IBattleEnemyInterface");

// Class BattlePrototype.PhantomAnimInstance
// 0x0020 (0x0640 - 0x0620)
class UPhantomAnimInstance final : public UASAnimInstance
{
public:
	FMulticastInlineDelegateProperty_             DispatchMontageBlendingOut;                        // 0x0620(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             DispatchMontageEnded;                              // 0x0630(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void RecvOnMontageBlendingOut(class UAnimMontage* Montage, bool bInterrupted);
	void RecvOnMontageEnded(class UAnimMontage* Montage, bool bInterrupted);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhantomAnimInstance">();
	}
	static class UPhantomAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhantomAnimInstance>();
	}
};
static_assert(alignof(UPhantomAnimInstance) == 0x000010, "Wrong alignment on UPhantomAnimInstance");
static_assert(sizeof(UPhantomAnimInstance) == 0x000640, "Wrong size on UPhantomAnimInstance");
static_assert(offsetof(UPhantomAnimInstance, DispatchMontageBlendingOut) == 0x000620, "Member 'UPhantomAnimInstance::DispatchMontageBlendingOut' has a wrong offset!");
static_assert(offsetof(UPhantomAnimInstance, DispatchMontageEnded) == 0x000630, "Member 'UPhantomAnimInstance::DispatchMontageEnded' has a wrong offset!");

// Class BattlePrototype.BP_UI_SceneMap
// 0x0300 (0x0530 - 0x0230)
class alignas(0x10) ABP_UI_SceneMap : public AActor
{
public:
	struct FVector                                ObjectIconScale;                                   // 0x0230(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DebugCameraPers;                                   // 0x023C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C58[0x3];                                     // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ViewModeCameraLocation;                            // 0x0240(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                ViewModeViewLocation;                              // 0x024C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ViewModeZoom;                                      // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MapGradationValue;                                 // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MapHeightValue;                                    // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         M_FootPrintSpanNormal;                             // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         M_FootPrintSpanExtent;                             // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         M_FootPrintSpanMax;                                // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          M_FootPrintStop;                                   // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C59[0x3];                                     // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         M_CameraHeight;                                    // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         M_CameraOrthoWidth;                                // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         M_CameraRotatePitch;                               // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         M_RotateCamera;                                    // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         M_CameraRoll;                                      // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         M_CameraRollBase;                                  // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsScaleFlag;                                       // 0x028C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsCameraRotateFlag;                                // 0x028D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsDetailMap;                                       // 0x028E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          M_IsPerspective;                                   // 0x028F(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         M_AreaMax;                                         // 0x0290(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         M_FloorMax;                                        // 0x0294(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         M_CurrentFloor;                                    // 0x0298(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         M_CurrentArea;                                     // 0x029C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         M_CurrentLevel;                                    // 0x02A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentFloorPlayer;                                // 0x02A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentAreaPlayer;                                 // 0x02A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentFloorMain;                                  // 0x02AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentFloorSub;                                   // 0x02B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentFloorBonds;                                 // 0x02B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         M_CurrentIndex;                                    // 0x02B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         M_ChapterNo;                                       // 0x02BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         M_ProgressNo;                                      // 0x02C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C5A[0x4];                                     // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FUIDetaileMapFloorData>         M_FloorData;                                       // 0x02C8(0x0010)(BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TDelegate<void(int32 Floor)>                  M_OnMinimapChangeFloor;                            // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UMaterialInterface*>             M_MaterialIconArray;                               // 0x02E8(0x0010)(BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMaterialInstanceDynamic*>       M_MaterialDynamicIconArray;                        // 0x02F8(0x0010)(BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         M_minimapDistanceSquareEnemy;                      // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C5B[0x4];                                     // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SM_MapModel_Base*                   M_SM_MapModel_Base;                                // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UStaticMeshComponent*>           M_MeshList;                                        // 0x0318(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FUIDetaileMapCheckData                 M_DetailMapData;                                   // 0x0328(0x0028)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C5C[0x30];                                    // 0x0350(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 M_AsyncLineActor;                                  // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C5D[0xC8];                                    // 0x0388(0x00C8)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstance*                        Instance;                                          // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AEnemyManager*                          EnemyManager;                                      // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class APlayerCameraManager*                   CameraManager;                                     // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AEventManager*                          EventManager;                                      // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneCaptureComponent2D*               CaptureCamera;                                     // 0x0470(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class APawn*                                  M_player;                                          // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInstancedStaticMeshComponent*          ObjectInstancedMesh;                               // 0x0480(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInstancedStaticMeshComponent*          NpcPlInstancedMesh;                                // 0x0488(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInstancedStaticMeshComponent*          EnemyInstancedMeshNormal;                          // 0x0490(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInstancedStaticMeshComponent*          EnemyInstancedMesh0630;                            // 0x0498(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInstancedStaticMeshComponent*          FootInstancedMesh;                                 // 0x04A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInstancedStaticMeshComponent*          MainQuestInstancedMesh;                            // 0x04A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInstancedStaticMeshComponent*          SubQuestActiveInstancedMesh;                       // 0x04B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInstancedStaticMeshComponent*          SubQuestCompActiveInstancedMesh;                   // 0x04B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInstancedStaticMeshComponent*          BoudsQuestInstancedMesh;                           // 0x04C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class APsychicObjectManager*                  PsychicObjectManager;                              // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class APlayerManager*                         PlayerManager;                                     // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class ARSCharacterBase>> PlayerCharacterList;                               // 0x04D8(0x0010)(ZeroConstructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class ARSCharacterBase*>               M_EnemyList;                                       // 0x04E8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FTransform>                     M_PlPosDataListNormal;                             // 0x04F8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FTransform>                     M_PlPosDataListExtent;                             // 0x0508(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ARSHUDBase*                             M_pHudBase;                                        // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
