#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_0000_EventTips_Base

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "FEventTriggerCommand_structs.hpp"


namespace SDK::Params
{

// Function BP_0000_EventTips_Base.BP_0000_EventTips_Base_C.ExecuteUbergraph_BP_0000_EventTips_Base
// 0x0398 (0x0398 - 0x0000)
struct BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     CallFunc_GetPlayerCharaID_ReturnPlayerID;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8894[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadMakeEventActorClassFromPath_AsMake_Event_Actor; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8895[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFEventTriggerCommand                  K2Node_MakeStruct_FEventTriggerCommand;            // 0x0020(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8896[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_AddEventTriggerCommand_self_CastInput;    // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8897[0x2];                                     // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8898[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_1;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8899[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFEventTriggerCommand                  K2Node_MakeStruct_FEventTriggerCommand_1;          // 0x00C0(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_AddEventTriggerCommand_self_CastInput_1;  // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_2;           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_889A[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadMakeEventActorClassFromPath_AsMake_Event_Actor_1; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFEventTriggerCommand                  K2Node_MakeStruct_FEventTriggerCommand_2;          // 0x0150(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_AddEventTriggerCommand_self_CastInput_2;  // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_3;           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_889B[0x3];                                     // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainEventLatentActor*                  K2Node_Event_latenter;                             // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHelpTutorial                                 CallFunc_Array_Get_Item;                           // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_889C[0x2];                                     // 0x01E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue; // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHelpTutorial                                 CallFunc_Array_Get_Item_1;                         // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_889D[0x3];                                     // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_1; // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHelpTutorial                                 CallFunc_Array_Get_Item_2;                         // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_889E[0x3];                                     // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_2; // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHelpTutorial                                 CallFunc_Array_Get_Item_3;                         // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_889F[0x3];                                     // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_3; // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHelpTutorial                                 CallFunc_Array_Get_Item_4;                         // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88A0[0x3];                                     // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_4; // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue_1;            // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHelpTutorial                                 CallFunc_Array_Get_Item_5;                         // 0x020D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88A1[0x2];                                     // 0x020E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_5; // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHelpTutorial                                 CallFunc_Array_Get_Item_6;                         // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x021A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88A2[0x1];                                     // 0x021B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_6; // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHelpTutorial                                 CallFunc_Array_Get_Item_7;                         // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88A3[0x3];                                     // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_7; // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHelpTutorial                                 CallFunc_Array_Get_Item_8;                         // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88A4[0x3];                                     // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_8; // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainEventLatentActor*                  K2Node_Event_latenter_1;                           // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHelpTutorial                                 CallFunc_Array_Get_Item_9;                         // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88A5[0x3];                                     // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_9; // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHelpTutorial                                 CallFunc_Array_Get_Item_10;                        // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88A6[0x3];                                     // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_10; // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHelpTutorial                                 CallFunc_Array_Get_Item_11;                        // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     CallFunc_GetPlayerCharaID_ReturnPlayerID_1;        // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88A7[0x2];                                     // 0x024A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_11; // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EContentsOpening                              CallFunc_Array_Get_Item_12;                        // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88A8[0x2];                                     // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88A9[0x3];                                     // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AMainEventLatentActor* Latenter)> K2Node_CreateDelegate_OutputDelegate;              // 0x025C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_88AA[0x4];                                     // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88AB[0x7];                                     // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue_1;        // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88AC[0x3];                                     // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue_2;        // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_2;                   // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88AD[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue_3;        // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_3;                   // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x02CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88AE[0x3];                                     // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88AF[0x4];                                     // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFEventTriggerCommand                  K2Node_MakeStruct_FEventTriggerCommand_3;          // 0x02D8(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_AddEventTriggerCommand_self_CastInput_3;  // 0x0340(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEventInterface>       K2Node_DynamicCast_AsEvent_Interface;              // 0x0360(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EventEnd_ReturnValue;                     // 0x0372(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88B0[0x5];                                     // 0x0373(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame_1;             // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AMainEventLatentActor* Latenter)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0380(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base) == 0x000008, "Wrong alignment on BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base");
static_assert(sizeof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base) == 0x000398, "Wrong size on BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, EntryPoint) == 0x000000, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_GetPlayerCharaID_ReturnPlayerID) == 0x000004, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_GetPlayerCharaID_ReturnPlayerID' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_LoadMakeEventActorClassFromPath_AsMake_Event_Actor) == 0x000008, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_LoadMakeEventActorClassFromPath_AsMake_Event_Actor' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000014, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_GetEventManager_EventManager) == 0x000018, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, K2Node_MakeStruct_FEventTriggerCommand) == 0x000020, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::K2Node_MakeStruct_FEventTriggerCommand' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_AddEventTriggerCommand_self_CastInput) == 0x000090, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_AddEventTriggerCommand_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x0000A0, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_NotEqual_StrStr_ReturnValue) == 0x0000A1, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, Temp_int_Loop_Counter_Variable) == 0x0000A4, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_GetEventManager_EventManager_1) == 0x0000B0, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_GetEventManager_EventManager_1' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_IsValid_ReturnValue_1) == 0x0000B8, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, K2Node_MakeStruct_FEventTriggerCommand_1) == 0x0000C0, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::K2Node_MakeStruct_FEventTriggerCommand_1' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_AddEventTriggerCommand_self_CastInput_1) == 0x000128, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_AddEventTriggerCommand_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_GetEventManager_EventManager_2) == 0x000138, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_GetEventManager_EventManager_2' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_IsValid_ReturnValue_2) == 0x000140, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_LoadMakeEventActorClassFromPath_AsMake_Event_Actor_1) == 0x000148, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_LoadMakeEventActorClassFromPath_AsMake_Event_Actor_1' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, K2Node_MakeStruct_FEventTriggerCommand_2) == 0x000150, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::K2Node_MakeStruct_FEventTriggerCommand_2' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_AddEventTriggerCommand_self_CastInput_2) == 0x0001B8, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_AddEventTriggerCommand_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_GetEventManager_EventManager_3) == 0x0001C8, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_GetEventManager_EventManager_3' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, Temp_int_Array_Index_Variable) == 0x0001D0, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_IsValid_ReturnValue_3) == 0x0001D4, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, K2Node_Event_latenter) == 0x0001D8, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::K2Node_Event_latenter' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_Array_Length_ReturnValue_1) == 0x0001E0, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, K2Node_SwitchInteger_CmpSuccess) == 0x0001E4, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_Array_Get_Item) == 0x0001E5, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue) == 0x0001E8, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_Array_Get_Item_1) == 0x0001EC, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_1) == 0x0001F0, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_Array_Get_Item_2) == 0x0001F4, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_2) == 0x0001F8, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_Array_Get_Item_3) == 0x0001FC, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_3) == 0x000200, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_Array_Get_Item_4) == 0x000204, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_4) == 0x000208, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_NotEqual_StrStr_ReturnValue_1) == 0x00020C, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_NotEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_Array_Get_Item_5) == 0x00020D, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_Array_Length_ReturnValue_2) == 0x000210, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_5) == 0x000214, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, K2Node_SwitchInteger_CmpSuccess_1) == 0x000218, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_Array_Get_Item_6) == 0x000219, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x00021A, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_6) == 0x00021C, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_Array_Get_Item_7) == 0x000220, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_7) == 0x000224, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_Array_Get_Item_8) == 0x000228, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_Array_Get_Item_8' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_8) == 0x00022C, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, K2Node_Event_latenter_1) == 0x000230, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::K2Node_Event_latenter_1' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_Array_Get_Item_9) == 0x000238, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_Array_Get_Item_9' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_9) == 0x00023C, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_Array_Get_Item_10) == 0x000240, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_Array_Get_Item_10' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_10) == 0x000244, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_Array_Get_Item_11) == 0x000248, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_Array_Get_Item_11' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_GetPlayerCharaID_ReturnPlayerID_1) == 0x000249, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_GetPlayerCharaID_ReturnPlayerID_1' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_11) == 0x00024C, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, K2Node_SwitchEnum_CmpSuccess_1) == 0x000250, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_Array_Get_Item_12) == 0x000251, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_Array_Get_Item_12' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_Array_Length_ReturnValue_3) == 0x000254, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_Less_IntInt_ReturnValue) == 0x000258, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, K2Node_CreateDelegate_OutputDelegate) == 0x00025C, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_GetClassDisplayName_ReturnValue) == 0x000270, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_Contains_ReturnValue) == 0x000280, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_GetClassDisplayName_ReturnValue_1) == 0x000288, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_GetClassDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_BooleanAND_ReturnValue) == 0x000298, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_Contains_ReturnValue_1) == 0x000299, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_BooleanAND_ReturnValue_1) == 0x00029A, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_BooleanAND_ReturnValue_2) == 0x00029B, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_BooleanAND_ReturnValue_3) == 0x00029C, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_GetClassDisplayName_ReturnValue_2) == 0x0002A0, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_GetClassDisplayName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_Contains_ReturnValue_2) == 0x0002B0, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_GetClassDisplayName_ReturnValue_3) == 0x0002B8, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_GetClassDisplayName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_BooleanAND_ReturnValue_4) == 0x0002C8, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_Contains_ReturnValue_3) == 0x0002C9, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_Contains_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_BooleanAND_ReturnValue_5) == 0x0002CA, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_BooleanAND_ReturnValue_6) == 0x0002CB, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_BooleanAND_ReturnValue_7) == 0x0002CC, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_SelectInt_ReturnValue) == 0x0002D0, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, K2Node_MakeStruct_FEventTriggerCommand_3) == 0x0002D8, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::K2Node_MakeStruct_FEventTriggerCommand_3' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_AddEventTriggerCommand_self_CastInput_3) == 0x000340, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_AddEventTriggerCommand_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_GetPlayerPawn_ReturnValue) == 0x000350, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000358, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, K2Node_DynamicCast_AsEvent_Interface) == 0x000360, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::K2Node_DynamicCast_AsEvent_Interface' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, K2Node_DynamicCast_bSuccess) == 0x000370, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_IsValid_ReturnValue_4) == 0x000371, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_EventEnd_ReturnValue) == 0x000372, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_EventEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_GetHUDMainGame_HUDMainGame_1) == 0x000378, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_GetHUDMainGame_HUDMainGame_1' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, K2Node_CreateDelegate_OutputDelegate_1) == 0x000380, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base, CallFunc_IsValid_ReturnValue_5) == 0x000390, "Member 'BP_0000_EventTips_Base_C_ExecuteUbergraph_BP_0000_EventTips_Base::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");

// Function BP_0000_EventTips_Base.BP_0000_EventTips_Base_C.SubEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_0000_EventTips_Base_C_SubEvent final
{
public:
	class AMainEventLatentActor*                  Latenter;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_0000_EventTips_Base_C_SubEvent) == 0x000008, "Wrong alignment on BP_0000_EventTips_Base_C_SubEvent");
static_assert(sizeof(BP_0000_EventTips_Base_C_SubEvent) == 0x000008, "Wrong size on BP_0000_EventTips_Base_C_SubEvent");
static_assert(offsetof(BP_0000_EventTips_Base_C_SubEvent, Latenter) == 0x000000, "Member 'BP_0000_EventTips_Base_C_SubEvent::Latenter' has a wrong offset!");

// Function BP_0000_EventTips_Base.BP_0000_EventTips_Base_C.AfterSettingEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_0000_EventTips_Base_C_AfterSettingEvent final
{
public:
	class AMainEventLatentActor*                  Latenter;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_0000_EventTips_Base_C_AfterSettingEvent) == 0x000008, "Wrong alignment on BP_0000_EventTips_Base_C_AfterSettingEvent");
static_assert(sizeof(BP_0000_EventTips_Base_C_AfterSettingEvent) == 0x000008, "Wrong size on BP_0000_EventTips_Base_C_AfterSettingEvent");
static_assert(offsetof(BP_0000_EventTips_Base_C_AfterSettingEvent, Latenter) == 0x000000, "Member 'BP_0000_EventTips_Base_C_AfterSettingEvent::Latenter' has a wrong offset!");

// Function BP_0000_EventTips_Base.BP_0000_EventTips_Base_C.PlControl_AfterSettings
// 0x0048 (0x0048 - 0x0000)
struct BP_0000_EventTips_Base_C_PlControl_AfterSettings final
{
public:
	EPlayerID                                     CallFunc_GetPlayerCharaID_ReturnPlayerID;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88B1[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88B2[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_InputManager_C*                     CallFunc_GetInputManager_BP_InputManager;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue_1;        // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88B3[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_InputManager_C*                     CallFunc_GetInputManager_BP_InputManager_1;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_0000_EventTips_Base_C_PlControl_AfterSettings) == 0x000008, "Wrong alignment on BP_0000_EventTips_Base_C_PlControl_AfterSettings");
static_assert(sizeof(BP_0000_EventTips_Base_C_PlControl_AfterSettings) == 0x000048, "Wrong size on BP_0000_EventTips_Base_C_PlControl_AfterSettings");
static_assert(offsetof(BP_0000_EventTips_Base_C_PlControl_AfterSettings, CallFunc_GetPlayerCharaID_ReturnPlayerID) == 0x000000, "Member 'BP_0000_EventTips_Base_C_PlControl_AfterSettings::CallFunc_GetPlayerCharaID_ReturnPlayerID' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_PlControl_AfterSettings, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'BP_0000_EventTips_Base_C_PlControl_AfterSettings::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_PlControl_AfterSettings, CallFunc_GetClassDisplayName_ReturnValue) == 0x000008, "Member 'BP_0000_EventTips_Base_C_PlControl_AfterSettings::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_PlControl_AfterSettings, CallFunc_Contains_ReturnValue) == 0x000018, "Member 'BP_0000_EventTips_Base_C_PlControl_AfterSettings::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_PlControl_AfterSettings, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'BP_0000_EventTips_Base_C_PlControl_AfterSettings::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_PlControl_AfterSettings, CallFunc_GetInputManager_BP_InputManager) == 0x000020, "Member 'BP_0000_EventTips_Base_C_PlControl_AfterSettings::CallFunc_GetInputManager_BP_InputManager' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_PlControl_AfterSettings, CallFunc_GetClassDisplayName_ReturnValue_1) == 0x000028, "Member 'BP_0000_EventTips_Base_C_PlControl_AfterSettings::CallFunc_GetClassDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_PlControl_AfterSettings, CallFunc_Contains_ReturnValue_1) == 0x000038, "Member 'BP_0000_EventTips_Base_C_PlControl_AfterSettings::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_PlControl_AfterSettings, CallFunc_Not_PreBool_ReturnValue_1) == 0x000039, "Member 'BP_0000_EventTips_Base_C_PlControl_AfterSettings::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_PlControl_AfterSettings, CallFunc_GetInputManager_BP_InputManager_1) == 0x000040, "Member 'BP_0000_EventTips_Base_C_PlControl_AfterSettings::CallFunc_GetInputManager_BP_InputManager_1' has a wrong offset!");

// Function BP_0000_EventTips_Base.BP_0000_EventTips_Base_C.TriggerWaitTimeSettings
// 0x0060 (0x0060 - 0x0000)
struct BP_0000_EventTips_Base_C_TriggerWaitTimeSettings final
{
public:
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88B4[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue_1;        // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88B5[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue_2;        // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_2;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerCharaID_ReturnPlayerID;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88B6[0x5];                                     // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue_3;        // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_3;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue_1;        // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_0000_EventTips_Base_C_TriggerWaitTimeSettings) == 0x000008, "Wrong alignment on BP_0000_EventTips_Base_C_TriggerWaitTimeSettings");
static_assert(sizeof(BP_0000_EventTips_Base_C_TriggerWaitTimeSettings) == 0x000060, "Wrong size on BP_0000_EventTips_Base_C_TriggerWaitTimeSettings");
static_assert(offsetof(BP_0000_EventTips_Base_C_TriggerWaitTimeSettings, CallFunc_GetClassDisplayName_ReturnValue) == 0x000000, "Member 'BP_0000_EventTips_Base_C_TriggerWaitTimeSettings::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_TriggerWaitTimeSettings, CallFunc_Contains_ReturnValue) == 0x000010, "Member 'BP_0000_EventTips_Base_C_TriggerWaitTimeSettings::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_TriggerWaitTimeSettings, CallFunc_GetClassDisplayName_ReturnValue_1) == 0x000018, "Member 'BP_0000_EventTips_Base_C_TriggerWaitTimeSettings::CallFunc_GetClassDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_TriggerWaitTimeSettings, CallFunc_Contains_ReturnValue_1) == 0x000028, "Member 'BP_0000_EventTips_Base_C_TriggerWaitTimeSettings::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_TriggerWaitTimeSettings, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000029, "Member 'BP_0000_EventTips_Base_C_TriggerWaitTimeSettings::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_TriggerWaitTimeSettings, CallFunc_GetClassDisplayName_ReturnValue_2) == 0x000030, "Member 'BP_0000_EventTips_Base_C_TriggerWaitTimeSettings::CallFunc_GetClassDisplayName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_TriggerWaitTimeSettings, CallFunc_Contains_ReturnValue_2) == 0x000040, "Member 'BP_0000_EventTips_Base_C_TriggerWaitTimeSettings::CallFunc_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_TriggerWaitTimeSettings, CallFunc_GetPlayerCharaID_ReturnPlayerID) == 0x000041, "Member 'BP_0000_EventTips_Base_C_TriggerWaitTimeSettings::CallFunc_GetPlayerCharaID_ReturnPlayerID' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_TriggerWaitTimeSettings, K2Node_SwitchEnum_CmpSuccess) == 0x000042, "Member 'BP_0000_EventTips_Base_C_TriggerWaitTimeSettings::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_TriggerWaitTimeSettings, CallFunc_GetClassDisplayName_ReturnValue_3) == 0x000048, "Member 'BP_0000_EventTips_Base_C_TriggerWaitTimeSettings::CallFunc_GetClassDisplayName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_TriggerWaitTimeSettings, CallFunc_Contains_ReturnValue_3) == 0x000058, "Member 'BP_0000_EventTips_Base_C_TriggerWaitTimeSettings::CallFunc_Contains_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_0000_EventTips_Base_C_TriggerWaitTimeSettings, CallFunc_NotEqual_FloatFloat_ReturnValue_1) == 0x000059, "Member 'BP_0000_EventTips_Base_C_TriggerWaitTimeSettings::CallFunc_NotEqual_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function BP_0000_EventTips_Base.BP_0000_EventTips_Base_C.ProgresIDSettings
// 0x0020 (0x0020 - 0x0000)
struct BP_0000_EventTips_Base_C_ProgresIDSettings final
{
public:
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
