#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AjitoManager

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "S_AjitoPresentResetPlayerInfo_structs.hpp"
#include "S_AjitoCharaTable_structs.hpp"
#include "S_AjitoLotteryTable_structs.hpp"


namespace SDK::Params
{

// Function BP_AjitoManager.BP_AjitoManager_C.ExecuteUbergraph_BP_AjitoManager
// 0x0038 (0x0038 - 0x0000)
struct BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64AF[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASkeletalMeshActor*                     K2Node_CustomEvent_NewParam;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AjitoPlacementManagerBase_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64B0[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager) == 0x000008, "Wrong alignment on BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager");
static_assert(sizeof(BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager) == 0x000038, "Wrong size on BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager");
static_assert(offsetof(BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager, EntryPoint) == 0x000000, "Member 'BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager, Temp_int_Loop_Num_Variable) == 0x000008, "Member 'BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager, K2Node_CustomEvent_NewParam) == 0x000010, "Member 'BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager::K2Node_CustomEvent_NewParam' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member 'BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager, K2Node_Event_EndPlayReason) == 0x000030, "Member 'BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager, CallFunc_Less_IntInt_ReturnValue) == 0x000031, "Member 'BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'BP_AjitoManager_C_ExecuteUbergraph_BP_AjitoManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_AjitoManager.BP_AjitoManager_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_AjitoManager_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AjitoManager_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_AjitoManager_C_ReceiveEndPlay");
static_assert(sizeof(BP_AjitoManager_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_AjitoManager_C_ReceiveEndPlay");
static_assert(offsetof(BP_AjitoManager_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_AjitoManager_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_AjitoManager.BP_AjitoManager_C.DelayActorUpdate
// 0x0008 (0x0008 - 0x0000)
struct BP_AjitoManager_C_DelayActorUpdate final
{
public:
	class ASkeletalMeshActor*                     NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AjitoManager_C_DelayActorUpdate) == 0x000008, "Wrong alignment on BP_AjitoManager_C_DelayActorUpdate");
static_assert(sizeof(BP_AjitoManager_C_DelayActorUpdate) == 0x000008, "Wrong size on BP_AjitoManager_C_DelayActorUpdate");
static_assert(offsetof(BP_AjitoManager_C_DelayActorUpdate, NewParam) == 0x000000, "Member 'BP_AjitoManager_C_DelayActorUpdate::NewParam' has a wrong offset!");

// Function BP_AjitoManager.BP_AjitoManager_C.SetHoodAjitoNpc
// 0x0038 (0x0038 - 0x0000)
struct BP_AjitoManager_C_SetHoodAjitoNpc final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64B1[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AjitoManager_C_SetHoodAjitoNpc) == 0x000008, "Wrong alignment on BP_AjitoManager_C_SetHoodAjitoNpc");
static_assert(sizeof(BP_AjitoManager_C_SetHoodAjitoNpc) == 0x000038, "Wrong size on BP_AjitoManager_C_SetHoodAjitoNpc");
static_assert(offsetof(BP_AjitoManager_C_SetHoodAjitoNpc, Actor) == 0x000000, "Member 'BP_AjitoManager_C_SetHoodAjitoNpc::Actor' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_SetHoodAjitoNpc, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000008, "Member 'BP_AjitoManager_C_SetHoodAjitoNpc::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_SetHoodAjitoNpc, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_AjitoManager_C_SetHoodAjitoNpc::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_SetHoodAjitoNpc, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_AjitoManager_C_SetHoodAjitoNpc::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_SetHoodAjitoNpc, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_AjitoManager_C_SetHoodAjitoNpc::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_SetHoodAjitoNpc, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BP_AjitoManager_C_SetHoodAjitoNpc::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_SetHoodAjitoNpc, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_AjitoManager_C_SetHoodAjitoNpc::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_SetHoodAjitoNpc, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_AjitoManager_C_SetHoodAjitoNpc::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_AjitoManager.BP_AjitoManager_C.DestroyAllSpawnedAjitoMember
// 0x0020 (0x0020 - 0x0000)
struct BP_AjitoManager_C_DestroyAllSpawnedAjitoMember final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64B2[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AjitoMember_C*                      CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AjitoManager_C_DestroyAllSpawnedAjitoMember) == 0x000008, "Wrong alignment on BP_AjitoManager_C_DestroyAllSpawnedAjitoMember");
static_assert(sizeof(BP_AjitoManager_C_DestroyAllSpawnedAjitoMember) == 0x000020, "Wrong size on BP_AjitoManager_C_DestroyAllSpawnedAjitoMember");
static_assert(offsetof(BP_AjitoManager_C_DestroyAllSpawnedAjitoMember, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_AjitoManager_C_DestroyAllSpawnedAjitoMember::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_DestroyAllSpawnedAjitoMember, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_AjitoManager_C_DestroyAllSpawnedAjitoMember::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_DestroyAllSpawnedAjitoMember, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_AjitoManager_C_DestroyAllSpawnedAjitoMember::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_DestroyAllSpawnedAjitoMember, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_AjitoManager_C_DestroyAllSpawnedAjitoMember::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_DestroyAllSpawnedAjitoMember, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_AjitoManager_C_DestroyAllSpawnedAjitoMember::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_DestroyAllSpawnedAjitoMember, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_AjitoManager_C_DestroyAllSpawnedAjitoMember::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_DestroyAllSpawnedAjitoMember, CallFunc_IsValid_ReturnValue) == 0x00001D, "Member 'BP_AjitoManager_C_DestroyAllSpawnedAjitoMember::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AjitoManager.BP_AjitoManager_C.GetArrangementPatternInfo
// 0x0080 (0x0080 - 0x0000)
struct BP_AjitoManager_C_GetArrangementPatternInfo final
{
public:
	class FName                                   PatternName;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAjitoArrangementPatternInfo           PatternInfo;                                       // 0x0008(0x0028)(Parm, OutParm)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FAjitoArrangementPatternInfo           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0040(0x0028)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64B3[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AjitoManager_C_GetArrangementPatternInfo) == 0x000008, "Wrong alignment on BP_AjitoManager_C_GetArrangementPatternInfo");
static_assert(sizeof(BP_AjitoManager_C_GetArrangementPatternInfo) == 0x000080, "Wrong size on BP_AjitoManager_C_GetArrangementPatternInfo");
static_assert(offsetof(BP_AjitoManager_C_GetArrangementPatternInfo, PatternName) == 0x000000, "Member 'BP_AjitoManager_C_GetArrangementPatternInfo::PatternName' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetArrangementPatternInfo, PatternInfo) == 0x000008, "Member 'BP_AjitoManager_C_GetArrangementPatternInfo::PatternInfo' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetArrangementPatternInfo, CallFunc_Conv_NameToString_ReturnValue) == 0x000030, "Member 'BP_AjitoManager_C_GetArrangementPatternInfo::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetArrangementPatternInfo, CallFunc_GetDataTableRowFromName_OutRow) == 0x000040, "Member 'BP_AjitoManager_C_GetArrangementPatternInfo::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetArrangementPatternInfo, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000068, "Member 'BP_AjitoManager_C_GetArrangementPatternInfo::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetArrangementPatternInfo, CallFunc_Concat_StrStr_ReturnValue) == 0x000070, "Member 'BP_AjitoManager_C_GetArrangementPatternInfo::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BP_AjitoManager.BP_AjitoManager_C._SetVisibleAllAtLevelActors_Deprecated
// 0x0001 (0x0001 - 0x0000)
struct BP_AjitoManager_C__SetVisibleAllAtLevelActors_Deprecated final
{
public:
	bool                                          Visibility;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AjitoManager_C__SetVisibleAllAtLevelActors_Deprecated) == 0x000001, "Wrong alignment on BP_AjitoManager_C__SetVisibleAllAtLevelActors_Deprecated");
static_assert(sizeof(BP_AjitoManager_C__SetVisibleAllAtLevelActors_Deprecated) == 0x000001, "Wrong size on BP_AjitoManager_C__SetVisibleAllAtLevelActors_Deprecated");
static_assert(offsetof(BP_AjitoManager_C__SetVisibleAllAtLevelActors_Deprecated, Visibility) == 0x000000, "Member 'BP_AjitoManager_C__SetVisibleAllAtLevelActors_Deprecated::Visibility' has a wrong offset!");

// Function BP_AjitoManager.BP_AjitoManager_C.VisibleAtLevelActor
// 0x0120 (0x0120 - 0x0000)
struct BP_AjitoManager_C_VisibleAtLevelActor final
{
public:
	struct FAjitoArrangementMasterInfo            ArrangementInfo;                                   // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64B4[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64B5[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASkeletalMeshActor*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x00E0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64B6[0x3];                                     // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_2;                   // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AjitoManager_C_VisibleAtLevelActor) == 0x000010, "Wrong alignment on BP_AjitoManager_C_VisibleAtLevelActor");
static_assert(sizeof(BP_AjitoManager_C_VisibleAtLevelActor) == 0x000120, "Wrong size on BP_AjitoManager_C_VisibleAtLevelActor");
static_assert(offsetof(BP_AjitoManager_C_VisibleAtLevelActor, ArrangementInfo) == 0x000000, "Member 'BP_AjitoManager_C_VisibleAtLevelActor::ArrangementInfo' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleAtLevelActor, Temp_int_Array_Index_Variable) == 0x0000C0, "Member 'BP_AjitoManager_C_VisibleAtLevelActor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleAtLevelActor, CallFunc_Concat_StrStr_ReturnValue) == 0x0000C8, "Member 'BP_AjitoManager_C_VisibleAtLevelActor::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleAtLevelActor, Temp_int_Loop_Counter_Variable) == 0x0000D8, "Member 'BP_AjitoManager_C_VisibleAtLevelActor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleAtLevelActor, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000E0, "Member 'BP_AjitoManager_C_VisibleAtLevelActor::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleAtLevelActor, CallFunc_Array_Length_ReturnValue) == 0x0000F0, "Member 'BP_AjitoManager_C_VisibleAtLevelActor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleAtLevelActor, CallFunc_Less_IntInt_ReturnValue) == 0x0000F4, "Member 'BP_AjitoManager_C_VisibleAtLevelActor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleAtLevelActor, CallFunc_GetDisplayName_ReturnValue) == 0x0000F8, "Member 'BP_AjitoManager_C_VisibleAtLevelActor::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleAtLevelActor, CallFunc_Add_IntInt_ReturnValue) == 0x000108, "Member 'BP_AjitoManager_C_VisibleAtLevelActor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleAtLevelActor, CallFunc_Contains_ReturnValue) == 0x00010C, "Member 'BP_AjitoManager_C_VisibleAtLevelActor::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleAtLevelActor, CallFunc_Contains_ReturnValue_1) == 0x00010D, "Member 'BP_AjitoManager_C_VisibleAtLevelActor::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleAtLevelActor, CallFunc_Contains_ReturnValue_2) == 0x00010E, "Member 'BP_AjitoManager_C_VisibleAtLevelActor::CallFunc_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleAtLevelActor, CallFunc_BooleanAND_ReturnValue) == 0x00010F, "Member 'BP_AjitoManager_C_VisibleAtLevelActor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleAtLevelActor, CallFunc_BooleanAND_ReturnValue_1) == 0x000110, "Member 'BP_AjitoManager_C_VisibleAtLevelActor::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_AjitoManager.BP_AjitoManager_C.SpawnDummyMember
// 0x0120 (0x0120 - 0x0000)
struct BP_AjitoManager_C_SpawnDummyMember final
{
public:
	class FString                                 CharaRoma;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Action;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64B7[0x8];                                     // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAjitoArrangementMasterInfo            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0050(0x00C0)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AjitoManager_C_SpawnDummyMember) == 0x000010, "Wrong alignment on BP_AjitoManager_C_SpawnDummyMember");
static_assert(sizeof(BP_AjitoManager_C_SpawnDummyMember) == 0x000120, "Wrong size on BP_AjitoManager_C_SpawnDummyMember");
static_assert(offsetof(BP_AjitoManager_C_SpawnDummyMember, CharaRoma) == 0x000000, "Member 'BP_AjitoManager_C_SpawnDummyMember::CharaRoma' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_SpawnDummyMember, Action) == 0x000010, "Member 'BP_AjitoManager_C_SpawnDummyMember::Action' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_SpawnDummyMember, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'BP_AjitoManager_C_SpawnDummyMember::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_SpawnDummyMember, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000030, "Member 'BP_AjitoManager_C_SpawnDummyMember::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_SpawnDummyMember, CallFunc_Conv_StringToName_ReturnValue) == 0x000040, "Member 'BP_AjitoManager_C_SpawnDummyMember::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_SpawnDummyMember, CallFunc_GetDataTableRowFromName_OutRow) == 0x000050, "Member 'BP_AjitoManager_C_SpawnDummyMember::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_SpawnDummyMember, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000110, "Member 'BP_AjitoManager_C_SpawnDummyMember::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function BP_AjitoManager.BP_AjitoManager_C.VisibleDummyMember
// 0x0290 (0x0290 - 0x0000)
struct BP_AjitoManager_C_VisibleDummyMember final
{
public:
	class FName                                   PlaceCandicateName;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64B8[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAjitoArrangementMasterInfo            ReturnValue;                                       // 0x0010(0x00C0)(Parm, OutParm, ReturnParm)
	struct FAjitoMemberPlaceCandicateInfo         CallFunc_GetDataTableRowFromName_OutRow;           // 0x00D0(0x0050)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64B9[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Map_Find_Value;                           // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64BA[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64BB[0x8];                                     // 0x01B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAjitoArrangementMasterInfo            CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x01C0(0x00C0)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AjitoManager_C_VisibleDummyMember) == 0x000010, "Wrong alignment on BP_AjitoManager_C_VisibleDummyMember");
static_assert(sizeof(BP_AjitoManager_C_VisibleDummyMember) == 0x000290, "Wrong size on BP_AjitoManager_C_VisibleDummyMember");
static_assert(offsetof(BP_AjitoManager_C_VisibleDummyMember, PlaceCandicateName) == 0x000000, "Member 'BP_AjitoManager_C_VisibleDummyMember::PlaceCandicateName' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleDummyMember, ReturnValue) == 0x000010, "Member 'BP_AjitoManager_C_VisibleDummyMember::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleDummyMember, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000D0, "Member 'BP_AjitoManager_C_VisibleDummyMember::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleDummyMember, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000120, "Member 'BP_AjitoManager_C_VisibleDummyMember::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleDummyMember, CallFunc_Conv_NameToString_ReturnValue) == 0x000128, "Member 'BP_AjitoManager_C_VisibleDummyMember::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleDummyMember, CallFunc_Left_ReturnValue) == 0x000138, "Member 'BP_AjitoManager_C_VisibleDummyMember::CallFunc_Left_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleDummyMember, CallFunc_Concat_StrStr_ReturnValue) == 0x000148, "Member 'BP_AjitoManager_C_VisibleDummyMember::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleDummyMember, CallFunc_Map_Find_Value) == 0x000158, "Member 'BP_AjitoManager_C_VisibleDummyMember::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleDummyMember, CallFunc_Map_Find_ReturnValue) == 0x000168, "Member 'BP_AjitoManager_C_VisibleDummyMember::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleDummyMember, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000170, "Member 'BP_AjitoManager_C_VisibleDummyMember::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleDummyMember, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000180, "Member 'BP_AjitoManager_C_VisibleDummyMember::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleDummyMember, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000190, "Member 'BP_AjitoManager_C_VisibleDummyMember::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleDummyMember, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0001A0, "Member 'BP_AjitoManager_C_VisibleDummyMember::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleDummyMember, CallFunc_Conv_StringToName_ReturnValue) == 0x0001B0, "Member 'BP_AjitoManager_C_VisibleDummyMember::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleDummyMember, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0001C0, "Member 'BP_AjitoManager_C_VisibleDummyMember::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_VisibleDummyMember, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000280, "Member 'BP_AjitoManager_C_VisibleDummyMember::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");

// Function BP_AjitoManager.BP_AjitoManager_C.GetPlaceCandicateToMemberInfo
// 0x0290 (0x0290 - 0x0000)
struct BP_AjitoManager_C_GetPlaceCandicateToMemberInfo final
{
public:
	class FName                                   PlaceCandicateName;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64BC[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAjitoArrangementMasterInfo            ReturnValue;                                       // 0x0010(0x00C0)(Parm, OutParm, ReturnParm)
	struct FAjitoMemberPlaceCandicateInfo         CallFunc_GetDataTableRowFromName_OutRow;           // 0x00D0(0x0050)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64BD[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Map_Find_Value;                           // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64BE[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64BF[0x8];                                     // 0x01B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAjitoArrangementMasterInfo            CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x01C0(0x00C0)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AjitoManager_C_GetPlaceCandicateToMemberInfo) == 0x000010, "Wrong alignment on BP_AjitoManager_C_GetPlaceCandicateToMemberInfo");
static_assert(sizeof(BP_AjitoManager_C_GetPlaceCandicateToMemberInfo) == 0x000290, "Wrong size on BP_AjitoManager_C_GetPlaceCandicateToMemberInfo");
static_assert(offsetof(BP_AjitoManager_C_GetPlaceCandicateToMemberInfo, PlaceCandicateName) == 0x000000, "Member 'BP_AjitoManager_C_GetPlaceCandicateToMemberInfo::PlaceCandicateName' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetPlaceCandicateToMemberInfo, ReturnValue) == 0x000010, "Member 'BP_AjitoManager_C_GetPlaceCandicateToMemberInfo::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetPlaceCandicateToMemberInfo, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000D0, "Member 'BP_AjitoManager_C_GetPlaceCandicateToMemberInfo::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetPlaceCandicateToMemberInfo, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000120, "Member 'BP_AjitoManager_C_GetPlaceCandicateToMemberInfo::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetPlaceCandicateToMemberInfo, CallFunc_Conv_NameToString_ReturnValue) == 0x000128, "Member 'BP_AjitoManager_C_GetPlaceCandicateToMemberInfo::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetPlaceCandicateToMemberInfo, CallFunc_Left_ReturnValue) == 0x000138, "Member 'BP_AjitoManager_C_GetPlaceCandicateToMemberInfo::CallFunc_Left_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetPlaceCandicateToMemberInfo, CallFunc_Concat_StrStr_ReturnValue) == 0x000148, "Member 'BP_AjitoManager_C_GetPlaceCandicateToMemberInfo::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetPlaceCandicateToMemberInfo, CallFunc_Map_Find_Value) == 0x000158, "Member 'BP_AjitoManager_C_GetPlaceCandicateToMemberInfo::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetPlaceCandicateToMemberInfo, CallFunc_Map_Find_ReturnValue) == 0x000168, "Member 'BP_AjitoManager_C_GetPlaceCandicateToMemberInfo::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetPlaceCandicateToMemberInfo, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000170, "Member 'BP_AjitoManager_C_GetPlaceCandicateToMemberInfo::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetPlaceCandicateToMemberInfo, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000180, "Member 'BP_AjitoManager_C_GetPlaceCandicateToMemberInfo::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetPlaceCandicateToMemberInfo, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000190, "Member 'BP_AjitoManager_C_GetPlaceCandicateToMemberInfo::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetPlaceCandicateToMemberInfo, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0001A0, "Member 'BP_AjitoManager_C_GetPlaceCandicateToMemberInfo::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetPlaceCandicateToMemberInfo, CallFunc_Conv_StringToName_ReturnValue) == 0x0001B0, "Member 'BP_AjitoManager_C_GetPlaceCandicateToMemberInfo::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetPlaceCandicateToMemberInfo, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0001C0, "Member 'BP_AjitoManager_C_GetPlaceCandicateToMemberInfo::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetPlaceCandicateToMemberInfo, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000280, "Member 'BP_AjitoManager_C_GetPlaceCandicateToMemberInfo::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");

// Function BP_AjitoManager.BP_AjitoManager_C._SpawnMemberFromMemberInfo
// 0x00E0 (0x00E0 - 0x0000)
struct BP_AjitoManager_C__SpawnMemberFromMemberInfo final
{
public:
	struct FAjitoArrangementMasterInfo            MasterInfo;                                        // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          PIE;                                               // 0x00C0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64C0[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AjitoMember_C*                      AjitoMemberActor;                                  // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AjitoNpcPeople_C*                   SpawnedAjitoMember;                                // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASkeletalMeshActor*                     SpawnedActor;                                      // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AjitoManager_C__SpawnMemberFromMemberInfo) == 0x000010, "Wrong alignment on BP_AjitoManager_C__SpawnMemberFromMemberInfo");
static_assert(sizeof(BP_AjitoManager_C__SpawnMemberFromMemberInfo) == 0x0000E0, "Wrong size on BP_AjitoManager_C__SpawnMemberFromMemberInfo");
static_assert(offsetof(BP_AjitoManager_C__SpawnMemberFromMemberInfo, MasterInfo) == 0x000000, "Member 'BP_AjitoManager_C__SpawnMemberFromMemberInfo::MasterInfo' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C__SpawnMemberFromMemberInfo, PIE) == 0x0000C0, "Member 'BP_AjitoManager_C__SpawnMemberFromMemberInfo::PIE' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C__SpawnMemberFromMemberInfo, AjitoMemberActor) == 0x0000C8, "Member 'BP_AjitoManager_C__SpawnMemberFromMemberInfo::AjitoMemberActor' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C__SpawnMemberFromMemberInfo, SpawnedAjitoMember) == 0x0000D0, "Member 'BP_AjitoManager_C__SpawnMemberFromMemberInfo::SpawnedAjitoMember' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C__SpawnMemberFromMemberInfo, SpawnedActor) == 0x0000D8, "Member 'BP_AjitoManager_C__SpawnMemberFromMemberInfo::SpawnedActor' has a wrong offset!");

// Function BP_AjitoManager.BP_AjitoManager_C.GetCharacterActorClass
// 0x0010 (0x0010 - 0x0000)
struct BP_AjitoManager_C_GetCharacterActorClass final
{
public:
	EPlayerID                                     PlayerId;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64C1[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 AjitoMemberActorClass;                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AjitoManager_C_GetCharacterActorClass) == 0x000008, "Wrong alignment on BP_AjitoManager_C_GetCharacterActorClass");
static_assert(sizeof(BP_AjitoManager_C_GetCharacterActorClass) == 0x000010, "Wrong size on BP_AjitoManager_C_GetCharacterActorClass");
static_assert(offsetof(BP_AjitoManager_C_GetCharacterActorClass, PlayerId) == 0x000000, "Member 'BP_AjitoManager_C_GetCharacterActorClass::PlayerId' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetCharacterActorClass, AjitoMemberActorClass) == 0x000008, "Member 'BP_AjitoManager_C_GetCharacterActorClass::AjitoMemberActorClass' has a wrong offset!");

// Function BP_AjitoManager.BP_AjitoManager_C.GetArrangementInfo
// 0x01C0 (0x01C0 - 0x0000)
struct BP_AjitoManager_C_GetArrangementInfo final
{
public:
	class FName                                   MasterKey;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64C2[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAjitoArrangementMasterInfo            ArrangementInfo;                                   // 0x0010(0x00C0)(Parm, OutParm)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FAjitoArrangementMasterInfo            CallFunc_GetDataTableRowFromName_OutRow;           // 0x00E0(0x00C0)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64C3[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AjitoManager_C_GetArrangementInfo) == 0x000010, "Wrong alignment on BP_AjitoManager_C_GetArrangementInfo");
static_assert(sizeof(BP_AjitoManager_C_GetArrangementInfo) == 0x0001C0, "Wrong size on BP_AjitoManager_C_GetArrangementInfo");
static_assert(offsetof(BP_AjitoManager_C_GetArrangementInfo, MasterKey) == 0x000000, "Member 'BP_AjitoManager_C_GetArrangementInfo::MasterKey' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetArrangementInfo, ArrangementInfo) == 0x000010, "Member 'BP_AjitoManager_C_GetArrangementInfo::ArrangementInfo' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetArrangementInfo, CallFunc_Conv_NameToString_ReturnValue) == 0x0000D0, "Member 'BP_AjitoManager_C_GetArrangementInfo::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetArrangementInfo, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000E0, "Member 'BP_AjitoManager_C_GetArrangementInfo::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetArrangementInfo, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0001A0, "Member 'BP_AjitoManager_C_GetArrangementInfo::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_GetArrangementInfo, CallFunc_Concat_StrStr_ReturnValue) == 0x0001A8, "Member 'BP_AjitoManager_C_GetArrangementInfo::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BP_AjitoManager.BP_AjitoManager_C.LoadLotteryData
// 0x0080 (0x0080 - 0x0000)
struct BP_AjitoManager_C_LoadLotteryData final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64C4[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64C5[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0018(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64C6[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAjitoArrangementPatternCondition      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0030(0x0048)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AjitoManager_C_LoadLotteryData) == 0x000008, "Wrong alignment on BP_AjitoManager_C_LoadLotteryData");
static_assert(sizeof(BP_AjitoManager_C_LoadLotteryData) == 0x000080, "Wrong size on BP_AjitoManager_C_LoadLotteryData");
static_assert(offsetof(BP_AjitoManager_C_LoadLotteryData, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_AjitoManager_C_LoadLotteryData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_LoadLotteryData, Temp_int_Loop_Num_Variable) == 0x000004, "Member 'BP_AjitoManager_C_LoadLotteryData::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_LoadLotteryData, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_AjitoManager_C_LoadLotteryData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_LoadLotteryData, CallFunc_Less_IntInt_ReturnValue) == 0x00000C, "Member 'BP_AjitoManager_C_LoadLotteryData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_LoadLotteryData, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_AjitoManager_C_LoadLotteryData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_LoadLotteryData, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000018, "Member 'BP_AjitoManager_C_LoadLotteryData::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_LoadLotteryData, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_AjitoManager_C_LoadLotteryData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_LoadLotteryData, CallFunc_GetDataTableRowFromName_OutRow) == 0x000030, "Member 'BP_AjitoManager_C_LoadLotteryData::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_LoadLotteryData, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000078, "Member 'BP_AjitoManager_C_LoadLotteryData::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function BP_AjitoManager.BP_AjitoManager_C.LoadAjitoCharacterTable
// 0x00A8 (0x00A8 - 0x0000)
struct BP_AjitoManager_C_LoadAjitoCharacterTable final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64C7[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0010(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64C8[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_AjitoCharaTable                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0028(0x0078)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AjitoManager_C_LoadAjitoCharacterTable) == 0x000008, "Wrong alignment on BP_AjitoManager_C_LoadAjitoCharacterTable");
static_assert(sizeof(BP_AjitoManager_C_LoadAjitoCharacterTable) == 0x0000A8, "Wrong size on BP_AjitoManager_C_LoadAjitoCharacterTable");
static_assert(offsetof(BP_AjitoManager_C_LoadAjitoCharacterTable, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_AjitoManager_C_LoadAjitoCharacterTable::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_LoadAjitoCharacterTable, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_AjitoManager_C_LoadAjitoCharacterTable::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_LoadAjitoCharacterTable, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_AjitoManager_C_LoadAjitoCharacterTable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_LoadAjitoCharacterTable, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000010, "Member 'BP_AjitoManager_C_LoadAjitoCharacterTable::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_LoadAjitoCharacterTable, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_AjitoManager_C_LoadAjitoCharacterTable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_LoadAjitoCharacterTable, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'BP_AjitoManager_C_LoadAjitoCharacterTable::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_LoadAjitoCharacterTable, CallFunc_GetDataTableRowFromName_OutRow) == 0x000028, "Member 'BP_AjitoManager_C_LoadAjitoCharacterTable::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_AjitoManager_C_LoadAjitoCharacterTable, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000A0, "Member 'BP_AjitoManager_C_LoadAjitoCharacterTable::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function BP_AjitoManager.BP_AjitoManager_C.GetLotteryMemberPattern
// 0x0410 (0x0410 - 0x0000)
struct BP_AjitoManager_C_GetLotteryMemberPattern final
{
public:
	struct FAjitoArrangementPatternInfo           Pattern;                                           // 0x0000(0x0028)(Parm, OutParm)
	class FName                                   PatternName;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ResultPatternString;                               // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TMap<class FName, struct FS_AjitoLotteryTable> TmpLotteryTable;                                   // 0x0040(0x0050)(Edit, BlueprintVisible)
	int32                                         LotteryNumMax;                                     // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TmpResult;                                         // 0x0094(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Error;                                             // 0x0095(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64C9[0x2];                                     // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAjitoArrangementPatternInfo           ResultPattern;                                     // 0x0098(0x0028)(Edit, BlueprintVisible)
	class FName                                   CurKey;                                            // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAjitoArrangementPatternInfo           TmpPattern;                                        // 0x00C8(0x0028)(Edit, BlueprintVisible)
	struct FAjitoArrangementPatternCondition      TmpLotteryCondition;                               // 0x00F0(0x0048)(Edit, BlueprintVisible)
	TMap<class FName, struct FAjitoArrangementPatternCondition> PossibleMemberPattern;                             // 0x0138(0x0050)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64CA[0x4];                                     // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
