#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ajito_ch0900

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Ajito_ch0900.BP_Ajito_ch0900_C.ExecuteUbergraph_BP_Ajito_ch0900
// 0x0088 (0x0088 - 0x0000)
struct BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73F0[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_om0717_C>         K2Node_DynamicCast_AsBPI_Om_0717;                  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73F1[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_om0717_C>         K2Node_DynamicCast_AsBPI_Om_0717_1;                // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_On_1;                           // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73F2[0x1];                                     // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_ObjNo;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_On;                             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73F3[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_om0717_C>         K2Node_DynamicCast_AsBPI_Om_0717_2;                // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73F4[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_om0717_C>         K2Node_DynamicCast_AsBPI_Om_0717_3;                // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue_1;     // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900) == 0x000008, "Wrong alignment on BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900");
static_assert(sizeof(BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900) == 0x000088, "Wrong size on BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900");
static_assert(offsetof(BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900, EntryPoint) == 0x000000, "Member 'BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900, K2Node_DynamicCast_AsBPI_Om_0717) == 0x000018, "Member 'BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900::K2Node_DynamicCast_AsBPI_Om_0717' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900, K2Node_DynamicCast_AsBPI_Om_0717_1) == 0x000030, "Member 'BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900::K2Node_DynamicCast_AsBPI_Om_0717_1' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900, CallFunc_DoesImplementInterface_ReturnValue) == 0x000041, "Member 'BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900, K2Node_CustomEvent_On_1) == 0x000042, "Member 'BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900::K2Node_CustomEvent_On_1' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900, K2Node_CustomEvent_ObjNo) == 0x000044, "Member 'BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900::K2Node_CustomEvent_ObjNo' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900, K2Node_CustomEvent_On) == 0x000050, "Member 'BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900::K2Node_CustomEvent_On' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900, K2Node_DynamicCast_AsBPI_Om_0717_2) == 0x000058, "Member 'BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900::K2Node_DynamicCast_AsBPI_Om_0717_2' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900, K2Node_DynamicCast_AsBPI_Om_0717_3) == 0x000070, "Member 'BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900::K2Node_DynamicCast_AsBPI_Om_0717_3' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900, K2Node_DynamicCast_bSuccess_3) == 0x000080, "Member 'BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900, CallFunc_IsValid_ReturnValue) == 0x000081, "Member 'BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900, CallFunc_DoesImplementInterface_ReturnValue_1) == 0x000082, "Member 'BP_Ajito_ch0900_C_ExecuteUbergraph_BP_Ajito_ch0900::CallFunc_DoesImplementInterface_ReturnValue_1' has a wrong offset!");

// Function BP_Ajito_ch0900.BP_Ajito_ch0900_C.Event_SetAllAttachmentCopy
// 0x0001 (0x0001 - 0x0000)
struct BP_Ajito_ch0900_C_Event_SetAllAttachmentCopy final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Ajito_ch0900_C_Event_SetAllAttachmentCopy) == 0x000001, "Wrong alignment on BP_Ajito_ch0900_C_Event_SetAllAttachmentCopy");
static_assert(sizeof(BP_Ajito_ch0900_C_Event_SetAllAttachmentCopy) == 0x000001, "Wrong size on BP_Ajito_ch0900_C_Event_SetAllAttachmentCopy");
static_assert(offsetof(BP_Ajito_ch0900_C_Event_SetAllAttachmentCopy, On) == 0x000000, "Member 'BP_Ajito_ch0900_C_Event_SetAllAttachmentCopy::On' has a wrong offset!");

// Function BP_Ajito_ch0900.BP_Ajito_ch0900_C.Event_SetAttachmentCopy
// 0x0008 (0x0008 - 0x0000)
struct BP_Ajito_ch0900_C_Event_SetAttachmentCopy final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73F5[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ObjNo;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Ajito_ch0900_C_Event_SetAttachmentCopy) == 0x000004, "Wrong alignment on BP_Ajito_ch0900_C_Event_SetAttachmentCopy");
static_assert(sizeof(BP_Ajito_ch0900_C_Event_SetAttachmentCopy) == 0x000008, "Wrong size on BP_Ajito_ch0900_C_Event_SetAttachmentCopy");
static_assert(offsetof(BP_Ajito_ch0900_C_Event_SetAttachmentCopy, On) == 0x000000, "Member 'BP_Ajito_ch0900_C_Event_SetAttachmentCopy::On' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_Event_SetAttachmentCopy, ObjNo) == 0x000004, "Member 'BP_Ajito_ch0900_C_Event_SetAttachmentCopy::ObjNo' has a wrong offset!");

// Function BP_Ajito_ch0900.BP_Ajito_ch0900_C.IsPhotoModeManualOverlap
// 0x0040 (0x0040 - 0x0000)
struct BP_Ajito_ch0900_C_IsPhotoModeManualOverlap final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          LbCopy;                                            // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73F6[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73F7[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73F8[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73F9[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73FA[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_AjitoOm_C>        K2Node_DynamicCast_AsBPI_Ajito_Om;                 // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OM_IsCopyCh0900_bCopy;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Ajito_ch0900_C_IsPhotoModeManualOverlap) == 0x000008, "Wrong alignment on BP_Ajito_ch0900_C_IsPhotoModeManualOverlap");
static_assert(sizeof(BP_Ajito_ch0900_C_IsPhotoModeManualOverlap) == 0x000040, "Wrong size on BP_Ajito_ch0900_C_IsPhotoModeManualOverlap");
static_assert(offsetof(BP_Ajito_ch0900_C_IsPhotoModeManualOverlap, ReturnValue) == 0x000000, "Member 'BP_Ajito_ch0900_C_IsPhotoModeManualOverlap::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_IsPhotoModeManualOverlap, LbCopy) == 0x000001, "Member 'BP_Ajito_ch0900_C_IsPhotoModeManualOverlap::LbCopy' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_IsPhotoModeManualOverlap, Temp_bool_True_if_break_was_hit_Variable) == 0x000002, "Member 'BP_Ajito_ch0900_C_IsPhotoModeManualOverlap::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_IsPhotoModeManualOverlap, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_Ajito_ch0900_C_IsPhotoModeManualOverlap::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_IsPhotoModeManualOverlap, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'BP_Ajito_ch0900_C_IsPhotoModeManualOverlap::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_IsPhotoModeManualOverlap, Temp_int_Loop_Num_Variable) == 0x00000C, "Member 'BP_Ajito_ch0900_C_IsPhotoModeManualOverlap::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_IsPhotoModeManualOverlap, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_Ajito_ch0900_C_IsPhotoModeManualOverlap::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_IsPhotoModeManualOverlap, CallFunc_Less_IntInt_ReturnValue) == 0x000014, "Member 'BP_Ajito_ch0900_C_IsPhotoModeManualOverlap::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_IsPhotoModeManualOverlap, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_Ajito_ch0900_C_IsPhotoModeManualOverlap::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_IsPhotoModeManualOverlap, CallFunc_BooleanAND_ReturnValue) == 0x00001C, "Member 'BP_Ajito_ch0900_C_IsPhotoModeManualOverlap::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_IsPhotoModeManualOverlap, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_Ajito_ch0900_C_IsPhotoModeManualOverlap::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_IsPhotoModeManualOverlap, K2Node_DynamicCast_AsBPI_Ajito_Om) == 0x000028, "Member 'BP_Ajito_ch0900_C_IsPhotoModeManualOverlap::K2Node_DynamicCast_AsBPI_Ajito_Om' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_IsPhotoModeManualOverlap, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_Ajito_ch0900_C_IsPhotoModeManualOverlap::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0900_C_IsPhotoModeManualOverlap, CallFunc_OM_IsCopyCh0900_bCopy) == 0x000039, "Member 'BP_Ajito_ch0900_C_IsPhotoModeManualOverlap::CallFunc_OM_IsCopyCh0900_bCopy' has a wrong offset!");

// Function BP_Ajito_ch0900.BP_Ajito_ch0900_C.GetPhotoModeManualOverlapCapsule
// 0x0008 (0x0008 - 0x0000)
struct BP_Ajito_ch0900_C_GetPhotoModeManualOverlapCapsule final
{
public:
	class UCapsuleComponent*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Ajito_ch0900_C_GetPhotoModeManualOverlapCapsule) == 0x000008, "Wrong alignment on BP_Ajito_ch0900_C_GetPhotoModeManualOverlapCapsule");
static_assert(sizeof(BP_Ajito_ch0900_C_GetPhotoModeManualOverlapCapsule) == 0x000008, "Wrong size on BP_Ajito_ch0900_C_GetPhotoModeManualOverlapCapsule");
static_assert(offsetof(BP_Ajito_ch0900_C_GetPhotoModeManualOverlapCapsule, ReturnValue) == 0x000000, "Member 'BP_Ajito_ch0900_C_GetPhotoModeManualOverlapCapsule::ReturnValue' has a wrong offset!");

}

