#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ajito_ch1000

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AjitoMember_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Ajito_ch1000.BP_Ajito_ch1000_C
// 0x0020 (0x0610 - 0x05F0)
class ABP_Ajito_ch1000_C final : public ABP_AjitoMember_C
{
public:
	uint8                                         Pad_7406[0x4];                                     // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Ajito_ch1000_C;                  // 0x05E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class FName>                           NoCollisionActionName;                             // 0x05F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class URSAjitoAnimInstance*                   AnimInstCola;                                      // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Ajito_ch1000(int32 EntryPoint);
	void ReceiveBeginPlay();
	void InitializeActionSystem();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Ajito_ch1000_C">();
	}
	static class ABP_Ajito_ch1000_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Ajito_ch1000_C>();
	}
};
static_assert(alignof(ABP_Ajito_ch1000_C) == 0x000010, "Wrong alignment on ABP_Ajito_ch1000_C");
static_assert(sizeof(ABP_Ajito_ch1000_C) == 0x000610, "Wrong size on ABP_Ajito_ch1000_C");
static_assert(offsetof(ABP_Ajito_ch1000_C, UberGraphFrame_BP_Ajito_ch1000_C) == 0x0005E8, "Member 'ABP_Ajito_ch1000_C::UberGraphFrame_BP_Ajito_ch1000_C' has a wrong offset!");
static_assert(offsetof(ABP_Ajito_ch1000_C, NoCollisionActionName) == 0x0005F0, "Member 'ABP_Ajito_ch1000_C::NoCollisionActionName' has a wrong offset!");
static_assert(offsetof(ABP_Ajito_ch1000_C, AnimInstCola) == 0x000600, "Member 'ABP_Ajito_ch1000_C::AnimInstCola' has a wrong offset!");

}

