#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ArrangeObjectStatic

#include "Basic.hpp"

#include "BattlePrototype_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ArrangeObjectStatic.BP_ArrangeObjectStatic_C
// 0x0018 (0x02C0 - 0x02A8)
class ABP_ArrangeObjectStatic_C : public AArrangeObject
{
public:
	class UBoxComponent*                          Box;                                               // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ArrangeObjectStatic_C">();
	}
	static class ABP_ArrangeObjectStatic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ArrangeObjectStatic_C>();
	}
};
static_assert(alignof(ABP_ArrangeObjectStatic_C) == 0x000008, "Wrong alignment on ABP_ArrangeObjectStatic_C");
static_assert(sizeof(ABP_ArrangeObjectStatic_C) == 0x0002C0, "Wrong size on ABP_ArrangeObjectStatic_C");
static_assert(offsetof(ABP_ArrangeObjectStatic_C, Box) == 0x0002A8, "Member 'ABP_ArrangeObjectStatic_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_ArrangeObjectStatic_C, StaticMesh) == 0x0002B0, "Member 'ABP_ArrangeObjectStatic_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_ArrangeObjectStatic_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABP_ArrangeObjectStatic_C::DefaultSceneRoot' has a wrong offset!");

}

