#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ajito_ch0300

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Ajito_ch0300.BP_Ajito_ch0300_C.ExecuteUbergraph_BP_Ajito_ch0300
// 0x0080 (0x0080 - 0x0000)
struct BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3143[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x0008(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3144[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_om0713_C>         K2Node_DynamicCast_AsBPI_Om_0713;                  // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3145[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_om0713_C>         K2Node_DynamicCast_AsBPI_Om_0713_1;                // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFireOn_FireOn;                          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3146[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_AnimInstance;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSAjitoAnimInstance*                   K2Node_DynamicCast_AsRSAjito_Anim_Instance;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3147[0x2];                                     // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300) == 0x000008, "Wrong alignment on BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300");
static_assert(sizeof(BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300) == 0x000080, "Wrong size on BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300");
static_assert(offsetof(BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300, EntryPoint) == 0x000000, "Member 'BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300, CallFunc_GetAllActorsWithInterface_OutActors) == 0x000008, "Member 'BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300::CallFunc_GetAllActorsWithInterface_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300, K2Node_DynamicCast_AsBPI_Om_0713) == 0x000030, "Member 'BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300::K2Node_DynamicCast_AsBPI_Om_0713' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300, K2Node_DynamicCast_AsBPI_Om_0713_1) == 0x000048, "Member 'BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300::K2Node_DynamicCast_AsBPI_Om_0713_1' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300, CallFunc_IsFireOn_FireOn) == 0x000059, "Member 'BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300::CallFunc_IsFireOn_FireOn' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300, CallFunc_GetAnimInstance_AnimInstance) == 0x000060, "Member 'BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300::CallFunc_GetAnimInstance_AnimInstance' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300, K2Node_DynamicCast_AsRSAjito_Anim_Instance) == 0x000068, "Member 'BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300::K2Node_DynamicCast_AsRSAjito_Anim_Instance' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300, CallFunc_Less_IntInt_ReturnValue) == 0x000071, "Member 'BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'BP_Ajito_ch0300_C_ExecuteUbergraph_BP_Ajito_ch0300::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

