#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ao_Pouf

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ao_Pouf.BP_ao_Pouf_C.ExecuteUbergraph_BP_ao_Pouf
// 0x00A8 (0x00A8 - 0x0000)
struct BP_ao_Pouf_C_ExecuteUbergraph_BP_ao_Pouf final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x0020(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ao_Pouf_C_ExecuteUbergraph_BP_ao_Pouf) == 0x000004, "Wrong alignment on BP_ao_Pouf_C_ExecuteUbergraph_BP_ao_Pouf");
static_assert(sizeof(BP_ao_Pouf_C_ExecuteUbergraph_BP_ao_Pouf) == 0x0000A8, "Wrong size on BP_ao_Pouf_C_ExecuteUbergraph_BP_ao_Pouf");
static_assert(offsetof(BP_ao_Pouf_C_ExecuteUbergraph_BP_ao_Pouf, EntryPoint) == 0x000000, "Member 'BP_ao_Pouf_C_ExecuteUbergraph_BP_ao_Pouf::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ao_Pouf_C_ExecuteUbergraph_BP_ao_Pouf, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_ao_Pouf_C_ExecuteUbergraph_BP_ao_Pouf::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ao_Pouf_C_ExecuteUbergraph_BP_ao_Pouf, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000008, "Member 'BP_ao_Pouf_C_ExecuteUbergraph_BP_ao_Pouf::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ao_Pouf_C_ExecuteUbergraph_BP_ao_Pouf, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000014, "Member 'BP_ao_Pouf_C_ExecuteUbergraph_BP_ao_Pouf::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ao_Pouf_C_ExecuteUbergraph_BP_ao_Pouf, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x000020, "Member 'BP_ao_Pouf_C_ExecuteUbergraph_BP_ao_Pouf::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");

// Function BP_ao_Pouf.BP_ao_Pouf_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ao_Pouf_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ao_Pouf_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ao_Pouf_C_ReceiveTick");
static_assert(sizeof(BP_ao_Pouf_C_ReceiveTick) == 0x000004, "Wrong size on BP_ao_Pouf_C_ReceiveTick");
static_assert(offsetof(BP_ao_Pouf_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ao_Pouf_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

