#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AjitoMember

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_AjitoMemberInfo_structs.hpp"
#include "EPlayerFacialAnim_structs.hpp"
#include "FMessageIDFacialData_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "FEventFacialAnimationData_structs.hpp"
#include "FPlayerFacialData_structs.hpp"
#include "S_AjitoOmReplaceInfo_structs.hpp"
#include "S_AjitoPresentOmInfo_structs.hpp"
#include "ECharaFacialID_structs.hpp"
#include "S_AjitoAttachTransformInfo_structs.hpp"


namespace SDK::Params
{

// Function BP_AjitoMember.BP_AjitoMember_C.ExecuteUbergraph_BP_AjitoMember
// 0x0220 (0x0220 - 0x0000)
struct BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNowDitherValue_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47EA[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47EB[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSParticleSystemComponentBase*         K2Node_Event_Particle_1;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENpcAnimationKind                             K2Node_Event_AnimKind;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47EC[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47ED[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     K2Node_CustomEvent_PlayerID;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47EE[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABrainTalkManager*                      CallFunc_GetBrainTalkManager_BrainTalkManager;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IRSAjitoAnimInstanceInterface> CallFunc_SetPlayerFacePos_self_CastInput;          // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetPlayerFacePos_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BrainTalkBt_BirthKizunaEp_ReturnValue;    // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47EF[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager_1;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47F0[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue_1;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47F1[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47F2[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47F3[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_AjitoOm_C>        K2Node_DynamicCast_AsBPI_Ajito_Om;                 // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47F4[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshFromActor_ReturnValue;     // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OM_StartStateMachine_result;              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47F5[0x6];                                     // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47F6[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAjitoAnimInstance*                   K2Node_DynamicCast_AsRSAjito_Anim_Instance;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47F7[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47F8[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_AjitoOmPhysics_C> K2Node_DynamicCast_AsBPI_Ajito_Om_Physics;         // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47F9[0x6];                                     // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47FA[0x5];                                     // 0x0143(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager_2;         // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue_2;                  // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47FB[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager_3;         // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IRSAjitoAnimInstanceInterface> CallFunc_SetPlayerFacePos_self_CastInput_1;        // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetPlayerFacePos_ReturnValue_1;           // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47FC[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue_3;                  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharaFacialID                                K2Node_Event_FacialMotionType;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47FD[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player_1;            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47FE[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface;         // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetTalkLookAtTurn_bDummy;                 // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47FF[0x3];                                     // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x01C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReversing_ReturnValue;                  // 0x01C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4800[0x2];                                     // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4801[0x4];                                     // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         K2Node_Event_Particle;                             // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4802[0x4];                                     // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       CallFunc_GetDynamicMaterialInstanceALL_ReturnValue; // 0x01F8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_5;          // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4803[0x4];                                     // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember) == 0x000008, "Wrong alignment on BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember");
static_assert(sizeof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember) == 0x000220, "Wrong size on BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, EntryPoint) == 0x000000, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_GetNowDitherValue_ReturnValue) == 0x000004, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_GetNowDitherValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, Temp_bool_Variable) == 0x000008, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, Temp_bool_Variable_1) == 0x000009, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, Temp_int_Variable) == 0x00000C, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, Temp_int_Loop_Num_Variable) == 0x000018, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, K2Node_Event_Particle_1) == 0x000020, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::K2Node_Event_Particle_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, K2Node_Event_AnimKind) == 0x000028, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::K2Node_Event_AnimKind' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, K2Node_Event_DeltaSeconds) == 0x00002C, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, Temp_int_Array_Index_Variable_1) == 0x000030, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_GetPlayerManager_PlayerManager) == 0x000038, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_GetPlayer_ReturnValue) == 0x000040, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_GetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, K2Node_CustomEvent_PlayerID) == 0x000048, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::K2Node_CustomEvent_PlayerID' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_GetSocketLocation_ReturnValue) == 0x00004C, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_GetBrainTalkManager_BrainTalkManager) == 0x000058, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_GetBrainTalkManager_BrainTalkManager' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_SetPlayerFacePos_self_CastInput) == 0x000060, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_SetPlayerFacePos_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_SetPlayerFacePos_ReturnValue) == 0x000070, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_SetPlayerFacePos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_IsValid_ReturnValue) == 0x000071, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_BrainTalkBt_BirthKizunaEp_ReturnValue) == 0x000072, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_BrainTalkBt_BirthKizunaEp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, K2Node_Event_EndPlayReason) == 0x000073, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, K2Node_SwitchEnum_CmpSuccess_1) == 0x000074, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_GetPlayerManager_PlayerManager_1) == 0x000078, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_GetPlayerManager_PlayerManager_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000080, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_GetPlayer_ReturnValue_1) == 0x000090, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_GetPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_Add_VectorVector_ReturnValue) == 0x000098, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, K2Node_DynamicCast_AsRSBattle_Player) == 0x0000A8, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, Temp_int_Loop_Counter_Variable) == 0x0000B4, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000B8, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, Temp_int_Loop_Counter_Variable_1) == 0x0000BC, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, K2Node_DynamicCast_AsBPI_Ajito_Om) == 0x0000C8, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::K2Node_DynamicCast_AsBPI_Ajito_Om' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_GetSkeletalMeshFromActor_ReturnValue) == 0x0000E0, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_GetSkeletalMeshFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_OM_StartStateMachine_result) == 0x0000E8, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_OM_StartStateMachine_result' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_IsValid_ReturnValue_1) == 0x0000E9, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_GetAnimInstance_ReturnValue) == 0x0000F0, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_Less_IntInt_ReturnValue) == 0x0000F8, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, K2Node_DynamicCast_AsRSAjito_Anim_Instance) == 0x000100, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::K2Node_DynamicCast_AsRSAjito_Anim_Instance' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, K2Node_DynamicCast_bSuccess_2) == 0x000108, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_Add_IntInt_ReturnValue_2) == 0x00010C, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_Array_Length_ReturnValue_1) == 0x000110, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, K2Node_DynamicCast_AsBPI_Ajito_Om_Physics) == 0x000118, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::K2Node_DynamicCast_AsBPI_Ajito_Om_Physics' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, K2Node_DynamicCast_bSuccess_3) == 0x000128, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_DoesImplementInterface_ReturnValue) == 0x000129, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_GetObjectName_ReturnValue) == 0x000130, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, K2Node_Select_Default) == 0x000140, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_Contains_ReturnValue) == 0x000141, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_Not_PreBool_ReturnValue) == 0x000142, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_GetPlayerManager_PlayerManager_2) == 0x000148, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_GetPlayerManager_PlayerManager_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_GetPlayer_ReturnValue_2) == 0x000150, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_GetPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_GetSocketLocation_ReturnValue_2) == 0x000158, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_GetSocketLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_GetPlayerManager_PlayerManager_3) == 0x000168, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_GetPlayerManager_PlayerManager_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_SetPlayerFacePos_self_CastInput_1) == 0x000170, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_SetPlayerFacePos_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_SetPlayerFacePos_ReturnValue_1) == 0x000180, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_SetPlayerFacePos_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_GetPlayer_ReturnValue_3) == 0x000188, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_GetPlayer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, K2Node_Event_FacialMotionType) == 0x000190, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::K2Node_Event_FacialMotionType' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, K2Node_DynamicCast_AsRSBattle_Player_1) == 0x000198, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::K2Node_DynamicCast_AsRSBattle_Player_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, K2Node_DynamicCast_bSuccess_4) == 0x0001A0, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, K2Node_DynamicCast_AsBPI_Player_Interface) == 0x0001A8, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::K2Node_DynamicCast_AsBPI_Player_Interface' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, K2Node_DynamicCast_bSuccess_5) == 0x0001B8, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_SetTalkLookAtTurn_bDummy) == 0x0001B9, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_SetTalkLookAtTurn_bDummy' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_IsValid_ReturnValue_2) == 0x0001BA, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_IsValid_ReturnValue_3) == 0x0001BB, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_Less_FloatFloat_ReturnValue) == 0x0001BC, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, Temp_int_Loop_Num_Variable_1) == 0x0001C0, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001C4, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_IsPlaying_ReturnValue) == 0x0001C5, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001C6, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_IsReversing_ReturnValue) == 0x0001C7, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_IsReversing_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001C8, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_BooleanAND_ReturnValue) == 0x0001C9, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0001CC, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001D0, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0001D4, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x0001D8, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0001DC, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x0001E0, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, K2Node_Event_Particle) == 0x0001E8, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::K2Node_Event_Particle' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_Divide_FloatFloat_ReturnValue_4) == 0x0001F0, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_Divide_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_GetDynamicMaterialInstanceALL_ReturnValue) == 0x0001F8, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_GetDynamicMaterialInstanceALL_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_Divide_FloatFloat_ReturnValue_5) == 0x000208, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_Divide_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_Array_Get_Item) == 0x000210, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_Array_Length_ReturnValue_2) == 0x000218, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember, CallFunc_Less_IntInt_ReturnValue_2) == 0x00021C, "Member 'BP_AjitoMember_C_ExecuteUbergraph_BP_AjitoMember::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function BP_AjitoMember.BP_AjitoMember_C.RegisterEffectInterface
// 0x0008 (0x0008 - 0x0000)
struct BP_AjitoMember_C_RegisterEffectInterface final
{
public:
	class URSParticleSystemComponentBase*         Particle;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AjitoMember_C_RegisterEffectInterface) == 0x000008, "Wrong alignment on BP_AjitoMember_C_RegisterEffectInterface");
static_assert(sizeof(BP_AjitoMember_C_RegisterEffectInterface) == 0x000008, "Wrong size on BP_AjitoMember_C_RegisterEffectInterface");
static_assert(offsetof(BP_AjitoMember_C_RegisterEffectInterface, Particle) == 0x000000, "Member 'BP_AjitoMember_C_RegisterEffectInterface::Particle' has a wrong offset!");

// Function BP_AjitoMember.BP_AjitoMember_C.I_SetFacialMotionType
// 0x0001 (0x0001 - 0x0000)
struct BP_AjitoMember_C_I_SetFacialMotionType final
{
public:
	ECharaFacialID                                Param_FacialMotionType;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AjitoMember_C_I_SetFacialMotionType) == 0x000001, "Wrong alignment on BP_AjitoMember_C_I_SetFacialMotionType");
static_assert(sizeof(BP_AjitoMember_C_I_SetFacialMotionType) == 0x000001, "Wrong size on BP_AjitoMember_C_I_SetFacialMotionType");
static_assert(offsetof(BP_AjitoMember_C_I_SetFacialMotionType, Param_FacialMotionType) == 0x000000, "Member 'BP_AjitoMember_C_I_SetFacialMotionType::Param_FacialMotionType' has a wrong offset!");

// Function BP_AjitoMember.BP_AjitoMember_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_AjitoMember_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AjitoMember_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_AjitoMember_C_ReceiveEndPlay");
static_assert(sizeof(BP_AjitoMember_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_AjitoMember_C_ReceiveEndPlay");
static_assert(offsetof(BP_AjitoMember_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_AjitoMember_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_AjitoMember.BP_AjitoMember_C.Event_BrainTalkBt_BirthKizunaEp
// 0x0001 (0x0001 - 0x0000)
struct BP_AjitoMember_C_Event_BrainTalkBt_BirthKizunaEp final
{
public:
	EPlayerID                                     Param_PlayerId;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AjitoMember_C_Event_BrainTalkBt_BirthKizunaEp) == 0x000001, "Wrong alignment on BP_AjitoMember_C_Event_BrainTalkBt_BirthKizunaEp");
static_assert(sizeof(BP_AjitoMember_C_Event_BrainTalkBt_BirthKizunaEp) == 0x000001, "Wrong size on BP_AjitoMember_C_Event_BrainTalkBt_BirthKizunaEp");
static_assert(offsetof(BP_AjitoMember_C_Event_BrainTalkBt_BirthKizunaEp, Param_PlayerId) == 0x000000, "Member 'BP_AjitoMember_C_Event_BrainTalkBt_BirthKizunaEp::Param_PlayerId' has a wrong offset!");

// Function BP_AjitoMember.BP_AjitoMember_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AjitoMember_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AjitoMember_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AjitoMember_C_ReceiveTick");
static_assert(sizeof(BP_AjitoMember_C_ReceiveTick) == 0x000004, "Wrong size on BP_AjitoMember_C_ReceiveTick");
static_assert(offsetof(BP_AjitoMember_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AjitoMember_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AjitoMember.BP_AjitoMember_C.ChangeAnimation
// 0x0001 (0x0001 - 0x0000)
struct BP_AjitoMember_C_ChangeAnimation final
{
public:
	ENpcAnimationKind                             AnimKind;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AjitoMember_C_ChangeAnimation) == 0x000001, "Wrong alignment on BP_AjitoMember_C_ChangeAnimation");
static_assert(sizeof(BP_AjitoMember_C_ChangeAnimation) == 0x000001, "Wrong size on BP_AjitoMember_C_ChangeAnimation");
static_assert(offsetof(BP_AjitoMember_C_ChangeAnimation, AnimKind) == 0x000000, "Member 'BP_AjitoMember_C_ChangeAnimation::AnimKind' has a wrong offset!");

// Function BP_AjitoMember.BP_AjitoMember_C.RegisterInterruptTelepoEffectInterface
// 0x0008 (0x0008 - 0x0000)
struct BP_AjitoMember_C_RegisterInterruptTelepoEffectInterface final
{
public:
	class URSParticleSystemComponentBase*         Particle;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AjitoMember_C_RegisterInterruptTelepoEffectInterface) == 0x000008, "Wrong alignment on BP_AjitoMember_C_RegisterInterruptTelepoEffectInterface");
static_assert(sizeof(BP_AjitoMember_C_RegisterInterruptTelepoEffectInterface) == 0x000008, "Wrong size on BP_AjitoMember_C_RegisterInterruptTelepoEffectInterface");
static_assert(offsetof(BP_AjitoMember_C_RegisterInterruptTelepoEffectInterface, Particle) == 0x000000, "Member 'BP_AjitoMember_C_RegisterInterruptTelepoEffectInterface::Particle' has a wrong offset!");

// Function BP_AjitoMember.BP_AjitoMember_C.UserConstructionScript
// 0x0094 (0x0094 - 0x0000)
struct BP_AjitoMember_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x000C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_AjitoMember_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_AjitoMember_C_UserConstructionScript");
static_assert(sizeof(BP_AjitoMember_C_UserConstructionScript) == 0x000094, "Wrong size on BP_AjitoMember_C_UserConstructionScript");
static_assert(offsetof(BP_AjitoMember_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000000, "Member 'BP_AjitoMember_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_UserConstructionScript, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x00000C, "Member 'BP_AjitoMember_C_UserConstructionScript::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function BP_AjitoMember.BP_AjitoMember_C.InitializeActionSystem
// 0x0120 (0x0120 - 0x0000)
struct BP_AjitoMember_C_InitializeActionSystem final
{
public:
	class UAnimSequence*                          Anim;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_2;                      // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4804[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable_3;                      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4805[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSAjitoAnimInstance*                   K2Node_DynamicCast_AsRSAjito_Anim_Instance;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4806[0x1];                                     // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4807[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_AjitoMemberInfo                     CallFunc_GetAnimInfoDataTableRow_Info;             // 0x0078(0x0098)(HasGetValueTypeHash)
	bool                                          CallFunc_GetAnimInfoDataTableRow_Error;            // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4808[0x2];                                     // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AjitoMember_C_InitializeActionSystem) == 0x000008, "Wrong alignment on BP_AjitoMember_C_InitializeActionSystem");
static_assert(sizeof(BP_AjitoMember_C_InitializeActionSystem) == 0x000120, "Wrong size on BP_AjitoMember_C_InitializeActionSystem");
static_assert(offsetof(BP_AjitoMember_C_InitializeActionSystem, Anim) == 0x000000, "Member 'BP_AjitoMember_C_InitializeActionSystem::Anim' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_InitializeActionSystem, Actor) == 0x000008, "Member 'BP_AjitoMember_C_InitializeActionSystem::Actor' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_InitializeActionSystem, Temp_int_Loop_Num_Variable) == 0x000010, "Member 'BP_AjitoMember_C_InitializeActionSystem::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_InitializeActionSystem, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_AjitoMember_C_InitializeActionSystem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_InitializeActionSystem, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'BP_AjitoMember_C_InitializeActionSystem::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_InitializeActionSystem, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_AjitoMember_C_InitializeActionSystem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_InitializeActionSystem, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'BP_AjitoMember_C_InitializeActionSystem::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_InitializeActionSystem, Temp_int_Array_Index_Variable) == 0x000024, "Member 'BP_AjitoMember_C_InitializeActionSystem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_InitializeActionSystem, Temp_int_Array_Index_Variable_1) == 0x000028, "Member 'BP_AjitoMember_C_InitializeActionSystem::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_InitializeActionSystem, Temp_int_Loop_Num_Variable_1) == 0x00002C, "Member 'BP_AjitoMember_C_InitializeActionSystem::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_InitializeActionSystem, Temp_int_Loop_Num_Variable_2) == 0x000030, "Member 'BP_AjitoMember_C_InitializeActionSystem::Temp_int_Loop_Num_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_InitializeActionSystem, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_AjitoMember_C_InitializeActionSystem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_InitializeActionSystem, CallFunc_Less_IntInt_ReturnValue_1) == 0x000035, "Member 'BP_AjitoMember_C_InitializeActionSystem::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_InitializeActionSystem, Temp_int_Loop_Num_Variable_3) == 0x000038, "Member 'BP_AjitoMember_C_InitializeActionSystem::Temp_int_Loop_Num_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_InitializeActionSystem, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BP_AjitoMember_C_InitializeActionSystem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_InitializeActionSystem, Temp_int_Array_Index_Variable_2) == 0x000040, "Member 'BP_AjitoMember_C_InitializeActionSystem::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_InitializeActionSystem, Temp_int_Array_Index_Variable_3) == 0x000044, "Member 'BP_AjitoMember_C_InitializeActionSystem::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoMember_C_InitializeActionSystem, CallFunc_Array_Length_ReturnValue_1) == 0x000048, "Member 'BP_AjitoMember_C_InitializeActionSystem::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
