#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ajito_ch1000

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Ajito_ch1000.BP_Ajito_ch1000_C.ExecuteUbergraph_BP_Ajito_ch1000
// 0x0070 (0x0070 - 0x0000)
struct BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7407[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7408[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x0018(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7409[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_740A[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_om0698_C>         K2Node_DynamicCast_AsBPI_Om_0698;                  // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_740B[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_AnimInstance;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSAjitoAnimInstance*                   K2Node_DynamicCast_AsRSAjito_Anim_Instance;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000) == 0x000008, "Wrong alignment on BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000");
static_assert(sizeof(BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000) == 0x000070, "Wrong size on BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000");
static_assert(offsetof(BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000, EntryPoint) == 0x000000, "Member 'BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000, CallFunc_GetAllActorsWithInterface_OutActors) == 0x000018, "Member 'BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000::CallFunc_GetAllActorsWithInterface_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000, K2Node_DynamicCast_AsBPI_Om_0698) == 0x000040, "Member 'BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000::K2Node_DynamicCast_AsBPI_Om_0698' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000, CallFunc_GetAnimInstance_AnimInstance) == 0x000058, "Member 'BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000::CallFunc_GetAnimInstance_AnimInstance' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000, K2Node_DynamicCast_AsRSAjito_Anim_Instance) == 0x000060, "Member 'BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000::K2Node_DynamicCast_AsRSAjito_Anim_Instance' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_Ajito_ch1000_C_ExecuteUbergraph_BP_Ajito_ch1000::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_Ajito_ch1000.BP_Ajito_ch1000_C.InitializeActionSystem
// 0x0001 (0x0001 - 0x0000)
struct BP_Ajito_ch1000_C_InitializeActionSystem final
{
public:
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Ajito_ch1000_C_InitializeActionSystem) == 0x000001, "Wrong alignment on BP_Ajito_ch1000_C_InitializeActionSystem");
static_assert(sizeof(BP_Ajito_ch1000_C_InitializeActionSystem) == 0x000001, "Wrong size on BP_Ajito_ch1000_C_InitializeActionSystem");
static_assert(offsetof(BP_Ajito_ch1000_C_InitializeActionSystem, CallFunc_Array_Contains_ReturnValue) == 0x000000, "Member 'BP_Ajito_ch1000_C_InitializeActionSystem::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

}

