#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AjitoNPCTalk_ch0900

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BP_AjitoNPCTalk_ch0900.BP_AjitoNPCTalk_ch0900_C.Check Exsist Kizuna EP
// 0x00D8 (0x00D8 - 0x0000)
struct BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP final
{
public:
	bool                                          IsKizunaEP;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A30[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_GetProgressID_self_CastInput;             // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetProgressID_ProgressID;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckScenarioFlag_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A31[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckDLCQuestContentCheck_ReturnValue;    // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckDLCQuestContentCheck_ReturnValue_1;  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A32[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager_1;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager_2;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckScenarioFlag_ReturnValue_1;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckScenarioFlag_ReturnValue_2;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A33[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager_3;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_1;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckScenarioFlag_ReturnValue_3;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A34[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_GetProgressID_self_CastInput_1;           // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetProgressID_ProgressID_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckDLCQuestContentCheck_ReturnValue_2;  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A35[0x2];                                     // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckDLCQuestContentCheck_ReturnValue_3;  // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A36[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager_4;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager_5;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckScenarioFlag_ReturnValue_4;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckScenarioFlag_ReturnValue_5;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_11;                // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_12;                // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_13;                // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_14;                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_15;                // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInterludeProgressInRange_ProgressInRange; // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInterludeProgressInRange_ProgressInRange_1; // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInterludeProgressInRange_ProgressInRange_2; // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInterludeProgressInRange_ProgressInRange_3; // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInterludeProgressInRange_ProgressInRange_4; // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A37[0x1];                                     // 0x00BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CheckBondsEpisodeNum_FinshEpisode;        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerCharaID_ReturnPlayerID;          // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInterludeProgressInRange_ProgressInRange_5; // 0x00C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInterludeProgressInRange_ProgressInRange_6; // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInterludeProgressInRange_ProgressInRange_7; // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A38[0x2];                                     // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CheckBondsEpisodeNum_FinshEpisode_1;      // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInterludeProgressInRange_ProgressInRange_8; // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP) == 0x000008, "Wrong alignment on BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP");
static_assert(sizeof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP) == 0x0000D8, "Wrong size on BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, IsKizunaEP) == 0x000000, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::IsKizunaEP' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_GetEventManager_EventManager) == 0x000008, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_GetSceneManager_SceneManager) == 0x000010, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_GetSceneManager_SceneManager' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_GetProgressID_self_CastInput) == 0x000018, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_GetProgressID_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_GetProgressID_ProgressID) == 0x000028, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_GetProgressID_ProgressID' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_CheckScenarioFlag_ReturnValue) == 0x00002C, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_CheckScenarioFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002D, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_Percent_IntInt_ReturnValue) == 0x000030, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue) == 0x000034, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000035, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_1) == 0x000036, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_CheckDLCQuestContentCheck_ReturnValue) == 0x000037, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_CheckDLCQuestContentCheck_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanOR_ReturnValue) == 0x000038, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_CheckDLCQuestContentCheck_ReturnValue_1) == 0x000039, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_CheckDLCQuestContentCheck_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_GetSceneManager_SceneManager_1) == 0x000040, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_GetSceneManager_SceneManager_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_GetSceneManager_SceneManager_2) == 0x000048, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_GetSceneManager_SceneManager_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_CheckScenarioFlag_ReturnValue_1) == 0x000050, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_CheckScenarioFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_CheckScenarioFlag_ReturnValue_2) == 0x000051, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_CheckScenarioFlag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_Not_PreBool_ReturnValue) == 0x000052, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_Not_PreBool_ReturnValue_1) == 0x000053, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_2) == 0x000054, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_3) == 0x000055, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_4) == 0x000056, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_5) == 0x000057, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_6) == 0x000058, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_7) == 0x000059, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_GetSceneManager_SceneManager_3) == 0x000060, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_GetSceneManager_SceneManager_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_GetEventManager_EventManager_1) == 0x000068, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_GetEventManager_EventManager_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_CheckScenarioFlag_ReturnValue_3) == 0x000070, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_CheckScenarioFlag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_GetProgressID_self_CastInput_1) == 0x000078, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_GetProgressID_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_GetProgressID_ProgressID_1) == 0x000088, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_GetProgressID_ProgressID_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_CheckDLCQuestContentCheck_ReturnValue_2) == 0x00008C, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_CheckDLCQuestContentCheck_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00008D, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000090, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_8) == 0x000094, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000095, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_9) == 0x000096, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_CheckDLCQuestContentCheck_ReturnValue_3) == 0x000097, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_CheckDLCQuestContentCheck_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanOR_ReturnValue_1) == 0x000098, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_GetSceneManager_SceneManager_4) == 0x0000A0, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_GetSceneManager_SceneManager_4' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_GetSceneManager_SceneManager_5) == 0x0000A8, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_GetSceneManager_SceneManager_5' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_CheckScenarioFlag_ReturnValue_4) == 0x0000B0, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_CheckScenarioFlag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_CheckScenarioFlag_ReturnValue_5) == 0x0000B1, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_CheckScenarioFlag_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_Not_PreBool_ReturnValue_2) == 0x0000B2, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_Not_PreBool_ReturnValue_3) == 0x0000B3, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_10) == 0x0000B4, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_11) == 0x0000B5, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_12) == 0x0000B6, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_13) == 0x0000B7, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_14) == 0x0000B8, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_15) == 0x0000B9, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_CheckInterludeProgressInRange_ProgressInRange) == 0x0000BA, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_CheckInterludeProgressInRange_ProgressInRange' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_CheckInterludeProgressInRange_ProgressInRange_1) == 0x0000BB, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_CheckInterludeProgressInRange_ProgressInRange_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_CheckInterludeProgressInRange_ProgressInRange_2) == 0x0000BC, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_CheckInterludeProgressInRange_ProgressInRange_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_CheckInterludeProgressInRange_ProgressInRange_3) == 0x0000BD, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_CheckInterludeProgressInRange_ProgressInRange_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_CheckInterludeProgressInRange_ProgressInRange_4) == 0x0000BE, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_CheckInterludeProgressInRange_ProgressInRange_4' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_CheckBondsEpisodeNum_FinshEpisode) == 0x0000C0, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_CheckBondsEpisodeNum_FinshEpisode' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, K2Node_SwitchInteger_CmpSuccess) == 0x0000C4, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_GetPlayerCharaID_ReturnPlayerID) == 0x0000C5, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_GetPlayerCharaID_ReturnPlayerID' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, K2Node_SwitchEnum_CmpSuccess) == 0x0000C6, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_CheckInterludeProgressInRange_ProgressInRange_5) == 0x0000C7, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_CheckInterludeProgressInRange_ProgressInRange_5' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_CheckInterludeProgressInRange_ProgressInRange_6) == 0x0000C8, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_CheckInterludeProgressInRange_ProgressInRange_6' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_CheckInterludeProgressInRange_ProgressInRange_7) == 0x0000C9, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_CheckInterludeProgressInRange_ProgressInRange_7' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_CheckBondsEpisodeNum_FinshEpisode_1) == 0x0000CC, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_CheckBondsEpisodeNum_FinshEpisode_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, K2Node_SwitchInteger_CmpSuccess_1) == 0x0000D0, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP, CallFunc_CheckInterludeProgressInRange_ProgressInRange_8) == 0x0000D1, "Member 'BP_AjitoNPCTalk_ch0900_C_Check_Exsist_Kizuna_EP::CallFunc_CheckInterludeProgressInRange_ProgressInRange_8' has a wrong offset!");

// Function BP_AjitoNPCTalk_ch0900.BP_AjitoNPCTalk_ch0900_C.FreeWord_KizunaEP
// 0x001C (0x001C - 0x0000)
struct BP_AjitoNPCTalk_ch0900_C_FreeWord_KizunaEP final
{
public:
	bool                                          IsSwapKizunaEPFreeWord;                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A39[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBondsProgress_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBondsProgress_ReturnValue_1;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_IntInt_ReturnValue_1;             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetIsProgressBondsEpisode_playerID;       // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     CallFunc_GetIsProgressBondsEpisode_targetID;       // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsProgressBondsEpisode_ReturnValue;    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AjitoNPCTalk_ch0900_C_FreeWord_KizunaEP) == 0x000004, "Wrong alignment on BP_AjitoNPCTalk_ch0900_C_FreeWord_KizunaEP");
static_assert(sizeof(BP_AjitoNPCTalk_ch0900_C_FreeWord_KizunaEP) == 0x00001C, "Wrong size on BP_AjitoNPCTalk_ch0900_C_FreeWord_KizunaEP");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_FreeWord_KizunaEP, IsSwapKizunaEPFreeWord) == 0x000000, "Member 'BP_AjitoNPCTalk_ch0900_C_FreeWord_KizunaEP::IsSwapKizunaEPFreeWord' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0900_C_FreeWord_KizunaEP, CallFunc_GetBondsProgress_ReturnValue) == 0x000004, "Member 'BP_AjitoNPCTalk_ch0900_C_FreeWord_KizunaEP::CallFunc_GetBondsProgress_ReturnValue' has a wrong offset!");
