#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ajito_ch0700

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BP_AjitoMember_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Ajito_ch0700.BP_Ajito_ch0700_C
// 0x0030 (0x0620 - 0x05F0)
class ABP_Ajito_ch0700_C final : public ABP_AjitoMember_C
{
public:
	uint8                                         Pad_42AC[0x4];                                     // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Ajito_ch0700_C;                  // 0x05E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         StealthRate;                                       // 0x05F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PreviousSwitchMaterial;                            // 0x05F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42AD[0x3];                                     // 0x05F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     StealthMaterial;                                   // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMaterialSwitchCache                   MaterialSwitchCache;                               // 0x0600(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          MaterialSwitchActive;                              // 0x0610(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MaterialSwitchRestore;                             // 0x0611(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42AE[0x2];                                     // 0x0612(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaterialSwitchHandle;                              // 0x0614(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsStealthOn;                                       // 0x0618(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42AF[0x3];                                     // 0x0619(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StealthSpeed;                                      // 0x061C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Ajito_ch0700(int32 EntryPoint);
	void I_SetStealthForce(bool On);
	void Event_StealthOff();
	void Event_StealthOn();
	void ReceiveTick(float DeltaSeconds);
	void SetStealth(bool StealthOnIn);
	void SetMaterialParameter(float Rate);
	void SwitchMaterial(class UMaterialInterface* NewMaterial, TArray<class FName>& ExcludeMaterialSlots, int32* Handle);
	void SetMaterialScalarParameter(class FName PramName, float Value);
	void UpdateStealth(float DeltaSeconds);
	void Debug_StealthOn();
	void Debug_StealthOff();
	void RestoreSwitchMaterial(int32 Param_MaterialSwitchHandle, bool OneFrameSetting);
	void SetStealthForce(bool StealthOnIn);
	void Debug_StealthOnForce();
	void Debug_StealthOffForce();
	void IsStealth(bool* Return);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Ajito_ch0700_C">();
	}
	static class ABP_Ajito_ch0700_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Ajito_ch0700_C>();
	}
};
static_assert(alignof(ABP_Ajito_ch0700_C) == 0x000010, "Wrong alignment on ABP_Ajito_ch0700_C");
static_assert(sizeof(ABP_Ajito_ch0700_C) == 0x000620, "Wrong size on ABP_Ajito_ch0700_C");
static_assert(offsetof(ABP_Ajito_ch0700_C, UberGraphFrame_BP_Ajito_ch0700_C) == 0x0005E8, "Member 'ABP_Ajito_ch0700_C::UberGraphFrame_BP_Ajito_ch0700_C' has a wrong offset!");
static_assert(offsetof(ABP_Ajito_ch0700_C, StealthRate) == 0x0005F0, "Member 'ABP_Ajito_ch0700_C::StealthRate' has a wrong offset!");
static_assert(offsetof(ABP_Ajito_ch0700_C, PreviousSwitchMaterial) == 0x0005F4, "Member 'ABP_Ajito_ch0700_C::PreviousSwitchMaterial' has a wrong offset!");
static_assert(offsetof(ABP_Ajito_ch0700_C, StealthMaterial) == 0x0005F8, "Member 'ABP_Ajito_ch0700_C::StealthMaterial' has a wrong offset!");
static_assert(offsetof(ABP_Ajito_ch0700_C, MaterialSwitchCache) == 0x000600, "Member 'ABP_Ajito_ch0700_C::MaterialSwitchCache' has a wrong offset!");
static_assert(offsetof(ABP_Ajito_ch0700_C, MaterialSwitchActive) == 0x000610, "Member 'ABP_Ajito_ch0700_C::MaterialSwitchActive' has a wrong offset!");
static_assert(offsetof(ABP_Ajito_ch0700_C, MaterialSwitchRestore) == 0x000611, "Member 'ABP_Ajito_ch0700_C::MaterialSwitchRestore' has a wrong offset!");
static_assert(offsetof(ABP_Ajito_ch0700_C, MaterialSwitchHandle) == 0x000614, "Member 'ABP_Ajito_ch0700_C::MaterialSwitchHandle' has a wrong offset!");
static_assert(offsetof(ABP_Ajito_ch0700_C, IsStealthOn) == 0x000618, "Member 'ABP_Ajito_ch0700_C::IsStealthOn' has a wrong offset!");
static_assert(offsetof(ABP_Ajito_ch0700_C, StealthSpeed) == 0x00061C, "Member 'ABP_Ajito_ch0700_C::StealthSpeed' has a wrong offset!");

}

