#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AjitoNPCTalk_ch0200

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BP_AjitoNPCTalk_ch0200.BP_AjitoNPCTalk_ch0200_C.Check Exsist Kizuna EP
// 0x00B0 (0x00B0 - 0x0000)
struct BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP final
{
public:
	bool                                          IsKizunaEP;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A6A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckScenarioFlag_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A6B[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_GetProgressID_self_CastInput;             // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetProgressID_ProgressID;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckDLCQuestContentCheck_ReturnValue;    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A6C[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckDLCQuestContentCheck_ReturnValue_1;  // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A6D[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager_1;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager_2;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckScenarioFlag_ReturnValue_1;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckScenarioFlag_ReturnValue_2;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameClearState                               CallFunc_GetGameClearState_ReturnValue;            // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A6E[0x5];                                     // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager_3;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckScenarioFlag_ReturnValue_3;          // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A6F[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_1;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemNum_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A70[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_GetProgressID_self_CastInput_1;           // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetProgressID_ProgressID_1;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x009F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_11;                // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInterludeProgressInRange_ProgressInRange; // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInterludeProgressInRange_ProgressInRange_1; // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInterludeProgressInRange_ProgressInRange_2; // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A71[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CheckBondsEpisodeNum_FinshEpisode;        // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckInterludeProgressInRange_ProgressInRange_3; // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP) == 0x000008, "Wrong alignment on BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP");
static_assert(sizeof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP) == 0x0000B0, "Wrong size on BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, IsKizunaEP) == 0x000000, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::IsKizunaEP' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_GetSceneManager_SceneManager) == 0x000008, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_GetSceneManager_SceneManager' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_GetEventManager_EventManager) == 0x000010, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_CheckScenarioFlag_ReturnValue) == 0x000018, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_CheckScenarioFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_GetProgressID_self_CastInput) == 0x000020, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_GetProgressID_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_GetProgressID_ProgressID) == 0x000030, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_GetProgressID_ProgressID' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_CheckDLCQuestContentCheck_ReturnValue) == 0x000034, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_CheckDLCQuestContentCheck_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000035, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_Percent_IntInt_ReturnValue) == 0x000038, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue) == 0x00003C, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00003D, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_1) == 0x00003E, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_CheckDLCQuestContentCheck_ReturnValue_1) == 0x00003F, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_CheckDLCQuestContentCheck_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanOR_ReturnValue) == 0x000040, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_GetSceneManager_SceneManager_1) == 0x000048, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_GetSceneManager_SceneManager_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_GetSceneManager_SceneManager_2) == 0x000050, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_GetSceneManager_SceneManager_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_CheckScenarioFlag_ReturnValue_1) == 0x000058, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_CheckScenarioFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_CheckScenarioFlag_ReturnValue_2) == 0x000059, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_CheckScenarioFlag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_Not_PreBool_ReturnValue) == 0x00005A, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_Not_PreBool_ReturnValue_1) == 0x00005B, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_2) == 0x00005C, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_3) == 0x00005D, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_4) == 0x00005E, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_5) == 0x00005F, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_6) == 0x000060, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_7) == 0x000061, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_GetGameClearState_ReturnValue) == 0x000062, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_GetGameClearState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_GetSceneManager_SceneManager_3) == 0x000068, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_GetSceneManager_SceneManager_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000070, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_CheckScenarioFlag_ReturnValue_3) == 0x000071, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_CheckScenarioFlag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_GetEventManager_EventManager_1) == 0x000078, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_GetEventManager_EventManager_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_GetItemNum_ReturnValue) == 0x000080, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_GetItemNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_GetProgressID_self_CastInput_1) == 0x000088, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_GetProgressID_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_GetProgressID_ProgressID_1) == 0x000098, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_GetProgressID_ProgressID_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00009C, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x00009D, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_8) == 0x00009E, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_9) == 0x00009F, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_10) == 0x0000A0, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_BooleanAND_ReturnValue_11) == 0x0000A1, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_BooleanAND_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_CheckInterludeProgressInRange_ProgressInRange) == 0x0000A2, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_CheckInterludeProgressInRange_ProgressInRange' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_CheckInterludeProgressInRange_ProgressInRange_1) == 0x0000A3, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_CheckInterludeProgressInRange_ProgressInRange_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_CheckInterludeProgressInRange_ProgressInRange_2) == 0x0000A4, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_CheckInterludeProgressInRange_ProgressInRange_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_CheckBondsEpisodeNum_FinshEpisode) == 0x0000A8, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_CheckBondsEpisodeNum_FinshEpisode' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, CallFunc_CheckInterludeProgressInRange_ProgressInRange_3) == 0x0000AC, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::CallFunc_CheckInterludeProgressInRange_ProgressInRange_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP, K2Node_SwitchInteger_CmpSuccess) == 0x0000AD, "Member 'BP_AjitoNPCTalk_ch0200_C_Check_Exsist_Kizuna_EP::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function BP_AjitoNPCTalk_ch0200.BP_AjitoNPCTalk_ch0200_C.FreeWord_KizunaEP
// 0x0014 (0x0014 - 0x0000)
struct BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP final
{
public:
	bool                                          IsSwapKizunaEPFreeWord;                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A72[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBondsProgress_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     CallFunc_GetIsProgressBondsEpisode_playerID;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     CallFunc_GetIsProgressBondsEpisode_targetID;       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsProgressBondsEpisode_ReturnValue;    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_IntInt_ReturnValue;               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP) == 0x000004, "Wrong alignment on BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP");
static_assert(sizeof(BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP) == 0x000014, "Wrong size on BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP, IsSwapKizunaEPFreeWord) == 0x000000, "Member 'BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP::IsSwapKizunaEPFreeWord' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP, CallFunc_GetBondsProgress_ReturnValue) == 0x000004, "Member 'BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP::CallFunc_GetBondsProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP, CallFunc_GetIsProgressBondsEpisode_playerID) == 0x000008, "Member 'BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP::CallFunc_GetIsProgressBondsEpisode_playerID' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP, CallFunc_GetIsProgressBondsEpisode_targetID) == 0x000009, "Member 'BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP::CallFunc_GetIsProgressBondsEpisode_targetID' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP, CallFunc_GetIsProgressBondsEpisode_ReturnValue) == 0x00000A, "Member 'BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP::CallFunc_GetIsProgressBondsEpisode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP, CallFunc_InRange_IntInt_ReturnValue) == 0x00000B, "Member 'BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP::CallFunc_InRange_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000C, "Member 'BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00000D, "Member 'BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP, CallFunc_BooleanAND_ReturnValue) == 0x00000E, "Member 'BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP, CallFunc_BooleanAND_ReturnValue_1) == 0x00000F, "Member 'BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP, CallFunc_BooleanAND_ReturnValue_2) == 0x000010, "Member 'BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP, CallFunc_BooleanAND_ReturnValue_3) == 0x000011, "Member 'BP_AjitoNPCTalk_ch0200_C_FreeWord_KizunaEP::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");

}

