#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AjitoPlacementManagerBase

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BP_AjitoPlacementManagerBase.BP_AjitoPlacementManagerBase_C.Reset Placement Presented Items
// 0x0210 (0x0210 - 0x0000)
struct BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items final
{
public:
	int32                                         RemoveItemIndex;                                   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     L_curPlayerId;                                     // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DE3[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurProgressId;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NeedProgressIdEx;                                  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEx;                                              // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     L_playerId;                                        // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DE4[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NeedProgressId;                                    // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPresented;                                       // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DE5[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   VisibleTag;                                        // 0x001C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   HideItemTagInUse;                                  // 0x0024(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ItemName;                                          // 0x002C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DE6[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 HideItemActorInUse;                                // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ItemActor;                                         // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPresentInfoData>               ItemInfos;                                         // 0x0048(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_8;                               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_9;                               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_10;                              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_11;                              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_12;                              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_13;                              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     Temp_byte_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DE7[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DE8[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_14;                              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_15;                              // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DE9[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_16;                              // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_17;                              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_18;                              // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_19;                              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_20;                              // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_21;                              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DEA[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_GetProgressID_self_CastInput;             // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetProgressID_ProgressID;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     Temp_byte_Variable_1;                              // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClearScenario_Cleared;                  // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DEB[0x1];                                     // 0x00FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_22;                              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DEC[0x2];                                     // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable_2;                      // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_23;                              // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsClearScenario_Cleared_1;                // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DED[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     CallFunc_GetBattleMemberPlayerID_ReturnValue;      // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DEE[0x3];                                     // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPresentInfoData>               CallFunc_GetHasPresentedItemInfoList_itemList;     // 0x0130(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_GetHasPresentedItemInfoList_ReturnValue;  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DEF[0x3];                                     // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DF0[0x3];                                     // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DF1[0x3];                                     // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_3;                      // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DF2[0x3];                                     // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager_1;         // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue;                    // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IPlayerInterface>      K2Node_DynamicCast_AsPlayer_Interface;             // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue;                  // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DF3[0x2];                                     // 0x0182(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_24;                              // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DF4[0x3];                                     // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Right_ReturnValue;                        // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemPresented_Presented;                // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DF5[0x3];                                     // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue;               // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DF6[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPresentInfoData>               CallFunc_GetHasPresentedItemInfoList_itemList_1;   // 0x01C8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_GetHasPresentedItemInfoList_ReturnValue_1; // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DF7[0x3];                                     // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DF8[0x4];                                     // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Right_ReturnValue_1;                      // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_1;           // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue_1;             // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items) == 0x000008, "Wrong alignment on BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items");
static_assert(sizeof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items) == 0x000210, "Wrong size on BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, RemoveItemIndex) == 0x000000, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::RemoveItemIndex' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, L_curPlayerId) == 0x000004, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::L_curPlayerId' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CurProgressId) == 0x000008, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CurProgressId' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, NeedProgressIdEx) == 0x00000C, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::NeedProgressIdEx' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, IsEx) == 0x000010, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::IsEx' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, L_playerId) == 0x000011, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::L_playerId' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, NeedProgressId) == 0x000014, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::NeedProgressId' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, IsPresented) == 0x000018, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::IsPresented' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, VisibleTag) == 0x00001C, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::VisibleTag' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, HideItemTagInUse) == 0x000024, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::HideItemTagInUse' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, ItemName) == 0x00002C, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::ItemName' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, HideItemActorInUse) == 0x000038, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::HideItemActorInUse' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, ItemActor) == 0x000040, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::ItemActor' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, ItemInfos) == 0x000048, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::ItemInfos' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable) == 0x000058, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable_1) == 0x00005C, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable_2) == 0x000060, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable_3) == 0x000064, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable_4) == 0x000068, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable_5) == 0x00006C, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable_6) == 0x000070, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable_7) == 0x000074, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable_8) == 0x000078, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable_9) == 0x00007C, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable_10) == 0x000080, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable_11) == 0x000084, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable_12) == 0x000088, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable_12' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable_13) == 0x00008C, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable_13' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_byte_Variable) == 0x000090, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Loop_Num_Variable) == 0x000094, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Array_Index_Variable) == 0x000098, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Loop_Counter_Variable) == 0x00009C, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Array_Index_Variable_1) == 0x0000A4, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Loop_Num_Variable_1) == 0x0000A8, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_Less_IntInt_ReturnValue) == 0x0000AC, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable_14) == 0x0000B0, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable_14' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable_15) == 0x0000B4, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable_15' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Loop_Counter_Variable_1) == 0x0000B8, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000BC, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000C0, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable_16) == 0x0000C4, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable_16' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable_17) == 0x0000C8, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable_17' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable_18) == 0x0000CC, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable_18' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable_19) == 0x0000D0, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable_19' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable_20) == 0x0000D4, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable_20' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable_21) == 0x0000D8, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable_21' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_GetEventManager_EventManager) == 0x0000E0, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_GetProgressID_self_CastInput) == 0x0000E8, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_GetProgressID_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_GetProgressID_ProgressID) == 0x0000F8, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_GetProgressID_ProgressID' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_byte_Variable_1) == 0x0000FC, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_IsClearScenario_Cleared) == 0x0000FD, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_IsClearScenario_Cleared' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000FE, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable_22) == 0x000100, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable_22' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_BooleanAND_ReturnValue) == 0x000104, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000105, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Loop_Num_Variable_2) == 0x000108, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Loop_Num_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable_23) == 0x00010C, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable_23' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000110, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_IsClearScenario_Cleared_1) == 0x000111, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_IsClearScenario_Cleared_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_BooleanAND_ReturnValue_1) == 0x000112, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000113, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_GetPlayerManager_PlayerManager) == 0x000118, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Array_Index_Variable_2) == 0x000120, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_GetBattleMemberPlayerID_ReturnValue) == 0x000124, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_GetBattleMemberPlayerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Loop_Counter_Variable_2) == 0x000128, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_Add_IntInt_ReturnValue_2) == 0x00012C, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_GetHasPresentedItemInfoList_itemList) == 0x000130, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_GetHasPresentedItemInfoList_itemList' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_GetHasPresentedItemInfoList_ReturnValue) == 0x000140, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_GetHasPresentedItemInfoList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_Array_Length_ReturnValue) == 0x000144, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000148, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Loop_Counter_Variable_3) == 0x00014C, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_Less_IntInt_ReturnValue_2) == 0x000150, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_Add_IntInt_ReturnValue_3) == 0x000154, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Loop_Num_Variable_3) == 0x000158, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Loop_Num_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_Less_IntInt_ReturnValue_3) == 0x00015C, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_GetPlayerManager_PlayerManager_1) == 0x000160, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_GetPlayerManager_PlayerManager_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_GetPlayer_ReturnValue) == 0x000168, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_GetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, K2Node_DynamicCast_AsPlayer_Interface) == 0x000170, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::K2Node_DynamicCast_AsPlayer_Interface' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, K2Node_DynamicCast_bSuccess) == 0x000180, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_GetPlayerID_ReturnValue) == 0x000181, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_GetPlayerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_Array_Length_ReturnValue_1) == 0x000184, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Variable_24) == 0x000188, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Variable_24' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_BooleanOR_ReturnValue) == 0x00018C, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, K2Node_Select_Default) == 0x000190, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, Temp_int_Array_Index_Variable_3) == 0x000194, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_Conv_NameToString_ReturnValue) == 0x000198, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_Right_ReturnValue) == 0x0001A8, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_Right_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_IsItemPresented_Presented) == 0x0001B8, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_IsItemPresented_Presented' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_Conv_StringToInt_ReturnValue) == 0x0001BC, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_InRange_IntInt_ReturnValue) == 0x0001C0, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_InRange_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_GetHasPresentedItemInfoList_itemList_1) == 0x0001C8, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_GetHasPresentedItemInfoList_itemList_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_GetHasPresentedItemInfoList_ReturnValue_1) == 0x0001D8, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_GetHasPresentedItemInfoList_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_Array_Length_ReturnValue_2) == 0x0001DC, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_Array_Length_ReturnValue_3) == 0x0001E0, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0001E8, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_Right_ReturnValue_1) == 0x0001F8, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_Right_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_Conv_StringToInt_ReturnValue_1) == 0x000208, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_Conv_StringToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items, CallFunc_InRange_IntInt_ReturnValue_1) == 0x00020C, "Member 'BP_AjitoPlacementManagerBase_C_Reset_Placement_Presented_Items::CallFunc_InRange_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_AjitoPlacementManagerBase.BP_AjitoPlacementManagerBase_C.SetItemVisible
// 0x0068 (0x0068 - 0x0000)
struct BP_AjitoPlacementManagerBase_C_SetItemVisible final
{
public:
	class FName                                   ItemName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Visible;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DF9[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetActorByItemName_Actor;                 // 0x0010(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetActorByItemName_HiddenActor;           // 0x0020(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DFA[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DFB[0x2];                                     // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DFC[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AjitoPlacementManagerBase_C_SetItemVisible) == 0x000008, "Wrong alignment on BP_AjitoPlacementManagerBase_C_SetItemVisible");
static_assert(sizeof(BP_AjitoPlacementManagerBase_C_SetItemVisible) == 0x000068, "Wrong size on BP_AjitoPlacementManagerBase_C_SetItemVisible");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetItemVisible, ItemName) == 0x000000, "Member 'BP_AjitoPlacementManagerBase_C_SetItemVisible::ItemName' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetItemVisible, Visible) == 0x000008, "Member 'BP_AjitoPlacementManagerBase_C_SetItemVisible::Visible' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetItemVisible, Temp_int_Loop_Num_Variable) == 0x00000C, "Member 'BP_AjitoPlacementManagerBase_C_SetItemVisible::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetItemVisible, CallFunc_GetActorByItemName_Actor) == 0x000010, "Member 'BP_AjitoPlacementManagerBase_C_SetItemVisible::CallFunc_GetActorByItemName_Actor' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetItemVisible, CallFunc_GetActorByItemName_HiddenActor) == 0x000020, "Member 'BP_AjitoPlacementManagerBase_C_SetItemVisible::CallFunc_GetActorByItemName_HiddenActor' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetItemVisible, Temp_int_Array_Index_Variable) == 0x000030, "Member 'BP_AjitoPlacementManagerBase_C_SetItemVisible::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetItemVisible, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'BP_AjitoPlacementManagerBase_C_SetItemVisible::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetItemVisible, CallFunc_Array_Length_ReturnValue_1) == 0x000038, "Member 'BP_AjitoPlacementManagerBase_C_SetItemVisible::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetItemVisible, CallFunc_Array_Length_ReturnValue_2) == 0x00003C, "Member 'BP_AjitoPlacementManagerBase_C_SetItemVisible::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetItemVisible, CallFunc_Greater_IntInt_ReturnValue) == 0x000040, "Member 'BP_AjitoPlacementManagerBase_C_SetItemVisible::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetItemVisible, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'BP_AjitoPlacementManagerBase_C_SetItemVisible::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetItemVisible, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'BP_AjitoPlacementManagerBase_C_SetItemVisible::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetItemVisible, Temp_int_Array_Index_Variable_1) == 0x00004C, "Member 'BP_AjitoPlacementManagerBase_C_SetItemVisible::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetItemVisible, Temp_int_Loop_Num_Variable_1) == 0x000050, "Member 'BP_AjitoPlacementManagerBase_C_SetItemVisible::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetItemVisible, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'BP_AjitoPlacementManagerBase_C_SetItemVisible::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetItemVisible, CallFunc_Not_PreBool_ReturnValue) == 0x000055, "Member 'BP_AjitoPlacementManagerBase_C_SetItemVisible::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetItemVisible, Temp_int_Loop_Counter_Variable_1) == 0x000058, "Member 'BP_AjitoPlacementManagerBase_C_SetItemVisible::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetItemVisible, CallFunc_Less_IntInt_ReturnValue_1) == 0x00005C, "Member 'BP_AjitoPlacementManagerBase_C_SetItemVisible::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetItemVisible, CallFunc_Add_IntInt_ReturnValue_1) == 0x000060, "Member 'BP_AjitoPlacementManagerBase_C_SetItemVisible::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_AjitoPlacementManagerBase.BP_AjitoPlacementManagerBase_C.SetAllItemVisible
// 0x001C (0x001C - 0x0000)
struct BP_AjitoPlacementManagerBase_C_SetAllItemVisible final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DFD[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DFE[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AjitoPlacementManagerBase_C_SetAllItemVisible) == 0x000004, "Wrong alignment on BP_AjitoPlacementManagerBase_C_SetAllItemVisible");
static_assert(sizeof(BP_AjitoPlacementManagerBase_C_SetAllItemVisible) == 0x00001C, "Wrong size on BP_AjitoPlacementManagerBase_C_SetAllItemVisible");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetAllItemVisible, Visible) == 0x000000, "Member 'BP_AjitoPlacementManagerBase_C_SetAllItemVisible::Visible' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetAllItemVisible, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_AjitoPlacementManagerBase_C_SetAllItemVisible::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetAllItemVisible, Temp_int_Loop_Num_Variable) == 0x000008, "Member 'BP_AjitoPlacementManagerBase_C_SetAllItemVisible::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetAllItemVisible, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_AjitoPlacementManagerBase_C_SetAllItemVisible::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetAllItemVisible, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'BP_AjitoPlacementManagerBase_C_SetAllItemVisible::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AjitoPlacementManagerBase_C_SetAllItemVisible, CallFunc_Less_IntInt_ReturnValue) == 0x000011, "Member 'BP_AjitoPlacementManagerBase_C_SetAllItemVisible::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
