#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ajito_ch0600

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Ajito_ch0600.BP_Ajito_ch0600_C.InitializeActionSystem
// 0x001C (0x001C - 0x0000)
struct BP_Ajito_ch0600_C_InitializeActionSystem final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Ajito_ch0600_C_InitializeActionSystem) == 0x000004, "Wrong alignment on BP_Ajito_ch0600_C_InitializeActionSystem");
static_assert(sizeof(BP_Ajito_ch0600_C_InitializeActionSystem) == 0x00001C, "Wrong size on BP_Ajito_ch0600_C_InitializeActionSystem");
static_assert(offsetof(BP_Ajito_ch0600_C_InitializeActionSystem, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'BP_Ajito_ch0600_C_InitializeActionSystem::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0600_C_InitializeActionSystem, CallFunc_BreakVector_X) == 0x00000C, "Member 'BP_Ajito_ch0600_C_InitializeActionSystem::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0600_C_InitializeActionSystem, CallFunc_BreakVector_Y) == 0x000010, "Member 'BP_Ajito_ch0600_C_InitializeActionSystem::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0600_C_InitializeActionSystem, CallFunc_BreakVector_Z) == 0x000014, "Member 'BP_Ajito_ch0600_C_InitializeActionSystem::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0600_C_InitializeActionSystem, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_Ajito_ch0600_C_InitializeActionSystem::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

}

