#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AttackEmitter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FAttackEmitterInfo_structs.hpp"
#include "EAttackEmitterMode_structs.hpp"


namespace SDK::Params
{

// Function BP_AttackEmitter.BP_AttackEmitter_C.ExecuteUbergraph_BP_AttackEmitter
// 0x0008 (0x0008 - 0x0000)
struct BP_AttackEmitter_C_ExecuteUbergraph_BP_AttackEmitter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AttackEmitter_C_ExecuteUbergraph_BP_AttackEmitter) == 0x000004, "Wrong alignment on BP_AttackEmitter_C_ExecuteUbergraph_BP_AttackEmitter");
static_assert(sizeof(BP_AttackEmitter_C_ExecuteUbergraph_BP_AttackEmitter) == 0x000008, "Wrong size on BP_AttackEmitter_C_ExecuteUbergraph_BP_AttackEmitter");
static_assert(offsetof(BP_AttackEmitter_C_ExecuteUbergraph_BP_AttackEmitter, EntryPoint) == 0x000000, "Member 'BP_AttackEmitter_C_ExecuteUbergraph_BP_AttackEmitter::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_ExecuteUbergraph_BP_AttackEmitter, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_AttackEmitter_C_ExecuteUbergraph_BP_AttackEmitter::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_AttackEmitter.BP_AttackEmitter_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AttackEmitter_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AttackEmitter_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AttackEmitter_C_ReceiveTick");
static_assert(sizeof(BP_AttackEmitter_C_ReceiveTick) == 0x000004, "Wrong size on BP_AttackEmitter_C_ReceiveTick");
static_assert(offsetof(BP_AttackEmitter_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AttackEmitter_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AttackEmitter.BP_AttackEmitter_C.Start
// 0x00C8 (0x00C8 - 0x0000)
struct BP_AttackEmitter_C_Start final
{
public:
	class UClass*                                 Param_Class;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFAttackEmitterInfo>            AttackInfo;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	float                                         Param_Interval;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttackEmitterMode                            Mode;                                              // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_820E[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_820F[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8210[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetCurrentTargetActor_TargetActor;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8211[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8212[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8213[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AttackEmitter_C_Start) == 0x000008, "Wrong alignment on BP_AttackEmitter_C_Start");
static_assert(sizeof(BP_AttackEmitter_C_Start) == 0x0000C8, "Wrong size on BP_AttackEmitter_C_Start");
static_assert(offsetof(BP_AttackEmitter_C_Start, Param_Class) == 0x000000, "Member 'BP_AttackEmitter_C_Start::Param_Class' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, AttackInfo) == 0x000008, "Member 'BP_AttackEmitter_C_Start::AttackInfo' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, Param_Interval) == 0x000018, "Member 'BP_AttackEmitter_C_Start::Param_Interval' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, Mode) == 0x00001C, "Member 'BP_AttackEmitter_C_Start::Mode' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001D, "Member 'BP_AttackEmitter_C_Start::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_AttackEmitter_C_Start::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'BP_AttackEmitter_C_Start::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, CallFunc_GetOwner_ReturnValue_1) == 0x000030, "Member 'BP_AttackEmitter_C_Start::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, K2Node_DynamicCast_AsRSBattle_Player) == 0x000038, "Member 'BP_AttackEmitter_C_Start::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_AttackEmitter_C_Start::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, CallFunc_GetActorForwardVector_ReturnValue) == 0x000044, "Member 'BP_AttackEmitter_C_Start::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, CallFunc_GetCurrentTargetActor_TargetActor) == 0x000050, "Member 'BP_AttackEmitter_C_Start::CallFunc_GetCurrentTargetActor_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BP_AttackEmitter_C_Start::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00005C, "Member 'BP_AttackEmitter_C_Start::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000068, "Member 'BP_AttackEmitter_C_Start::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000074, "Member 'BP_AttackEmitter_C_Start::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, CallFunc_BreakVector_X) == 0x000080, "Member 'BP_AttackEmitter_C_Start::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, CallFunc_BreakVector_Y) == 0x000084, "Member 'BP_AttackEmitter_C_Start::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, CallFunc_BreakVector_Z) == 0x000088, "Member 'BP_AttackEmitter_C_Start::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, CallFunc_MakeVector_ReturnValue) == 0x00008C, "Member 'BP_AttackEmitter_C_Start::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, CallFunc_Normal_ReturnValue) == 0x000098, "Member 'BP_AttackEmitter_C_Start::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, Temp_int_Loop_Counter_Variable) == 0x0000A4, "Member 'BP_AttackEmitter_C_Start::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'BP_AttackEmitter_C_Start::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, CallFunc_Greater_IntInt_ReturnValue) == 0x0000AC, "Member 'BP_AttackEmitter_C_Start::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, Temp_int_Loop_Num_Variable) == 0x0000B0, "Member 'BP_AttackEmitter_C_Start::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, CallFunc_Less_IntInt_ReturnValue) == 0x0000B4, "Member 'BP_AttackEmitter_C_Start::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, Temp_int_Array_Index_Variable) == 0x0000B8, "Member 'BP_AttackEmitter_C_Start::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000BC, "Member 'BP_AttackEmitter_C_Start::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, CallFunc_Array_Length_ReturnValue_1) == 0x0000C0, "Member 'BP_AttackEmitter_C_Start::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Start, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000C4, "Member 'BP_AttackEmitter_C_Start::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_AttackEmitter.BP_AttackEmitter_C.Update
// 0x0018 (0x0018 - 0x0000)
struct BP_AttackEmitter_C_Update final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8214[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOver_ReturnValue;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AttackEmitter_C_Update) == 0x000008, "Wrong alignment on BP_AttackEmitter_C_Update");
static_assert(sizeof(BP_AttackEmitter_C_Update) == 0x000018, "Wrong size on BP_AttackEmitter_C_Update");
static_assert(offsetof(BP_AttackEmitter_C_Update, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'BP_AttackEmitter_C_Update::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Update, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000001, "Member 'BP_AttackEmitter_C_Update::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Update, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_AttackEmitter_C_Update::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Update, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_AttackEmitter_C_Update::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_Update, CallFunc_IsOver_ReturnValue) == 0x000010, "Member 'BP_AttackEmitter_C_Update::CallFunc_IsOver_ReturnValue' has a wrong offset!");

// Function BP_AttackEmitter.BP_AttackEmitter_C.SetAttack
// 0x00F0 (0x00F0 - 0x0000)
struct BP_AttackEmitter_C_SetAttack final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LRotate;                                           // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFAttackEmitterInfo                    LInfo;                                             // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LAddAngle;                                         // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LStartAngle;                                       // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LLastIndex;                                        // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EREDActorStatType                             CallFunc_GetActorStatType_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8215[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8216[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8217[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8218[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SimpleAttackActor_C*                K2Node_DynamicCast_AsBP_Simple_Attack_Actor;       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AttackEmitter_C_SetAttack) == 0x000010, "Wrong alignment on BP_AttackEmitter_C_SetAttack");
static_assert(sizeof(BP_AttackEmitter_C_SetAttack) == 0x0000F0, "Wrong size on BP_AttackEmitter_C_SetAttack");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, Param_Index) == 0x000000, "Member 'BP_AttackEmitter_C_SetAttack::Param_Index' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, LRotate) == 0x000004, "Member 'BP_AttackEmitter_C_SetAttack::LRotate' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, LInfo) == 0x000010, "Member 'BP_AttackEmitter_C_SetAttack::LInfo' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, LAddAngle) == 0x00001C, "Member 'BP_AttackEmitter_C_SetAttack::LAddAngle' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, LStartAngle) == 0x000020, "Member 'BP_AttackEmitter_C_SetAttack::LStartAngle' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, LLastIndex) == 0x000024, "Member 'BP_AttackEmitter_C_SetAttack::LLastIndex' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'BP_AttackEmitter_C_SetAttack::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, CallFunc_GetActorStatType_ReturnValue) == 0x000030, "Member 'BP_AttackEmitter_C_SetAttack::CallFunc_GetActorStatType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, CallFunc_GetOwner_ReturnValue_1) == 0x000038, "Member 'BP_AttackEmitter_C_SetAttack::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, Temp_int_Variable) == 0x000040, "Member 'BP_AttackEmitter_C_SetAttack::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000044, "Member 'BP_AttackEmitter_C_SetAttack::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'BP_AttackEmitter_C_SetAttack::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00004C, "Member 'BP_AttackEmitter_C_SetAttack::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000050, "Member 'BP_AttackEmitter_C_SetAttack::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000054, "Member 'BP_AttackEmitter_C_SetAttack::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, CallFunc_Subtract_IntInt_ReturnValue) == 0x000060, "Member 'BP_AttackEmitter_C_SetAttack::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, CallFunc_Greater_IntInt_ReturnValue) == 0x000064, "Member 'BP_AttackEmitter_C_SetAttack::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000068, "Member 'BP_AttackEmitter_C_SetAttack::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00006C, "Member 'BP_AttackEmitter_C_SetAttack::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000070, "Member 'BP_AttackEmitter_C_SetAttack::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, CallFunc_Add_FloatFloat_ReturnValue) == 0x000074, "Member 'BP_AttackEmitter_C_SetAttack::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, CallFunc_MakeRotator_ReturnValue) == 0x000078, "Member 'BP_AttackEmitter_C_SetAttack::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000084, "Member 'BP_AttackEmitter_C_SetAttack::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x000088, "Member 'BP_AttackEmitter_C_SetAttack::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, CallFunc_Add_VectorVector_ReturnValue) == 0x000094, "Member 'BP_AttackEmitter_C_SetAttack::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, CallFunc_MakeTransform_ReturnValue) == 0x0000A0, "Member 'BP_AttackEmitter_C_SetAttack::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000D0, "Member 'BP_AttackEmitter_C_SetAttack::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000D8, "Member 'BP_AttackEmitter_C_SetAttack::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, K2Node_DynamicCast_AsBP_Simple_Attack_Actor) == 0x0000E0, "Member 'BP_AttackEmitter_C_SetAttack::K2Node_DynamicCast_AsBP_Simple_Attack_Actor' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttack, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'BP_AttackEmitter_C_SetAttack::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_AttackEmitter.BP_AttackEmitter_C.SetAttackSearchEnemy
// 0x0360 (0x0360 - 0x0000)
struct BP_AttackEmitter_C_SetAttackSearchEnemy final
{
public:
	int32                                         Attack_index_in;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LHitNrl;                                           // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 LMinEm;                                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LMinFound;                                         // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8219[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LMinDistSq;                                        // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LWorkVec;                                          // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_821A[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LWorkEm;                                           // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         LInAngleEmList;                                    // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	float                                         LSearchAngle;                                      // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LSearchRangeSq;                                    // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LSearchMax;                                        // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFAttackEmitterInfo                    LInfo;                                             // 0x0054(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         LEmList;                                           // 0x0060(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_821B[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_821C[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_821D[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EnemyManager_C*                     CallFunc_GetEnemyManager_Manager;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_821E[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Square_ReturnValue;                       // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_821F[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8220[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8221[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0118(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8222[0x3];                                     // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0140(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8223[0x3];                                     // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8224[0x2];                                     // 0x01D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8225[0x4];                                     // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8226[0x2];                                     // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8227[0x3];                                     // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_2;                      // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0265(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8228[0x2];                                     // 0x0266(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_3;                      // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8229[0x3];                                     // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0284(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegCos_ReturnValue;                       // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0294(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_822A[0x3];                                     // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_822B[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           Temp_object_Variable_1;                            // 0x02B8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_822C[0x3];                                     // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x02E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_822D[0xC];                                     // 0x02F4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0300(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_822E[0x4];                                     // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SimpleAttackActor_C*                K2Node_DynamicCast_AsBP_Simple_Attack_Actor;       // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AttackEmitter_C_SetAttackSearchEnemy) == 0x000010, "Wrong alignment on BP_AttackEmitter_C_SetAttackSearchEnemy");
static_assert(sizeof(BP_AttackEmitter_C_SetAttackSearchEnemy) == 0x000360, "Wrong size on BP_AttackEmitter_C_SetAttackSearchEnemy");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, Attack_index_in) == 0x000000, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::Attack_index_in' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, LHitNrl) == 0x000004, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::LHitNrl' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, LMinEm) == 0x000010, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::LMinEm' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, LMinFound) == 0x000018, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::LMinFound' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, LMinDistSq) == 0x00001C, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::LMinDistSq' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, LWorkVec) == 0x000020, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::LWorkVec' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, LWorkEm) == 0x000030, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::LWorkEm' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, LInAngleEmList) == 0x000038, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::LInAngleEmList' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, LSearchAngle) == 0x000048, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::LSearchAngle' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, LSearchRangeSq) == 0x00004C, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::LSearchRangeSq' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, LSearchMax) == 0x000050, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::LSearchMax' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, LInfo) == 0x000054, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::LInfo' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, LEmList) == 0x000060, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::LEmList' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, Temp_int_Loop_Counter_Variable) == 0x000070, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000078, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, Temp_int_Loop_Counter_Variable_1) == 0x000084, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, CallFunc_Add_IntInt_ReturnValue_1) == 0x000088, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, Temp_bool_True_if_break_was_hit_Variable) == 0x00008C, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, Temp_int_Array_Index_Variable) == 0x000090, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, CallFunc_Not_PreBool_ReturnValue) == 0x000094, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, Temp_int_Loop_Num_Variable) == 0x000098, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, Temp_int_Array_Index_Variable_1) == 0x00009C, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, Temp_int_Loop_Num_Variable_1) == 0x0000A0, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, CallFunc_Less_IntInt_ReturnValue) == 0x0000A4, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, CallFunc_GetEnemyManager_Manager) == 0x0000A8, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::CallFunc_GetEnemyManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, CallFunc_BooleanAND_ReturnValue) == 0x0000B0, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, Temp_int_Loop_Counter_Variable_2) == 0x0000B4, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000B8, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, Temp_int_Array_Index_Variable_2) == 0x0000BC, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, CallFunc_GetOwner_ReturnValue) == 0x0000C0, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, CallFunc_Square_ReturnValue) == 0x0000C8, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::CallFunc_Square_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, K2Node_MakeArray_Array) == 0x0000D0, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, CallFunc_VSizeSquared_ReturnValue) == 0x0000E0, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, CallFunc_GetOwner_ReturnValue_1) == 0x0000E8, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000F0, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, CallFunc_Array_Length_ReturnValue) == 0x0000FC, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, Temp_int_Loop_Counter_Variable_3) == 0x000100, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000104, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AttackEmitter_C_SetAttackSearchEnemy, CallFunc_Less_IntInt_ReturnValue_1) == 0x000110, "Member 'BP_AttackEmitter_C_SetAttackSearchEnemy::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
