#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ajito_ch0700

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Ajito_ch0700.BP_Ajito_ch0700_C.ExecuteUbergraph_BP_Ajito_ch0700
// 0x000C (0x000C - 0x0000)
struct BP_Ajito_ch0700_C_ExecuteUbergraph_BP_Ajito_ch0700 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_on;                                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42B0[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Ajito_ch0700_C_ExecuteUbergraph_BP_Ajito_ch0700) == 0x000004, "Wrong alignment on BP_Ajito_ch0700_C_ExecuteUbergraph_BP_Ajito_ch0700");
static_assert(sizeof(BP_Ajito_ch0700_C_ExecuteUbergraph_BP_Ajito_ch0700) == 0x00000C, "Wrong size on BP_Ajito_ch0700_C_ExecuteUbergraph_BP_Ajito_ch0700");
static_assert(offsetof(BP_Ajito_ch0700_C_ExecuteUbergraph_BP_Ajito_ch0700, EntryPoint) == 0x000000, "Member 'BP_Ajito_ch0700_C_ExecuteUbergraph_BP_Ajito_ch0700::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_ExecuteUbergraph_BP_Ajito_ch0700, K2Node_Event_on) == 0x000004, "Member 'BP_Ajito_ch0700_C_ExecuteUbergraph_BP_Ajito_ch0700::K2Node_Event_on' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_ExecuteUbergraph_BP_Ajito_ch0700, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_Ajito_ch0700_C_ExecuteUbergraph_BP_Ajito_ch0700::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_Ajito_ch0700.BP_Ajito_ch0700_C.I_SetStealthForce
// 0x0001 (0x0001 - 0x0000)
struct BP_Ajito_ch0700_C_I_SetStealthForce final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Ajito_ch0700_C_I_SetStealthForce) == 0x000001, "Wrong alignment on BP_Ajito_ch0700_C_I_SetStealthForce");
static_assert(sizeof(BP_Ajito_ch0700_C_I_SetStealthForce) == 0x000001, "Wrong size on BP_Ajito_ch0700_C_I_SetStealthForce");
static_assert(offsetof(BP_Ajito_ch0700_C_I_SetStealthForce, On) == 0x000000, "Member 'BP_Ajito_ch0700_C_I_SetStealthForce::On' has a wrong offset!");

// Function BP_Ajito_ch0700.BP_Ajito_ch0700_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Ajito_ch0700_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Ajito_ch0700_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Ajito_ch0700_C_ReceiveTick");
static_assert(sizeof(BP_Ajito_ch0700_C_ReceiveTick) == 0x000004, "Wrong size on BP_Ajito_ch0700_C_ReceiveTick");
static_assert(offsetof(BP_Ajito_ch0700_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Ajito_ch0700_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Ajito_ch0700.BP_Ajito_ch0700_C.SetStealth
// 0x0001 (0x0001 - 0x0000)
struct BP_Ajito_ch0700_C_SetStealth final
{
public:
	bool                                          StealthOnIn;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Ajito_ch0700_C_SetStealth) == 0x000001, "Wrong alignment on BP_Ajito_ch0700_C_SetStealth");
static_assert(sizeof(BP_Ajito_ch0700_C_SetStealth) == 0x000001, "Wrong size on BP_Ajito_ch0700_C_SetStealth");
static_assert(offsetof(BP_Ajito_ch0700_C_SetStealth, StealthOnIn) == 0x000000, "Member 'BP_Ajito_ch0700_C_SetStealth::StealthOnIn' has a wrong offset!");

// Function BP_Ajito_ch0700.BP_Ajito_ch0700_C.SetMaterialParameter
// 0x0030 (0x0030 - 0x0000)
struct BP_Ajito_ch0700_C_SetMaterialParameter final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaterialStealthParam_StealthRate;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaterialStealthParam_BaseMatVanish;    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMaterialStealthParam_IsStealthMat;     // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42B1[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_SwitchMaterial_Handle;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Ajito_ch0700_C_SetMaterialParameter) == 0x000008, "Wrong alignment on BP_Ajito_ch0700_C_SetMaterialParameter");
static_assert(sizeof(BP_Ajito_ch0700_C_SetMaterialParameter) == 0x000030, "Wrong size on BP_Ajito_ch0700_C_SetMaterialParameter");
static_assert(offsetof(BP_Ajito_ch0700_C_SetMaterialParameter, Rate) == 0x000000, "Member 'BP_Ajito_ch0700_C_SetMaterialParameter::Rate' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_SetMaterialParameter, CallFunc_GetMaterialStealthParam_StealthRate) == 0x000004, "Member 'BP_Ajito_ch0700_C_SetMaterialParameter::CallFunc_GetMaterialStealthParam_StealthRate' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_SetMaterialParameter, CallFunc_GetMaterialStealthParam_BaseMatVanish) == 0x000008, "Member 'BP_Ajito_ch0700_C_SetMaterialParameter::CallFunc_GetMaterialStealthParam_BaseMatVanish' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_SetMaterialParameter, CallFunc_GetMaterialStealthParam_IsStealthMat) == 0x00000C, "Member 'BP_Ajito_ch0700_C_SetMaterialParameter::CallFunc_GetMaterialStealthParam_IsStealthMat' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_SetMaterialParameter, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_Ajito_ch0700_C_SetMaterialParameter::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_SetMaterialParameter, CallFunc_SelectFloat_ReturnValue) == 0x000014, "Member 'BP_Ajito_ch0700_C_SetMaterialParameter::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_SetMaterialParameter, K2Node_MakeArray_Array) == 0x000018, "Member 'BP_Ajito_ch0700_C_SetMaterialParameter::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_SetMaterialParameter, CallFunc_SwitchMaterial_Handle) == 0x000028, "Member 'BP_Ajito_ch0700_C_SetMaterialParameter::CallFunc_SwitchMaterial_Handle' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_SetMaterialParameter, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x00002C, "Member 'BP_Ajito_ch0700_C_SetMaterialParameter::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function BP_Ajito_ch0700.BP_Ajito_ch0700_C.SwitchMaterial
// 0x0028 (0x0028 - 0x0000)
struct BP_Ajito_ch0700_C_SwitchMaterial final
{
public:
	class UMaterialInterface*                     NewMaterial;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           ExcludeMaterialSlots;                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	int32                                         Handle;                                            // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42B2[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SwitchMaterialExclude_LayerID;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Ajito_ch0700_C_SwitchMaterial) == 0x000008, "Wrong alignment on BP_Ajito_ch0700_C_SwitchMaterial");
static_assert(sizeof(BP_Ajito_ch0700_C_SwitchMaterial) == 0x000028, "Wrong size on BP_Ajito_ch0700_C_SwitchMaterial");
static_assert(offsetof(BP_Ajito_ch0700_C_SwitchMaterial, NewMaterial) == 0x000000, "Member 'BP_Ajito_ch0700_C_SwitchMaterial::NewMaterial' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_SwitchMaterial, ExcludeMaterialSlots) == 0x000008, "Member 'BP_Ajito_ch0700_C_SwitchMaterial::ExcludeMaterialSlots' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_SwitchMaterial, Handle) == 0x000018, "Member 'BP_Ajito_ch0700_C_SwitchMaterial::Handle' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_SwitchMaterial, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'BP_Ajito_ch0700_C_SwitchMaterial::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_SwitchMaterial, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_Ajito_ch0700_C_SwitchMaterial::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_SwitchMaterial, CallFunc_SwitchMaterialExclude_LayerID) == 0x000024, "Member 'BP_Ajito_ch0700_C_SwitchMaterial::CallFunc_SwitchMaterialExclude_LayerID' has a wrong offset!");

// Function BP_Ajito_ch0700.BP_Ajito_ch0700_C.SetMaterialScalarParameter
// 0x000C (0x000C - 0x0000)
struct BP_Ajito_ch0700_C_SetMaterialScalarParameter final
{
public:
	class FName                                   PramName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Ajito_ch0700_C_SetMaterialScalarParameter) == 0x000004, "Wrong alignment on BP_Ajito_ch0700_C_SetMaterialScalarParameter");
static_assert(sizeof(BP_Ajito_ch0700_C_SetMaterialScalarParameter) == 0x00000C, "Wrong size on BP_Ajito_ch0700_C_SetMaterialScalarParameter");
static_assert(offsetof(BP_Ajito_ch0700_C_SetMaterialScalarParameter, PramName) == 0x000000, "Member 'BP_Ajito_ch0700_C_SetMaterialScalarParameter::PramName' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_SetMaterialScalarParameter, Value) == 0x000008, "Member 'BP_Ajito_ch0700_C_SetMaterialScalarParameter::Value' has a wrong offset!");

// Function BP_Ajito_ch0700.BP_Ajito_ch0700_C.UpdateStealth
// 0x001C (0x001C - 0x0000)
struct BP_Ajito_ch0700_C_UpdateStealth final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42B3[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42B4[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Ajito_ch0700_C_UpdateStealth) == 0x000004, "Wrong alignment on BP_Ajito_ch0700_C_UpdateStealth");
static_assert(sizeof(BP_Ajito_ch0700_C_UpdateStealth) == 0x00001C, "Wrong size on BP_Ajito_ch0700_C_UpdateStealth");
static_assert(offsetof(BP_Ajito_ch0700_C_UpdateStealth, DeltaSeconds) == 0x000000, "Member 'BP_Ajito_ch0700_C_UpdateStealth::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_UpdateStealth, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_Ajito_ch0700_C_UpdateStealth::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_UpdateStealth, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_Ajito_ch0700_C_UpdateStealth::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_UpdateStealth, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_Ajito_ch0700_C_UpdateStealth::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_UpdateStealth, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000010, "Member 'BP_Ajito_ch0700_C_UpdateStealth::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_UpdateStealth, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_Ajito_ch0700_C_UpdateStealth::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_UpdateStealth, CallFunc_Add_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_Ajito_ch0700_C_UpdateStealth::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_Ajito_ch0700.BP_Ajito_ch0700_C.RestoreSwitchMaterial
// 0x0008 (0x0008 - 0x0000)
struct BP_Ajito_ch0700_C_RestoreSwitchMaterial final
{
public:
	int32                                         Param_MaterialSwitchHandle;                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OneFrameSetting;                                   // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RestoreSwitchMaterial_ReturnValue;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Ajito_ch0700_C_RestoreSwitchMaterial) == 0x000004, "Wrong alignment on BP_Ajito_ch0700_C_RestoreSwitchMaterial");
static_assert(sizeof(BP_Ajito_ch0700_C_RestoreSwitchMaterial) == 0x000008, "Wrong size on BP_Ajito_ch0700_C_RestoreSwitchMaterial");
static_assert(offsetof(BP_Ajito_ch0700_C_RestoreSwitchMaterial, Param_MaterialSwitchHandle) == 0x000000, "Member 'BP_Ajito_ch0700_C_RestoreSwitchMaterial::Param_MaterialSwitchHandle' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_RestoreSwitchMaterial, OneFrameSetting) == 0x000004, "Member 'BP_Ajito_ch0700_C_RestoreSwitchMaterial::OneFrameSetting' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_RestoreSwitchMaterial, CallFunc_RestoreSwitchMaterial_ReturnValue) == 0x000005, "Member 'BP_Ajito_ch0700_C_RestoreSwitchMaterial::CallFunc_RestoreSwitchMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ajito_ch0700_C_RestoreSwitchMaterial, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000006, "Member 'BP_Ajito_ch0700_C_RestoreSwitchMaterial::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Ajito_ch0700.BP_Ajito_ch0700_C.SetStealthForce
// 0x0001 (0x0001 - 0x0000)
struct BP_Ajito_ch0700_C_SetStealthForce final
{
public:
	bool                                          StealthOnIn;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Ajito_ch0700_C_SetStealthForce) == 0x000001, "Wrong alignment on BP_Ajito_ch0700_C_SetStealthForce");
static_assert(sizeof(BP_Ajito_ch0700_C_SetStealthForce) == 0x000001, "Wrong size on BP_Ajito_ch0700_C_SetStealthForce");
static_assert(offsetof(BP_Ajito_ch0700_C_SetStealthForce, StealthOnIn) == 0x000000, "Member 'BP_Ajito_ch0700_C_SetStealthForce::StealthOnIn' has a wrong offset!");

// Function BP_Ajito_ch0700.BP_Ajito_ch0700_C.IsStealth
// 0x0001 (0x0001 - 0x0000)
struct BP_Ajito_ch0700_C_IsStealth final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Ajito_ch0700_C_IsStealth) == 0x000001, "Wrong alignment on BP_Ajito_ch0700_C_IsStealth");
static_assert(sizeof(BP_Ajito_ch0700_C_IsStealth) == 0x000001, "Wrong size on BP_Ajito_ch0700_C_IsStealth");
static_assert(offsetof(BP_Ajito_ch0700_C_IsStealth, Return) == 0x000000, "Member 'BP_Ajito_ch0700_C_IsStealth::Return' has a wrong offset!");

}

