#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AttachmentManageComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "FAttachmentMaterialData_structs.hpp"
#include "EAttachmentCategory_structs.hpp"
#include "Engine_structs.hpp"
#include "FAttachmentMeshComponentData_structs.hpp"
#include "FAttachmentPartsData_structs.hpp"
#include "FAttachmentData_structs.hpp"
#include "FAttachmentEquipData_structs.hpp"


namespace SDK::Params
{

// Function BP_AttachmentManageComponent.BP_AttachmentManageComponent_C.ExecuteUbergraph_BP_AttachmentManageComponent
// 0x00E0 (0x00E0 - 0x0000)
struct BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bHidden;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76A0[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76A1[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76A2[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNextLoadAsset_bSuccess;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76A3[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 CallFunc_GetNextLoadAsset_Array_Element;           // 0x0030(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_GetNextLoadAsset_MeshIndex;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76A4[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76A5[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_AttachmentIndex;                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76A6[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76A7[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0084(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bHidden)>                 K2Node_CreateDelegate_OutputDelegate_1;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsLoadComplete_bComplete;                 // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76A8[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76A9[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76AA[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_2;         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76AB[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent) == 0x000008, "Wrong alignment on BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent");
static_assert(sizeof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent) == 0x0000E0, "Wrong size on BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, EntryPoint) == 0x000000, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, K2Node_CustomEvent_bHidden) == 0x000004, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::K2Node_CustomEvent_bHidden' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, Temp_bool_IsClosed_Variable) == 0x000014, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, Temp_int_Loop_Counter_Variable_1) == 0x00001C, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, Temp_bool_Has_Been_Initd_Variable) == 0x000020, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, CallFunc_GetNextLoadAsset_bSuccess) == 0x000028, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::CallFunc_GetNextLoadAsset_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, CallFunc_GetNextLoadAsset_Array_Element) == 0x000030, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::CallFunc_GetNextLoadAsset_Array_Element' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, CallFunc_GetNextLoadAsset_MeshIndex) == 0x000058, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::CallFunc_GetNextLoadAsset_MeshIndex' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x00005C, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, Temp_int_Loop_Num_Variable) == 0x000060, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, Temp_int_Array_Index_Variable) == 0x00006C, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, K2Node_CustomEvent_AttachmentIndex) == 0x000070, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::K2Node_CustomEvent_AttachmentIndex' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, CallFunc_Array_Add_ReturnValue) == 0x000074, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, CallFunc_Less_IntInt_ReturnValue_1) == 0x000078, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, CallFunc_MakeLiteralInt_ReturnValue) == 0x00007C, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000080, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000084, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000094, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, CallFunc_IsLoadComplete_bComplete) == 0x0000A4, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::CallFunc_IsLoadComplete_bComplete' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, Temp_int_Loop_Num_Variable_1) == 0x0000A8, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000AC, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, CallFunc_Array_Length_ReturnValue_1) == 0x0000B0, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x0000B4, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, Temp_int_Array_Index_Variable_1) == 0x0000BC, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, CallFunc_Array_IsValidIndex_ReturnValue_2) == 0x0000C0, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::CallFunc_Array_IsValidIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, CallFunc_Array_Add_ReturnValue_1) == 0x0000C4, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, Temp_object_Variable) == 0x0000C8, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, CallFunc_GetEventManager_EventManager) == 0x0000D0, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent, CallFunc_IsValid_ReturnValue) == 0x0000D8, "Member 'BP_AttachmentManageComponent_C_ExecuteUbergraph_BP_AttachmentManageComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AttachmentManageComponent.BP_AttachmentManageComponent_C.OnHiddenSetoMask
// 0x0001 (0x0001 - 0x0000)
struct BP_AttachmentManageComponent_C_OnHiddenSetoMask final
{
public:
	bool                                          bHidden;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AttachmentManageComponent_C_OnHiddenSetoMask) == 0x000001, "Wrong alignment on BP_AttachmentManageComponent_C_OnHiddenSetoMask");
static_assert(sizeof(BP_AttachmentManageComponent_C_OnHiddenSetoMask) == 0x000001, "Wrong size on BP_AttachmentManageComponent_C_OnHiddenSetoMask");
static_assert(offsetof(BP_AttachmentManageComponent_C_OnHiddenSetoMask, bHidden) == 0x000000, "Member 'BP_AttachmentManageComponent_C_OnHiddenSetoMask::bHidden' has a wrong offset!");

// Function BP_AttachmentManageComponent.BP_AttachmentManageComponent_C.LoadAttachmentMeshOld
// 0x0004 (0x0004 - 0x0000)
struct BP_AttachmentManageComponent_C_LoadAttachmentMeshOld final
{
public:
	int32                                         AttachmentIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AttachmentManageComponent_C_LoadAttachmentMeshOld) == 0x000004, "Wrong alignment on BP_AttachmentManageComponent_C_LoadAttachmentMeshOld");
static_assert(sizeof(BP_AttachmentManageComponent_C_LoadAttachmentMeshOld) == 0x000004, "Wrong size on BP_AttachmentManageComponent_C_LoadAttachmentMeshOld");
static_assert(offsetof(BP_AttachmentManageComponent_C_LoadAttachmentMeshOld, AttachmentIndex) == 0x000000, "Member 'BP_AttachmentManageComponent_C_LoadAttachmentMeshOld::AttachmentIndex' has a wrong offset!");

// Function BP_AttachmentManageComponent.BP_AttachmentManageComponent_C.OnLoaded_0CFCF78E4D34EAE44DCD22AC2752519B
// 0x0008 (0x0008 - 0x0000)
struct BP_AttachmentManageComponent_C_OnLoaded_0CFCF78E4D34EAE44DCD22AC2752519B final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AttachmentManageComponent_C_OnLoaded_0CFCF78E4D34EAE44DCD22AC2752519B) == 0x000008, "Wrong alignment on BP_AttachmentManageComponent_C_OnLoaded_0CFCF78E4D34EAE44DCD22AC2752519B");
static_assert(sizeof(BP_AttachmentManageComponent_C_OnLoaded_0CFCF78E4D34EAE44DCD22AC2752519B) == 0x000008, "Wrong size on BP_AttachmentManageComponent_C_OnLoaded_0CFCF78E4D34EAE44DCD22AC2752519B");
static_assert(offsetof(BP_AttachmentManageComponent_C_OnLoaded_0CFCF78E4D34EAE44DCD22AC2752519B, Loaded) == 0x000000, "Member 'BP_AttachmentManageComponent_C_OnLoaded_0CFCF78E4D34EAE44DCD22AC2752519B::Loaded' has a wrong offset!");

// Function BP_AttachmentManageComponent.BP_AttachmentManageComponent_C.Equip
// 0x0068 (0x0068 - 0x0000)
struct BP_AttachmentManageComponent_C_Equip final
{
public:
	EPlayerAttachment                             AttachmentIndex;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76AC[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AttachmentItemID;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LEquipedAttachmentID;                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LIndex;                                            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAttachmentDataTable_bSuccess;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76AD[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFAttachmentData                       CallFunc_GetAttachmentDataTable_AttachmentData;    // 0x0018(0x0020)(HasGetValueTypeHash)
	struct FFAttachmentEquipData                  CallFunc_GetAttachmentDataTable_EquipData;         // 0x0038(0x0020)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76AE[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AttachmentManageComponent_C_Equip) == 0x000008, "Wrong alignment on BP_AttachmentManageComponent_C_Equip");
static_assert(sizeof(BP_AttachmentManageComponent_C_Equip) == 0x000068, "Wrong size on BP_AttachmentManageComponent_C_Equip");
static_assert(offsetof(BP_AttachmentManageComponent_C_Equip, AttachmentIndex) == 0x000000, "Member 'BP_AttachmentManageComponent_C_Equip::AttachmentIndex' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_Equip, AttachmentItemID) == 0x000004, "Member 'BP_AttachmentManageComponent_C_Equip::AttachmentItemID' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_Equip, LEquipedAttachmentID) == 0x000008, "Member 'BP_AttachmentManageComponent_C_Equip::LEquipedAttachmentID' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_Equip, LIndex) == 0x00000C, "Member 'BP_AttachmentManageComponent_C_Equip::LIndex' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_Equip, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000010, "Member 'BP_AttachmentManageComponent_C_Equip::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_Equip, CallFunc_GetAttachmentDataTable_bSuccess) == 0x000014, "Member 'BP_AttachmentManageComponent_C_Equip::CallFunc_GetAttachmentDataTable_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_Equip, CallFunc_GetAttachmentDataTable_AttachmentData) == 0x000018, "Member 'BP_AttachmentManageComponent_C_Equip::CallFunc_GetAttachmentDataTable_AttachmentData' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_Equip, CallFunc_GetAttachmentDataTable_EquipData) == 0x000038, "Member 'BP_AttachmentManageComponent_C_Equip::CallFunc_GetAttachmentDataTable_EquipData' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_Equip, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_AttachmentManageComponent_C_Equip::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_Equip, CallFunc_Array_Length_ReturnValue_1) == 0x00005C, "Member 'BP_AttachmentManageComponent_C_Equip::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_Equip, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000060, "Member 'BP_AttachmentManageComponent_C_Equip::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_Equip, CallFunc_Array_Get_Item) == 0x000064, "Member 'BP_AttachmentManageComponent_C_Equip::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BP_AttachmentManageComponent.BP_AttachmentManageComponent_C.GetAttachmentDataTable
// 0x01B0 (0x01B0 - 0x0000)
struct BP_AttachmentManageComponent_C_GetAttachmentDataTable final
{
public:
	int32                                         AttachmentItemID;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76AF[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFAttachmentData                       Param_AttachmentData;                              // 0x0008(0x0020)(Parm, OutParm, HasGetValueTypeHash)
	struct FFAttachmentEquipData                  Param_EquipData;                                   // 0x0028(0x0020)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_1;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFAttachmentData                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0070(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76B0[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             Temp_object_Variable_2;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_3;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_4;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_5;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_6;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_7;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_8;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_9;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_10;                           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_11;                           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_12;                           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_13;                           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_14;                           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_15;                           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_16;                           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_17;                           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_18;                           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_19;                           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_20;                           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_21;                           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_22;                           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_23;                           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_24;                           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_25;                           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_26;                           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     Temp_byte_Variable;                                // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76B1[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             K2Node_Select_Default;                             // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFAttachmentEquipData                  CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0188(0x0020)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AttachmentManageComponent_C_GetAttachmentDataTable) == 0x000008, "Wrong alignment on BP_AttachmentManageComponent_C_GetAttachmentDataTable");
static_assert(sizeof(BP_AttachmentManageComponent_C_GetAttachmentDataTable) == 0x0001B0, "Wrong size on BP_AttachmentManageComponent_C_GetAttachmentDataTable");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, AttachmentItemID) == 0x000000, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::AttachmentItemID' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, bSuccess) == 0x000004, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Param_AttachmentData) == 0x000008, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Param_AttachmentData' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Param_EquipData) == 0x000028, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Param_EquipData' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable) == 0x000048, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, CallFunc_Conv_IntToString_ReturnValue) == 0x000050, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, CallFunc_Conv_StringToName_ReturnValue) == 0x000060, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_1) == 0x000068, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, CallFunc_GetDataTableRowFromName_OutRow) == 0x000070, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000090, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_2) == 0x000098, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, CallFunc_Conv_IntToString_ReturnValue_1) == 0x0000A0, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, CallFunc_Conv_StringToName_ReturnValue_1) == 0x0000B0, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_3) == 0x0000B8, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_4) == 0x0000C0, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_5) == 0x0000C8, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_6) == 0x0000D0, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_7) == 0x0000D8, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_8) == 0x0000E0, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_9) == 0x0000E8, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_10) == 0x0000F0, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_11) == 0x0000F8, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_12) == 0x000100, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_13) == 0x000108, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_13' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_14) == 0x000110, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_14' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_15) == 0x000118, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_15' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_16) == 0x000120, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_16' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_17) == 0x000128, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_17' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_18) == 0x000130, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_18' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_19) == 0x000138, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_19' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_20) == 0x000140, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_20' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_21) == 0x000148, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_21' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_22) == 0x000150, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_22' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_23) == 0x000158, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_23' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_24) == 0x000160, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_24' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_25) == 0x000168, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_25' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_object_Variable_26) == 0x000170, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_object_Variable_26' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, Temp_byte_Variable) == 0x000178, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, K2Node_Select_Default) == 0x000180, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000188, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_GetAttachmentDataTable, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0001A8, "Member 'BP_AttachmentManageComponent_C_GetAttachmentDataTable::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");

// Function BP_AttachmentManageComponent.BP_AttachmentManageComponent_C.TakeOff
// 0x0080 (0x0080 - 0x0000)
struct BP_AttachmentManageComponent_C_TakeOff final
{
public:
	EPlayerAttachment                             AttachmentIndex;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76B2[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        NewLocalVar_1;                                     // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         LIndex;                                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76B3[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFAttachmentMeshComponentData          CallFunc_Array_Get_Item;                           // 0x0030(0x0020)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76B4[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76B5[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Attachment_C>     K2Node_DynamicCast_AsBPI_Attachment;               // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DestroyAttachmentMeshComponent_bDummy;    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76B6[0x1];                                     // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AttachmentManageComponent_C_TakeOff) == 0x000008, "Wrong alignment on BP_AttachmentManageComponent_C_TakeOff");
static_assert(sizeof(BP_AttachmentManageComponent_C_TakeOff) == 0x000080, "Wrong size on BP_AttachmentManageComponent_C_TakeOff");
static_assert(offsetof(BP_AttachmentManageComponent_C_TakeOff, AttachmentIndex) == 0x000000, "Member 'BP_AttachmentManageComponent_C_TakeOff::AttachmentIndex' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_TakeOff, NewLocalVar_1) == 0x000008, "Member 'BP_AttachmentManageComponent_C_TakeOff::NewLocalVar_1' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_TakeOff, LIndex) == 0x000018, "Member 'BP_AttachmentManageComponent_C_TakeOff::LIndex' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_TakeOff, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00001C, "Member 'BP_AttachmentManageComponent_C_TakeOff::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_TakeOff, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_AttachmentManageComponent_C_TakeOff::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_TakeOff, Temp_int_Loop_Num_Variable) == 0x000024, "Member 'BP_AttachmentManageComponent_C_TakeOff::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_TakeOff, Temp_int_Variable) == 0x000028, "Member 'BP_AttachmentManageComponent_C_TakeOff::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_TakeOff, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002C, "Member 'BP_AttachmentManageComponent_C_TakeOff::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_TakeOff, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_AttachmentManageComponent_C_TakeOff::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_TakeOff, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_AttachmentManageComponent_C_TakeOff::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_TakeOff, CallFunc_IsValid_ReturnValue) == 0x000054, "Member 'BP_AttachmentManageComponent_C_TakeOff::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_TakeOff, CallFunc_GetOwner_ReturnValue) == 0x000058, "Member 'BP_AttachmentManageComponent_C_TakeOff::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_TakeOff, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'BP_AttachmentManageComponent_C_TakeOff::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_TakeOff, K2Node_DynamicCast_AsBPI_Attachment) == 0x000068, "Member 'BP_AttachmentManageComponent_C_TakeOff::K2Node_DynamicCast_AsBPI_Attachment' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_TakeOff, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_AttachmentManageComponent_C_TakeOff::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_TakeOff, CallFunc_DestroyAttachmentMeshComponent_bDummy) == 0x000079, "Member 'BP_AttachmentManageComponent_C_TakeOff::CallFunc_DestroyAttachmentMeshComponent_bDummy' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_TakeOff, CallFunc_Less_IntInt_ReturnValue) == 0x00007A, "Member 'BP_AttachmentManageComponent_C_TakeOff::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_TakeOff, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'BP_AttachmentManageComponent_C_TakeOff::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_AttachmentManageComponent.BP_AttachmentManageComponent_C.IsCategoryVisibility
// 0x0004 (0x0004 - 0x0000)
struct BP_AttachmentManageComponent_C_IsCategoryVisibility final
{
public:
	EAttachmentCategory                           Category;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bVisibility;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AttachmentManageComponent_C_IsCategoryVisibility) == 0x000001, "Wrong alignment on BP_AttachmentManageComponent_C_IsCategoryVisibility");
static_assert(sizeof(BP_AttachmentManageComponent_C_IsCategoryVisibility) == 0x000004, "Wrong size on BP_AttachmentManageComponent_C_IsCategoryVisibility");
static_assert(offsetof(BP_AttachmentManageComponent_C_IsCategoryVisibility, Category) == 0x000000, "Member 'BP_AttachmentManageComponent_C_IsCategoryVisibility::Category' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_IsCategoryVisibility, bVisibility) == 0x000001, "Member 'BP_AttachmentManageComponent_C_IsCategoryVisibility::bVisibility' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_IsCategoryVisibility, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'BP_AttachmentManageComponent_C_IsCategoryVisibility::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AttachmentManageComponent_C_IsCategoryVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'BP_AttachmentManageComponent_C_IsCategoryVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_AttachmentManageComponent.BP_AttachmentManageComponent_C.Attachment
// 0x0290 (0x0290 - 0x0000)
struct BP_AttachmentManageComponent_C_Attachment final
{
public:
	int32                                         AttachmentIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MeshIndex;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                LoadedObject;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachmentCategory                           LCategory;                                         // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76B7[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstance*>              LMaterialInstance;                                 // 0x0018(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FFAttachmentMaterialData>       LMaterialData;                                     // 0x0028(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         MaterialLastIndex;                                 // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76B8[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 LOwnerAttachedMesh;                                // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFAttachmentPartsData                  LPartsData;                                        // 0x0048(0x0030)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          LbSkeletalMesh;                                    // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76B9[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         LMesh;                                             // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
