#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BT_c10_Interval

#include "Basic.hpp"

#include "FEventTriggerCommand_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BP_BT_c10_Interval.BP_BT_c10_Interval_C.ExecuteUbergraph_BP_BT_c10_Interval
// 0x0230 (0x0230 - 0x0000)
struct BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6495[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFEventTriggerCommand                  K2Node_MakeStruct_FEventTriggerCommand;            // 0x0008(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_AddEventTriggerCommand_self_CastInput;    // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6496[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFEventTriggerCommand                  K2Node_MakeStruct_FEventTriggerCommand_1;          // 0x0090(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_1;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_AddEventTriggerCommand_self_CastInput_1;  // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckScenarioFlag_ReturnValue;            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckScenarioFlag_ReturnValue_1;          // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckScenarioFlag_ReturnValue_2;          // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckScenarioFlag_ReturnValue_3;          // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6497[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFEventTriggerCommand                  K2Node_MakeStruct_FEventTriggerCommand_2;          // 0x0120(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_2;           // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_AddEventTriggerCommand_self_CastInput_2;  // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6498[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFEventTriggerCommand                  K2Node_MakeStruct_FEventTriggerCommand_3;          // 0x01A8(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_3;           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_AddEventTriggerCommand_self_CastInput_3;  // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerCharaID_ReturnPlayerID;          // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval) == 0x000008, "Wrong alignment on BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval");
static_assert(sizeof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval) == 0x000230, "Wrong size on BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval");
static_assert(offsetof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval, EntryPoint) == 0x000000, "Member 'BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval, K2Node_MakeStruct_FEventTriggerCommand) == 0x000008, "Member 'BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval::K2Node_MakeStruct_FEventTriggerCommand' has a wrong offset!");
static_assert(offsetof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval, CallFunc_GetEventManager_EventManager) == 0x000070, "Member 'BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval, CallFunc_AddEventTriggerCommand_self_CastInput) == 0x000078, "Member 'BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval::CallFunc_AddEventTriggerCommand_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval, K2Node_MakeStruct_FEventTriggerCommand_1) == 0x000090, "Member 'BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval::K2Node_MakeStruct_FEventTriggerCommand_1' has a wrong offset!");
static_assert(offsetof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval, CallFunc_GetEventManager_EventManager_1) == 0x0000F8, "Member 'BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval::CallFunc_GetEventManager_EventManager_1' has a wrong offset!");
static_assert(offsetof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval, CallFunc_GetSceneManager_SceneManager) == 0x000100, "Member 'BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval::CallFunc_GetSceneManager_SceneManager' has a wrong offset!");
static_assert(offsetof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval, CallFunc_AddEventTriggerCommand_self_CastInput_1) == 0x000108, "Member 'BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval::CallFunc_AddEventTriggerCommand_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval, CallFunc_CheckScenarioFlag_ReturnValue) == 0x000118, "Member 'BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval::CallFunc_CheckScenarioFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval, CallFunc_CheckScenarioFlag_ReturnValue_1) == 0x000119, "Member 'BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval::CallFunc_CheckScenarioFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval, CallFunc_CheckScenarioFlag_ReturnValue_2) == 0x00011A, "Member 'BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval::CallFunc_CheckScenarioFlag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval, CallFunc_CheckScenarioFlag_ReturnValue_3) == 0x00011B, "Member 'BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval::CallFunc_CheckScenarioFlag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval, CallFunc_IsValid_ReturnValue_1) == 0x00011C, "Member 'BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval, K2Node_MakeStruct_FEventTriggerCommand_2) == 0x000120, "Member 'BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval::K2Node_MakeStruct_FEventTriggerCommand_2' has a wrong offset!");
static_assert(offsetof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval, CallFunc_GetEventManager_EventManager_2) == 0x000188, "Member 'BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval::CallFunc_GetEventManager_EventManager_2' has a wrong offset!");
static_assert(offsetof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval, CallFunc_AddEventTriggerCommand_self_CastInput_2) == 0x000190, "Member 'BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval::CallFunc_AddEventTriggerCommand_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval, CallFunc_IsValid_ReturnValue_2) == 0x0001A0, "Member 'BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval, K2Node_MakeStruct_FEventTriggerCommand_3) == 0x0001A8, "Member 'BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval::K2Node_MakeStruct_FEventTriggerCommand_3' has a wrong offset!");
static_assert(offsetof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval, CallFunc_GetEventManager_EventManager_3) == 0x000210, "Member 'BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval::CallFunc_GetEventManager_EventManager_3' has a wrong offset!");
static_assert(offsetof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval, CallFunc_AddEventTriggerCommand_self_CastInput_3) == 0x000218, "Member 'BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval::CallFunc_AddEventTriggerCommand_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval, CallFunc_IsValid_ReturnValue_3) == 0x000228, "Member 'BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval, CallFunc_GetPlayerCharaID_ReturnPlayerID) == 0x000229, "Member 'BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval::CallFunc_GetPlayerCharaID_ReturnPlayerID' has a wrong offset!");
static_assert(offsetof(BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval, K2Node_SwitchEnum_CmpSuccess) == 0x00022A, "Member 'BP_BT_c10_Interval_C_ExecuteUbergraph_BP_BT_c10_Interval::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

