#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BrainFieldCollisions

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BrainFieldCollisions.BP_BrainFieldCollisions_C
// 0x0028 (0x0258 - 0x0230)
class ABP_BrainFieldCollisions_C final : public AActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UObject>>         CollisionReference;                                // 0x0238(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UObject>>         BFReference;                                       // 0x0248(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BrainFieldCollisions_C">();
	}
	static class ABP_BrainFieldCollisions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BrainFieldCollisions_C>();
	}
};
static_assert(alignof(ABP_BrainFieldCollisions_C) == 0x000008, "Wrong alignment on ABP_BrainFieldCollisions_C");
static_assert(sizeof(ABP_BrainFieldCollisions_C) == 0x000258, "Wrong size on ABP_BrainFieldCollisions_C");
static_assert(offsetof(ABP_BrainFieldCollisions_C, DefaultSceneRoot) == 0x000230, "Member 'ABP_BrainFieldCollisions_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BrainFieldCollisions_C, CollisionReference) == 0x000238, "Member 'ABP_BrainFieldCollisions_C::CollisionReference' has a wrong offset!");
static_assert(offsetof(ABP_BrainFieldCollisions_C, BFReference) == 0x000248, "Member 'ABP_BrainFieldCollisions_C::BFReference' has a wrong offset!");

}

