#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BrainFieldManager

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ERenderTargetType_structs.hpp"


namespace SDK::Params
{

// Function BP_BrainFieldManager.BP_BrainFieldManager_C.ED_BrainFieldBattleEnd__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_BrainFieldManager_C_ED_BrainFieldBattleEnd__DelegateSignature final
{
public:
	EBrainFieldEndType                            Param_EndType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BrainFieldManager_C_ED_BrainFieldBattleEnd__DelegateSignature) == 0x000001, "Wrong alignment on BP_BrainFieldManager_C_ED_BrainFieldBattleEnd__DelegateSignature");
static_assert(sizeof(BP_BrainFieldManager_C_ED_BrainFieldBattleEnd__DelegateSignature) == 0x000001, "Wrong size on BP_BrainFieldManager_C_ED_BrainFieldBattleEnd__DelegateSignature");
static_assert(offsetof(BP_BrainFieldManager_C_ED_BrainFieldBattleEnd__DelegateSignature, Param_EndType) == 0x000000, "Member 'BP_BrainFieldManager_C_ED_BrainFieldBattleEnd__DelegateSignature::Param_EndType' has a wrong offset!");

// Function BP_BrainFieldManager.BP_BrainFieldManager_C.ED_BrainFieldSwitchBG__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_BrainFieldManager_C_ED_BrainFieldSwitchBG__DelegateSignature final
{
public:
	bool                                          IsBrainField;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BrainFieldManager_C_ED_BrainFieldSwitchBG__DelegateSignature) == 0x000001, "Wrong alignment on BP_BrainFieldManager_C_ED_BrainFieldSwitchBG__DelegateSignature");
static_assert(sizeof(BP_BrainFieldManager_C_ED_BrainFieldSwitchBG__DelegateSignature) == 0x000001, "Wrong size on BP_BrainFieldManager_C_ED_BrainFieldSwitchBG__DelegateSignature");
static_assert(offsetof(BP_BrainFieldManager_C_ED_BrainFieldSwitchBG__DelegateSignature, IsBrainField) == 0x000000, "Member 'BP_BrainFieldManager_C_ED_BrainFieldSwitchBG__DelegateSignature::IsBrainField' has a wrong offset!");

// Function BP_BrainFieldManager.BP_BrainFieldManager_C.ED_ChangeMonitorState__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_BrainFieldManager_C_ED_ChangeMonitorState__DelegateSignature final
{
public:
	EBrainFieldMonitorState                       MonitorState;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BrainFieldManager_C_ED_ChangeMonitorState__DelegateSignature) == 0x000001, "Wrong alignment on BP_BrainFieldManager_C_ED_ChangeMonitorState__DelegateSignature");
static_assert(sizeof(BP_BrainFieldManager_C_ED_ChangeMonitorState__DelegateSignature) == 0x000001, "Wrong size on BP_BrainFieldManager_C_ED_ChangeMonitorState__DelegateSignature");
static_assert(offsetof(BP_BrainFieldManager_C_ED_ChangeMonitorState__DelegateSignature, MonitorState) == 0x000000, "Member 'BP_BrainFieldManager_C_ED_ChangeMonitorState__DelegateSignature::MonitorState' has a wrong offset!");

// Function BP_BrainFieldManager.BP_BrainFieldManager_C.ExecuteUbergraph_BP_BrainFieldManager
// 0x0350 (0x0350 - 0x0000)
struct BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFinishNormalFieldVisible_Finish;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_VisibleBrainField;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B7D[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_ObjectNum;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_MoveBrainField;                 // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFinishBrainFieldVisible_Finish;         // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayPerformSequencer_StartPlay;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B7E[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBrainFieldRestoreFlag                 CallFunc_VisibleNormalParticles_SetRestoreFlag;    // 0x0030(0x0028)()
	class ABP_LevelManager_C*                     CallFunc_GetLevelManager_LevelManager;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B7F[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LevelManager_C*                     CallFunc_GetLevelManager_LevelManager_1;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B80[0x2];                                     // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_UseRefresh;                     // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B81[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrainFieldSequenceActor_C*          CallFunc_FinishSpawningActor_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B82[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_CustomEvent_Actors;                         // 0x00C8(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Visible;                        // 0x00D8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B83[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable_1;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B84[0x2];                                     // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	EREDActorStatType                             CallFunc_GetActorStatType_ReturnValue;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B85[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      K2Node_DynamicCast_AsPlayer_Interface;             // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckFinishCondition_IsFinish;            // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CloseBrainField_ReturnValue;              // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B86[0xD];                                     // 0x0113(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0120(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B87[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventCameraRoot_C*                  CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B88[0x3];                                     // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B89[0x2];                                     // 0x018E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0190(0x0018)()
	const class ADebuggingItemBool*               K2Node_CustomEvent_InItem;                         // 0x01A8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValue_ReturnValue;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B8A[0x3];                                     // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01B4(0x0010)(ZeroConstructor, NoDestructor)
	EBrainFieldMonitorState                       K2Node_CustomEvent_MonitorState;                   // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B8B[0x3];                                     // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadSoftClassActor_ReturnValue;           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B8C[0x3];                                     // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEventStartup_IsEvent;                   // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B8D[0x6];                                     // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x01E0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B8E[0x4];                                     // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IEventInterface>       K2Node_DynamicCast_AsEvent_Interface;              // 0x0228(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetHoodVisible_ReturnValue;               // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x023B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B8F[0x4];                                     // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_3;              // 0x0240(0x0030)(IsPlainOldData, NoDestructor)
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingAnyDead_Playing;                 // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B90[0x7];                                     // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PostProcessManager_C*               CallFunc_GetPostProcessManager_Manager;            // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B91[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPostProcessComponent*                  CallFunc_GetPerformPostProcess_PostProcess;        // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RenderTargetManager_C*              CallFunc_GetRenderTargetManager_Manager;           // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetDebuggingManager_Manager;              // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_GetRenderTarget_RenderTarget;             // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B92[0x6];                                     // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ADebuggingItemBase*                     CallFunc_SearchItem_ReturnValue;                   // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADebuggingItemBool*                     K2Node_DynamicCast_AsDebugging_Item_Bool;          // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReady_ReturnValue;                      // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Is_Performance_Sequencer_IsPerform;       // 0x02DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B93[0x5];                                     // 0x02DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_1; // 0x02E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUserIsPlayer_IsPlayer;                  // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B94[0x5];                                     // 0x02F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 K2Node_CustomEvent_target;                         // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERenderTargetType                             K2Node_CustomEvent_RenderTargetType;               // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B95[0x7];                                     // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 K2Node_CustomEvent_NewTarget;                      // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B96[0x3];                                     // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ADebuggingItemBool* InItem)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0314(0x0010)(ZeroConstructor, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B97[0x3];                                     // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ERenderTargetType RenderTargetType, class UTextureRenderTarget2D* NewTarget)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0328(0x0010)(ZeroConstructor, NoDestructor)
	class ABP_RenderTargetManager_C*              CallFunc_GetRenderTargetManager_Manager_1;         // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ERenderTargetType RenderTargetType, class UTextureRenderTarget2D* NewTarget)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0340(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager) == 0x000010, "Wrong alignment on BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager");
static_assert(sizeof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager) == 0x000350, "Wrong size on BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, EntryPoint) == 0x000000, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_IsFinishNormalFieldVisible_Finish) == 0x000004, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_IsFinishNormalFieldVisible_Finish' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_CustomEvent_VisibleBrainField) == 0x000005, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_CustomEvent_VisibleBrainField' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_CustomEvent_ObjectNum) == 0x000008, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_CustomEvent_ObjectNum' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_Not_PreBool_ReturnValue_1) == 0x00000D, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_CustomEvent_MoveBrainField) == 0x00000E, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_CustomEvent_MoveBrainField' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_IsFinishBrainFieldVisible_Finish) == 0x00000F, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_IsFinishBrainFieldVisible_Finish' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_Array_LastIndex_ReturnValue) == 0x000010, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_PlayPerformSequencer_StartPlay) == 0x000018, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_PlayPerformSequencer_StartPlay' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_K2_GetPawn_ReturnValue) == 0x000028, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_VisibleNormalParticles_SetRestoreFlag) == 0x000030, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_VisibleNormalParticles_SetRestoreFlag' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_GetLevelManager_LevelManager) == 0x000058, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_GetLevelManager_LevelManager' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_GetLevelManager_LevelManager_1) == 0x000068, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_GetLevelManager_LevelManager_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_IsValid_ReturnValue_2) == 0x000071, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_Divide_IntInt_ReturnValue) == 0x000074, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_Add_IntInt_ReturnValue_1) == 0x000078, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_CustomEvent_UseRefresh) == 0x00007C, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_CustomEvent_UseRefresh' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000B0, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000B8, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000C0, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_CustomEvent_Actors) == 0x0000C8, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_CustomEvent_Actors' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_CustomEvent_Visible) == 0x0000D8, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_CustomEvent_Visible' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_Array_Length_ReturnValue) == 0x0000DC, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_CustomEvent_Enable_1) == 0x0000E0, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_CustomEvent_Enable_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_CustomEvent_Enable) == 0x0000E1, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_Event_DeltaSeconds) == 0x0000E4, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_CreateDelegate_OutputDelegate) == 0x0000E8, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_GetActorStatType_ReturnValue) == 0x0000F8, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_GetActorStatType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_DynamicCast_AsPlayer_Interface) == 0x000100, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_DynamicCast_AsPlayer_Interface' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_CheckFinishCondition_IsFinish) == 0x000111, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_CheckFinishCondition_IsFinish' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_CloseBrainField_ReturnValue) == 0x000112, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_CloseBrainField_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_MakeTransform_ReturnValue_1) == 0x000120, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, Temp_int_Variable) == 0x000150, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000158, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000160, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000168, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_Array_Length_ReturnValue_1) == 0x000178, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_Add_IntInt_ReturnValue_2) == 0x00017C, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000180, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, Temp_int_Loop_Counter_Variable) == 0x000184, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_Add_IntInt_ReturnValue_3) == 0x000188, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_MakeLiteralByte_ReturnValue) == 0x00018C, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x00018D, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_MakeLiteralText_ReturnValue) == 0x000190, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_CustomEvent_InItem) == 0x0001A8, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_CustomEvent_InItem' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_GetValue_ReturnValue) == 0x0001B0, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001B4, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_CustomEvent_MonitorState) == 0x0001C4, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_CustomEvent_MonitorState' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_LoadSoftClassActor_ReturnValue) == 0x0001C8, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_LoadSoftClassActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x0001D0, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, Temp_int_Loop_Num_Variable) == 0x0001D4, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_Less_IntInt_ReturnValue) == 0x0001D8, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_IsEventStartup_IsEvent) == 0x0001D9, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_IsEventStartup_IsEvent' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_MakeTransform_ReturnValue_2) == 0x0001E0, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000210, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000218, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, Temp_int_Array_Index_Variable) == 0x000220, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_DynamicCast_AsEvent_Interface) == 0x000228, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_DynamicCast_AsEvent_Interface' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_DynamicCast_bSuccess_1) == 0x000238, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_IsValid_ReturnValue_3) == 0x000239, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_SetHoodVisible_ReturnValue) == 0x00023A, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_SetHoodVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00023B, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_MakeTransform_ReturnValue_3) == 0x000240, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_MakeTransform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_GetPlayerManager_PlayerManager) == 0x000270, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3) == 0x000278, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_IsPlayingAnyDead_Playing) == 0x000280, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_IsPlayingAnyDead_Playing' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_FinishSpawningActor_ReturnValue_3) == 0x000288, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_FinishSpawningActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_GetPostProcessManager_Manager) == 0x000290, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_GetPostProcessManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_IsValid_ReturnValue_4) == 0x000298, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_GetPerformPostProcess_PostProcess) == 0x0002A0, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_GetPerformPostProcess_PostProcess' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_GetRenderTargetManager_Manager) == 0x0002A8, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_GetRenderTargetManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_GetDebuggingManager_Manager) == 0x0002B0, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_GetDebuggingManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_GetRenderTarget_RenderTarget) == 0x0002B8, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_GetRenderTarget_RenderTarget' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_IsValid_ReturnValue_5) == 0x0002C0, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_IsValid_ReturnValue_6) == 0x0002C1, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_SearchItem_ReturnValue) == 0x0002C8, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_SearchItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_DynamicCast_AsDebugging_Item_Bool) == 0x0002D0, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_DynamicCast_AsDebugging_Item_Bool' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_DynamicCast_bSuccess_2) == 0x0002D8, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_IsReady_ReturnValue) == 0x0002D9, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_IsReady_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_Is_Performance_Sequencer_IsPerform) == 0x0002DA, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_Is_Performance_Sequencer_IsPerform' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_1) == 0x0002E0, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_IsUserIsPlayer_IsPlayer) == 0x0002F0, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_IsUserIsPlayer_IsPlayer' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_Not_PreBool_ReturnValue_2) == 0x0002F1, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_BooleanAND_ReturnValue) == 0x0002F2, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_CustomEvent_target) == 0x0002F8, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_CustomEvent_target' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_CustomEvent_RenderTargetType) == 0x000300, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_CustomEvent_RenderTargetType' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_CustomEvent_NewTarget) == 0x000308, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_CustomEvent_NewTarget' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000310, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_CreateDelegate_OutputDelegate_2) == 0x000314, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_Event_EndPlayReason) == 0x000324, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_CreateDelegate_OutputDelegate_3) == 0x000328, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, CallFunc_GetRenderTargetManager_Manager_1) == 0x000338, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::CallFunc_GetRenderTargetManager_Manager_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager, K2Node_CreateDelegate_OutputDelegate_4) == 0x000340, "Member 'BP_BrainFieldManager_C_ExecuteUbergraph_BP_BrainFieldManager::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function BP_BrainFieldManager.BP_BrainFieldManager_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_BrainFieldManager_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BrainFieldManager_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_BrainFieldManager_C_ReceiveEndPlay");
static_assert(sizeof(BP_BrainFieldManager_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_BrainFieldManager_C_ReceiveEndPlay");
static_assert(offsetof(BP_BrainFieldManager_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_BrainFieldManager_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_BrainFieldManager.BP_BrainFieldManager_C.ResetRenderTarget
// 0x0010 (0x0010 - 0x0000)
struct BP_BrainFieldManager_C_ResetRenderTarget final
{
public:
	ERenderTargetType                             RenderTargetType;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B98[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 NewTarget;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BrainFieldManager_C_ResetRenderTarget) == 0x000008, "Wrong alignment on BP_BrainFieldManager_C_ResetRenderTarget");
static_assert(sizeof(BP_BrainFieldManager_C_ResetRenderTarget) == 0x000010, "Wrong size on BP_BrainFieldManager_C_ResetRenderTarget");
static_assert(offsetof(BP_BrainFieldManager_C_ResetRenderTarget, RenderTargetType) == 0x000000, "Member 'BP_BrainFieldManager_C_ResetRenderTarget::RenderTargetType' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldManager_C_ResetRenderTarget, NewTarget) == 0x000008, "Member 'BP_BrainFieldManager_C_ResetRenderTarget::NewTarget' has a wrong offset!");

// Function BP_BrainFieldManager.BP_BrainFieldManager_C.SetBGRenderTarget
// 0x0008 (0x0008 - 0x0000)
struct BP_BrainFieldManager_C_SetBGRenderTarget final
{
public:
	class UTextureRenderTarget2D*                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BrainFieldManager_C_SetBGRenderTarget) == 0x000008, "Wrong alignment on BP_BrainFieldManager_C_SetBGRenderTarget");
static_assert(sizeof(BP_BrainFieldManager_C_SetBGRenderTarget) == 0x000008, "Wrong size on BP_BrainFieldManager_C_SetBGRenderTarget");
static_assert(offsetof(BP_BrainFieldManager_C_SetBGRenderTarget, Target) == 0x000000, "Member 'BP_BrainFieldManager_C_SetBGRenderTarget::Target' has a wrong offset!");

// Function BP_BrainFieldManager.BP_BrainFieldManager_C.OnChangeMonitorState
// 0x0001 (0x0001 - 0x0000)
struct BP_BrainFieldManager_C_OnChangeMonitorState final
{
public:
	EBrainFieldMonitorState                       MonitorState;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BrainFieldManager_C_OnChangeMonitorState) == 0x000001, "Wrong alignment on BP_BrainFieldManager_C_OnChangeMonitorState");
static_assert(sizeof(BP_BrainFieldManager_C_OnChangeMonitorState) == 0x000001, "Wrong size on BP_BrainFieldManager_C_OnChangeMonitorState");
static_assert(offsetof(BP_BrainFieldManager_C_OnChangeMonitorState, MonitorState) == 0x000000, "Member 'BP_BrainFieldManager_C_OnChangeMonitorState::MonitorState' has a wrong offset!");

// Function BP_BrainFieldManager.BP_BrainFieldManager_C.OnChangedDebugForceEnd
// 0x0008 (0x0008 - 0x0000)
struct BP_BrainFieldManager_C_OnChangedDebugForceEnd final
{
public:
	const class ADebuggingItemBool*               InItem;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BrainFieldManager_C_OnChangedDebugForceEnd) == 0x000008, "Wrong alignment on BP_BrainFieldManager_C_OnChangedDebugForceEnd");
static_assert(sizeof(BP_BrainFieldManager_C_OnChangedDebugForceEnd) == 0x000008, "Wrong size on BP_BrainFieldManager_C_OnChangedDebugForceEnd");
static_assert(offsetof(BP_BrainFieldManager_C_OnChangedDebugForceEnd, InItem) == 0x000000, "Member 'BP_BrainFieldManager_C_OnChangedDebugForceEnd::InItem' has a wrong offset!");

// Function BP_BrainFieldManager.BP_BrainFieldManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_BrainFieldManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BrainFieldManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_BrainFieldManager_C_ReceiveTick");
static_assert(sizeof(BP_BrainFieldManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_BrainFieldManager_C_ReceiveTick");
static_assert(offsetof(BP_BrainFieldManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_BrainFieldManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_BrainFieldManager.BP_BrainFieldManager_C.PrivateSetDynamicShadowDelay
// 0x0001 (0x0001 - 0x0000)
struct BP_BrainFieldManager_C_PrivateSetDynamicShadowDelay final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BrainFieldManager_C_PrivateSetDynamicShadowDelay) == 0x000001, "Wrong alignment on BP_BrainFieldManager_C_PrivateSetDynamicShadowDelay");
static_assert(sizeof(BP_BrainFieldManager_C_PrivateSetDynamicShadowDelay) == 0x000001, "Wrong size on BP_BrainFieldManager_C_PrivateSetDynamicShadowDelay");
static_assert(offsetof(BP_BrainFieldManager_C_PrivateSetDynamicShadowDelay, Enable) == 0x000000, "Member 'BP_BrainFieldManager_C_PrivateSetDynamicShadowDelay::Enable' has a wrong offset!");

// Function BP_BrainFieldManager.BP_BrainFieldManager_C.PrivateSetDynamicShadow
// 0x0001 (0x0001 - 0x0000)
struct BP_BrainFieldManager_C_PrivateSetDynamicShadow final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BrainFieldManager_C_PrivateSetDynamicShadow) == 0x000001, "Wrong alignment on BP_BrainFieldManager_C_PrivateSetDynamicShadow");
static_assert(sizeof(BP_BrainFieldManager_C_PrivateSetDynamicShadow) == 0x000001, "Wrong size on BP_BrainFieldManager_C_PrivateSetDynamicShadow");
static_assert(offsetof(BP_BrainFieldManager_C_PrivateSetDynamicShadow, Enable) == 0x000000, "Member 'BP_BrainFieldManager_C_PrivateSetDynamicShadow::Enable' has a wrong offset!");

// Function BP_BrainFieldManager.BP_BrainFieldManager_C.Private_DelayedHood
// 0x0018 (0x0018 - 0x0000)
struct BP_BrainFieldManager_C_Private_DelayedHood final
{
public:
