#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleSimulatorManager

#include "Basic.hpp"

#include "S_BattleSimulatorData_structs.hpp"


namespace SDK::Params
{

// Function BP_BattleSimulatorManager.BP_BattleSimulatorManager_C.ExecuteUbergraph_BP_BattleSimulatorManager
// 0x0140 (0x0140 - 0x0000)
struct BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53CF[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53D0[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadSoftClass_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTimerPause_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMissionActive_ReturnValue;              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53D1[0x5];                                     // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetPauseTimerList_ReturnValue;            // 0x0028(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53D2[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_BattleSimulatorData                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0050(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53D3[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABrainTalkManager*                      CallFunc_GetBrainTalkManager_BrainTalkManager;     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53D4[0x6];                                     // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleManager*                         CallFunc_GetBattleManager_ReturnValue;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53D5[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetEventManager_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEnemyManager*                          CallFunc_GetEnemyManager_EnemyManager;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   K2Node_DynamicCast_AsBPI_Event_Manager;            // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SimulatorCancelMission_ReturnValue;       // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x00E4(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53D6[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSHUDBase*                             CallFunc_GetHUDBase_HUDBase;                       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetVisionSimulatorTimerDraw_ReturnValue;  // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53D7[0x5];                                     // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSHUDBase*                             CallFunc_GetHUDBase_HUDBase_1;                     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSHUDBase*                             CallFunc_GetHUDBase_HUDBase_2;                     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetVisionSimulatorTimerDraw_ReturnValue_1; // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetVisionSimulatorTimerDraw_ReturnValue_2; // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53D8[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetEventManager_ReturnValue_1;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0120(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   K2Node_DynamicCast_AsBPI_Event_Manager_1;          // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetENPCPresetPlayerCamera_ret;            // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager) == 0x000008, "Wrong alignment on BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager");
static_assert(sizeof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager) == 0x000140, "Wrong size on BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, EntryPoint) == 0x000000, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_GetRSGameInstance_RSGameInstance) == 0x000008, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_GetRSGameInstance_RSGameInstance' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_LoadSoftClass_ReturnValue) == 0x000018, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_LoadSoftClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_IsTimerPause_ReturnValue) == 0x000020, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_IsTimerPause_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_IsMissionActive_ReturnValue) == 0x000021, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_IsMissionActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_GetPauseTimerList_ReturnValue) == 0x000028, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_GetPauseTimerList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_LoadSoftObject_ReturnValue) == 0x000038, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_LoadSoftObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, K2Node_DynamicCast_AsData_Table) == 0x000040, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::K2Node_DynamicCast_AsData_Table' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_GetDataTableRowFromName_OutRow) == 0x000050, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000098, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_GetBrainTalkManager_BrainTalkManager) == 0x0000A0, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_GetBrainTalkManager_BrainTalkManager' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_IsValid_ReturnValue_1) == 0x0000A8, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000A9, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_GetBattleManager_ReturnValue) == 0x0000B0, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_IsValid_ReturnValue_2) == 0x0000B8, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_GetEventManager_ReturnValue) == 0x0000C0, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_GetEventManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_GetEnemyManager_EnemyManager) == 0x0000C8, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_GetEnemyManager_EnemyManager' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, K2Node_DynamicCast_AsBPI_Event_Manager) == 0x0000D0, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::K2Node_DynamicCast_AsBPI_Event_Manager' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_IsValid_ReturnValue_3) == 0x0000E1, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_SimulatorCancelMission_ReturnValue) == 0x0000E2, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_SimulatorCancelMission_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_IsValid_ReturnValue_4) == 0x0000E3, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, Temp_name_Variable) == 0x0000E4, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_GetHUDBase_HUDBase) == 0x0000F0, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_GetHUDBase_HUDBase' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_Array_Contains_ReturnValue) == 0x0000F8, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_IsValid_ReturnValue_5) == 0x0000F9, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_SetVisionSimulatorTimerDraw_ReturnValue) == 0x0000FA, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_SetVisionSimulatorTimerDraw_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_GetHUDBase_HUDBase_1) == 0x000100, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_GetHUDBase_HUDBase_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_GetHUDBase_HUDBase_2) == 0x000108, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_GetHUDBase_HUDBase_2' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_IsValid_ReturnValue_6) == 0x000110, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_IsValid_ReturnValue_7) == 0x000111, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_SetVisionSimulatorTimerDraw_ReturnValue_1) == 0x000112, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_SetVisionSimulatorTimerDraw_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_SetVisionSimulatorTimerDraw_ReturnValue_2) == 0x000113, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_SetVisionSimulatorTimerDraw_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_GetEventManager_ReturnValue_1) == 0x000118, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_GetEventManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, Temp_name_Variable_1) == 0x000120, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, K2Node_DynamicCast_AsBPI_Event_Manager_1) == 0x000128, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::K2Node_DynamicCast_AsBPI_Event_Manager_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, K2Node_DynamicCast_bSuccess_2) == 0x000138, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_SetENPCPresetPlayerCamera_ret) == 0x000139, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_SetENPCPresetPlayerCamera_ret' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_Array_Contains_ReturnValue_1) == 0x00013A, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager, CallFunc_IsValid_ReturnValue_8) == 0x00013B, "Member 'BP_BattleSimulatorManager_C_ExecuteUbergraph_BP_BattleSimulatorManager::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");

// Function BP_BattleSimulatorManager.BP_BattleSimulatorManager_C.IsDebugBattleSimulatorAccesFlag
// 0x0030 (0x0030 - 0x0000)
struct BP_BattleSimulatorManager_C_IsDebugBattleSimulatorAccesFlag final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Enable;                                            // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53D9[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetDebuggingManager_DebuggingManager;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53DA[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInterface>            K2Node_DynamicCast_AsBPDebugging_Manager_Interface; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetOpenDebugBattleSimulatorAccessFlag_Enable; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BattleSimulatorManager_C_IsDebugBattleSimulatorAccesFlag) == 0x000008, "Wrong alignment on BP_BattleSimulatorManager_C_IsDebugBattleSimulatorAccesFlag");
static_assert(sizeof(BP_BattleSimulatorManager_C_IsDebugBattleSimulatorAccesFlag) == 0x000030, "Wrong size on BP_BattleSimulatorManager_C_IsDebugBattleSimulatorAccesFlag");
static_assert(offsetof(BP_BattleSimulatorManager_C_IsDebugBattleSimulatorAccesFlag, Return) == 0x000000, "Member 'BP_BattleSimulatorManager_C_IsDebugBattleSimulatorAccesFlag::Return' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_IsDebugBattleSimulatorAccesFlag, Enable) == 0x000001, "Member 'BP_BattleSimulatorManager_C_IsDebugBattleSimulatorAccesFlag::Enable' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_IsDebugBattleSimulatorAccesFlag, CallFunc_GetDebuggingManager_DebuggingManager) == 0x000008, "Member 'BP_BattleSimulatorManager_C_IsDebugBattleSimulatorAccesFlag::CallFunc_GetDebuggingManager_DebuggingManager' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_IsDebugBattleSimulatorAccesFlag, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_BattleSimulatorManager_C_IsDebugBattleSimulatorAccesFlag::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_IsDebugBattleSimulatorAccesFlag, K2Node_DynamicCast_AsBPDebugging_Manager_Interface) == 0x000018, "Member 'BP_BattleSimulatorManager_C_IsDebugBattleSimulatorAccesFlag::K2Node_DynamicCast_AsBPDebugging_Manager_Interface' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_IsDebugBattleSimulatorAccesFlag, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_BattleSimulatorManager_C_IsDebugBattleSimulatorAccesFlag::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_IsDebugBattleSimulatorAccesFlag, CallFunc_GetOpenDebugBattleSimulatorAccessFlag_Enable) == 0x000029, "Member 'BP_BattleSimulatorManager_C_IsDebugBattleSimulatorAccesFlag::CallFunc_GetOpenDebugBattleSimulatorAccessFlag_Enable' has a wrong offset!");

// Function BP_BattleSimulatorManager.BP_BattleSimulatorManager_C.IsOpenBattleSimulator
// 0x00C0 (0x00C0 - 0x0000)
struct BP_BattleSimulatorManager_C_IsOpenBattleSimulator final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          IsExNewGameFlow;                                   // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53DB[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetEventManager_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   K2Node_DynamicCast_AsBPI_Event_Manager;            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53DC[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetProgressID_ProgressID;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53DD[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Mid_ReturnValue;                          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53DE[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Mid_ReturnValue_1;                        // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53DF[0x6];                                     // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53E0[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Mid_ReturnValue_2;                        // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUserParamManager*                      CallFunc_GetUserParamManager_UserParamManager;     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsExNewGameFlow_ReturnValue;              // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDebugBattleSimulatorAccesFlag_return;   // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDLC2PatchReleaseVersion_ReturnValue;    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BattleSimulatorManager_C_IsOpenBattleSimulator) == 0x000008, "Wrong alignment on BP_BattleSimulatorManager_C_IsOpenBattleSimulator");
static_assert(sizeof(BP_BattleSimulatorManager_C_IsOpenBattleSimulator) == 0x0000C0, "Wrong size on BP_BattleSimulatorManager_C_IsOpenBattleSimulator");
static_assert(offsetof(BP_BattleSimulatorManager_C_IsOpenBattleSimulator, ReturnValue) == 0x000000, "Member 'BP_BattleSimulatorManager_C_IsOpenBattleSimulator::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleSimulatorManager_C_IsOpenBattleSimulator, IsExNewGameFlow) == 0x000001, "Member 'BP_BattleSimulatorManager_C_IsOpenBattleSimulator::IsExNewGameFlow' has a wrong offset!");
