#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BSPPortal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BSPPortal.BP_BSPPortal_C
// 0x0018 (0x0270 - 0x0258)
class ABP_BSPPortal_C final : public ABSPPortalBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BSPPortal(int32 EntryPoint);
	void BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void CheckOverlapComponent();
	void _InitializeNearBlockVolumes();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BSPPortal_C">();
	}
	static class ABP_BSPPortal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BSPPortal_C>();
	}
};
static_assert(alignof(ABP_BSPPortal_C) == 0x000008, "Wrong alignment on ABP_BSPPortal_C");
static_assert(sizeof(ABP_BSPPortal_C) == 0x000270, "Wrong size on ABP_BSPPortal_C");
static_assert(offsetof(ABP_BSPPortal_C, UberGraphFrame) == 0x000258, "Member 'ABP_BSPPortal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BSPPortal_C, Box) == 0x000260, "Member 'ABP_BSPPortal_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_BSPPortal_C, DefaultSceneRoot) == 0x000268, "Member 'ABP_BSPPortal_C::DefaultSceneRoot' has a wrong offset!");

}

