#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BT_m01_Interval

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_MakeEventActorChild_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BT_m01_Interval.BP_BT_m01_Interval_C
// 0x0018 (0x04A0 - 0x0488)
class ABP_BT_m01_Interval_C final : public ABP_MakeEventActorChild_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_BT_m01_Interval_C;               // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   BT_m01_320;                                        // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BT_m01_330;                                        // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BT_m01_Interval(int32 EntryPoint);
	void StartEvent();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BT_m01_Interval_C">();
	}
	static class ABP_BT_m01_Interval_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BT_m01_Interval_C>();
	}
};
static_assert(alignof(ABP_BT_m01_Interval_C) == 0x000008, "Wrong alignment on ABP_BT_m01_Interval_C");
static_assert(sizeof(ABP_BT_m01_Interval_C) == 0x0004A0, "Wrong size on ABP_BT_m01_Interval_C");
static_assert(offsetof(ABP_BT_m01_Interval_C, UberGraphFrame_BP_BT_m01_Interval_C) == 0x000488, "Member 'ABP_BT_m01_Interval_C::UberGraphFrame_BP_BT_m01_Interval_C' has a wrong offset!");
static_assert(offsetof(ABP_BT_m01_Interval_C, BT_m01_320) == 0x000490, "Member 'ABP_BT_m01_Interval_C::BT_m01_320' has a wrong offset!");
static_assert(offsetof(ABP_BT_m01_Interval_C, BT_m01_330) == 0x000498, "Member 'ABP_BT_m01_Interval_C::BT_m01_330' has a wrong offset!");

}

