#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BgmComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_RSAtomComponent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BgmComponent.BP_BgmComponent_C
// 0x0010 (0x1270 - 0x1260)
class UBP_BgmComponent_C final : public UBP_RSAtomComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_BgmComponent_C;                  // 0x1260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         TmpAisac;                                          // 0x1268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TmpDulation;                                       // 0x126C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BgmComponent(int32 EntryPoint);
	void OnElectricStart(const struct FFSASElectricParam& Param, class AActor* Owner);
	void OnElectricEnd(const struct FFSASElectricParam& Param, class AActor* Owner, float RemainTime);
	void OnFireStart(const struct FFSASFireParam& Param, class AActor* Owner);
	void OnFireEnd(const struct FFSASFireParam& Param, class AActor* Owner, float RemainTime);
	void OnAcceleratorEnd(const struct FAcceleratorParam& Parameter, class AActor* Owner, float RemainTime, bool bHologram);
	void OnAcceleratorStart(const struct FAcceleratorParam& Parameter, class AActor* Owner, bool bHologram);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BgmComponent_C">();
	}
	static class UBP_BgmComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BgmComponent_C>();
	}
};
static_assert(alignof(UBP_BgmComponent_C) == 0x000010, "Wrong alignment on UBP_BgmComponent_C");
static_assert(sizeof(UBP_BgmComponent_C) == 0x001270, "Wrong size on UBP_BgmComponent_C");
static_assert(offsetof(UBP_BgmComponent_C, UberGraphFrame_BP_BgmComponent_C) == 0x001260, "Member 'UBP_BgmComponent_C::UberGraphFrame_BP_BgmComponent_C' has a wrong offset!");
static_assert(offsetof(UBP_BgmComponent_C, TmpAisac) == 0x001268, "Member 'UBP_BgmComponent_C::TmpAisac' has a wrong offset!");
static_assert(offsetof(UBP_BgmComponent_C, TmpDulation) == 0x00126C, "Member 'UBP_BgmComponent_C::TmpDulation' has a wrong offset!");

}

