#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleManager

#include "Basic.hpp"

#include "FEventTriggerCommandData_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_EnemySound_structs.hpp"
#include "Struct_EnemyDeadLogParam_structs.hpp"
#include "EDeadFactor_structs.hpp"
#include "E_SASKind_structs.hpp"


namespace SDK::Params
{

// Function BP_BattleManager.BP_BattleManager_C.OnHpDownEvent__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct BP_BattleManager_C_OnHpDownEvent__DelegateSignature final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCharacterHPEventInfo                  EventInfo;                                         // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_BattleManager_C_OnHpDownEvent__DelegateSignature) == 0x000008, "Wrong alignment on BP_BattleManager_C_OnHpDownEvent__DelegateSignature");
static_assert(sizeof(BP_BattleManager_C_OnHpDownEvent__DelegateSignature) == 0x000030, "Wrong size on BP_BattleManager_C_OnHpDownEvent__DelegateSignature");
static_assert(offsetof(BP_BattleManager_C_OnHpDownEvent__DelegateSignature, Actor) == 0x000000, "Member 'BP_BattleManager_C_OnHpDownEvent__DelegateSignature::Actor' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_OnHpDownEvent__DelegateSignature, EventInfo) == 0x000008, "Member 'BP_BattleManager_C_OnHpDownEvent__DelegateSignature::EventInfo' has a wrong offset!");

// Function BP_BattleManager.BP_BattleManager_C.ExecuteUbergraph_BP_BattleManager
// 0x00B0 (0x00B0 - 0x0000)
struct BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BB0[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Is_Disp_Enemy_Name_Log_displayName;       // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BB1[0x5];                                     // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame_1;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetLogGetItem_ReturnValue;                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BB2[0x1];                                     // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_helpTutoID;                           // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_delaySec;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame_2;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CloseTutoOperation_ReturnValue;           // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartTutoOperation_ReturnValue;           // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BB3[0x1];                                     // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class ABP_BattlefieldManager_C*               CallFunc_GetBattlefieldManager_BP_BattlefieldManager; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BB4[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame_3;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFade_ReturnValue;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFadeAnimation_ReturnValue;              // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BB5[0x5];                                     // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetEventManager_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEventManager*                          K2Node_DynamicCast_AsEvent_Manager;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCutSceneEventNative_ReturnValue;        // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameOverResult                               CallFunc_GetGameOverResult_Result;                 // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEndGameOver_IsEnd;                      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BB6[0x1];                                     // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager) == 0x000008, "Wrong alignment on BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager");
static_assert(sizeof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager) == 0x0000B0, "Wrong size on BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, EntryPoint) == 0x000000, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_Conv_NameToString_ReturnValue) == 0x000010, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000020, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_NotEqual_NameName_ReturnValue) == 0x000021, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_Is_Disp_Enemy_Name_Log_displayName) == 0x000022, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_Is_Disp_Enemy_Name_Log_displayName' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000028, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_GetHUDMainGame_HUDMainGame_1) == 0x000030, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_GetHUDMainGame_HUDMainGame_1' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, Temp_bool_IsClosed_Variable) == 0x000038, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_SetLogGetItem_ReturnValue) == 0x000039, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_SetLogGetItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, Temp_bool_Has_Been_Initd_Variable) == 0x00003A, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, K2Node_Event_helpTutoID) == 0x00003C, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::K2Node_Event_helpTutoID' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, K2Node_Event_delaySec) == 0x000044, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::K2Node_Event_delaySec' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_GetHUDMainGame_HUDMainGame_2) == 0x000048, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_GetHUDMainGame_HUDMainGame_2' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000050, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_IsValid_ReturnValue) == 0x000054, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_CloseTutoOperation_ReturnValue) == 0x000055, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_CloseTutoOperation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_StartTutoOperation_ReturnValue) == 0x000056, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_StartTutoOperation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_GetBattlefieldManager_BP_BattlefieldManager) == 0x000068, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_GetBattlefieldManager_BP_BattlefieldManager' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_GetHUDMainGame_HUDMainGame_3) == 0x000078, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_GetHUDMainGame_HUDMainGame_3' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_IsFade_ReturnValue) == 0x000080, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_IsFade_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_IsFadeAnimation_ReturnValue) == 0x000081, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_IsFadeAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_BooleanOR_ReturnValue) == 0x000082, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_GetEventManager_ReturnValue) == 0x000088, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_GetEventManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, K2Node_DynamicCast_AsEvent_Manager) == 0x000090, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::K2Node_DynamicCast_AsEvent_Manager' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_IsCutSceneEventNative_ReturnValue) == 0x000099, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_IsCutSceneEventNative_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_IsValid_ReturnValue_2) == 0x00009A, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_GetGameOverResult_Result) == 0x00009B, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_GetGameOverResult_Result' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_IsEndGameOver_IsEnd) == 0x00009C, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_IsEndGameOver_IsEnd' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, K2Node_SwitchEnum_CmpSuccess) == 0x00009D, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, CallFunc_Not_PreBool_ReturnValue) == 0x00009E, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000A0, "Member 'BP_BattleManager_C_ExecuteUbergraph_BP_BattleManager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function BP_BattleManager.BP_BattleManager_C.StartTutorialOperation
// 0x000C (0x000C - 0x0000)
struct BP_BattleManager_C_StartTutorialOperation final
{
public:
	class FName                                   HelpTutoID;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelaySec;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleManager_C_StartTutorialOperation) == 0x000004, "Wrong alignment on BP_BattleManager_C_StartTutorialOperation");
static_assert(sizeof(BP_BattleManager_C_StartTutorialOperation) == 0x00000C, "Wrong size on BP_BattleManager_C_StartTutorialOperation");
static_assert(offsetof(BP_BattleManager_C_StartTutorialOperation, HelpTutoID) == 0x000000, "Member 'BP_BattleManager_C_StartTutorialOperation::HelpTutoID' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_StartTutorialOperation, DelaySec) == 0x000008, "Member 'BP_BattleManager_C_StartTutorialOperation::DelaySec' has a wrong offset!");

// Function BP_BattleManager.BP_BattleManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_BattleManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_BattleManager_C_ReceiveTick");
static_assert(sizeof(BP_BattleManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_BattleManager_C_ReceiveTick");
static_assert(offsetof(BP_BattleManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_BattleManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_BattleManager.BP_BattleManager_C.UpdateBattleMode
// 0x01D8 (0x01D8 - 0x0000)
struct BP_BattleManager_C_UpdateBattleMode final
{
public:
	class ARSBattlePlayer_C*                      LMainPlayer;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LbAfterPlayerStealth;                              // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LbPlayerStealth;                                   // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BB7[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    PlayerManager;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebugForceBattleFlag;                             // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BB8[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARSCharacterBase*>               PlayerList;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BB9[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LevelManager_C*                     CallFunc_GetLevelManager_LevelManager;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidCurrentSimulatorLevelInfosName_ReturnValue; // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidEventCommandEnemyExterminationEvent_IsValid; // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BBA[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFEventTriggerCommandData              CallFunc_IsValidEventCommandEnemyExterminationEvent_EventTriggerCommandData; // 0x0050(0x0078)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleSimulatorManager*                CallFunc_GetBattleSimulatorManager_BattleSimulatorManager; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMissionActive_ReturnValue;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BBB[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LevelManager_C*                     CallFunc_GetLevelManager_LevelManager_1;           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidCurrentSimulatorLevelInfosName_ReturnValue_1; // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BBC[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckBattleLog_StealthLost_ReturnValue;   // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayBrainTalkStealthLost_ReturnValue;     // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BBD[0x1];                                     // 0x00EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsForceBattle_ReturnValue;                // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BBE[0x3];                                     // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerStealth_bStealth;                 // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerStealth_bAfterStealth;            // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckExistBattleEnemy_bExistEnemy;        // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BBF[0x1];                                     // 0x00FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_CheckExistBattleEnemy_LastEnemy;          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ARSCharacterBase*>               CallFunc_GetPlayerList_ReturnValue;                // 0x0108(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BattlefieldManager_C*               CallFunc_GetBattlefieldManager_BP_BattlefieldManager; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyFenceEnabled_ReturnValue;            // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BC0[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetDebuggingManager_Manager;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EnemyManager_C*                     CallFunc_GetEnemyManager_Manager;                  // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	Enum_EnemySound                               CallFunc_GetEnemySound_return;                     // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC1[0x6];                                     // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SoundManager_C*                     CallFunc_GetSoundManager_SoundManager;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SoundManager_C*                     CallFunc_GetSoundManager_SoundManager_1;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager_1;         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsForceBattle_ReturnValue_1;              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckExistBattleEnemy_bExistEnemy_1;      // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BC2[0x6];                                     // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_CheckExistBattleEnemy_LastEnemy_1;        // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_Array_Get_Item;                           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC3[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface;         // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetPlayerBattle_bDummy;                   // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0193(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BC4[0x3];                                     // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_Array_Get_Item_1;                         // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface_1;       // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetPlayerBattle_bDummy_1;                 // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingAnyDead_Playing;                 // 0x01BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BC5[0x4];                                     // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARSCharacterBase*>               CallFunc_GetPlayerList_ReturnValue_1;              // 0x01C0(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsBattleMode_ReturnValue;                 // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BattleManager_C_UpdateBattleMode) == 0x000008, "Wrong alignment on BP_BattleManager_C_UpdateBattleMode");
static_assert(sizeof(BP_BattleManager_C_UpdateBattleMode) == 0x0001D8, "Wrong size on BP_BattleManager_C_UpdateBattleMode");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, LMainPlayer) == 0x000000, "Member 'BP_BattleManager_C_UpdateBattleMode::LMainPlayer' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, LbAfterPlayerStealth) == 0x000008, "Member 'BP_BattleManager_C_UpdateBattleMode::LbAfterPlayerStealth' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, LbPlayerStealth) == 0x000009, "Member 'BP_BattleManager_C_UpdateBattleMode::LbPlayerStealth' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, PlayerManager) == 0x000010, "Member 'BP_BattleManager_C_UpdateBattleMode::PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, bDebugForceBattleFlag) == 0x000018, "Member 'BP_BattleManager_C_UpdateBattleMode::bDebugForceBattleFlag' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, PlayerList) == 0x000020, "Member 'BP_BattleManager_C_UpdateBattleMode::PlayerList' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, Temp_int_Array_Index_Variable) == 0x000030, "Member 'BP_BattleManager_C_UpdateBattleMode::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_GetEventManager_EventManager) == 0x000038, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_GetLevelManager_LevelManager) == 0x000040, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_GetLevelManager_LevelManager' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_IsValidCurrentSimulatorLevelInfosName_ReturnValue) == 0x00004A, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_IsValidCurrentSimulatorLevelInfosName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_IsValidEventCommandEnemyExterminationEvent_IsValid) == 0x00004B, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_IsValidEventCommandEnemyExterminationEvent_IsValid' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_IsValidEventCommandEnemyExterminationEvent_EventTriggerCommandData) == 0x000050, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_IsValidEventCommandEnemyExterminationEvent_EventTriggerCommandData' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_GetBattleSimulatorManager_BattleSimulatorManager) == 0x0000C8, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_GetBattleSimulatorManager_BattleSimulatorManager' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_IsMissionActive_ReturnValue) == 0x0000D0, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_IsMissionActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_GetLevelManager_LevelManager_1) == 0x0000D8, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_GetLevelManager_LevelManager_1' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_IsValidCurrentSimulatorLevelInfosName_ReturnValue_1) == 0x0000E0, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_IsValidCurrentSimulatorLevelInfosName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, Temp_int_Loop_Counter_Variable) == 0x0000E4, "Member 'BP_BattleManager_C_UpdateBattleMode::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_Add_IntInt_ReturnValue) == 0x0000E8, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_CheckBattleLog_StealthLost_ReturnValue) == 0x0000EC, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_CheckBattleLog_StealthLost_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_Not_PreBool_ReturnValue) == 0x0000ED, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_PlayBrainTalkStealthLost_ReturnValue) == 0x0000EE, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_PlayBrainTalkStealthLost_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, Temp_int_Loop_Counter_Variable_1) == 0x0000F0, "Member 'BP_BattleManager_C_UpdateBattleMode::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_IsForceBattle_ReturnValue) == 0x0000F4, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_IsForceBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000F8, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_IsPlayerStealth_bStealth) == 0x0000FC, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_IsPlayerStealth_bStealth' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_IsPlayerStealth_bAfterStealth) == 0x0000FD, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_IsPlayerStealth_bAfterStealth' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_CheckExistBattleEnemy_bExistEnemy) == 0x0000FE, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_CheckExistBattleEnemy_bExistEnemy' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_CheckExistBattleEnemy_LastEnemy) == 0x000100, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_CheckExistBattleEnemy_LastEnemy' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_GetPlayerList_ReturnValue) == 0x000108, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_GetPlayerList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_GetPlayerManager_PlayerManager) == 0x000118, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_GetBattlefieldManager_BP_BattlefieldManager) == 0x000120, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_GetBattlefieldManager_BP_BattlefieldManager' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_IsAnyFenceEnabled_ReturnValue) == 0x000128, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_IsAnyFenceEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_GetDebuggingManager_Manager) == 0x000130, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_GetDebuggingManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_GetEnemyManager_Manager) == 0x000138, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_GetEnemyManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_IsValid_ReturnValue_2) == 0x000140, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_GetEnemySound_return) == 0x000141, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_GetEnemySound_return' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_GetSoundManager_SoundManager) == 0x000148, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_GetSoundManager_SoundManager' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_GetSoundManager_SoundManager_1) == 0x000150, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_GetSoundManager_SoundManager_1' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_GetPlayerManager_PlayerManager_1) == 0x000158, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_GetPlayerManager_PlayerManager_1' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_IsForceBattle_ReturnValue_1) == 0x000160, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_IsForceBattle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_CheckExistBattleEnemy_bExistEnemy_1) == 0x000161, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_CheckExistBattleEnemy_bExistEnemy_1' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_CheckExistBattleEnemy_LastEnemy_1) == 0x000168, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_CheckExistBattleEnemy_LastEnemy_1' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_Array_Get_Item) == 0x000170, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_Array_Length_ReturnValue) == 0x000178, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, K2Node_DynamicCast_AsBPI_Player_Interface) == 0x000180, "Member 'BP_BattleManager_C_UpdateBattleMode::K2Node_DynamicCast_AsBPI_Player_Interface' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, K2Node_DynamicCast_bSuccess) == 0x000190, "Member 'BP_BattleManager_C_UpdateBattleMode::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_Less_IntInt_ReturnValue) == 0x000191, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_SetPlayerBattle_bDummy) == 0x000192, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_SetPlayerBattle_bDummy' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_IsValid_ReturnValue_3) == 0x000193, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_Array_Length_ReturnValue_1) == 0x000194, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, Temp_int_Array_Index_Variable_1) == 0x000198, "Member 'BP_BattleManager_C_UpdateBattleMode::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_Less_IntInt_ReturnValue_1) == 0x00019C, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_Array_Get_Item_1) == 0x0001A0, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, K2Node_DynamicCast_AsBPI_Player_Interface_1) == 0x0001A8, "Member 'BP_BattleManager_C_UpdateBattleMode::K2Node_DynamicCast_AsBPI_Player_Interface_1' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, K2Node_DynamicCast_bSuccess_1) == 0x0001B8, "Member 'BP_BattleManager_C_UpdateBattleMode::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_IsValid_ReturnValue_4) == 0x0001B9, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_SetPlayerBattle_bDummy_1) == 0x0001BA, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_SetPlayerBattle_bDummy_1' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_IsPlayingAnyDead_Playing) == 0x0001BB, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_IsPlayingAnyDead_Playing' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_GetPlayerList_ReturnValue_1) == 0x0001C0, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_GetPlayerList_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleMode, CallFunc_IsBattleMode_ReturnValue) == 0x0001D0, "Member 'BP_BattleManager_C_UpdateBattleMode::CallFunc_IsBattleMode_ReturnValue' has a wrong offset!");

// Function BP_BattleManager.BP_BattleManager_C.UpdateBattleSound
// 0x0020 (0x0020 - 0x0000)
struct BP_BattleManager_C_UpdateBattleSound final
{
public:
	Enum_EnemySound                               EnemySound;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC6[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SoundManager_C*                     CallFunc_GetSoundManager_SoundManager;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EnemyManager_C*                     CallFunc_GetEnemyManager_Manager;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_EnemySound                               CallFunc_GetEnemySound_return;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBattleMode_ReturnValue;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BattleManager_C_UpdateBattleSound) == 0x000008, "Wrong alignment on BP_BattleManager_C_UpdateBattleSound");
static_assert(sizeof(BP_BattleManager_C_UpdateBattleSound) == 0x000020, "Wrong size on BP_BattleManager_C_UpdateBattleSound");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleSound, EnemySound) == 0x000000, "Member 'BP_BattleManager_C_UpdateBattleSound::EnemySound' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleSound, CallFunc_GetSoundManager_SoundManager) == 0x000008, "Member 'BP_BattleManager_C_UpdateBattleSound::CallFunc_GetSoundManager_SoundManager' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleSound, CallFunc_GetEnemyManager_Manager) == 0x000010, "Member 'BP_BattleManager_C_UpdateBattleSound::CallFunc_GetEnemyManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleSound, CallFunc_GetEnemySound_return) == 0x000018, "Member 'BP_BattleManager_C_UpdateBattleSound::CallFunc_GetEnemySound_return' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleSound, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000019, "Member 'BP_BattleManager_C_UpdateBattleSound::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleManager_C_UpdateBattleSound, CallFunc_IsBattleMode_ReturnValue) == 0x00001A, "Member 'BP_BattleManager_C_UpdateBattleSound::CallFunc_IsBattleMode_ReturnValue' has a wrong offset!");

// Function BP_BattleManager.BP_BattleManager_C.GetSituation
// 0x0008 (0x0008 - 0x0000)
struct BP_BattleManager_C_GetSituation final
{
public:
	class UBattleSituationComponent*              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleManager_C_GetSituation) == 0x000008, "Wrong alignment on BP_BattleManager_C_GetSituation");
static_assert(sizeof(BP_BattleManager_C_GetSituation) == 0x000008, "Wrong size on BP_BattleManager_C_GetSituation");
static_assert(offsetof(BP_BattleManager_C_GetSituation, ReturnValue) == 0x000000, "Member 'BP_BattleManager_C_GetSituation::ReturnValue' has a wrong offset!");

// Function BP_BattleManager.BP_BattleManager_C.SetEnemyDead
// 0x06D0 (0x06D0 - 0x0000)
struct BP_BattleManager_C_SetEnemyDead final
{
public:
	class FName                                   Character_ID;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DropDataIndex;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC7[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             EnemyLocation;                                     // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	EDeadFactor                                   DeadFactor;                                        // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC8[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DeadActorLevel;                                    // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseDeadCharacterName;                              // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BC9[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DeadCharacterName;                                 // 0x004C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDefeatedMainPlayer;                               // 0x0054(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsDispKillEnemyName;                               // 0x0055(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BCA[0x2];                                     // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   LogReplaceName;                                    // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHCHitResult                           DeadHitResult;                                     // 0x0060(0x01C0)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	class ARSBattlePlayer_C*                      LPluginRecoveryPlayer;                             // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     LPluginRecoveryPlayerID;                           // 0x0228(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BCB[0x3];                                     // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AccessoryCrashRecoveryRate;                        // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LIsUnique;                                         // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LIsCV;                                             // 0x0231(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BCC[0x2];                                     // 0x0232(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   LogCharacterID;                                    // 0x0234(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LMainPlayerExp;                                    // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LProbability;                                      // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LRandomValue;                                      // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 LIntegerList;                                      // 0x0248(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          LFindEnemyDropData;                                // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BCD[0x3];                                     // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBattleLogParam                        BattleLogParam;                                    // 0x025C(0x0028)(Edit, BlueprintVisible, NoDestructor)
	float                                         LMoneyBonusRate;                                   // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerManager_C*                    LPlayerManager;                                    // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LExpBonusRate;                                     // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BCE[0x4];                                     // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      LMainPlayer;                                       // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LDropCopy;                                         // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BCF[0x3];                                     // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LDropProbabilityOffset;                            // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LMoney;                                            // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LExp;                                              // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserParamManager*                      LUserParamManager;                                 // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEnemyDropDataCell                     LEnemyDropData;                                    // 0x02B8(0x0038)(Edit, BlueprintVisible)
	class FName                                   NewLocalVar_0;                                     // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
