#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BT_m09_Interval

#include "Basic.hpp"

#include "FEventTriggerCommand_structs.hpp"


namespace SDK::Params
{

// Function BP_BT_m09_Interval.BP_BT_m09_Interval_C.ExecuteUbergraph_BP_BT_m09_Interval
// 0x02B8 (0x02B8 - 0x0000)
struct BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_581A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFEventTriggerCommand                  K2Node_MakeStruct_FEventTriggerCommand;            // 0x0010(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_581B[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_AddEventTriggerCommand_self_CastInput;    // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFEventTriggerCommand                  K2Node_MakeStruct_FEventTriggerCommand_1;          // 0x0090(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_1;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_AddEventTriggerCommand_self_CastInput_1;  // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_581C[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFEventTriggerCommand                  K2Node_MakeStruct_FEventTriggerCommand_2;          // 0x0118(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_2;           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager;             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_AddEventTriggerCommand_self_CastInput_2;  // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckScenarioFlag_ReturnValue;            // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckScenarioFlag_ReturnValue_1;          // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckScenarioFlag_ReturnValue_2;          // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckScenarioFlag_ReturnValue_3;          // 0x01A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckScenarioFlag_ReturnValue_4;          // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_581D[0x2];                                     // 0x01A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFEventTriggerCommand                  K2Node_MakeStruct_FEventTriggerCommand_3;          // 0x01A8(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_3;           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_AddEventTriggerCommand_self_CastInput_3;  // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_581E[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFEventTriggerCommand                  K2Node_MakeStruct_FEventTriggerCommand_4;          // 0x0230(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_4;           // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_AddEventTriggerCommand_self_CastInput_4;  // 0x02A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval) == 0x000008, "Wrong alignment on BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval");
static_assert(sizeof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval) == 0x0002B8, "Wrong size on BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, EntryPoint) == 0x000000, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, CallFunc_GetEventManager_EventManager) == 0x000008, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, K2Node_MakeStruct_FEventTriggerCommand) == 0x000010, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::K2Node_MakeStruct_FEventTriggerCommand' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, CallFunc_AddEventTriggerCommand_self_CastInput) == 0x000080, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::CallFunc_AddEventTriggerCommand_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, K2Node_MakeStruct_FEventTriggerCommand_1) == 0x000090, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::K2Node_MakeStruct_FEventTriggerCommand_1' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, CallFunc_GetEventManager_EventManager_1) == 0x0000F8, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::CallFunc_GetEventManager_EventManager_1' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, CallFunc_AddEventTriggerCommand_self_CastInput_1) == 0x000100, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::CallFunc_AddEventTriggerCommand_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, CallFunc_IsValid_ReturnValue_1) == 0x000110, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, K2Node_MakeStruct_FEventTriggerCommand_2) == 0x000118, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::K2Node_MakeStruct_FEventTriggerCommand_2' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, CallFunc_GetEventManager_EventManager_2) == 0x000180, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::CallFunc_GetEventManager_EventManager_2' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, CallFunc_GetSceneManager_SceneManager) == 0x000188, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::CallFunc_GetSceneManager_SceneManager' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, CallFunc_AddEventTriggerCommand_self_CastInput_2) == 0x000190, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::CallFunc_AddEventTriggerCommand_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, CallFunc_CheckScenarioFlag_ReturnValue) == 0x0001A0, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::CallFunc_CheckScenarioFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, CallFunc_CheckScenarioFlag_ReturnValue_1) == 0x0001A1, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::CallFunc_CheckScenarioFlag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, CallFunc_CheckScenarioFlag_ReturnValue_2) == 0x0001A2, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::CallFunc_CheckScenarioFlag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, CallFunc_CheckScenarioFlag_ReturnValue_3) == 0x0001A3, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::CallFunc_CheckScenarioFlag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, CallFunc_CheckScenarioFlag_ReturnValue_4) == 0x0001A4, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::CallFunc_CheckScenarioFlag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, CallFunc_IsValid_ReturnValue_2) == 0x0001A5, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, K2Node_MakeStruct_FEventTriggerCommand_3) == 0x0001A8, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::K2Node_MakeStruct_FEventTriggerCommand_3' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, CallFunc_GetEventManager_EventManager_3) == 0x000210, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::CallFunc_GetEventManager_EventManager_3' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, CallFunc_AddEventTriggerCommand_self_CastInput_3) == 0x000218, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::CallFunc_AddEventTriggerCommand_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, CallFunc_IsValid_ReturnValue_3) == 0x000228, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, K2Node_MakeStruct_FEventTriggerCommand_4) == 0x000230, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::K2Node_MakeStruct_FEventTriggerCommand_4' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, CallFunc_GetEventManager_EventManager_4) == 0x000298, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::CallFunc_GetEventManager_EventManager_4' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, CallFunc_AddEventTriggerCommand_self_CastInput_4) == 0x0002A0, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::CallFunc_AddEventTriggerCommand_self_CastInput_4' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval, CallFunc_IsValid_ReturnValue_4) == 0x0002B0, "Member 'BP_BT_m09_Interval_C_ExecuteUbergraph_BP_BT_m09_Interval::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");

}

