#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BonusGhostTrailComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_BonusGhostTrailComponent.BP_BonusGhostTrailComponent_C.ExecuteUbergraph_BP_BonusGhostTrailComponent
// 0x0004 (0x0004 - 0x0000)
struct BP_BonusGhostTrailComponent_C_ExecuteUbergraph_BP_BonusGhostTrailComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BonusGhostTrailComponent_C_ExecuteUbergraph_BP_BonusGhostTrailComponent) == 0x000004, "Wrong alignment on BP_BonusGhostTrailComponent_C_ExecuteUbergraph_BP_BonusGhostTrailComponent");
static_assert(sizeof(BP_BonusGhostTrailComponent_C_ExecuteUbergraph_BP_BonusGhostTrailComponent) == 0x000004, "Wrong size on BP_BonusGhostTrailComponent_C_ExecuteUbergraph_BP_BonusGhostTrailComponent");
static_assert(offsetof(BP_BonusGhostTrailComponent_C_ExecuteUbergraph_BP_BonusGhostTrailComponent, EntryPoint) == 0x000000, "Member 'BP_BonusGhostTrailComponent_C_ExecuteUbergraph_BP_BonusGhostTrailComponent::EntryPoint' has a wrong offset!");

// Function BP_BonusGhostTrailComponent.BP_BonusGhostTrailComponent_C.SpawnManager
// 0x0070 (0x0070 - 0x0000)
struct BP_BonusGhostTrailComponent_C_SpawnManager final
{
public:
	class ABP_GhostTrailManager_C*                Param_GhostTrailManager;                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F6F[0x8];                                     // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F70[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BonusGhostTrailManager_C*           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BonusGhostTrailComponent_C_SpawnManager) == 0x000010, "Wrong alignment on BP_BonusGhostTrailComponent_C_SpawnManager");
static_assert(sizeof(BP_BonusGhostTrailComponent_C_SpawnManager) == 0x000070, "Wrong size on BP_BonusGhostTrailComponent_C_SpawnManager");
static_assert(offsetof(BP_BonusGhostTrailComponent_C_SpawnManager, Param_GhostTrailManager) == 0x000000, "Member 'BP_BonusGhostTrailComponent_C_SpawnManager::Param_GhostTrailManager' has a wrong offset!");
static_assert(offsetof(BP_BonusGhostTrailComponent_C_SpawnManager, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_BonusGhostTrailComponent_C_SpawnManager::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BonusGhostTrailComponent_C_SpawnManager, CallFunc_GetOwner_ReturnValue_1) == 0x000010, "Member 'BP_BonusGhostTrailComponent_C_SpawnManager::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BonusGhostTrailComponent_C_SpawnManager, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'BP_BonusGhostTrailComponent_C_SpawnManager::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BonusGhostTrailComponent_C_SpawnManager, K2Node_DynamicCast_AsPawn) == 0x000050, "Member 'BP_BonusGhostTrailComponent_C_SpawnManager::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(BP_BonusGhostTrailComponent_C_SpawnManager, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_BonusGhostTrailComponent_C_SpawnManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BonusGhostTrailComponent_C_SpawnManager, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000060, "Member 'BP_BonusGhostTrailComponent_C_SpawnManager::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BonusGhostTrailComponent_C_SpawnManager, CallFunc_FinishSpawningActor_ReturnValue) == 0x000068, "Member 'BP_BonusGhostTrailComponent_C_SpawnManager::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

