#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BrainTalkManager

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BrainTalkManager.BP_BrainTalkManager_C
// 0x0070 (0x0350 - 0x02E0)
class ABP_BrainTalkManager_C final : public ABrainTalkManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<EPlayerID, int32>                        StrongestWeaponList;                               // 0x02F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         BT_ReturnToTheAjito_EnemyNumMax;                   // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BT_GiveItemsFromFriendsWithAjito_EnemyNumMax;      // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BT_GiveItemsFromFriendsWithField_ScoreNumMax;      // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BrainTalkManager(int32 EntryPoint);
	void DoBrainTalk_QuestNpcNearbyCanBeOrdered();
	void StopBrainTalk_BPFL_FromNative();
	void StartBrainTalk_FromNative2_2(const struct FBrainTalkBt_PlayInfo& Info, const bool IsEventCallEnable, const bool Param_IsGameOverCheck);
	void InitializeStrongestWeaponIdList();
	void StartBrainTalk_FromNative(const struct FBrainTalkMasterData& BrainTalkData, const struct FBrainTalk_CategoryDatatable& CategoryDatatable);
	void StartBrainTalk_FromNative2(class FName BrainTalkID, EBrainTalkCategory Category);
	void BrainTalk_QuestNpcNearbyCanBeOrdered_Work();
	int32 GetBrainTalkBt_ReturnToTheAjito_EnemyNumMax();
	int32 GetBrainTalkBt_GiveItemsFromFriendsWithAjito_EnemyNumMax();
	int32 GetBrainTalkBt_GiveItemsFromFriendsWithField_ScoreNumMax();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BrainTalkManager_C">();
	}
	static class ABP_BrainTalkManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BrainTalkManager_C>();
	}
};
static_assert(alignof(ABP_BrainTalkManager_C) == 0x000008, "Wrong alignment on ABP_BrainTalkManager_C");
static_assert(sizeof(ABP_BrainTalkManager_C) == 0x000350, "Wrong size on ABP_BrainTalkManager_C");
static_assert(offsetof(ABP_BrainTalkManager_C, UberGraphFrame) == 0x0002E0, "Member 'ABP_BrainTalkManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BrainTalkManager_C, DefaultSceneRoot) == 0x0002E8, "Member 'ABP_BrainTalkManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BrainTalkManager_C, StrongestWeaponList) == 0x0002F0, "Member 'ABP_BrainTalkManager_C::StrongestWeaponList' has a wrong offset!");
static_assert(offsetof(ABP_BrainTalkManager_C, BT_ReturnToTheAjito_EnemyNumMax) == 0x000340, "Member 'ABP_BrainTalkManager_C::BT_ReturnToTheAjito_EnemyNumMax' has a wrong offset!");
static_assert(offsetof(ABP_BrainTalkManager_C, BT_GiveItemsFromFriendsWithAjito_EnemyNumMax) == 0x000344, "Member 'ABP_BrainTalkManager_C::BT_GiveItemsFromFriendsWithAjito_EnemyNumMax' has a wrong offset!");
static_assert(offsetof(ABP_BrainTalkManager_C, BT_GiveItemsFromFriendsWithField_ScoreNumMax) == 0x000348, "Member 'ABP_BrainTalkManager_C::BT_GiveItemsFromFriendsWithField_ScoreNumMax' has a wrong offset!");

}

