#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleSituationComponent

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BP_BattleSituationComponent.BP_BattleSituationComponent_C.ExecuteUbergraph_BP_BattleSituationComponent
// 0x0018 (0x0018 - 0x0000)
struct BP_BattleSituationComponent_C_ExecuteUbergraph_BP_BattleSituationComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EBattleSituationType SituationType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	EBattleSituationType                          K2Node_CustomEvent_SituationType;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BattleSituationComponent_C_ExecuteUbergraph_BP_BattleSituationComponent) == 0x000004, "Wrong alignment on BP_BattleSituationComponent_C_ExecuteUbergraph_BP_BattleSituationComponent");
static_assert(sizeof(BP_BattleSituationComponent_C_ExecuteUbergraph_BP_BattleSituationComponent) == 0x000018, "Wrong size on BP_BattleSituationComponent_C_ExecuteUbergraph_BP_BattleSituationComponent");
static_assert(offsetof(BP_BattleSituationComponent_C_ExecuteUbergraph_BP_BattleSituationComponent, EntryPoint) == 0x000000, "Member 'BP_BattleSituationComponent_C_ExecuteUbergraph_BP_BattleSituationComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BattleSituationComponent_C_ExecuteUbergraph_BP_BattleSituationComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_BattleSituationComponent_C_ExecuteUbergraph_BP_BattleSituationComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BattleSituationComponent_C_ExecuteUbergraph_BP_BattleSituationComponent, K2Node_CustomEvent_SituationType) == 0x000014, "Member 'BP_BattleSituationComponent_C_ExecuteUbergraph_BP_BattleSituationComponent::K2Node_CustomEvent_SituationType' has a wrong offset!");
static_assert(offsetof(BP_BattleSituationComponent_C_ExecuteUbergraph_BP_BattleSituationComponent, K2Node_SwitchEnum_CmpSuccess) == 0x000015, "Member 'BP_BattleSituationComponent_C_ExecuteUbergraph_BP_BattleSituationComponent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_BattleSituationComponent.BP_BattleSituationComponent_C.Private_OnChangeSituation
// 0x0001 (0x0001 - 0x0000)
struct BP_BattleSituationComponent_C_Private_OnChangeSituation final
{
public:
	EBattleSituationType                          Param_SituationType;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleSituationComponent_C_Private_OnChangeSituation) == 0x000001, "Wrong alignment on BP_BattleSituationComponent_C_Private_OnChangeSituation");
static_assert(sizeof(BP_BattleSituationComponent_C_Private_OnChangeSituation) == 0x000001, "Wrong size on BP_BattleSituationComponent_C_Private_OnChangeSituation");
static_assert(offsetof(BP_BattleSituationComponent_C_Private_OnChangeSituation, Param_SituationType) == 0x000000, "Member 'BP_BattleSituationComponent_C_Private_OnChangeSituation::Param_SituationType' has a wrong offset!");

// Function BP_BattleSituationComponent.BP_BattleSituationComponent_C.GetSituationParameter
// 0x0010 (0x0010 - 0x0000)
struct BP_BattleSituationComponent_C_GetSituationParameter final
{
public:
	EBattleSituationActionType                    ActionType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511F[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RemainTime;                                        // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Priority;                                          // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BattleSituationComponent_C_GetSituationParameter) == 0x000004, "Wrong alignment on BP_BattleSituationComponent_C_GetSituationParameter");
static_assert(sizeof(BP_BattleSituationComponent_C_GetSituationParameter) == 0x000010, "Wrong size on BP_BattleSituationComponent_C_GetSituationParameter");
static_assert(offsetof(BP_BattleSituationComponent_C_GetSituationParameter, ActionType) == 0x000000, "Member 'BP_BattleSituationComponent_C_GetSituationParameter::ActionType' has a wrong offset!");
static_assert(offsetof(BP_BattleSituationComponent_C_GetSituationParameter, RemainTime) == 0x000004, "Member 'BP_BattleSituationComponent_C_GetSituationParameter::RemainTime' has a wrong offset!");
static_assert(offsetof(BP_BattleSituationComponent_C_GetSituationParameter, Priority) == 0x000008, "Member 'BP_BattleSituationComponent_C_GetSituationParameter::Priority' has a wrong offset!");
static_assert(offsetof(BP_BattleSituationComponent_C_GetSituationParameter, K2Node_SwitchEnum_CmpSuccess) == 0x00000C, "Member 'BP_BattleSituationComponent_C_GetSituationParameter::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

