#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BrainTalkManager

#include "Basic.hpp"

#include "FEventTriggerCommand_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BP_BrainTalkManager.BP_BrainTalkManager_C.ExecuteUbergraph_BP_BrainTalkManager
// 0x00D0 (0x00D0 - 0x0000)
struct BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_534D[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetBrainTalk_IsSuccess;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_534E[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_BrainTalkID;                          // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrainTalkCategory                            K2Node_Event_category;                             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_534F[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBrainTalkMasterData                   K2Node_Event_brainTalkData;                        // 0x0030(0x0030)()
	struct FBrainTalk_CategoryDatatable           K2Node_Event_categoryDataTable;                    // 0x0060(0x0030)()
	int32                                         CallFunc_Map_Find_Value;                           // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5350[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBrainTalkBt_PlayInfo                  K2Node_Event_info;                                 // 0x0098(0x0030)()
	bool                                          K2Node_Event_isEventCallEnable;                    // 0x00C8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsGameOverCheck;                      // 0x00C9(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager) == 0x000008, "Wrong alignment on BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager");
static_assert(sizeof(BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager) == 0x0000D0, "Wrong size on BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager");
static_assert(offsetof(BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager, EntryPoint) == 0x000000, "Member 'BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager, CallFunc_MakeLiteralInt_ReturnValue) == 0x000004, "Member 'BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager, Temp_int_Variable) == 0x000008, "Member 'BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager, Temp_int_Variable_1) == 0x00000C, "Member 'BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager, CallFunc_Conv_IntToByte_ReturnValue) == 0x000010, "Member 'BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager, CallFunc_GetValidValue_ReturnValue) == 0x000018, "Member 'BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000019, "Member 'BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager, CallFunc_Less_IntInt_ReturnValue) == 0x00001A, "Member 'BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x00001B, "Member 'BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00001C, "Member 'BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager, CallFunc_SetBrainTalk_IsSuccess) == 0x000020, "Member 'BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager::CallFunc_SetBrainTalk_IsSuccess' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager, K2Node_Event_BrainTalkID) == 0x000024, "Member 'BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager::K2Node_Event_BrainTalkID' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager, K2Node_Event_category) == 0x00002C, "Member 'BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager::K2Node_Event_category' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager, K2Node_Event_brainTalkData) == 0x000030, "Member 'BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager::K2Node_Event_brainTalkData' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager, K2Node_Event_categoryDataTable) == 0x000060, "Member 'BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager::K2Node_Event_categoryDataTable' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager, CallFunc_Map_Find_Value) == 0x000090, "Member 'BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager, CallFunc_Map_Find_ReturnValue) == 0x000094, "Member 'BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager, K2Node_Event_info) == 0x000098, "Member 'BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager::K2Node_Event_info' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager, K2Node_Event_isEventCallEnable) == 0x0000C8, "Member 'BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager::K2Node_Event_isEventCallEnable' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager, K2Node_Event_IsGameOverCheck) == 0x0000C9, "Member 'BP_BrainTalkManager_C_ExecuteUbergraph_BP_BrainTalkManager::K2Node_Event_IsGameOverCheck' has a wrong offset!");

// Function BP_BrainTalkManager.BP_BrainTalkManager_C.StartBrainTalk_FromNative2_2
// 0x0038 (0x0038 - 0x0000)
struct BP_BrainTalkManager_C_StartBrainTalk_FromNative2_2 final
{
public:
	struct FBrainTalkBt_PlayInfo                  Info;                                              // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsEventCallEnable;                                 // 0x0030(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Param_IsGameOverCheck;                             // 0x0031(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BrainTalkManager_C_StartBrainTalk_FromNative2_2) == 0x000008, "Wrong alignment on BP_BrainTalkManager_C_StartBrainTalk_FromNative2_2");
static_assert(sizeof(BP_BrainTalkManager_C_StartBrainTalk_FromNative2_2) == 0x000038, "Wrong size on BP_BrainTalkManager_C_StartBrainTalk_FromNative2_2");
static_assert(offsetof(BP_BrainTalkManager_C_StartBrainTalk_FromNative2_2, Info) == 0x000000, "Member 'BP_BrainTalkManager_C_StartBrainTalk_FromNative2_2::Info' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_StartBrainTalk_FromNative2_2, IsEventCallEnable) == 0x000030, "Member 'BP_BrainTalkManager_C_StartBrainTalk_FromNative2_2::IsEventCallEnable' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_StartBrainTalk_FromNative2_2, Param_IsGameOverCheck) == 0x000031, "Member 'BP_BrainTalkManager_C_StartBrainTalk_FromNative2_2::Param_IsGameOverCheck' has a wrong offset!");

// Function BP_BrainTalkManager.BP_BrainTalkManager_C.StartBrainTalk_FromNative
// 0x0060 (0x0060 - 0x0000)
struct BP_BrainTalkManager_C_StartBrainTalk_FromNative final
{
public:
	struct FBrainTalkMasterData                   BrainTalkData;                                     // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FBrainTalk_CategoryDatatable           CategoryDatatable;                                 // 0x0030(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_BrainTalkManager_C_StartBrainTalk_FromNative) == 0x000008, "Wrong alignment on BP_BrainTalkManager_C_StartBrainTalk_FromNative");
static_assert(sizeof(BP_BrainTalkManager_C_StartBrainTalk_FromNative) == 0x000060, "Wrong size on BP_BrainTalkManager_C_StartBrainTalk_FromNative");
static_assert(offsetof(BP_BrainTalkManager_C_StartBrainTalk_FromNative, BrainTalkData) == 0x000000, "Member 'BP_BrainTalkManager_C_StartBrainTalk_FromNative::BrainTalkData' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_StartBrainTalk_FromNative, CategoryDatatable) == 0x000030, "Member 'BP_BrainTalkManager_C_StartBrainTalk_FromNative::CategoryDatatable' has a wrong offset!");

// Function BP_BrainTalkManager.BP_BrainTalkManager_C.StartBrainTalk_FromNative2
// 0x000C (0x000C - 0x0000)
struct BP_BrainTalkManager_C_StartBrainTalk_FromNative2 final
{
public:
	class FName                                   BrainTalkID;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrainTalkCategory                            Category;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BrainTalkManager_C_StartBrainTalk_FromNative2) == 0x000004, "Wrong alignment on BP_BrainTalkManager_C_StartBrainTalk_FromNative2");
static_assert(sizeof(BP_BrainTalkManager_C_StartBrainTalk_FromNative2) == 0x00000C, "Wrong size on BP_BrainTalkManager_C_StartBrainTalk_FromNative2");
static_assert(offsetof(BP_BrainTalkManager_C_StartBrainTalk_FromNative2, BrainTalkID) == 0x000000, "Member 'BP_BrainTalkManager_C_StartBrainTalk_FromNative2::BrainTalkID' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_StartBrainTalk_FromNative2, Category) == 0x000008, "Member 'BP_BrainTalkManager_C_StartBrainTalk_FromNative2::Category' has a wrong offset!");

// Function BP_BrainTalkManager.BP_BrainTalkManager_C.BrainTalk_QuestNpcNearbyCanBeOrdered_Work
// 0x0150 (0x0150 - 0x0000)
struct BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work final
{
public:
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFEventTriggerCommand                  K2Node_MakeStruct_FEventTriggerCommand;            // 0x0010(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5351[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_AddEventTriggerCommand_self_CastInput;    // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_1;           // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFEventTriggerCommand                  K2Node_MakeStruct_FEventTriggerCommand_1;          // 0x0098(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_1;           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5352[0x2];                                     // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentLocationAndArea_LocationID;     // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentLocationAndArea_AreaID;         // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5353[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_AddEventTriggerCommand_self_CastInput_1;  // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_6;          // 0x0136(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_7;          // 0x0137(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_8;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_9;          // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_10;         // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x013E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_11;         // 0x013F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_12;         // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_13;         // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x0147(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work) == 0x000008, "Wrong alignment on BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work");
static_assert(sizeof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work) == 0x000150, "Wrong size on BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000000, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_MakeLiteralInt_ReturnValue) == 0x000004, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_GetEventManager_EventManager) == 0x000008, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, K2Node_MakeStruct_FEventTriggerCommand) == 0x000010, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::K2Node_MakeStruct_FEventTriggerCommand' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_AddEventTriggerCommand_self_CastInput) == 0x000080, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_AddEventTriggerCommand_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_MakeLiteralInt_ReturnValue_1) == 0x000090, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_MakeLiteralInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_MakeLiteralFloat_ReturnValue_1) == 0x000094, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_MakeLiteralFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, K2Node_MakeStruct_FEventTriggerCommand_1) == 0x000098, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::K2Node_MakeStruct_FEventTriggerCommand_1' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_GetEventManager_EventManager_1) == 0x000100, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_GetEventManager_EventManager_1' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_GetSceneManager_SceneManager) == 0x000108, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_GetSceneManager_SceneManager' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_IsValid_ReturnValue_1) == 0x000110, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_IsValid_ReturnValue_2) == 0x000111, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_GetCurrentLocationAndArea_LocationID) == 0x000114, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_GetCurrentLocationAndArea_LocationID' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_GetCurrentLocationAndArea_AreaID) == 0x000118, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_GetCurrentLocationAndArea_AreaID' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_AddEventTriggerCommand_self_CastInput_1) == 0x000120, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_AddEventTriggerCommand_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000130, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000131, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000132, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000133, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x000134, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_EqualEqual_IntInt_ReturnValue_5) == 0x000135, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_EqualEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_EqualEqual_IntInt_ReturnValue_6) == 0x000136, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_EqualEqual_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_EqualEqual_IntInt_ReturnValue_7) == 0x000137, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_EqualEqual_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_EqualEqual_IntInt_ReturnValue_8) == 0x000138, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_EqualEqual_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_BooleanAND_ReturnValue) == 0x000139, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_BooleanAND_ReturnValue_1) == 0x00013A, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_EqualEqual_IntInt_ReturnValue_9) == 0x00013B, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_EqualEqual_IntInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_EqualEqual_IntInt_ReturnValue_10) == 0x00013C, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_EqualEqual_IntInt_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_BooleanAND_ReturnValue_2) == 0x00013D, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_BooleanAND_ReturnValue_3) == 0x00013E, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_EqualEqual_IntInt_ReturnValue_11) == 0x00013F, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_EqualEqual_IntInt_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_BooleanOR_ReturnValue) == 0x000140, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_BooleanAND_ReturnValue_4) == 0x000141, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_BooleanOR_ReturnValue_1) == 0x000142, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_EqualEqual_IntInt_ReturnValue_12) == 0x000143, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_EqualEqual_IntInt_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_BooleanOR_ReturnValue_2) == 0x000144, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_BooleanAND_ReturnValue_5) == 0x000145, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_EqualEqual_IntInt_ReturnValue_13) == 0x000146, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_EqualEqual_IntInt_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_BooleanAND_ReturnValue_6) == 0x000147, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_BooleanOR_ReturnValue_3) == 0x000148, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work, CallFunc_BooleanOR_ReturnValue_4) == 0x000149, "Member 'BP_BrainTalkManager_C_BrainTalk_QuestNpcNearbyCanBeOrdered_Work::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");

// Function BP_BrainTalkManager.BP_BrainTalkManager_C.GetBrainTalkBt_ReturnToTheAjito_EnemyNumMax
// 0x0004 (0x0004 - 0x0000)
struct BP_BrainTalkManager_C_GetBrainTalkBt_ReturnToTheAjito_EnemyNumMax final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BrainTalkManager_C_GetBrainTalkBt_ReturnToTheAjito_EnemyNumMax) == 0x000004, "Wrong alignment on BP_BrainTalkManager_C_GetBrainTalkBt_ReturnToTheAjito_EnemyNumMax");
static_assert(sizeof(BP_BrainTalkManager_C_GetBrainTalkBt_ReturnToTheAjito_EnemyNumMax) == 0x000004, "Wrong size on BP_BrainTalkManager_C_GetBrainTalkBt_ReturnToTheAjito_EnemyNumMax");
static_assert(offsetof(BP_BrainTalkManager_C_GetBrainTalkBt_ReturnToTheAjito_EnemyNumMax, ReturnValue) == 0x000000, "Member 'BP_BrainTalkManager_C_GetBrainTalkBt_ReturnToTheAjito_EnemyNumMax::ReturnValue' has a wrong offset!");

// Function BP_BrainTalkManager.BP_BrainTalkManager_C.GetBrainTalkBt_GiveItemsFromFriendsWithAjito_EnemyNumMax
// 0x0004 (0x0004 - 0x0000)
struct BP_BrainTalkManager_C_GetBrainTalkBt_GiveItemsFromFriendsWithAjito_EnemyNumMax final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BrainTalkManager_C_GetBrainTalkBt_GiveItemsFromFriendsWithAjito_EnemyNumMax) == 0x000004, "Wrong alignment on BP_BrainTalkManager_C_GetBrainTalkBt_GiveItemsFromFriendsWithAjito_EnemyNumMax");
static_assert(sizeof(BP_BrainTalkManager_C_GetBrainTalkBt_GiveItemsFromFriendsWithAjito_EnemyNumMax) == 0x000004, "Wrong size on BP_BrainTalkManager_C_GetBrainTalkBt_GiveItemsFromFriendsWithAjito_EnemyNumMax");
static_assert(offsetof(BP_BrainTalkManager_C_GetBrainTalkBt_GiveItemsFromFriendsWithAjito_EnemyNumMax, ReturnValue) == 0x000000, "Member 'BP_BrainTalkManager_C_GetBrainTalkBt_GiveItemsFromFriendsWithAjito_EnemyNumMax::ReturnValue' has a wrong offset!");

// Function BP_BrainTalkManager.BP_BrainTalkManager_C.GetBrainTalkBt_GiveItemsFromFriendsWithField_ScoreNumMax
// 0x0004 (0x0004 - 0x0000)
struct BP_BrainTalkManager_C_GetBrainTalkBt_GiveItemsFromFriendsWithField_ScoreNumMax final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BrainTalkManager_C_GetBrainTalkBt_GiveItemsFromFriendsWithField_ScoreNumMax) == 0x000004, "Wrong alignment on BP_BrainTalkManager_C_GetBrainTalkBt_GiveItemsFromFriendsWithField_ScoreNumMax");
static_assert(sizeof(BP_BrainTalkManager_C_GetBrainTalkBt_GiveItemsFromFriendsWithField_ScoreNumMax) == 0x000004, "Wrong size on BP_BrainTalkManager_C_GetBrainTalkBt_GiveItemsFromFriendsWithField_ScoreNumMax");
static_assert(offsetof(BP_BrainTalkManager_C_GetBrainTalkBt_GiveItemsFromFriendsWithField_ScoreNumMax, ReturnValue) == 0x000000, "Member 'BP_BrainTalkManager_C_GetBrainTalkBt_GiveItemsFromFriendsWithField_ScoreNumMax::ReturnValue' has a wrong offset!");

}

