#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BT_m09_190

#include "Basic.hpp"

#include "FEventTriggerCommand_structs.hpp"


namespace SDK::Params
{

// Function BP_BT_m09_190.BP_BT_m09_190_C.ExecuteUbergraph_BP_BT_m09_190
// 0x0098 (0x0098 - 0x0000)
struct BP_BT_m09_190_C_ExecuteUbergraph_BP_BT_m09_190 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_648A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFEventTriggerCommand                  K2Node_MakeStruct_FEventTriggerCommand;            // 0x0008(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_AddEventTriggerCommand_self_CastInput;    // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_648B[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BT_m09_190_C_ExecuteUbergraph_BP_BT_m09_190) == 0x000008, "Wrong alignment on BP_BT_m09_190_C_ExecuteUbergraph_BP_BT_m09_190");
static_assert(sizeof(BP_BT_m09_190_C_ExecuteUbergraph_BP_BT_m09_190) == 0x000098, "Wrong size on BP_BT_m09_190_C_ExecuteUbergraph_BP_BT_m09_190");
static_assert(offsetof(BP_BT_m09_190_C_ExecuteUbergraph_BP_BT_m09_190, EntryPoint) == 0x000000, "Member 'BP_BT_m09_190_C_ExecuteUbergraph_BP_BT_m09_190::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_190_C_ExecuteUbergraph_BP_BT_m09_190, K2Node_MakeStruct_FEventTriggerCommand) == 0x000008, "Member 'BP_BT_m09_190_C_ExecuteUbergraph_BP_BT_m09_190::K2Node_MakeStruct_FEventTriggerCommand' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_190_C_ExecuteUbergraph_BP_BT_m09_190, CallFunc_GetEventManager_EventManager) == 0x000070, "Member 'BP_BT_m09_190_C_ExecuteUbergraph_BP_BT_m09_190::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_190_C_ExecuteUbergraph_BP_BT_m09_190, CallFunc_AddEventTriggerCommand_self_CastInput) == 0x000078, "Member 'BP_BT_m09_190_C_ExecuteUbergraph_BP_BT_m09_190::CallFunc_AddEventTriggerCommand_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_190_C_ExecuteUbergraph_BP_BT_m09_190, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'BP_BT_m09_190_C_ExecuteUbergraph_BP_BT_m09_190::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BT_m09_190_C_ExecuteUbergraph_BP_BT_m09_190, CallFunc_GetSceneManager_SceneManager) == 0x000090, "Member 'BP_BT_m09_190_C_ExecuteUbergraph_BP_BT_m09_190::CallFunc_GetSceneManager_SceneManager' has a wrong offset!");

}

