#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BrainFieldSequenceActor

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MovieScene_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BrainFieldSequenceActor.BP_BrainFieldSequenceActor_C.ExecuteUbergraph_BP_BrainFieldSequenceActor
// 0x0360 (0x0360 - 0x0000)
struct BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B04[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         K2Node_DynamicCast_AsLevel_Sequence;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B05[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B06[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B07[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         K2Node_DynamicCast_AsHUDMain_Game;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B08[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_1;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B09[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B0A[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_BlendTimeSeconds;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_WatchOffset;                    // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_value_2;                        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B0B[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_TargetOffset_1;                 // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Pitch_1;                        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_EaseTime_1;                     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B0C[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_TargetOffset;                   // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Pitch;                          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_EaseTime;                       // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_value_1;                        // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B0D[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0110(0x0030)(IsPlainOldData, NoDestructor)
	class ARSLevelSequenceActor*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager;             // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager_1;           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B0E[0x6];                                     // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager_2;           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameSystemManager_C*                CallFunc_GetGameSystemManager_Manager;             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveGlobalCustomTimeDilation_Success;   // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B0F[0x2];                                     // 0x0182(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetGlobalCustomTimeDilation_CurrentCustomTimeDilation; // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B10[0x3];                                     // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager_3;           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager_4;           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B11[0x6];                                     // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager_5;           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager_6;           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B12[0x6];                                     // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager_7;           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager_8;           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B13[0x6];                                     // 0x01D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager_9;           // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager_10;          // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B14[0x6];                                     // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager_11;          // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager_12;          // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_value;                          // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B15[0x5];                                     // 0x0203(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager_13;          // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B16[0x7];                                     // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager_14;          // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B17[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_2;          // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_18;                   // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B18[0x6];                                     // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager_15;          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasSeamlessEvent_HasEvent;                // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_19;                   // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B19[0x6];                                     // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_1;                          // 0x0250(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<struct FMovieSceneObjectBindingID>     CallFunc_GetSequenceObjectBindingIDList_OutBindingIDList; // 0x0260(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_GetSequenceObjectBindingIDList_IsFind;    // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B1A[0x3];                                     // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PostProcessManager_C*               CallFunc_GetPostProcessManager_Manager;            // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PostProcessManager_C*               CallFunc_GetPostProcessManager_Manager_1;          // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_20;                   // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_21;                   // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B1B[0x2];                                     // 0x028A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B1C[0x4];                                     // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_3;          // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_4;          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_22;                   // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B1D[0x3];                                     // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQualifiedFrameTime                    CallFunc_GetCurrentTime_ReturnValue;               // 0x02AC(0x0010)(NoDestructor, HasGetValueTypeHash)
	struct FFrameNumber                           CallFunc_BreakQualifiedFrameTime_Frame;            // 0x02BC(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FFrameRate                             CallFunc_BreakQualifiedFrameTime_FrameRate;        // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakQualifiedFrameTime_SubFrame;         // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_23;                   // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x02CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B1E[0x2];                                     // 0x02CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager_16;          // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_24;                   // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B1F[0x3];                                     // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x02DC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5B20[0x4];                                     // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_5;          // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B21[0x7];                                     // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SASManager_C*                       CallFunc_GetSASManager_SAS_Manager;                // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_25;                   // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetHealedBrainFieldFlag_isHealed;         // 0x030A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetHealedBrainFieldFlag_isHealed_1;       // 0x030B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue_1;        // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x030D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B22[0x2];                                     // 0x030E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B23[0x3];                                     // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x031C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_26;                   // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_27;                   // 0x032D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B24[0x2];                                     // 0x032E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0330(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_28;                   // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_29;                   // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B25[0x5];                                     // 0x0343(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager_17;          // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_30;                   // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor) == 0x000010, "Wrong alignment on BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor");
static_assert(sizeof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor) == 0x000360, "Wrong size on BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, EntryPoint) == 0x000000, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, Temp_object_Variable) == 0x000008, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, K2Node_DynamicCast_AsLevel_Sequence) == 0x000010, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::K2Node_DynamicCast_AsLevel_Sequence' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetSequencePlayer_ReturnValue) == 0x000020, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, K2Node_MakeArray_Array) == 0x000030, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, K2Node_CustomEvent_Enable) == 0x000040, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetPlayerController_ReturnValue) == 0x000048, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetHUD_ReturnValue) == 0x000050, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, K2Node_DynamicCast_AsHUDMain_Game) == 0x000058, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::K2Node_DynamicCast_AsHUDMain_Game' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetSequencePlayer_ReturnValue_1) == 0x000068, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetSequencePlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, Temp_int_Loop_Num_Variable) == 0x000074, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, K2Node_CustomEvent_Loaded) == 0x000080, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, K2Node_CustomEvent_BlendTimeSeconds) == 0x000088, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::K2Node_CustomEvent_BlendTimeSeconds' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, K2Node_CustomEvent_WatchOffset) == 0x00008C, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::K2Node_CustomEvent_WatchOffset' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, K2Node_CustomEvent_value_2) == 0x000098, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::K2Node_CustomEvent_value_2' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, Temp_int_Loop_Counter_Variable) == 0x00009C, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, K2Node_CustomEvent_TargetOffset_1) == 0x0000A0, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::K2Node_CustomEvent_TargetOffset_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, K2Node_CustomEvent_Pitch_1) == 0x0000AC, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::K2Node_CustomEvent_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, K2Node_CustomEvent_EaseTime_1) == 0x0000B0, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::K2Node_CustomEvent_EaseTime_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_Less_IntInt_ReturnValue) == 0x0000B4, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_Add_IntInt_ReturnValue) == 0x0000B8, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, K2Node_CustomEvent_TargetOffset) == 0x0000BC, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::K2Node_CustomEvent_TargetOffset' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, K2Node_CustomEvent_Pitch) == 0x0000C8, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::K2Node_CustomEvent_Pitch' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, K2Node_CustomEvent_EaseTime) == 0x0000CC, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::K2Node_CustomEvent_EaseTime' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_MakeTransform_ReturnValue) == 0x0000D0, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, K2Node_CustomEvent_value_1) == 0x000100, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::K2Node_CustomEvent_value_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000108, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_MakeTransform_ReturnValue_1) == 0x000110, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_FinishSpawningActor_ReturnValue) == 0x000140, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000148, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000150, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetBrainFieldManager_Manager) == 0x000158, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetBrainFieldManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetBrainFieldManager_Manager_1) == 0x000160, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetBrainFieldManager_Manager_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_2) == 0x000168, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_3) == 0x000169, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetBrainFieldManager_Manager_2) == 0x000170, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetBrainFieldManager_Manager_2' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetGameSystemManager_Manager) == 0x000178, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetGameSystemManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_4) == 0x000180, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_RemoveGlobalCustomTimeDilation_Success) == 0x000181, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_RemoveGlobalCustomTimeDilation_Success' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_SetGlobalCustomTimeDilation_CurrentCustomTimeDilation) == 0x000184, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_SetGlobalCustomTimeDilation_CurrentCustomTimeDilation' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_5) == 0x000188, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00018C, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetBrainFieldManager_Manager_3) == 0x000190, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetBrainFieldManager_Manager_3' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetBrainFieldManager_Manager_4) == 0x000198, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetBrainFieldManager_Manager_4' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_6) == 0x0001A0, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_7) == 0x0001A1, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetBrainFieldManager_Manager_5) == 0x0001A8, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetBrainFieldManager_Manager_5' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetBrainFieldManager_Manager_6) == 0x0001B0, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetBrainFieldManager_Manager_6' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_8) == 0x0001B8, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_9) == 0x0001B9, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetBrainFieldManager_Manager_7) == 0x0001C0, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetBrainFieldManager_Manager_7' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetBrainFieldManager_Manager_8) == 0x0001C8, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetBrainFieldManager_Manager_8' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_10) == 0x0001D0, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_11) == 0x0001D1, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetBrainFieldManager_Manager_9) == 0x0001D8, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetBrainFieldManager_Manager_9' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetBrainFieldManager_Manager_10) == 0x0001E0, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetBrainFieldManager_Manager_10' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_12) == 0x0001E8, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_13) == 0x0001E9, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetBrainFieldManager_Manager_11) == 0x0001F0, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetBrainFieldManager_Manager_11' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetBrainFieldManager_Manager_12) == 0x0001F8, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetBrainFieldManager_Manager_12' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_14) == 0x000200, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_15) == 0x000201, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, K2Node_CustomEvent_value) == 0x000202, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::K2Node_CustomEvent_value' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetBrainFieldManager_Manager_13) == 0x000208, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetBrainFieldManager_Manager_13' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_16) == 0x000210, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetBrainFieldManager_Manager_14) == 0x000218, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetBrainFieldManager_Manager_14' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_17) == 0x000220, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000228, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetSequencePlayer_ReturnValue_2) == 0x000230, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetSequencePlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_18) == 0x000238, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_MakeLiteralByte_ReturnValue) == 0x000239, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetBrainFieldManager_Manager_15) == 0x000240, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetBrainFieldManager_Manager_15' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_HasSeamlessEvent_HasEvent) == 0x000248, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_HasSeamlessEvent_HasEvent' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_19) == 0x000249, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, K2Node_MakeArray_Array_1) == 0x000250, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetSequenceObjectBindingIDList_OutBindingIDList) == 0x000260, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetSequenceObjectBindingIDList_OutBindingIDList' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetSequenceObjectBindingIDList_IsFind) == 0x000270, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetSequenceObjectBindingIDList_IsFind' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_Array_Length_ReturnValue) == 0x000274, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetPostProcessManager_Manager) == 0x000278, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetPostProcessManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetPostProcessManager_Manager_1) == 0x000280, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetPostProcessManager_Manager_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_20) == 0x000288, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_21) == 0x000289, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, K2Node_Event_DeltaSeconds) == 0x00028C, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000290, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetSequencePlayer_ReturnValue_3) == 0x000298, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetSequencePlayer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetSequencePlayer_ReturnValue_4) == 0x0002A0, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetSequencePlayer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_22) == 0x0002A8, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetCurrentTime_ReturnValue) == 0x0002AC, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_BreakQualifiedFrameTime_Frame) == 0x0002BC, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_BreakQualifiedFrameTime_Frame' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_BreakQualifiedFrameTime_FrameRate) == 0x0002C0, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_BreakQualifiedFrameTime_FrameRate' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_BreakQualifiedFrameTime_SubFrame) == 0x0002C8, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_BreakQualifiedFrameTime_SubFrame' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_23) == 0x0002CC, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0002CD, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetBrainFieldManager_Manager_16) == 0x0002D0, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetBrainFieldManager_Manager_16' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_24) == 0x0002D8, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, K2Node_CreateDelegate_OutputDelegate) == 0x0002DC, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetSequencePlayer_ReturnValue_5) == 0x0002F0, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetSequencePlayer_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0002F8, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetSASManager_SAS_Manager) == 0x000300, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetSASManager_SAS_Manager' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_IsValid_ReturnValue_25) == 0x000308, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_IsValid_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000309, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetHealedBrainFieldFlag_isHealed) == 0x00030A, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetHealedBrainFieldFlag_isHealed' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_GetHealedBrainFieldFlag_isHealed_1) == 0x00030B, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_GetHealedBrainFieldFlag_isHealed_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_EqualEqual_BoolBool_ReturnValue_1) == 0x00030C, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_EqualEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_BooleanAND_ReturnValue) == 0x00030D, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor, CallFunc_Add_FloatFloat_ReturnValue) == 0x000310, "Member 'BP_BrainFieldSequenceActor_C_ExecuteUbergraph_BP_BrainFieldSequenceActor::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
