#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BulletManageComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FBulletManageData_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BulletManageComponent.BP_BulletManageComponent_C
// 0x0068 (0x0128 - 0x00C0)
class UBP_BulletManageComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class ABP_BulletBase_C*>               BulletList;                                        // 0x00C8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	TMap<class UClass*, struct FFBulletManageData> ManageData;                                        // 0x00D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_BulletManageComponent(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void AddBullet(class UClass* BulletClass, int32 BulletNum, bool* bSuccess);
	void GetBulletList(TArray<class ABP_BulletBase_C*>* Param_BulletList);
	void FinishUsedBullet();

	void GetUnusedBullet(class UClass* BulletClass, class ABP_BulletBase_C** Bullet) const;
	void GetUsedBulletList(class UClass* BulletClass, TArray<class ABP_BulletBase_C*>* Param_BulletList) const;
	void GetUsedBulletAllList(TArray<class ABP_BulletBase_C*>* Param_BulletList) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BulletManageComponent_C">();
	}
	static class UBP_BulletManageComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BulletManageComponent_C>();
	}
};
static_assert(alignof(UBP_BulletManageComponent_C) == 0x000008, "Wrong alignment on UBP_BulletManageComponent_C");
static_assert(sizeof(UBP_BulletManageComponent_C) == 0x000128, "Wrong size on UBP_BulletManageComponent_C");
static_assert(offsetof(UBP_BulletManageComponent_C, UberGraphFrame) == 0x0000C0, "Member 'UBP_BulletManageComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_BulletManageComponent_C, BulletList) == 0x0000C8, "Member 'UBP_BulletManageComponent_C::BulletList' has a wrong offset!");
static_assert(offsetof(UBP_BulletManageComponent_C, ManageData) == 0x0000D8, "Member 'UBP_BulletManageComponent_C::ManageData' has a wrong offset!");

}

