#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleSimulatorManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BattleSimulatorManager.BP_BattleSimulatorManager_C
// 0x0018 (0x05A8 - 0x0590)
class ABP_BattleSimulatorManager_C final : public ABattleSimulatorManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x05A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_BattleSimulatorManager(int32 EntryPoint);
	void OnFinishMissionBP();
	void OnCancelMission();
	void OnSetPauseTimer();
	void AddEndMissionEventCommand();
	void IsDebugBattleSimulatorAccesFlag(bool* Return);
	bool IsOpenBattleSimulator();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BattleSimulatorManager_C">();
	}
	static class ABP_BattleSimulatorManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BattleSimulatorManager_C>();
	}
};
static_assert(alignof(ABP_BattleSimulatorManager_C) == 0x000008, "Wrong alignment on ABP_BattleSimulatorManager_C");
static_assert(sizeof(ABP_BattleSimulatorManager_C) == 0x0005A8, "Wrong size on ABP_BattleSimulatorManager_C");
static_assert(offsetof(ABP_BattleSimulatorManager_C, UberGraphFrame) == 0x000590, "Member 'ABP_BattleSimulatorManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BattleSimulatorManager_C, DefaultSceneRoot) == 0x000598, "Member 'ABP_BattleSimulatorManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BattleSimulatorManager_C, NewVar_0) == 0x0005A0, "Member 'ABP_BattleSimulatorManager_C::NewVar_0' has a wrong offset!");

}

