#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BT_m09_160

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_MakeEventActorChild_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BT_m09_160.BP_BT_m09_160_C
// 0x0030 (0x04B8 - 0x0488)
class ABP_BT_m09_160_C final : public ABP_MakeEventActorChild_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_BT_m09_160_C;                    // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   BT_m09_180;                                        // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BT_m09_190;                                        // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BT_m09_170;                                        // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BT_m09_150;                                        // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BT_m09_160;                                        // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BT_m09_160(int32 EntryPoint);
	void StartEvent();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BT_m09_160_C">();
	}
	static class ABP_BT_m09_160_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BT_m09_160_C>();
	}
};
static_assert(alignof(ABP_BT_m09_160_C) == 0x000008, "Wrong alignment on ABP_BT_m09_160_C");
static_assert(sizeof(ABP_BT_m09_160_C) == 0x0004B8, "Wrong size on ABP_BT_m09_160_C");
static_assert(offsetof(ABP_BT_m09_160_C, UberGraphFrame_BP_BT_m09_160_C) == 0x000488, "Member 'ABP_BT_m09_160_C::UberGraphFrame_BP_BT_m09_160_C' has a wrong offset!");
static_assert(offsetof(ABP_BT_m09_160_C, BT_m09_180) == 0x000490, "Member 'ABP_BT_m09_160_C::BT_m09_180' has a wrong offset!");
static_assert(offsetof(ABP_BT_m09_160_C, BT_m09_190) == 0x000498, "Member 'ABP_BT_m09_160_C::BT_m09_190' has a wrong offset!");
static_assert(offsetof(ABP_BT_m09_160_C, BT_m09_170) == 0x0004A0, "Member 'ABP_BT_m09_160_C::BT_m09_170' has a wrong offset!");
static_assert(offsetof(ABP_BT_m09_160_C, BT_m09_150) == 0x0004A8, "Member 'ABP_BT_m09_160_C::BT_m09_150' has a wrong offset!");
static_assert(offsetof(ABP_BT_m09_160_C, BT_m09_160) == 0x0004B0, "Member 'ABP_BT_m09_160_C::BT_m09_160' has a wrong offset!");

}

