#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_co0101

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BP_CableBase_classes.hpp"
#include "ECableType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_co0101.BP_co0101_C
// 0x0068 (0x0380 - 0x0318)
class ABP_co0101_C final : public ABP_CableBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_co0101_C;                        // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameTimer                             DitherTimer;                                       // 0x0320(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         PARAM_DitherTime;                                  // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_BP_co0101_C;                                 // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_45FB[0x4];                                     // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_co0101_C*                          AnimBP;                                            // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBrainFieldMode;                                   // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bStart;                                            // 0x0341(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bNexusDriveMode;                                   // 0x0342(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45FC[0x1];                                     // 0x0343(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameTimer                             NexusDriveSwitchTimer;                             // 0x0344(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         PARAM_NexusDriveCableSwitchTime;                   // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NexusDriveSwitchBeginValue;                        // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NexusDriveSwitchEndValue;                          // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableExColor;                                    // 0x035C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45FD[0x3];                                     // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameTimer                             ExColorSwitchTimer;                                // 0x0360(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ExColorSwitchBeginValue;                           // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExColorSwitchEndValue;                             // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PARAM_ExColorSwitchTime;                           // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NexusCableMatFlag;                                 // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_co0101(int32 EntryPoint);
	void EndOverrideGravity(ERSCableGravityType Type);
	void BeginOverrideGravity(ERSCableGravityType Type);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void SetCodePower(float Rate);
	void SetVisibility(bool New_Visibility);
	void UpdateDither();
	void DoCodeStart(ECableType Type, bool bOptionNoCutin, bool bNexusDrive, bool bExColor, bool* bDummy);
	void DoCodeEnd(ECableType Ttype, bool* bEnd);
	void EventPhysicsIdling(float IdlingSec, bool* bDummy);
	void GetSASStartAnimSequence(class UAnimSequence** AnimSequence);
	void UpdateSwitchNexusDrive();
	void SwitchNexusDrive(bool bNexusDrive);
	void UpdateSwitchExColor();
	void SwitchExColor(bool bExColor);
	void SettingTickInterval();
	void SetUseNexusDrive(float Value);

	void GetCableIndex(int32* Param_Index) const;
	void GetMaterialLocationParamName(class FName* ParamName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_co0101_C">();
	}
	static class ABP_co0101_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_co0101_C>();
	}
};
static_assert(alignof(ABP_co0101_C) == 0x000008, "Wrong alignment on ABP_co0101_C");
static_assert(sizeof(ABP_co0101_C) == 0x000380, "Wrong size on ABP_co0101_C");
static_assert(offsetof(ABP_co0101_C, UberGraphFrame_BP_co0101_C) == 0x000318, "Member 'ABP_co0101_C::UberGraphFrame_BP_co0101_C' has a wrong offset!");
static_assert(offsetof(ABP_co0101_C, DitherTimer) == 0x000320, "Member 'ABP_co0101_C::DitherTimer' has a wrong offset!");
static_assert(offsetof(ABP_co0101_C, PARAM_DitherTime) == 0x00032C, "Member 'ABP_co0101_C::PARAM_DitherTime' has a wrong offset!");
static_assert(offsetof(ABP_co0101_C, Index_BP_co0101_C) == 0x000330, "Member 'ABP_co0101_C::Index_BP_co0101_C' has a wrong offset!");
static_assert(offsetof(ABP_co0101_C, AnimBP) == 0x000338, "Member 'ABP_co0101_C::AnimBP' has a wrong offset!");
static_assert(offsetof(ABP_co0101_C, bBrainFieldMode) == 0x000340, "Member 'ABP_co0101_C::bBrainFieldMode' has a wrong offset!");
static_assert(offsetof(ABP_co0101_C, bStart) == 0x000341, "Member 'ABP_co0101_C::bStart' has a wrong offset!");
static_assert(offsetof(ABP_co0101_C, bNexusDriveMode) == 0x000342, "Member 'ABP_co0101_C::bNexusDriveMode' has a wrong offset!");
static_assert(offsetof(ABP_co0101_C, NexusDriveSwitchTimer) == 0x000344, "Member 'ABP_co0101_C::NexusDriveSwitchTimer' has a wrong offset!");
static_assert(offsetof(ABP_co0101_C, PARAM_NexusDriveCableSwitchTime) == 0x000350, "Member 'ABP_co0101_C::PARAM_NexusDriveCableSwitchTime' has a wrong offset!");
static_assert(offsetof(ABP_co0101_C, NexusDriveSwitchBeginValue) == 0x000354, "Member 'ABP_co0101_C::NexusDriveSwitchBeginValue' has a wrong offset!");
static_assert(offsetof(ABP_co0101_C, NexusDriveSwitchEndValue) == 0x000358, "Member 'ABP_co0101_C::NexusDriveSwitchEndValue' has a wrong offset!");
static_assert(offsetof(ABP_co0101_C, bEnableExColor) == 0x00035C, "Member 'ABP_co0101_C::bEnableExColor' has a wrong offset!");
static_assert(offsetof(ABP_co0101_C, ExColorSwitchTimer) == 0x000360, "Member 'ABP_co0101_C::ExColorSwitchTimer' has a wrong offset!");
static_assert(offsetof(ABP_co0101_C, ExColorSwitchBeginValue) == 0x00036C, "Member 'ABP_co0101_C::ExColorSwitchBeginValue' has a wrong offset!");
static_assert(offsetof(ABP_co0101_C, ExColorSwitchEndValue) == 0x000370, "Member 'ABP_co0101_C::ExColorSwitchEndValue' has a wrong offset!");
static_assert(offsetof(ABP_co0101_C, PARAM_ExColorSwitchTime) == 0x000374, "Member 'ABP_co0101_C::PARAM_ExColorSwitchTime' has a wrong offset!");
static_assert(offsetof(ABP_co0101_C, NexusCableMatFlag) == 0x000378, "Member 'ABP_co0101_C::NexusCableMatFlag' has a wrong offset!");

}

