#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_co0100

#include "Basic.hpp"

#include "ECableType_structs.hpp"
#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BP_co0100.BP_co0100_C.ExecuteUbergraph_BP_co0100
// 0x0028 (0x0028 - 0x0000)
struct BP_co0100_C_ExecuteUbergraph_BP_co0100 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERSCableGravityType                           K2Node_Event_Type_1;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F45[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_co0100_C*                          K2Node_DynamicCast_AsABP_Co_0100;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EndOverrideGravity_ReturnValue;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ERSCableGravityType                           K2Node_Event_Type;                                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginOverrideGravity_ReturnValue;         // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_co0100_C_ExecuteUbergraph_BP_co0100) == 0x000008, "Wrong alignment on BP_co0100_C_ExecuteUbergraph_BP_co0100");
static_assert(sizeof(BP_co0100_C_ExecuteUbergraph_BP_co0100) == 0x000028, "Wrong size on BP_co0100_C_ExecuteUbergraph_BP_co0100");
static_assert(offsetof(BP_co0100_C_ExecuteUbergraph_BP_co0100, EntryPoint) == 0x000000, "Member 'BP_co0100_C_ExecuteUbergraph_BP_co0100::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_ExecuteUbergraph_BP_co0100, K2Node_Event_Type_1) == 0x000004, "Member 'BP_co0100_C_ExecuteUbergraph_BP_co0100::K2Node_Event_Type_1' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_ExecuteUbergraph_BP_co0100, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'BP_co0100_C_ExecuteUbergraph_BP_co0100::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_ExecuteUbergraph_BP_co0100, K2Node_DynamicCast_AsABP_Co_0100) == 0x000010, "Member 'BP_co0100_C_ExecuteUbergraph_BP_co0100::K2Node_DynamicCast_AsABP_Co_0100' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_ExecuteUbergraph_BP_co0100, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_co0100_C_ExecuteUbergraph_BP_co0100::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_ExecuteUbergraph_BP_co0100, CallFunc_EndOverrideGravity_ReturnValue) == 0x000019, "Member 'BP_co0100_C_ExecuteUbergraph_BP_co0100::CallFunc_EndOverrideGravity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_ExecuteUbergraph_BP_co0100, K2Node_Event_Type) == 0x00001A, "Member 'BP_co0100_C_ExecuteUbergraph_BP_co0100::K2Node_Event_Type' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_ExecuteUbergraph_BP_co0100, CallFunc_BeginOverrideGravity_ReturnValue) == 0x00001B, "Member 'BP_co0100_C_ExecuteUbergraph_BP_co0100::CallFunc_BeginOverrideGravity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_ExecuteUbergraph_BP_co0100, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'BP_co0100_C_ExecuteUbergraph_BP_co0100::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_ExecuteUbergraph_BP_co0100, CallFunc_Conv_IntToByte_ReturnValue) == 0x000020, "Member 'BP_co0100_C_ExecuteUbergraph_BP_co0100::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_ExecuteUbergraph_BP_co0100, CallFunc_GetValidValue_ReturnValue) == 0x000021, "Member 'BP_co0100_C_ExecuteUbergraph_BP_co0100::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");

// Function BP_co0100.BP_co0100_C.BeginOverrideGravity
// 0x0001 (0x0001 - 0x0000)
struct BP_co0100_C_BeginOverrideGravity final
{
public:
	ERSCableGravityType                           Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_co0100_C_BeginOverrideGravity) == 0x000001, "Wrong alignment on BP_co0100_C_BeginOverrideGravity");
static_assert(sizeof(BP_co0100_C_BeginOverrideGravity) == 0x000001, "Wrong size on BP_co0100_C_BeginOverrideGravity");
static_assert(offsetof(BP_co0100_C_BeginOverrideGravity, Type) == 0x000000, "Member 'BP_co0100_C_BeginOverrideGravity::Type' has a wrong offset!");

// Function BP_co0100.BP_co0100_C.EndOverrideGravity
// 0x0001 (0x0001 - 0x0000)
struct BP_co0100_C_EndOverrideGravity final
{
public:
	ERSCableGravityType                           Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_co0100_C_EndOverrideGravity) == 0x000001, "Wrong alignment on BP_co0100_C_EndOverrideGravity");
static_assert(sizeof(BP_co0100_C_EndOverrideGravity) == 0x000001, "Wrong size on BP_co0100_C_EndOverrideGravity");
static_assert(offsetof(BP_co0100_C_EndOverrideGravity, Type) == 0x000000, "Member 'BP_co0100_C_EndOverrideGravity::Type' has a wrong offset!");

// Function BP_co0100.BP_co0100_C.DoCodeStart
// 0x0007 (0x0007 - 0x0000)
struct BP_co0100_C_DoCodeStart final
{
public:
	ECableType                                    Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOptionNoCutin;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bNexusDrive;                                       // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bExColor;                                          // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDummy;                                            // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoCodeStart_bDummy;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDriveMode_bDrive;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_co0100_C_DoCodeStart) == 0x000001, "Wrong alignment on BP_co0100_C_DoCodeStart");
static_assert(sizeof(BP_co0100_C_DoCodeStart) == 0x000007, "Wrong size on BP_co0100_C_DoCodeStart");
static_assert(offsetof(BP_co0100_C_DoCodeStart, Type) == 0x000000, "Member 'BP_co0100_C_DoCodeStart::Type' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_DoCodeStart, bOptionNoCutin) == 0x000001, "Member 'BP_co0100_C_DoCodeStart::bOptionNoCutin' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_DoCodeStart, bNexusDrive) == 0x000002, "Member 'BP_co0100_C_DoCodeStart::bNexusDrive' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_DoCodeStart, bExColor) == 0x000003, "Member 'BP_co0100_C_DoCodeStart::bExColor' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_DoCodeStart, bDummy) == 0x000004, "Member 'BP_co0100_C_DoCodeStart::bDummy' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_DoCodeStart, CallFunc_DoCodeStart_bDummy) == 0x000005, "Member 'BP_co0100_C_DoCodeStart::CallFunc_DoCodeStart_bDummy' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_DoCodeStart, CallFunc_IsDriveMode_bDrive) == 0x000006, "Member 'BP_co0100_C_DoCodeStart::CallFunc_IsDriveMode_bDrive' has a wrong offset!");

// Function BP_co0100.BP_co0100_C.EventPhysicsIdling
// 0x0008 (0x0008 - 0x0000)
struct BP_co0100_C_EventPhysicsIdling final
{
public:
	float                                         IdlingSec;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDummy;                                            // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EventPhysicsIdling_bDummy;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_co0100_C_EventPhysicsIdling) == 0x000004, "Wrong alignment on BP_co0100_C_EventPhysicsIdling");
static_assert(sizeof(BP_co0100_C_EventPhysicsIdling) == 0x000008, "Wrong size on BP_co0100_C_EventPhysicsIdling");
static_assert(offsetof(BP_co0100_C_EventPhysicsIdling, IdlingSec) == 0x000000, "Member 'BP_co0100_C_EventPhysicsIdling::IdlingSec' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_EventPhysicsIdling, bDummy) == 0x000004, "Member 'BP_co0100_C_EventPhysicsIdling::bDummy' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_EventPhysicsIdling, CallFunc_EventPhysicsIdling_bDummy) == 0x000005, "Member 'BP_co0100_C_EventPhysicsIdling::CallFunc_EventPhysicsIdling_bDummy' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_EventPhysicsIdling, CallFunc_IsValid_ReturnValue) == 0x000006, "Member 'BP_co0100_C_EventPhysicsIdling::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_co0100.BP_co0100_C.GetCableIndex
// 0x0004 (0x0004 - 0x0000)
struct BP_co0100_C_GetCableIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_co0100_C_GetCableIndex) == 0x000004, "Wrong alignment on BP_co0100_C_GetCableIndex");
static_assert(sizeof(BP_co0100_C_GetCableIndex) == 0x000004, "Wrong size on BP_co0100_C_GetCableIndex");
static_assert(offsetof(BP_co0100_C_GetCableIndex, Param_Index) == 0x000000, "Member 'BP_co0100_C_GetCableIndex::Param_Index' has a wrong offset!");

// Function BP_co0100.BP_co0100_C.GetMaterialLocationParamName
// 0x00A8 (0x00A8 - 0x0000)
struct BP_co0100_C_GetMaterialLocationParamName final
{
public:
	class FName                                   ParamName;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCableIndex_Index;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F46[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_co0100_C_GetMaterialLocationParamName) == 0x000008, "Wrong alignment on BP_co0100_C_GetMaterialLocationParamName");
static_assert(sizeof(BP_co0100_C_GetMaterialLocationParamName) == 0x0000A8, "Wrong size on BP_co0100_C_GetMaterialLocationParamName");
static_assert(offsetof(BP_co0100_C_GetMaterialLocationParamName, ParamName) == 0x000000, "Member 'BP_co0100_C_GetMaterialLocationParamName::ParamName' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_GetMaterialLocationParamName, CallFunc_GetCableIndex_Index) == 0x000008, "Member 'BP_co0100_C_GetMaterialLocationParamName::CallFunc_GetCableIndex_Index' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_GetMaterialLocationParamName, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'BP_co0100_C_GetMaterialLocationParamName::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_GetMaterialLocationParamName, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'BP_co0100_C_GetMaterialLocationParamName::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_GetMaterialLocationParamName, K2Node_MakeArray_Array) == 0x000068, "Member 'BP_co0100_C_GetMaterialLocationParamName::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_GetMaterialLocationParamName, CallFunc_Format_ReturnValue) == 0x000078, "Member 'BP_co0100_C_GetMaterialLocationParamName::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_GetMaterialLocationParamName, CallFunc_Conv_TextToString_ReturnValue) == 0x000090, "Member 'BP_co0100_C_GetMaterialLocationParamName::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_co0100_C_GetMaterialLocationParamName, CallFunc_Conv_StringToName_ReturnValue) == 0x0000A0, "Member 'BP_co0100_C_GetMaterialLocationParamName::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

}

