#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CosmosWebManager

#include "Basic.hpp"

#include "CosmosWebApi_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CosmosWebManager.BP_CosmosWebManager_C.ExecuteUbergraph_BP_CosmosWebManager
// 0x0410 (0x0410 - 0x0000)
struct BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGetTokenAndSignatureExecuting_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3822[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue_1;            // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3823[0x1];                                     // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance_1;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_9;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_10;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_11;                 // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3824[0x5];                                     // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance_2;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_12;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_13;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3825[0x5];                                     // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance_3;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance_4;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance_5;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue_2;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue_3;            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3826[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCosmosResultParam                     K2Node_MakeStruct_CosmosResultParam;               // 0x0060(0x0028)()
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance_6;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNetMessage*                            K2Node_CustomEvent_data;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_code;                           // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3827[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_errmsg;                         // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_14;                 // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_15;                 // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_16;                 // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3828[0x1];                                     // 0x00C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetLoginTalken_ReturnValue;               // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_17;                 // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3829[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_382A[0x3];                                     // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_18;                 // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_19;                 // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_20;                 // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_21;                 // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_22;                 // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_23;                 // 0x00FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_24;                 // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_382B[0x2];                                     // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsResultOK_IsOK;                          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsResultOK_IsOK_1;                        // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsResultOK_IsOK_2;                        // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_382C[0x5];                                     // 0x010B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCosmosUserParam                       K2Node_MakeStruct_CosmosUserParam;                 // 0x0110(0x0028)()
	bool                                          CallFunc_BooleanOR_ReturnValue_25;                 // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_382D[0x3];                                     // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetBaseURL_BaseUrl;                       // 0x013C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_26;                 // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_382E[0x3];                                     // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_27;                 // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECosmosWebAPIType                             K2Node_Event_Type_2;                               // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_382F[0x6];                                     // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance_7;       // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue_4;            // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue_5;            // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3830[0x2];                                     // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_AgreeFlag;                            // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_CosmosGetPlatformUserID_PlatformUserID;   // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CosmosGetPlatformUserID_Result;           // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3831[0x2];                                     // 0x018A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_EnvInitialize_ReturnValue;                // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_EnvUpdate_ReturnValue;                    // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_28;                 // 0x0196(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_29;                 // 0x0197(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3832[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_GetWebDateTime_DateTime;                  // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_Event_PlatformUserIDList;                   // 0x01A8(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	struct FAmieInterlockingCheckAnswer           K2Node_Event_param;                                // 0x01B8(0x0020)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CallCheckAnswerDelegate_ReturnValue;      // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CosmosIsQuestAnswerLoaded_ReturnValue;    // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3833[0x5];                                     // 0x01DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance_8;       // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Region;                               // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Use;                                  // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Language;                             // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsWait;                               // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3834[0x3];                                     // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCosmosHugeTssReadListParam            K2Node_MakeStruct_CosmosHugeTssReadListParam;      // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue_6;            // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue_7;            // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3835[0x2];                                     // 0x0206(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_QuestName;                            // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CosmosIsQuestAnswerLoaded_ReturnValue_1;  // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_30;                 // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_31;                 // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetTokenAndSignature_ReturnValue;         // 0x0223(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_32;                 // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_33;                 // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCompleteTokenAndSignature_ReturnValue;  // 0x0226(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_34;                 // 0x0227(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_9;                // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECosmosWebAPIType                             K2Node_Event_Type_1;                               // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x022B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x022D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x022E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x022F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckSessionNG_IsNG;                      // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckKpiFaile_NewParam;                   // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckKpiFaile_NewParam_1;                 // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3836[0x5];                                     // 0x0233(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance_9;       // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_35;                 // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_36;                 // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_37;                 // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_38;                 // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_39;                 // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_10;               // 0x0245(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_40;                 // 0x0246(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_41;                 // 0x0247(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_42;                 // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_43;                 // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECosmosWebAPIType                             K2Node_Event_Type;                                 // 0x024A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_44;                 // 0x024B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_11;               // 0x024D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3837[0x2];                                     // 0x024E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWebApiConnect*                         CallFunc_RequestAPI_webApiConnect;                 // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PreCheck_isOK;                            // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3838[0x3];                                     // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetBaseURL_V2_BaseUrl;                    // 0x025C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3839[0x4];                                     // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_2;          // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ReceiveResponse_isOK;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_383A[0x7];                                     // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetLoginTalken_ReturnValue_1;             // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_MakeDateTime_ReturnValue;                 // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCosmosUserParam                       K2Node_MakeStruct_CosmosUserParam_1;               // 0x02B8(0x0028)()
	struct FCosmosRankingSetScoreParam            K2Node_MakeStruct_CosmosRankingSetScoreParam;      // 0x02E0(0x0028)()
	bool                                          CallFunc_BooleanOR_ReturnValue_45;                 // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_383B[0x7];                                     // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance_10;      // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_46;                 // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_47;                 // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue_8;            // 0x031A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_48;                 // 0x031B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_49;                 // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_12;               // 0x031D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue_9;            // 0x031E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_383C[0x1];                                     // 0x031F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_CosmosGetPlatformUserID_PlatformUserID_1; // 0x0328(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CosmosGetPlatformUserID_Result_1;         // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_383D[0x3];                                     // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_EnvUpdate_ReturnValue_1;                  // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance_11;      // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue_10;           // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue_11;           // 0x034A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_383E[0x1];                                     // 0x034B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_50;                 // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_51;                 // 0x0352(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_52;                 // 0x0353(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_53;                 // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_54;                 // 0x0355(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_13;               // 0x0356(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_383F[0x1];                                     // 0x0357(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance_12;      // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Code, const class FString& Errmsg)> K2Node_CreateDelegate_OutputDelegate;              // 0x0360(0x0010)(ZeroConstructor, NoDestructor)
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance_13;      // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance_14;      // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCosmosTusReadParam                    K2Node_MakeStruct_CosmosTusReadParam;              // 0x0380(0x0018)()
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance_15;      // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance_16;      // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPlayableQuestList_ReturnValue;         // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetPlayableQuestList_ReturnValue_1;       // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3840[0x6];                                     // 0x03AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance_17;      // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance_18;      // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPlayableQuestList_ReturnValue_2;       // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetPlayableQuestList_ReturnValue_3;       // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3841[0x6];                                     // 0x03C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance_19;      // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance_20;      // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGetTokenAndSignatureExecuting_ReturnValue_1; // 0x03DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3842[0x1];                                     // 0x03DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UNetMessage* Data)>      K2Node_CreateDelegate_OutputDelegate_1;            // 0x03DC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x03EC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3843[0x4];                                     // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0400(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTokenAndSignature_ReturnValue_1;       // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCompleteTokenAndSignature_ReturnValue_1; // 0x0409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager) == 0x000008, "Wrong alignment on BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager");
static_assert(sizeof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager) == 0x000410, "Wrong size on BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, EntryPoint) == 0x000000, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_IsGetTokenAndSignatureExecuting_ReturnValue) == 0x000004, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_IsGetTokenAndSignatureExecuting_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_GetRSGameInstance_RSGameInstance) == 0x000008, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_GetRSGameInstance_RSGameInstance' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue) == 0x000010, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000012, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_NotEqual_StrStr_ReturnValue_1) == 0x000013, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_NotEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_1) == 0x000014, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_Not_PreBool_ReturnValue_1) == 0x000015, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_2) == 0x000016, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_3) == 0x000017, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_4) == 0x000018, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_5) == 0x000019, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_6) == 0x00001A, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_7) == 0x00001B, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_Not_PreBool_ReturnValue_2) == 0x00001C, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_8) == 0x00001D, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_Not_PreBool_ReturnValue_3) == 0x00001E, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_GetRSGameInstance_RSGameInstance_1) == 0x000020, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_GetRSGameInstance_RSGameInstance_1' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_9) == 0x000028, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_10) == 0x000029, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_11) == 0x00002A, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_GetRSGameInstance_RSGameInstance_2) == 0x000030, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_GetRSGameInstance_RSGameInstance_2' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_12) == 0x000038, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_13) == 0x000039, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_Not_PreBool_ReturnValue_4) == 0x00003A, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_GetRSGameInstance_RSGameInstance_3) == 0x000040, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_GetRSGameInstance_RSGameInstance_3' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_GetRSGameInstance_RSGameInstance_4) == 0x000048, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_GetRSGameInstance_RSGameInstance_4' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_GetRSGameInstance_RSGameInstance_5) == 0x000050, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_GetRSGameInstance_RSGameInstance_5' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_NotEqual_StrStr_ReturnValue_2) == 0x000058, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_NotEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_NotEqual_StrStr_ReturnValue_3) == 0x000059, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_NotEqual_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, K2Node_MakeStruct_CosmosResultParam) == 0x000060, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::K2Node_MakeStruct_CosmosResultParam' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_GetRSGameInstance_RSGameInstance_6) == 0x000088, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_GetRSGameInstance_RSGameInstance_6' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, K2Node_CustomEvent_data) == 0x000090, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::K2Node_CustomEvent_data' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, K2Node_CustomEvent_code) == 0x000098, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::K2Node_CustomEvent_code' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, K2Node_CustomEvent_errmsg) == 0x0000A0, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::K2Node_CustomEvent_errmsg' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_Concat_StrStr_ReturnValue) == 0x0000B0, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_Add_IntInt_ReturnValue) == 0x0000C0, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_14) == 0x0000C4, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_15) == 0x0000C5, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_16) == 0x0000C6, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_GetLoginTalken_ReturnValue) == 0x0000C8, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_GetLoginTalken_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_17) == 0x0000D8, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000E0, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_Not_PreBool_ReturnValue_5) == 0x0000F0, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_Map_Length_ReturnValue) == 0x0000F4, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000F8, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_18) == 0x0000F9, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_19) == 0x0000FA, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_Not_PreBool_ReturnValue_6) == 0x0000FB, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_20) == 0x0000FC, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_21) == 0x0000FD, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_22) == 0x0000FE, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_23) == 0x0000FF, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_24) == 0x000100, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_Not_PreBool_ReturnValue_7) == 0x000101, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_Not_PreBool_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, K2Node_Event_DeltaSeconds) == 0x000104, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_IsResultOK_IsOK) == 0x000108, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_IsResultOK_IsOK' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_IsResultOK_IsOK_1) == 0x000109, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_IsResultOK_IsOK_1' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_IsResultOK_IsOK_2) == 0x00010A, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_IsResultOK_IsOK_2' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, K2Node_MakeStruct_CosmosUserParam) == 0x000110, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::K2Node_MakeStruct_CosmosUserParam' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_25) == 0x000138, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_GetBaseURL_BaseUrl) == 0x00013C, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_GetBaseURL_BaseUrl' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_26) == 0x000144, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_Conv_NameToString_ReturnValue) == 0x000148, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_27) == 0x000158, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_27' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, K2Node_Event_Type_2) == 0x000159, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::K2Node_Event_Type_2' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_GetRSGameInstance_RSGameInstance_7) == 0x000160, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_GetRSGameInstance_RSGameInstance_7' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_NotEqual_StrStr_ReturnValue_4) == 0x000168, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_NotEqual_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_NotEqual_StrStr_ReturnValue_5) == 0x000169, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_NotEqual_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, K2Node_Event_AgreeFlag) == 0x00016C, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::K2Node_Event_AgreeFlag' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_GetPlayerController_ReturnValue) == 0x000170, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_CosmosGetPlatformUserID_PlatformUserID) == 0x000178, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_CosmosGetPlatformUserID_PlatformUserID' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_CosmosGetPlatformUserID_Result) == 0x000188, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_CosmosGetPlatformUserID_Result' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, K2Node_Event_EndPlayReason) == 0x000189, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_EnvInitialize_ReturnValue) == 0x00018C, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_EnvInitialize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_EnvUpdate_ReturnValue) == 0x000190, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_EnvUpdate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000194, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, K2Node_SwitchInteger_CmpSuccess) == 0x000195, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_28) == 0x000196, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_28' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_BooleanOR_ReturnValue_29) == 0x000197, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_BooleanOR_ReturnValue_29' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_Not_PreBool_ReturnValue_8) == 0x000198, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_Not_PreBool_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager, CallFunc_GetWebDateTime_DateTime) == 0x0001A0, "Member 'BP_CosmosWebManager_C_ExecuteUbergraph_BP_CosmosWebManager::CallFunc_GetWebDateTime_DateTime' has a wrong offset!");
