#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CalcCustomTImeDilationComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CalcCustomTImeDilationComponent.BP_CalcCustomTImeDilationComponent_C
// 0x0060 (0x0120 - 0x00C0)
class UBP_CalcCustomTImeDilationComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<class FString, float>                    CustomTimeDilationDic;                             // 0x00C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         CurrentCustomTimeDilation;                         // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CalcCustomTImeDilationComponent(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SetGlobalCustomTimeDilation(const class FString& Param_Name, float CustomTimeDilation, float* Param_CurrentCustomTimeDilation);
	void RemoveGlobalCustomTimeDilation(const class FString& Param_Name, bool* Success);
	void CalcCustomTimeDilation(float* CustomTimeDilation);
	void IsRegistName(const class FString& RegistName, bool* IsFound, float* Param_CurrentCustomTimeDilation);

	void GetCurrentCustomTimeDilation(float* CustomTimeDilation) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CalcCustomTImeDilationComponent_C">();
	}
	static class UBP_CalcCustomTImeDilationComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CalcCustomTImeDilationComponent_C>();
	}
};
static_assert(alignof(UBP_CalcCustomTImeDilationComponent_C) == 0x000008, "Wrong alignment on UBP_CalcCustomTImeDilationComponent_C");
static_assert(sizeof(UBP_CalcCustomTImeDilationComponent_C) == 0x000120, "Wrong size on UBP_CalcCustomTImeDilationComponent_C");
static_assert(offsetof(UBP_CalcCustomTImeDilationComponent_C, UberGraphFrame) == 0x0000C0, "Member 'UBP_CalcCustomTImeDilationComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_CalcCustomTImeDilationComponent_C, CustomTimeDilationDic) == 0x0000C8, "Member 'UBP_CalcCustomTImeDilationComponent_C::CustomTimeDilationDic' has a wrong offset!");
static_assert(offsetof(UBP_CalcCustomTImeDilationComponent_C, CurrentCustomTimeDilation) == 0x000118, "Member 'UBP_CalcCustomTImeDilationComponent_C::CurrentCustomTimeDilation' has a wrong offset!");

}

