#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CutinManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_SASKind_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "MovieScene_structs.hpp"
#include "FSASCutinData_structs.hpp"


namespace SDK::Params
{

// Function BP_CutinManager.BP_CutinManager_C.ExecuteUbergraph_BP_CutinManager
// 0x02A0 (0x02A0 - 0x0000)
struct BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPaused_ReturnValue;                     // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D77[0x1];                                     // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQualifiedFrameTime                    CallFunc_GetCurrentTime_ReturnValue;               // 0x0014(0x0010)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D78[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrameNumber                           CallFunc_BreakQualifiedFrameTime_Frame;            // 0x0028(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FFrameRate                             CallFunc_BreakQualifiedFrameTime_FrameRate;        // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakQualifiedFrameTime_SubFrame;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D79[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D7A[0xC];                                     // 0x0044(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0050(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D7B[0x2];                                     // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D7C[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue;                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface;         // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartSASCode_bDummy;                      // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D7D[0x5];                                     // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CutinBase_C*                        K2Node_DynamicCast_AsWB_Cutin_Base;                // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D7E[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D7F[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_1;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SASManager_C*                       CallFunc_GetSASManager_SAS_Manager;                // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D80[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SASManager_C*                       CallFunc_GetSASManager_SAS_Manager_1;              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SASManager_C*                       CallFunc_GetSASManager_SAS_Manager_2;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrainCrashManager_C*                CallFunc_GetBrainCrashManager_Manager;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSLevelSequenceActor*                  CallFunc_GetCurrentSequencer_Sequencer;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IRSGameModeBPInterface_C> K2Node_DynamicCast_AsRSGame_Mode_BPInterface;      // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D81[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_2;          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_GetMainPlayerBP_Player;                   // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D82[0x6];                                     // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_SetPlayerActionSAS_self_CastInput;        // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetPlayerActionSAS_bDummy;                // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D83[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SASManager_C*                       CallFunc_GetSASManager_SAS_Manager_3;              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SASManager_C*                       CallFunc_GetSASManager_SAS_Manager_4;              // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SASManager_C*                       CallFunc_GetSASManager_SAS_Manager_5;              // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SASManager_C*                       CallFunc_GetSASManager_SAS_Manager_6;              // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SASManager_C*                       CallFunc_GetSASManager_SAS_Manager_7;              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D84[0x3];                                     // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UDataTable>              K2Node_CustomEvent_DataTable;                      // 0x01A8(0x0028)(ConstParm, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_MessageTableName;               // 0x01D0(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_WindowType;                     // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D85[0x4];                                     // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_messageLabel;                   // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Skipable;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D86[0x3];                                     // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DrawSecond;                     // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsVoiceOnlyMessage;             // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsSkipVoiceEnd;                 // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D87[0x6];                                     // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D88[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_1;           // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_2;           // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D89[0x6];                                     // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SASManager_C*                       CallFunc_GetSASManager_SAS_Manager_8;              // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SASManager_C*                       CallFunc_GetSASManager_SAS_Manager_9;              // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_VoiceFileName;                  // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D8A[0x4];                                     // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SoundManager_C*                     CallFunc_GetSoundManager_SoundManager;             // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D8B[0x6];                                     // 0x0272(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SASManager_C*                       CallFunc_GetSASManager_SAS_Manager_10;             // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetCutinWidget_Widget;                    // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_SeeThroughJustDodge_Cutin_C*        K2Node_DynamicCast_AsWB_See_Through_Just_Dodge_Cutin; // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D8C[0x7];                                     // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SASManager_C*                       CallFunc_GetSASManager_SAS_Manager_11;             // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager) == 0x000010, "Wrong alignment on BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager");
static_assert(sizeof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager) == 0x0002A0, "Wrong size on BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, EntryPoint) == 0x000000, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetSequencePlayer_ReturnValue) == 0x000008, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_IsPaused_ReturnValue) == 0x000012, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_IsPaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetCurrentTime_ReturnValue) == 0x000014, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_IsPlaying_ReturnValue) == 0x000024, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_BreakQualifiedFrameTime_Frame) == 0x000028, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_BreakQualifiedFrameTime_Frame' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_BreakQualifiedFrameTime_FrameRate) == 0x00002C, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_BreakQualifiedFrameTime_FrameRate' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_BreakQualifiedFrameTime_SubFrame) == 0x000034, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_BreakQualifiedFrameTime_SubFrame' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_BooleanOR_ReturnValue) == 0x000038, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_Greater_IntInt_ReturnValue) == 0x000039, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetTransform_ReturnValue) == 0x000050, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, K2Node_Event_EndPlayReason) == 0x000080, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_IsValid_ReturnValue_2) == 0x000081, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_Array_Length_ReturnValue) == 0x000084, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, K2Node_SwitchEnum_CmpSuccess) == 0x000088, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetPlayerManager_PlayerManager) == 0x000090, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetPlayer_ReturnValue) == 0x000098, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, K2Node_DynamicCast_AsBPI_Player_Interface) == 0x0000A0, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::K2Node_DynamicCast_AsBPI_Player_Interface' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_IsValid_ReturnValue_3) == 0x0000B1, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_StartSASCode_bDummy) == 0x0000B2, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_StartSASCode_bDummy' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_Create_ReturnValue) == 0x0000B8, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, K2Node_DynamicCast_AsWB_Cutin_Base) == 0x0000C0, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::K2Node_DynamicCast_AsWB_Cutin_Base' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000D0, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000D8, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_IsEditor_ReturnValue) == 0x0000E0, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_IsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetSequencePlayer_ReturnValue_1) == 0x0000E8, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetSequencePlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetSASManager_SAS_Manager) == 0x0000F0, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetSASManager_SAS_Manager' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000F8, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetSASManager_SAS_Manager_1) == 0x000100, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetSASManager_SAS_Manager_1' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetSASManager_SAS_Manager_2) == 0x000108, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetSASManager_SAS_Manager_2' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetBrainCrashManager_Manager) == 0x000110, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetBrainCrashManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetGameMode_ReturnValue) == 0x000118, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetCurrentSequencer_Sequencer) == 0x000120, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetCurrentSequencer_Sequencer' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, K2Node_DynamicCast_AsRSGame_Mode_BPInterface) == 0x000128, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::K2Node_DynamicCast_AsRSGame_Mode_BPInterface' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, K2Node_DynamicCast_bSuccess_2) == 0x000138, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetSequencePlayer_ReturnValue_2) == 0x000140, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetSequencePlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetMainPlayerBP_Player) == 0x000148, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetMainPlayerBP_Player' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, K2Node_DynamicCast_AsRSBattle_Player) == 0x000150, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, K2Node_DynamicCast_bSuccess_3) == 0x000158, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_IsValid_ReturnValue_4) == 0x000159, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_SetPlayerActionSAS_self_CastInput) == 0x000160, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_SetPlayerActionSAS_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_SetPlayerActionSAS_bDummy) == 0x000170, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_SetPlayerActionSAS_bDummy' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetSASManager_SAS_Manager_3) == 0x000178, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetSASManager_SAS_Manager_3' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetSASManager_SAS_Manager_4) == 0x000180, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetSASManager_SAS_Manager_4' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetSASManager_SAS_Manager_5) == 0x000188, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetSASManager_SAS_Manager_5' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetSASManager_SAS_Manager_6) == 0x000190, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetSASManager_SAS_Manager_6' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetSASManager_SAS_Manager_7) == 0x000198, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetSASManager_SAS_Manager_7' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, Temp_int_Loop_Num_Variable) == 0x0001A0, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_Less_IntInt_ReturnValue) == 0x0001A4, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, K2Node_CustomEvent_DataTable) == 0x0001A8, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::K2Node_CustomEvent_DataTable' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, K2Node_CustomEvent_MessageTableName) == 0x0001D0, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::K2Node_CustomEvent_MessageTableName' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, K2Node_CustomEvent_WindowType) == 0x0001E0, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::K2Node_CustomEvent_WindowType' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, K2Node_CustomEvent_messageLabel) == 0x0001E8, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::K2Node_CustomEvent_messageLabel' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, K2Node_CustomEvent_Skipable) == 0x0001F8, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::K2Node_CustomEvent_Skipable' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, K2Node_CustomEvent_DrawSecond) == 0x0001FC, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::K2Node_CustomEvent_DrawSecond' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, K2Node_CustomEvent_IsVoiceOnlyMessage) == 0x000200, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::K2Node_CustomEvent_IsVoiceOnlyMessage' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, K2Node_CustomEvent_IsSkipVoiceEnd) == 0x000201, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::K2Node_CustomEvent_IsSkipVoiceEnd' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetEventManager_EventManager) == 0x000208, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_Concat_StrStr_ReturnValue) == 0x000210, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_IsValid_ReturnValue_5) == 0x000220, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetEventManager_EventManager_1) == 0x000228, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetEventManager_EventManager_1' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetEventManager_EventManager_2) == 0x000230, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetEventManager_EventManager_2' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_IsValid_ReturnValue_6) == 0x000238, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_IsValid_ReturnValue_7) == 0x000239, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetSASManager_SAS_Manager_8) == 0x000240, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetSASManager_SAS_Manager_8' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetSASManager_SAS_Manager_9) == 0x000248, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetSASManager_SAS_Manager_9' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, K2Node_CustomEvent_VoiceFileName) == 0x000250, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::K2Node_CustomEvent_VoiceFileName' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, Temp_int_Array_Index_Variable) == 0x000260, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetSoundManager_SoundManager) == 0x000268, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetSoundManager_SoundManager' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_IsValid_ReturnValue_8) == 0x000270, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_IsValid_ReturnValue_9) == 0x000271, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetSASManager_SAS_Manager_10) == 0x000278, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetSASManager_SAS_Manager_10' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetCutinWidget_Widget) == 0x000280, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetCutinWidget_Widget' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, K2Node_DynamicCast_AsWB_See_Through_Just_Dodge_Cutin) == 0x000288, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::K2Node_DynamicCast_AsWB_See_Through_Just_Dodge_Cutin' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, K2Node_DynamicCast_bSuccess_4) == 0x000290, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager, CallFunc_GetSASManager_SAS_Manager_11) == 0x000298, "Member 'BP_CutinManager_C_ExecuteUbergraph_BP_CutinManager::CallFunc_GetSASManager_SAS_Manager_11' has a wrong offset!");

// Function BP_CutinManager.BP_CutinManager_C.PlayVoice
// 0x0010 (0x0010 - 0x0000)
struct BP_CutinManager_C_PlayVoice final
{
public:
	class FString                                 VoiceFileName;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CutinManager_C_PlayVoice) == 0x000008, "Wrong alignment on BP_CutinManager_C_PlayVoice");
static_assert(sizeof(BP_CutinManager_C_PlayVoice) == 0x000010, "Wrong size on BP_CutinManager_C_PlayVoice");
static_assert(offsetof(BP_CutinManager_C_PlayVoice, VoiceFileName) == 0x000000, "Member 'BP_CutinManager_C_PlayVoice::VoiceFileName' has a wrong offset!");

// Function BP_CutinManager.BP_CutinManager_C.DrawMessage
// 0x0028 (0x0028 - 0x0000)
struct BP_CutinManager_C_DrawMessage final
{
public:
	int32                                         WindowType;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D8D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MessageLabel;                                      // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Skipable;                                          // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D8E[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DrawSecond;                                        // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsVoiceOnlyMessage;                                // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsSkipVoiceEnd;                                    // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CutinManager_C_DrawMessage) == 0x000008, "Wrong alignment on BP_CutinManager_C_DrawMessage");
static_assert(sizeof(BP_CutinManager_C_DrawMessage) == 0x000028, "Wrong size on BP_CutinManager_C_DrawMessage");
static_assert(offsetof(BP_CutinManager_C_DrawMessage, WindowType) == 0x000000, "Member 'BP_CutinManager_C_DrawMessage::WindowType' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_DrawMessage, MessageLabel) == 0x000008, "Member 'BP_CutinManager_C_DrawMessage::MessageLabel' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_DrawMessage, Skipable) == 0x000018, "Member 'BP_CutinManager_C_DrawMessage::Skipable' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_DrawMessage, DrawSecond) == 0x00001C, "Member 'BP_CutinManager_C_DrawMessage::DrawSecond' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_DrawMessage, IsVoiceOnlyMessage) == 0x000020, "Member 'BP_CutinManager_C_DrawMessage::IsVoiceOnlyMessage' has a wrong offset!");
static_assert(offsetof(BP_CutinManager_C_DrawMessage, IsSkipVoiceEnd) == 0x000021, "Member 'BP_CutinManager_C_DrawMessage::IsSkipVoiceEnd' has a wrong offset!");

// Function BP_CutinManager.BP_CutinManager_C.UnloadMessage
// 0x0010 (0x0010 - 0x0000)
struct BP_CutinManager_C_UnloadMessage final
{
public:
	class FString                                 MessageTableName;                                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_CutinManager_C_UnloadMessage) == 0x000008, "Wrong alignment on BP_CutinManager_C_UnloadMessage");
static_assert(sizeof(BP_CutinManager_C_UnloadMessage) == 0x000010, "Wrong size on BP_CutinManager_C_UnloadMessage");
static_assert(offsetof(BP_CutinManager_C_UnloadMessage, MessageTableName) == 0x000000, "Member 'BP_CutinManager_C_UnloadMessage::MessageTableName' has a wrong offset!");

// Function BP_CutinManager.BP_CutinManager_C.LoadMessage
// 0x0028 (0x0028 - 0x0000)
struct BP_CutinManager_C_LoadMessage final
{
public:
	TSoftObjectPtr<class UDataTable>              DataTable;                                         // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_CutinManager_C_LoadMessage) == 0x000008, "Wrong alignment on BP_CutinManager_C_LoadMessage");
static_assert(sizeof(BP_CutinManager_C_LoadMessage) == 0x000028, "Wrong size on BP_CutinManager_C_LoadMessage");
static_assert(offsetof(BP_CutinManager_C_LoadMessage, DataTable) == 0x000000, "Member 'BP_CutinManager_C_LoadMessage::DataTable' has a wrong offset!");

// Function BP_CutinManager.BP_CutinManager_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_CutinManager_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CutinManager_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_CutinManager_C_ReceiveEndPlay");
static_assert(sizeof(BP_CutinManager_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_CutinManager_C_ReceiveEndPlay");
static_assert(offsetof(BP_CutinManager_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_CutinManager_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_CutinManager.BP_CutinManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CutinManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CutinManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_CutinManager_C_ReceiveTick");
static_assert(sizeof(BP_CutinManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_CutinManager_C_ReceiveTick");
static_assert(offsetof(BP_CutinManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_CutinManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_CutinManager.BP_CutinManager_C.StartCutin
// 0x0330 (0x0330 - 0x0000)
struct BP_CutinManager_C_StartCutin final
{
public:
	class FName                                   RowName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SASKind                                     ESASKindType;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D8F[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SequencerID;                                       // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TmpActor;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         ShowActorList;                                     // 0x0018(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FMovieSceneObjectBindingID             CameraBinding;                                     // 0x0028(0x0018)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D90[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue;                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D91[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D92[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D93[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D94[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D95[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D96[0x2];                                     // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D97[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D98[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         K2Node_MakeArray_Array_1;                          // 0x00D8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class UClass*>                         K2Node_MakeArray_Array_2;                          // 0x00E8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D99[0x3];                                     // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable_2;                      // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D9A[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_3;                          // 0x0108(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array_4;                          // 0x0118(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	class ACineCameraActor*                       CallFunc_GetCaptureCameraBP_CaptureCameraBP;       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CaptureCineCameraActor_C> K2Node_DynamicCast_AsBPI_Capture_Cine_Camera_Actor; // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D9B[0x6];                                     // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneCaptureComponent2D*               CallFunc_GetSceneCaptureComponent2D_SceneCaptureComponent2D; // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D9C[0x3];                                     // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D9D[0x2];                                     // 0x015E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_Map_Values_Values;                        // 0x0160(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0178(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_3;                      // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D9E[0x3];                                     // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D9F[0x3];                                     // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01A0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSLevelSequenceActor*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetCutinWidget_Widget;                    // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToPlayerScreen_ReturnValue;            // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DA0[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
