#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CaptureCineCameraActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CinematicCamera_classes.hpp"
#include "ERenderTargetType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CaptureCineCameraActor.BP_CaptureCineCameraActor_C
// 0x0030 (0x0A70 - 0x0A40)
class ABP_CaptureCineCameraActor_C : public ACineCameraActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URSSceneCaptureComponent2D*             RSSceneCaptureComponent2D;                         // 0x0A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_CaptureCineCameraActor_C*>   CaptureCameraArray;                                // 0x0A50(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 RT_Cutin;                                          // 0x0A60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StaticHighResExposureManual;                       // 0x0A68(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	uint8                                         Pad_6334[0x3];                                     // 0x0A69(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StaticHighResExposureValue;                        // 0x0A6C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CaptureCineCameraActor(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ResetRenderTarget(ERenderTargetType RenderTargetType, class UTextureRenderTarget2D* NewTarget);
	void SetupCutinBuffer();
	void AddPostProcessMaterial(class UMaterialInstanceDynamic* Mid);
	void SetUseBloom(bool UseBloom);
	void SetTickFlags(bool Enable);
	void SetCutinBufferIndex(int32 Param_Index);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void CameraSetup(bool* Success);
	void PrivateSetTickFlags(bool Enable);
	void PrivateSetCutinBufferIndex(int32 Param_Index);
	void UpdateCelLookLight(float Yaw, float Pitch);
	void GetSceneCaptureComponent2D(class USceneCaptureComponent2D** SceneCaptureComponent2D);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CaptureCineCameraActor_C">();
	}
	static class ABP_CaptureCineCameraActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CaptureCineCameraActor_C>();
	}
};
static_assert(alignof(ABP_CaptureCineCameraActor_C) == 0x000010, "Wrong alignment on ABP_CaptureCineCameraActor_C");
static_assert(sizeof(ABP_CaptureCineCameraActor_C) == 0x000A70, "Wrong size on ABP_CaptureCineCameraActor_C");
static_assert(offsetof(ABP_CaptureCineCameraActor_C, UberGraphFrame) == 0x000A40, "Member 'ABP_CaptureCineCameraActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CaptureCineCameraActor_C, RSSceneCaptureComponent2D) == 0x000A48, "Member 'ABP_CaptureCineCameraActor_C::RSSceneCaptureComponent2D' has a wrong offset!");
static_assert(offsetof(ABP_CaptureCineCameraActor_C, CaptureCameraArray) == 0x000A50, "Member 'ABP_CaptureCineCameraActor_C::CaptureCameraArray' has a wrong offset!");
static_assert(offsetof(ABP_CaptureCineCameraActor_C, RT_Cutin) == 0x000A60, "Member 'ABP_CaptureCineCameraActor_C::RT_Cutin' has a wrong offset!");
static_assert(offsetof(ABP_CaptureCineCameraActor_C, StaticHighResExposureManual) == 0x000A68, "Member 'ABP_CaptureCineCameraActor_C::StaticHighResExposureManual' has a wrong offset!");
static_assert(offsetof(ABP_CaptureCineCameraActor_C, StaticHighResExposureValue) == 0x000A6C, "Member 'ABP_CaptureCineCameraActor_C::StaticHighResExposureValue' has a wrong offset!");

}

