#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CameraTriggerBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BP_TriggerBoxBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CameraTriggerBox.BP_CameraTriggerBox_C
// 0x0038 (0x0298 - 0x0260)
class ABP_CameraTriggerBox_C final : public ABP_TriggerBoxBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_CameraTriggerBox_C;              // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_RSPlayerCameraManager_C*            CameraManager;                                     // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCameraTriggerInfo                     TriggerInfo;                                       // 0x0270(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BP_CameraTriggerBox(int32 EntryPoint);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveBeginPlay();
	void GetCameraManager(class ABP_RSPlayerCameraManager_C** Camera_manager);
	void SetEventTriggerInfo(bool Flag_in, class AActor* Ply_actor_in, const struct FCameraTriggerInfo& Trg_info_in);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CameraTriggerBox_C">();
	}
	static class ABP_CameraTriggerBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CameraTriggerBox_C>();
	}
};
static_assert(alignof(ABP_CameraTriggerBox_C) == 0x000008, "Wrong alignment on ABP_CameraTriggerBox_C");
static_assert(sizeof(ABP_CameraTriggerBox_C) == 0x000298, "Wrong size on ABP_CameraTriggerBox_C");
static_assert(offsetof(ABP_CameraTriggerBox_C, UberGraphFrame_BP_CameraTriggerBox_C) == 0x000260, "Member 'ABP_CameraTriggerBox_C::UberGraphFrame_BP_CameraTriggerBox_C' has a wrong offset!");
static_assert(offsetof(ABP_CameraTriggerBox_C, CameraManager) == 0x000268, "Member 'ABP_CameraTriggerBox_C::CameraManager' has a wrong offset!");
static_assert(offsetof(ABP_CameraTriggerBox_C, TriggerInfo) == 0x000270, "Member 'ABP_CameraTriggerBox_C::TriggerInfo' has a wrong offset!");

}

