#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CaptureBG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ERenderTargetType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function BP_CaptureBG.BP_CaptureBG_C.ExecuteUbergraph_BP_CaptureBG
// 0x0260 (0x0260 - 0x0000)
struct BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4625[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4626[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4627[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Delta_Seconds;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_2;       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_And_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4628[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_And_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4629[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_462A[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_462B[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_462C[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSParticleSystemComponentBase*         CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            K2Node_CustomEvent_Curve;                          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_462D[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_1;                              // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_462E[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1; // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_462F[0x6];                                     // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00F0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSLevelSequenceActor*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4630[0x2];                                     // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4631[0x1];                                     // 0x0147(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RenderTargetManager_C*              CallFunc_GetRenderTargetManager_Manager;           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_GetRenderTarget_RenderTarget;             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            Temp_object_Variable;                              // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            Temp_object_Variable_1;                            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4632[0x6];                                     // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            Temp_object_Variable_2;                            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_2; // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4633[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         K2Node_CustomEvent_InSequence;                     // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewPlaybackPosition;            // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4634[0x4];                                     // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetNamedMaterial_ReturnValue;             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateNamedDynamicMaterialInstance_ReturnValue; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetNamedMaterial_ReturnValue_1;           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4635[0x4];                                     // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateNamedDynamicMaterialInstance_ReturnValue_1; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4636[0x3];                                     // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4637[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetNamedMaterial_ReturnValue_2;           // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateNamedDynamicMaterialInstance_ReturnValue_2; // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetNamedMaterial_ReturnValue_3;           // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4638[0x4];                                     // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateNamedDynamicMaterialInstance_ReturnValue_3; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4639[0x3];                                     // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0203(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_463A[0x4];                                     // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCineCameraComponent*                   CallFunc_GetCineCameraComponent_ReturnValue;       // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            Temp_object_Variable_3;                            // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ERenderTargetType RenderTargetType, class UTextureRenderTarget2D* NewTarget)> K2Node_CreateDelegate_OutputDelegate;              // 0x021C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_463B[0x4];                                     // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            K2Node_Select_Default_1;                           // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_463C[0x6];                                     // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RenderTargetManager_C*              CallFunc_GetRenderTargetManager_Manager_1;         // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ERenderTargetType RenderTargetType, class UTextureRenderTarget2D* NewTarget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0248(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG) == 0x000010, "Wrong alignment on BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG");
static_assert(sizeof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG) == 0x000260, "Wrong size on BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, EntryPoint) == 0x000000, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, Temp_name_Variable) == 0x000008, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, Temp_bool_Has_Been_Initd_Variable) == 0x000010, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, Temp_int_Variable) == 0x000014, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, Temp_bool_IsClosed_Variable) == 0x000018, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_RandomIntegerInRange_ReturnValue) == 0x00001C, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_RandomFloatInRange_ReturnValue) == 0x000020, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_MakeVector_ReturnValue) == 0x000024, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000030, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_MakeVector_ReturnValue_1) == 0x000034, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000040, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, K2Node_CustomEvent_Delta_Seconds) == 0x000044, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::K2Node_CustomEvent_Delta_Seconds' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_RandomIntegerInRange_ReturnValue_1) == 0x000048, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_RandomIntegerInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_RandomIntegerInRange_ReturnValue_2) == 0x00004C, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_RandomIntegerInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_And_IntInt_ReturnValue) == 0x000054, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_And_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_Greater_IntInt_ReturnValue) == 0x000058, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_SelectFloat_ReturnValue) == 0x000060, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_And_IntInt_ReturnValue_1) == 0x000064, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_And_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000068, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_SelectFloat_ReturnValue_1) == 0x00006C, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_MakeVector_ReturnValue_2) == 0x000070, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x00007C, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000080, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, K2Node_Event_DeltaSeconds) == 0x000088, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_GetMaterial_ReturnValue) == 0x000090, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000098, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_Array_Add_ReturnValue) == 0x0000A0, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_Array_Length_ReturnValue) == 0x0000A4, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_Greater_IntInt_ReturnValue_2) == 0x0000A8, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000AC, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0000B0, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, K2Node_CustomEvent_Curve) == 0x0000B8, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::K2Node_CustomEvent_Curve' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, Temp_name_Variable_1) == 0x0000C4, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, Temp_bool_Has_Been_Initd_Variable_1) == 0x0000CC, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, Temp_name_Variable_2) == 0x0000D0, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, Temp_name_Variable_3) == 0x0000D8, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, K2Node_Select_Default) == 0x0000E0, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1) == 0x0000E8, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000E9, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_MakeTransform_ReturnValue) == 0x0000F0, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000120, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_Array_Get_Item) == 0x000128, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_FinishSpawningActor_ReturnValue) == 0x000130, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_Array_Length_ReturnValue_1) == 0x000138, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_Less_IntInt_ReturnValue_1) == 0x00013C, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_IsValid_ReturnValue_1) == 0x00013D, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_Array_Length_ReturnValue_2) == 0x000140, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, Temp_bool_IsClosed_Variable_1) == 0x000144, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_Greater_IntInt_ReturnValue_3) == 0x000145, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_IsPlaying_ReturnValue) == 0x000146, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_GetRenderTargetManager_Manager) == 0x000148, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_GetRenderTargetManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_GetRenderTarget_RenderTarget) == 0x000150, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_GetRenderTarget_RenderTarget' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, Temp_object_Variable) == 0x000158, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, Temp_object_Variable_1) == 0x000160, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_GetSequencePlayer_ReturnValue) == 0x000168, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_IsValid_ReturnValue_2) == 0x000170, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_IsValid_ReturnValue_3) == 0x000171, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, Temp_object_Variable_2) == 0x000178, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_2) == 0x000180, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, K2Node_CustomEvent_InSequence) == 0x000188, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::K2Node_CustomEvent_InSequence' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, K2Node_CustomEvent_NewPlaybackPosition) == 0x000190, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::K2Node_CustomEvent_NewPlaybackPosition' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_GetNamedMaterial_ReturnValue) == 0x000198, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_GetNamedMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_CreateNamedDynamicMaterialInstance_ReturnValue) == 0x0001A0, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_CreateNamedDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_GetNamedMaterial_ReturnValue_1) == 0x0001A8, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_GetNamedMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_Array_Add_ReturnValue_1) == 0x0001B0, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_CreateNamedDynamicMaterialInstance_ReturnValue_1) == 0x0001B8, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_CreateNamedDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_IsValid_ReturnValue_4) == 0x0001C0, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_Array_Add_ReturnValue_2) == 0x0001C4, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_IsValid_ReturnValue_5) == 0x0001C8, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_GetNamedMaterial_ReturnValue_2) == 0x0001D0, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_GetNamedMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_CreateNamedDynamicMaterialInstance_ReturnValue_2) == 0x0001D8, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_CreateNamedDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_GetNamedMaterial_ReturnValue_3) == 0x0001E0, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_GetNamedMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_Array_Add_ReturnValue_3) == 0x0001E8, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_CreateNamedDynamicMaterialInstance_ReturnValue_3) == 0x0001F0, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_CreateNamedDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_IsValid_ReturnValue_6) == 0x0001F8, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_Array_Add_ReturnValue_4) == 0x0001FC, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_IsValid_ReturnValue_7) == 0x000200, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_IsValid_ReturnValue_8) == 0x000201, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_IsValid_ReturnValue_9) == 0x000202, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, Temp_bool_Has_Been_Initd_Variable_2) == 0x000203, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_GetCineCameraComponent_ReturnValue) == 0x000208, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_GetCineCameraComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, Temp_object_Variable_3) == 0x000210, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, Temp_int_Variable_1) == 0x000218, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, K2Node_CreateDelegate_OutputDelegate) == 0x00021C, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, K2Node_Select_Default_1) == 0x000230, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, K2Node_Event_EndPlayReason) == 0x000238, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_IsValid_ReturnValue_10) == 0x000239, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_GetRenderTargetManager_Manager_1) == 0x000240, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_GetRenderTargetManager_Manager_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, K2Node_CreateDelegate_OutputDelegate_1) == 0x000248, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, CallFunc_IsValid_ReturnValue_11) == 0x000258, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG, Temp_bool_IsClosed_Variable_2) == 0x000259, "Member 'BP_CaptureBG_C_ExecuteUbergraph_BP_CaptureBG::Temp_bool_IsClosed_Variable_2' has a wrong offset!");

// Function BP_CaptureBG.BP_CaptureBG_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_CaptureBG_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CaptureBG_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_CaptureBG_C_ReceiveEndPlay");
static_assert(sizeof(BP_CaptureBG_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_CaptureBG_C_ReceiveEndPlay");
static_assert(offsetof(BP_CaptureBG_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_CaptureBG_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_CaptureBG.BP_CaptureBG_C.CaptureSceneBGForLevelSequencer
// 0x0010 (0x0010 - 0x0000)
struct BP_CaptureBG_C_CaptureSceneBGForLevelSequencer final
{
public:
	class ULevelSequence*                         InSequence;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewPlaybackPosition;                               // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CaptureBG_C_CaptureSceneBGForLevelSequencer) == 0x000008, "Wrong alignment on BP_CaptureBG_C_CaptureSceneBGForLevelSequencer");
static_assert(sizeof(BP_CaptureBG_C_CaptureSceneBGForLevelSequencer) == 0x000010, "Wrong size on BP_CaptureBG_C_CaptureSceneBGForLevelSequencer");
static_assert(offsetof(BP_CaptureBG_C_CaptureSceneBGForLevelSequencer, InSequence) == 0x000000, "Member 'BP_CaptureBG_C_CaptureSceneBGForLevelSequencer::InSequence' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_CaptureSceneBGForLevelSequencer, NewPlaybackPosition) == 0x000008, "Member 'BP_CaptureBG_C_CaptureSceneBGForLevelSequencer::NewPlaybackPosition' has a wrong offset!");

// Function BP_CaptureBG.BP_CaptureBG_C.StartBGAlphaCurve
// 0x0008 (0x0008 - 0x0000)
struct BP_CaptureBG_C_StartBGAlphaCurve final
{
public:
	class UCurveFloat*                            Curve;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CaptureBG_C_StartBGAlphaCurve) == 0x000008, "Wrong alignment on BP_CaptureBG_C_StartBGAlphaCurve");
static_assert(sizeof(BP_CaptureBG_C_StartBGAlphaCurve) == 0x000008, "Wrong size on BP_CaptureBG_C_StartBGAlphaCurve");
static_assert(offsetof(BP_CaptureBG_C_StartBGAlphaCurve, Curve) == 0x000000, "Member 'BP_CaptureBG_C_StartBGAlphaCurve::Curve' has a wrong offset!");

// Function BP_CaptureBG.BP_CaptureBG_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CaptureBG_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CaptureBG_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_CaptureBG_C_ReceiveTick");
static_assert(sizeof(BP_CaptureBG_C_ReceiveTick) == 0x000004, "Wrong size on BP_CaptureBG_C_ReceiveTick");
static_assert(offsetof(BP_CaptureBG_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_CaptureBG_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_CaptureBG.BP_CaptureBG_C.Private_TickBlockNoise
// 0x0004 (0x0004 - 0x0000)
struct BP_CaptureBG_C_Private_TickBlockNoise final
{
public:
	float                                         Delta_Seconds;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CaptureBG_C_Private_TickBlockNoise) == 0x000004, "Wrong alignment on BP_CaptureBG_C_Private_TickBlockNoise");
static_assert(sizeof(BP_CaptureBG_C_Private_TickBlockNoise) == 0x000004, "Wrong size on BP_CaptureBG_C_Private_TickBlockNoise");
static_assert(offsetof(BP_CaptureBG_C_Private_TickBlockNoise, Delta_Seconds) == 0x000000, "Member 'BP_CaptureBG_C_Private_TickBlockNoise::Delta_Seconds' has a wrong offset!");

// Function BP_CaptureBG.BP_CaptureBG_C.PlayBoardBGAnimation
// 0x0028 (0x0028 - 0x0000)
struct BP_CaptureBG_C_PlayBoardBGAnimation final
{
public:
	class FString                                 boardAnimationName;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsLoop;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsAddMotion;                                       // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_463D[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimationAsset*                        CallFunc_GetAnimSequenceForAnimNamePath_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CaptureBG_C_PlayBoardBGAnimation) == 0x000008, "Wrong alignment on BP_CaptureBG_C_PlayBoardBGAnimation");
static_assert(sizeof(BP_CaptureBG_C_PlayBoardBGAnimation) == 0x000028, "Wrong size on BP_CaptureBG_C_PlayBoardBGAnimation");
static_assert(offsetof(BP_CaptureBG_C_PlayBoardBGAnimation, boardAnimationName) == 0x000000, "Member 'BP_CaptureBG_C_PlayBoardBGAnimation::boardAnimationName' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_PlayBoardBGAnimation, IsLoop) == 0x000010, "Member 'BP_CaptureBG_C_PlayBoardBGAnimation::IsLoop' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_PlayBoardBGAnimation, IsAddMotion) == 0x000011, "Member 'BP_CaptureBG_C_PlayBoardBGAnimation::IsAddMotion' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_PlayBoardBGAnimation, CallFunc_GetAnimSequenceForAnimNamePath_ReturnValue) == 0x000018, "Member 'BP_CaptureBG_C_PlayBoardBGAnimation::CallFunc_GetAnimSequenceForAnimNamePath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_PlayBoardBGAnimation, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_CaptureBG_C_PlayBoardBGAnimation::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_CaptureBG.BP_CaptureBG_C.GetAnimSequenceForAnimNamePath
// 0x0050 (0x0050 - 0x0000)
struct BP_CaptureBG_C_GetAnimSequenceForAnimNamePath final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UAnimationAsset*                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 DefaultOrbitPath;                                  // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 DefaultPath;                                       // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_AddAssetPathPrefix_ReturnValue;           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimationAsset*                        CallFunc_GetAnimSequenceFromPath_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CaptureBG_C_GetAnimSequenceForAnimNamePath) == 0x000008, "Wrong alignment on BP_CaptureBG_C_GetAnimSequenceForAnimNamePath");
static_assert(sizeof(BP_CaptureBG_C_GetAnimSequenceForAnimNamePath) == 0x000050, "Wrong size on BP_CaptureBG_C_GetAnimSequenceForAnimNamePath");
static_assert(offsetof(BP_CaptureBG_C_GetAnimSequenceForAnimNamePath, Path) == 0x000000, "Member 'BP_CaptureBG_C_GetAnimSequenceForAnimNamePath::Path' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_GetAnimSequenceForAnimNamePath, ReturnValue) == 0x000010, "Member 'BP_CaptureBG_C_GetAnimSequenceForAnimNamePath::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_GetAnimSequenceForAnimNamePath, DefaultOrbitPath) == 0x000018, "Member 'BP_CaptureBG_C_GetAnimSequenceForAnimNamePath::DefaultOrbitPath' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_GetAnimSequenceForAnimNamePath, DefaultPath) == 0x000028, "Member 'BP_CaptureBG_C_GetAnimSequenceForAnimNamePath::DefaultPath' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_GetAnimSequenceForAnimNamePath, CallFunc_AddAssetPathPrefix_ReturnValue) == 0x000038, "Member 'BP_CaptureBG_C_GetAnimSequenceForAnimNamePath::CallFunc_AddAssetPathPrefix_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_GetAnimSequenceForAnimNamePath, CallFunc_GetAnimSequenceFromPath_ReturnValue) == 0x000048, "Member 'BP_CaptureBG_C_GetAnimSequenceForAnimNamePath::CallFunc_GetAnimSequenceFromPath_ReturnValue' has a wrong offset!");

// Function BP_CaptureBG.BP_CaptureBG_C.AddBordBGAnimation
// 0x0020 (0x0020 - 0x0000)
struct BP_CaptureBG_C_AddBordBGAnimation final
{
public:
	class FString                                 boardAnimationName;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsLoop;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_463E[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CaptureBG_C_AddBordBGAnimation) == 0x000008, "Wrong alignment on BP_CaptureBG_C_AddBordBGAnimation");
static_assert(sizeof(BP_CaptureBG_C_AddBordBGAnimation) == 0x000020, "Wrong size on BP_CaptureBG_C_AddBordBGAnimation");
static_assert(offsetof(BP_CaptureBG_C_AddBordBGAnimation, boardAnimationName) == 0x000000, "Member 'BP_CaptureBG_C_AddBordBGAnimation::boardAnimationName' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_AddBordBGAnimation, IsLoop) == 0x000010, "Member 'BP_CaptureBG_C_AddBordBGAnimation::IsLoop' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_AddBordBGAnimation, CallFunc_Array_Add_ReturnValue) == 0x000014, "Member 'BP_CaptureBG_C_AddBordBGAnimation::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_AddBordBGAnimation, CallFunc_Array_Add_ReturnValue_1) == 0x000018, "Member 'BP_CaptureBG_C_AddBordBGAnimation::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function BP_CaptureBG.BP_CaptureBG_C.IsEndMotion
// 0x000C (0x000C - 0x0000)
struct BP_CaptureBG_C_IsEndMotion final
{
public:
	bool                                          Param_IsEndMotion;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_463F[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CaptureBG_C_IsEndMotion) == 0x000004, "Wrong alignment on BP_CaptureBG_C_IsEndMotion");
static_assert(sizeof(BP_CaptureBG_C_IsEndMotion) == 0x00000C, "Wrong size on BP_CaptureBG_C_IsEndMotion");
static_assert(offsetof(BP_CaptureBG_C_IsEndMotion, Param_IsEndMotion) == 0x000000, "Member 'BP_CaptureBG_C_IsEndMotion::Param_IsEndMotion' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_IsEndMotion, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_CaptureBG_C_IsEndMotion::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_IsEndMotion, CallFunc_IsPlaying_ReturnValue) == 0x000008, "Member 'BP_CaptureBG_C_IsEndMotion::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_IsEndMotion, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000009, "Member 'BP_CaptureBG_C_IsEndMotion::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_IsEndMotion, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x00000A, "Member 'BP_CaptureBG_C_IsEndMotion::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CaptureBG_C_IsEndMotion, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'BP_CaptureBG_C_IsEndMotion::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_CaptureBG.BP_CaptureBG_C.EndEvent
// 0x07E0 (0x07E0 - 0x0000)
struct BP_CaptureBG_C_EndEvent final
{
public:
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings;             // 0x0000(0x0780)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0781(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0782(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0783(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4640[0xC];                                     // 0x0784(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0790(0x0030)(IsPlainOldData, NoDestructor)
