#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CalcParameterComponent

#include "Basic.hpp"

#include "CharactersLevelData_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "CharactersParameter_structs.hpp"


namespace SDK::Params
{

// Function BP_CalcParameterComponent.BP_CalcParameterComponent_C.CalcCharactersParameterTable
// 0x1078 (0x1078 - 0x0000)
struct BP_CalcParameterComponent_C_CalcCharactersParameterTable final
{
public:
	EPlayerID                                     PlayerId;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52D5[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharactersParameterTable              Parameter;                                         // 0x0008(0x01F8)(Parm, OutParm)
	bool                                          LbHPDying;                                         // 0x0200(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LbHPMax;                                           // 0x0201(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52D6[0x2];                                     // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LHPRate;                                           // 0x0204(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerManager_C*                    LPlayerManager;                                    // 0x0208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayerInfo                            LPlayerInfo;                                       // 0x0210(0x00D0)(Edit, BlueprintVisible, NoDestructor)
	struct FCharactersParameterTable              LParameter;                                        // 0x02E0(0x01F8)(Edit, BlueprintVisible)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52D7[0x3];                                     // 0x04D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerInfo                            CallFunc_GetPartyMemberInfo_ReturnValue;           // 0x04DC(0x00D0)(NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x05AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x05AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52D8[0x2];                                     // 0x05AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayerInfo                            CallFunc_GetPartyMemberInfo_ReturnValue_1;         // 0x05B8(0x00D0)(NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52D9[0x3];                                     // 0x0689(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0690(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0694(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterParam_return;                 // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52DA[0x7];                                     // 0x0699(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharactersParameter                   CallFunc_GetCharacterParam_data_table;             // 0x06A0(0x01F8)(HasGetValueTypeHash)
	struct FCharactersParameterTable              CallFunc_CalcEquip_OutParameter;                   // 0x0898(0x01F8)()
	struct FCharactersParameterTable              CallFunc_CalcSkill_OutParameter;                   // 0x0A90(0x01F8)()
	struct FCharactersParameterTable              CallFunc_CalcLevel_OutParameter;                   // 0x0C88(0x01F8)()
	struct FCharactersParameterTable              CallFunc_ApplyAjitoTogetherCharactersParameter_ReturnValue; // 0x0E80(0x01F8)()
};
static_assert(alignof(BP_CalcParameterComponent_C_CalcCharactersParameterTable) == 0x000008, "Wrong alignment on BP_CalcParameterComponent_C_CalcCharactersParameterTable");
static_assert(sizeof(BP_CalcParameterComponent_C_CalcCharactersParameterTable) == 0x001078, "Wrong size on BP_CalcParameterComponent_C_CalcCharactersParameterTable");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcCharactersParameterTable, PlayerId) == 0x000000, "Member 'BP_CalcParameterComponent_C_CalcCharactersParameterTable::PlayerId' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcCharactersParameterTable, Parameter) == 0x000008, "Member 'BP_CalcParameterComponent_C_CalcCharactersParameterTable::Parameter' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcCharactersParameterTable, LbHPDying) == 0x000200, "Member 'BP_CalcParameterComponent_C_CalcCharactersParameterTable::LbHPDying' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcCharactersParameterTable, LbHPMax) == 0x000201, "Member 'BP_CalcParameterComponent_C_CalcCharactersParameterTable::LbHPMax' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcCharactersParameterTable, LHPRate) == 0x000204, "Member 'BP_CalcParameterComponent_C_CalcCharactersParameterTable::LHPRate' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcCharactersParameterTable, LPlayerManager) == 0x000208, "Member 'BP_CalcParameterComponent_C_CalcCharactersParameterTable::LPlayerManager' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcCharactersParameterTable, LPlayerInfo) == 0x000210, "Member 'BP_CalcParameterComponent_C_CalcCharactersParameterTable::LPlayerInfo' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcCharactersParameterTable, LParameter) == 0x0002E0, "Member 'BP_CalcParameterComponent_C_CalcCharactersParameterTable::LParameter' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcCharactersParameterTable, K2Node_SwitchEnum_CmpSuccess) == 0x0004D8, "Member 'BP_CalcParameterComponent_C_CalcCharactersParameterTable::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcCharactersParameterTable, CallFunc_GetPartyMemberInfo_ReturnValue) == 0x0004DC, "Member 'BP_CalcParameterComponent_C_CalcCharactersParameterTable::CallFunc_GetPartyMemberInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcCharactersParameterTable, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0005AC, "Member 'BP_CalcParameterComponent_C_CalcCharactersParameterTable::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcCharactersParameterTable, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0005AD, "Member 'BP_CalcParameterComponent_C_CalcCharactersParameterTable::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcCharactersParameterTable, CallFunc_GetPlayerManager_PlayerManager) == 0x0005B0, "Member 'BP_CalcParameterComponent_C_CalcCharactersParameterTable::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcCharactersParameterTable, CallFunc_GetPartyMemberInfo_ReturnValue_1) == 0x0005B8, "Member 'BP_CalcParameterComponent_C_CalcCharactersParameterTable::CallFunc_GetPartyMemberInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcCharactersParameterTable, CallFunc_Greater_IntInt_ReturnValue) == 0x000688, "Member 'BP_CalcParameterComponent_C_CalcCharactersParameterTable::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcCharactersParameterTable, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00068C, "Member 'BP_CalcParameterComponent_C_CalcCharactersParameterTable::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcCharactersParameterTable, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000690, "Member 'BP_CalcParameterComponent_C_CalcCharactersParameterTable::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcCharactersParameterTable, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000694, "Member 'BP_CalcParameterComponent_C_CalcCharactersParameterTable::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcCharactersParameterTable, CallFunc_GetCharacterParam_return) == 0x000698, "Member 'BP_CalcParameterComponent_C_CalcCharactersParameterTable::CallFunc_GetCharacterParam_return' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcCharactersParameterTable, CallFunc_GetCharacterParam_data_table) == 0x0006A0, "Member 'BP_CalcParameterComponent_C_CalcCharactersParameterTable::CallFunc_GetCharacterParam_data_table' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcCharactersParameterTable, CallFunc_CalcEquip_OutParameter) == 0x000898, "Member 'BP_CalcParameterComponent_C_CalcCharactersParameterTable::CallFunc_CalcEquip_OutParameter' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcCharactersParameterTable, CallFunc_CalcSkill_OutParameter) == 0x000A90, "Member 'BP_CalcParameterComponent_C_CalcCharactersParameterTable::CallFunc_CalcSkill_OutParameter' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcCharactersParameterTable, CallFunc_CalcLevel_OutParameter) == 0x000C88, "Member 'BP_CalcParameterComponent_C_CalcCharactersParameterTable::CallFunc_CalcLevel_OutParameter' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcCharactersParameterTable, CallFunc_ApplyAjitoTogetherCharactersParameter_ReturnValue) == 0x000E80, "Member 'BP_CalcParameterComponent_C_CalcCharactersParameterTable::CallFunc_ApplyAjitoTogetherCharactersParameter_ReturnValue' has a wrong offset!");

// Function BP_CalcParameterComponent.BP_CalcParameterComponent_C.CalcLevel
// 0x0720 (0x0720 - 0x0000)
struct BP_CalcParameterComponent_C_CalcLevel final
{
public:
	struct FCharactersParameterTable              RefParameter;                                      // 0x0000(0x01F8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPlayerInfo                            PlayerInfo;                                        // 0x01F8(0x00D0)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FCharactersParameterTable              OutParameter;                                      // 0x02C8(0x01F8)(Parm, OutParm)
	struct FCharactersParameterTable              LParameter;                                        // 0x04C0(0x01F8)(Edit, BlueprintVisible)
	TArray<int32>                                 L_objDefList;                                      // 0x06B8(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<int32>                                 L_defList;                                         // 0x06C8(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         L_psyAtk;                                          // 0x06D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_phyAtk;                                          // 0x06DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 L_hpList;                                          // 0x06E0(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterLevelData_return;             // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52DB[0x3];                                     // 0x06F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharactersLevelData                   CallFunc_GetCharacterLevelData_data_table;         // 0x06F4(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x070C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x0714(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_3;                     // 0x0718(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CalcParameterComponent_C_CalcLevel) == 0x000008, "Wrong alignment on BP_CalcParameterComponent_C_CalcLevel");
static_assert(sizeof(BP_CalcParameterComponent_C_CalcLevel) == 0x000720, "Wrong size on BP_CalcParameterComponent_C_CalcLevel");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcLevel, RefParameter) == 0x000000, "Member 'BP_CalcParameterComponent_C_CalcLevel::RefParameter' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcLevel, PlayerInfo) == 0x0001F8, "Member 'BP_CalcParameterComponent_C_CalcLevel::PlayerInfo' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcLevel, OutParameter) == 0x0002C8, "Member 'BP_CalcParameterComponent_C_CalcLevel::OutParameter' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcLevel, LParameter) == 0x0004C0, "Member 'BP_CalcParameterComponent_C_CalcLevel::LParameter' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcLevel, L_objDefList) == 0x0006B8, "Member 'BP_CalcParameterComponent_C_CalcLevel::L_objDefList' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcLevel, L_defList) == 0x0006C8, "Member 'BP_CalcParameterComponent_C_CalcLevel::L_defList' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcLevel, L_psyAtk) == 0x0006D8, "Member 'BP_CalcParameterComponent_C_CalcLevel::L_psyAtk' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcLevel, L_phyAtk) == 0x0006DC, "Member 'BP_CalcParameterComponent_C_CalcLevel::L_phyAtk' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcLevel, L_hpList) == 0x0006E0, "Member 'BP_CalcParameterComponent_C_CalcLevel::L_hpList' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcLevel, CallFunc_GetCharacterLevelData_return) == 0x0006F0, "Member 'BP_CalcParameterComponent_C_CalcLevel::CallFunc_GetCharacterLevelData_return' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcLevel, CallFunc_GetCharacterLevelData_data_table) == 0x0006F4, "Member 'BP_CalcParameterComponent_C_CalcLevel::CallFunc_GetCharacterLevelData_data_table' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcLevel, CallFunc_FTrunc_ReturnValue) == 0x00070C, "Member 'BP_CalcParameterComponent_C_CalcLevel::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcLevel, CallFunc_FTrunc_ReturnValue_1) == 0x000710, "Member 'BP_CalcParameterComponent_C_CalcLevel::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcLevel, CallFunc_FTrunc_ReturnValue_2) == 0x000714, "Member 'BP_CalcParameterComponent_C_CalcLevel::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcLevel, CallFunc_FTrunc_ReturnValue_3) == 0x000718, "Member 'BP_CalcParameterComponent_C_CalcLevel::CallFunc_FTrunc_ReturnValue_3' has a wrong offset!");

// Function BP_CalcParameterComponent.BP_CalcParameterComponent_C.CalcSkill
// 0x0790 (0x0790 - 0x0000)
struct BP_CalcParameterComponent_C_CalcSkill final
{
public:
	struct FCharactersParameterTable              RefParameter;                                      // 0x0000(0x01F8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPlayerInfo                            Info;                                              // 0x01F8(0x00D0)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FCharactersParameterTable              OutParameter;                                      // 0x02C8(0x01F8)(Parm, OutParm)
	float                                         LDefenceRate;                                      // 0x04C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LPsychicRate;                                      // 0x04C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LAttackRate;                                       // 0x04C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52DC[0x4];                                     // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharactersParameterTable              LParameter;                                        // 0x04D0(0x01F8)(Edit, BlueprintVisible)
	class ARSBattlePlayer_C*                      L_player;                                          // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     L_playerId;                                        // 0x06D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52DD[0x7];                                     // 0x06D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    L_playerManager;                                   // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLearnedSkillParameter_bLearned;        // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52DE[0x3];                                     // 0x06E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetLearnedSkillParameter_Parameter;       // 0x06E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLearnedSkillParameter_Parameter2;      // 0x06E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x06EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLearnedSkillParameter_bLearned_1;      // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52DF[0x3];                                     // 0x06F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetLearnedSkillParameter_Parameter_1;     // 0x06F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLearnedSkillParameter_Parameter2_1;    // 0x06F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x06FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLearnedSkillParameter_bLearned_2;      // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52E0[0x3];                                     // 0x0701(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetLearnedSkillParameter_Parameter_2;     // 0x0704(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLearnedSkillParameter_Parameter2_2;    // 0x0708(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x070C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLearnedSkillParameter_bLearned_3;      // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52E1[0x3];                                     // 0x0711(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetLearnedSkillParameter_Parameter_3;     // 0x0714(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLearnedSkillParameter_Parameter2_3;    // 0x0718(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x071C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0720(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDriveMode_ReturnValue;                  // 0x0724(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52E2[0x3];                                     // 0x0725(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x072C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0730(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52E3[0x4];                                     // 0x0734(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0738(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0748(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x074C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x0750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52E4[0x4];                                     // 0x0754(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      CallFunc_GetMainPlayer_Player;                     // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLearnedSkillParameter_bLearned_4;      // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52E5[0x3];                                     // 0x0761(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetLearnedSkillParameter_Parameter_4;     // 0x0764(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLearnedSkillParameter_Parameter2_4;    // 0x0768(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x076C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0770(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0774(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0778(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52E6[0x4];                                     // 0x077C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0780(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     CallFunc_GetBattleMemberPlayerID_ReturnValue;      // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0789(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CalcParameterComponent_C_CalcSkill) == 0x000008, "Wrong alignment on BP_CalcParameterComponent_C_CalcSkill");
static_assert(sizeof(BP_CalcParameterComponent_C_CalcSkill) == 0x000790, "Wrong size on BP_CalcParameterComponent_C_CalcSkill");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, RefParameter) == 0x000000, "Member 'BP_CalcParameterComponent_C_CalcSkill::RefParameter' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, Info) == 0x0001F8, "Member 'BP_CalcParameterComponent_C_CalcSkill::Info' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, OutParameter) == 0x0002C8, "Member 'BP_CalcParameterComponent_C_CalcSkill::OutParameter' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, LDefenceRate) == 0x0004C0, "Member 'BP_CalcParameterComponent_C_CalcSkill::LDefenceRate' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, LPsychicRate) == 0x0004C4, "Member 'BP_CalcParameterComponent_C_CalcSkill::LPsychicRate' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, LAttackRate) == 0x0004C8, "Member 'BP_CalcParameterComponent_C_CalcSkill::LAttackRate' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, LParameter) == 0x0004D0, "Member 'BP_CalcParameterComponent_C_CalcSkill::LParameter' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, L_player) == 0x0006C8, "Member 'BP_CalcParameterComponent_C_CalcSkill::L_player' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, L_playerId) == 0x0006D0, "Member 'BP_CalcParameterComponent_C_CalcSkill::L_playerId' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, L_playerManager) == 0x0006D8, "Member 'BP_CalcParameterComponent_C_CalcSkill::L_playerManager' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_GetLearnedSkillParameter_bLearned) == 0x0006E0, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_GetLearnedSkillParameter_bLearned' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_GetLearnedSkillParameter_Parameter) == 0x0006E4, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_GetLearnedSkillParameter_Parameter' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_GetLearnedSkillParameter_Parameter2) == 0x0006E8, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_GetLearnedSkillParameter_Parameter2' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_Add_FloatFloat_ReturnValue) == 0x0006EC, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_GetLearnedSkillParameter_bLearned_1) == 0x0006F0, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_GetLearnedSkillParameter_bLearned_1' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_GetLearnedSkillParameter_Parameter_1) == 0x0006F4, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_GetLearnedSkillParameter_Parameter_1' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_GetLearnedSkillParameter_Parameter2_1) == 0x0006F8, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_GetLearnedSkillParameter_Parameter2_1' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0006FC, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_GetLearnedSkillParameter_bLearned_2) == 0x000700, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_GetLearnedSkillParameter_bLearned_2' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_GetLearnedSkillParameter_Parameter_2) == 0x000704, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_GetLearnedSkillParameter_Parameter_2' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_GetLearnedSkillParameter_Parameter2_2) == 0x000708, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_GetLearnedSkillParameter_Parameter2_2' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x00070C, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_GetLearnedSkillParameter_bLearned_3) == 0x000710, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_GetLearnedSkillParameter_bLearned_3' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_GetLearnedSkillParameter_Parameter_3) == 0x000714, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_GetLearnedSkillParameter_Parameter_3' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_GetLearnedSkillParameter_Parameter2_3) == 0x000718, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_GetLearnedSkillParameter_Parameter2_3' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x00071C, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_Array_Get_Item) == 0x000720, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_IsDriveMode_ReturnValue) == 0x000724, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_IsDriveMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000728, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_FTrunc_ReturnValue) == 0x00072C, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000730, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, K2Node_MakeArray_Array) == 0x000738, "Member 'BP_CalcParameterComponent_C_CalcSkill::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_FTrunc_ReturnValue_1) == 0x000748, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_Multiply_IntFloat_ReturnValue_2) == 0x00074C, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_Multiply_IntFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_FTrunc_ReturnValue_2) == 0x000750, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_GetMainPlayer_Player) == 0x000758, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_GetMainPlayer_Player' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_GetLearnedSkillParameter_bLearned_4) == 0x000760, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_GetLearnedSkillParameter_bLearned_4' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_GetLearnedSkillParameter_Parameter_4) == 0x000764, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_GetLearnedSkillParameter_Parameter_4' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_GetLearnedSkillParameter_Parameter2_4) == 0x000768, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_GetLearnedSkillParameter_Parameter2_4' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_Add_FloatFloat_ReturnValue_4) == 0x00076C, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_Add_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000770, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000774, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000778, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_GetPlayerManager_PlayerManager) == 0x000780, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_GetBattleMemberPlayerID_ReturnValue) == 0x000788, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_GetBattleMemberPlayerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CalcParameterComponent_C_CalcSkill, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000789, "Member 'BP_CalcParameterComponent_C_CalcSkill::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_CalcParameterComponent.BP_CalcParameterComponent_C.CalcEquip
// 0x0928 (0x0928 - 0x0000)
struct BP_CalcParameterComponent_C_CalcEquip final
{
public:
	struct FCharactersParameterTable              RefParameter;                                      // 0x0000(0x01F8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPlayerInfo                            Info;                                              // 0x01F8(0x00D0)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          bHPMax;                                            // 0x02C8(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHPDying;                                          // 0x02C9(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52E7[0x6];                                     // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharactersParameterTable              OutParameter;                                      // 0x02D0(0x01F8)(Parm, OutParm)
	int32                                         LBrainAttack;                                      // 0x04C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52E8[0x4];                                     // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharactersParameterTable              LParameter;                                        // 0x04D0(0x01F8)(Edit, BlueprintVisible)
	float                                         LRate;                                             // 0x06C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     LPlayerID;                                         // 0x06CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52E9[0x3];                                     // 0x06CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    LPlayerManager;                                    // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52EA[0x3];                                     // 0x06D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeItemID_ReturnValue;                   // 0x06DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemDataCell                          CallFunc_GetItemDataCellByItemId_ItemData;         // 0x06E0(0x0080)()
	bool                                          CallFunc_GetItemDataCellByItemId_ReturnValue;      // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52EB[0x3];                                     // 0x0761(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAccessoryEffect_outValue;              // 0x0764(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAccessoryEffect_ReturnValue;           // 0x0768(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52EC[0x3];                                     // 0x0769(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x076C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAccessoryEffect_outValue_1;            // 0x0770(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAccessoryEffect_ReturnValue_1;         // 0x0774(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52ED[0x3];                                     // 0x0775(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0778(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAccessoryEffect_outValue_2;            // 0x077C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAccessoryEffect_ReturnValue_2;         // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52EE[0x3];                                     // 0x0781(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0784(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAccessoryEffect_outValue_3;            // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAccessoryEffect_ReturnValue_3;         // 0x078C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52EF[0x3];                                     // 0x078D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAccessoryEffect_outValue_4;            // 0x0794(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAccessoryEffect_ReturnValue_4;         // 0x0798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52F0[0x3];                                     // 0x0799(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x079C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAccessoryEffect_outValue_5;            // 0x07A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAccessoryEffect_ReturnValue_5;         // 0x07A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52F1[0x3];                                     // 0x07A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x07A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAccessoryEffect_outValue_6;            // 0x07AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAccessoryEffect_ReturnValue_6;         // 0x07B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52F2[0x3];                                     // 0x07B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_5;             // 0x07B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAccessoryEffect_outValue_7;            // 0x07B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAccessoryEffect_ReturnValue_7;         // 0x07BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52F3[0x3];                                     // 0x07BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_6;             // 0x07C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAccessoryEffect_outValue_8;            // 0x07C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAccessoryEffect_ReturnValue_8;         // 0x07C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52F4[0x3];                                     // 0x07C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_7;             // 0x07CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x07D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue;                 // 0x07D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x07D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52F5[0x4];                                     // 0x07DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 CallFunc_GetAccessoryExtendParameter_outParameter; // 0x07E0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_GetAccessoryExtendParameter_ReturnValue;  // 0x07F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetBattleMemberPlayerID_ReturnValue;      // 0x07F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52F6[0x2];                                     // 0x07F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Array_Get_Item;                           // 0x07F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x07F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52F7[0x7];                                     // 0x07F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      CallFunc_GetMainPlayer_Player;                     // 0x0800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBrainFieldHelpedCount_ReturnValue;     // 0x0808(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x080C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_GetBattleMemberActorFromKind_ReturnValue; // 0x0810(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0818(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52F8[0x4];                                     // 0x081C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface;       // 0x0820(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52F9[0x3];                                     // 0x0831(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0834(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerStatusAI_bResult;                 // 0x0838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0839(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52FA[0x2];                                     // 0x083A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAccessoryEffect_outValue_9;            // 0x083C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAccessoryEffect_ReturnValue_9;         // 0x0840(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52FB[0x3];                                     // 0x0841(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0844(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAccessoryEffect_outValue_10;           // 0x0848(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAccessoryEffect_ReturnValue_10;        // 0x084C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52FC[0x3];                                     // 0x084D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0850(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_9;             // 0x0854(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAccessoryEffect_outValue_11;           // 0x0858(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAccessoryEffect_ReturnValue_11;        // 0x085C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52FD[0x3];                                     // 0x085D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_10;            // 0x0860(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAccessoryEffect_outValue_12;           // 0x0864(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAccessoryEffect_ReturnValue_12;        // 0x0868(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52FE[0x3];                                     // 0x0869(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_11;            // 0x086C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x0870(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0874(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue_1;               // 0x0878(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x087C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_2;                         // 0x0880(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x0884(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue_2;               // 0x0888(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_3;                     // 0x088C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x0890(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue_3;               // 0x0894(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_3;                         // 0x0898(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_4;                     // 0x089C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_4;                         // 0x08A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_5;                         // 0x08A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x08A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x08AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x08B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_6;                         // 0x08B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x08B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52FF[0x4];                                     // 0x08BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x08C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x08C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5300[0x4];                                     // 0x08CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPartyPlayerCacheData                  CallFunc_GetPartyPlayerCache_ReturnValue;          // 0x08D0(0x0038)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0908(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x090C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0910(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0914(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
