#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CameraTriggerBox

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BP_CameraTriggerBox.BP_CameraTriggerBox_C.ExecuteUbergraph_BP_CameraTriggerBox
// 0x0040 (0x0040 - 0x0000)
struct BP_CameraTriggerBox_C_ExecuteUbergraph_BP_CameraTriggerBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E4C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RSPlayerCameraManager_C*            CallFunc_GetCameraManager_camera_manager;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E4D[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CameraTriggerBox_C_ExecuteUbergraph_BP_CameraTriggerBox) == 0x000008, "Wrong alignment on BP_CameraTriggerBox_C_ExecuteUbergraph_BP_CameraTriggerBox");
static_assert(sizeof(BP_CameraTriggerBox_C_ExecuteUbergraph_BP_CameraTriggerBox) == 0x000040, "Wrong size on BP_CameraTriggerBox_C_ExecuteUbergraph_BP_CameraTriggerBox");
static_assert(offsetof(BP_CameraTriggerBox_C_ExecuteUbergraph_BP_CameraTriggerBox, EntryPoint) == 0x000000, "Member 'BP_CameraTriggerBox_C_ExecuteUbergraph_BP_CameraTriggerBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CameraTriggerBox_C_ExecuteUbergraph_BP_CameraTriggerBox, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'BP_CameraTriggerBox_C_ExecuteUbergraph_BP_CameraTriggerBox::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraTriggerBox_C_ExecuteUbergraph_BP_CameraTriggerBox, CallFunc_GetCameraManager_camera_manager) == 0x000010, "Member 'BP_CameraTriggerBox_C_ExecuteUbergraph_BP_CameraTriggerBox::CallFunc_GetCameraManager_camera_manager' has a wrong offset!");
static_assert(offsetof(BP_CameraTriggerBox_C_ExecuteUbergraph_BP_CameraTriggerBox, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000018, "Member 'BP_CameraTriggerBox_C_ExecuteUbergraph_BP_CameraTriggerBox::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CameraTriggerBox_C_ExecuteUbergraph_BP_CameraTriggerBox, K2Node_Event_OtherActor) == 0x000020, "Member 'BP_CameraTriggerBox_C_ExecuteUbergraph_BP_CameraTriggerBox::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_CameraTriggerBox_C_ExecuteUbergraph_BP_CameraTriggerBox, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000028, "Member 'BP_CameraTriggerBox_C_ExecuteUbergraph_BP_CameraTriggerBox::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraTriggerBox_C_ExecuteUbergraph_BP_CameraTriggerBox, K2Node_Event_OtherActor_1) == 0x000030, "Member 'BP_CameraTriggerBox_C_ExecuteUbergraph_BP_CameraTriggerBox::K2Node_Event_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_CameraTriggerBox_C_ExecuteUbergraph_BP_CameraTriggerBox, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000038, "Member 'BP_CameraTriggerBox_C_ExecuteUbergraph_BP_CameraTriggerBox::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");

// Function BP_CameraTriggerBox.BP_CameraTriggerBox_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_CameraTriggerBox_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraTriggerBox_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on BP_CameraTriggerBox_C_ReceiveActorEndOverlap");
static_assert(sizeof(BP_CameraTriggerBox_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on BP_CameraTriggerBox_C_ReceiveActorEndOverlap");
static_assert(offsetof(BP_CameraTriggerBox_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'BP_CameraTriggerBox_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// Function BP_CameraTriggerBox.BP_CameraTriggerBox_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_CameraTriggerBox_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraTriggerBox_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_CameraTriggerBox_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_CameraTriggerBox_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_CameraTriggerBox_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_CameraTriggerBox_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_CameraTriggerBox_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_CameraTriggerBox.BP_CameraTriggerBox_C.GetCameraManager
// 0x0020 (0x0020 - 0x0000)
struct BP_CameraTriggerBox_C_GetCameraManager final
{
public:
	class ABP_RSPlayerCameraManager_C*            Camera_manager;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RSPlayerCameraManager_C*            K2Node_DynamicCast_AsBP_RSPlayer_Camera_Manager;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CameraTriggerBox_C_GetCameraManager) == 0x000008, "Wrong alignment on BP_CameraTriggerBox_C_GetCameraManager");
static_assert(sizeof(BP_CameraTriggerBox_C_GetCameraManager) == 0x000020, "Wrong size on BP_CameraTriggerBox_C_GetCameraManager");
static_assert(offsetof(BP_CameraTriggerBox_C_GetCameraManager, Camera_manager) == 0x000000, "Member 'BP_CameraTriggerBox_C_GetCameraManager::Camera_manager' has a wrong offset!");
static_assert(offsetof(BP_CameraTriggerBox_C_GetCameraManager, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000008, "Member 'BP_CameraTriggerBox_C_GetCameraManager::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraTriggerBox_C_GetCameraManager, K2Node_DynamicCast_AsBP_RSPlayer_Camera_Manager) == 0x000010, "Member 'BP_CameraTriggerBox_C_GetCameraManager::K2Node_DynamicCast_AsBP_RSPlayer_Camera_Manager' has a wrong offset!");
static_assert(offsetof(BP_CameraTriggerBox_C_GetCameraManager, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_CameraTriggerBox_C_GetCameraManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CameraTriggerBox_C_GetCameraManager, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BP_CameraTriggerBox_C_GetCameraManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_CameraTriggerBox.BP_CameraTriggerBox_C.SetEventTriggerInfo
// 0x0068 (0x0068 - 0x0000)
struct BP_CameraTriggerBox_C_SetEventTriggerInfo final
{
public:
	bool                                          Flag_in;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E4E[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Ply_actor_in;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCameraTriggerInfo                     Trg_info_in;                                       // 0x0010(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          L_bDebug;                                          // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E4F[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      L_ply;                                             // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E50[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetDebuggingManager_Manager;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CameraTriggerBox_C_SetEventTriggerInfo) == 0x000008, "Wrong alignment on BP_CameraTriggerBox_C_SetEventTriggerInfo");
static_assert(sizeof(BP_CameraTriggerBox_C_SetEventTriggerInfo) == 0x000068, "Wrong size on BP_CameraTriggerBox_C_SetEventTriggerInfo");
static_assert(offsetof(BP_CameraTriggerBox_C_SetEventTriggerInfo, Flag_in) == 0x000000, "Member 'BP_CameraTriggerBox_C_SetEventTriggerInfo::Flag_in' has a wrong offset!");
static_assert(offsetof(BP_CameraTriggerBox_C_SetEventTriggerInfo, Ply_actor_in) == 0x000008, "Member 'BP_CameraTriggerBox_C_SetEventTriggerInfo::Ply_actor_in' has a wrong offset!");
static_assert(offsetof(BP_CameraTriggerBox_C_SetEventTriggerInfo, Trg_info_in) == 0x000010, "Member 'BP_CameraTriggerBox_C_SetEventTriggerInfo::Trg_info_in' has a wrong offset!");
static_assert(offsetof(BP_CameraTriggerBox_C_SetEventTriggerInfo, L_bDebug) == 0x000038, "Member 'BP_CameraTriggerBox_C_SetEventTriggerInfo::L_bDebug' has a wrong offset!");
static_assert(offsetof(BP_CameraTriggerBox_C_SetEventTriggerInfo, L_ply) == 0x000040, "Member 'BP_CameraTriggerBox_C_SetEventTriggerInfo::L_ply' has a wrong offset!");
static_assert(offsetof(BP_CameraTriggerBox_C_SetEventTriggerInfo, K2Node_DynamicCast_AsRSBattle_Player) == 0x000048, "Member 'BP_CameraTriggerBox_C_SetEventTriggerInfo::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_CameraTriggerBox_C_SetEventTriggerInfo, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_CameraTriggerBox_C_SetEventTriggerInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CameraTriggerBox_C_SetEventTriggerInfo, CallFunc_GetDebuggingManager_Manager) == 0x000058, "Member 'BP_CameraTriggerBox_C_SetEventTriggerInfo::CallFunc_GetDebuggingManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_CameraTriggerBox_C_SetEventTriggerInfo, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_CameraTriggerBox_C_SetEventTriggerInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

