#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CrashVisionComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CrashVisionComponent.BP_CrashVisionComponent_C.ExecuteUbergraph_BP_CrashVisionComponent
// 0x0010 (0x0010 - 0x0000)
struct BP_CrashVisionComponent_C_ExecuteUbergraph_BP_CrashVisionComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableShockWave_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89C9[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CrashVisionComponent_C_ExecuteUbergraph_BP_CrashVisionComponent) == 0x000008, "Wrong alignment on BP_CrashVisionComponent_C_ExecuteUbergraph_BP_CrashVisionComponent");
static_assert(sizeof(BP_CrashVisionComponent_C_ExecuteUbergraph_BP_CrashVisionComponent) == 0x000010, "Wrong size on BP_CrashVisionComponent_C_ExecuteUbergraph_BP_CrashVisionComponent");
static_assert(offsetof(BP_CrashVisionComponent_C_ExecuteUbergraph_BP_CrashVisionComponent, EntryPoint) == 0x000000, "Member 'BP_CrashVisionComponent_C_ExecuteUbergraph_BP_CrashVisionComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CrashVisionComponent_C_ExecuteUbergraph_BP_CrashVisionComponent, CallFunc_IsEnableShockWave_ReturnValue) == 0x000004, "Member 'BP_CrashVisionComponent_C_ExecuteUbergraph_BP_CrashVisionComponent::CallFunc_IsEnableShockWave_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CrashVisionComponent_C_ExecuteUbergraph_BP_CrashVisionComponent, CallFunc_GetPlayerManager_PlayerManager) == 0x000008, "Member 'BP_CrashVisionComponent_C_ExecuteUbergraph_BP_CrashVisionComponent::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");

// Function BP_CrashVisionComponent.BP_CrashVisionComponent_C.AttackShockWave
// 0x0048 (0x0048 - 0x0000)
struct BP_CrashVisionComponent_C_AttackShockWave final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89CA[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89CB[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARSCharacterBase*>               CallFunc_GetCrashTargetList_ReturnValue;           // 0x0018(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89CC[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleCharacterInterface_C> K2Node_DynamicCast_AsBPI_Battle_Character_Interface; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReserveCrashVisionShockWave_bDummy;       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CrashVisionComponent_C_AttackShockWave) == 0x000008, "Wrong alignment on BP_CrashVisionComponent_C_AttackShockWave");
static_assert(sizeof(BP_CrashVisionComponent_C_AttackShockWave) == 0x000048, "Wrong size on BP_CrashVisionComponent_C_AttackShockWave");
static_assert(offsetof(BP_CrashVisionComponent_C_AttackShockWave, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_CrashVisionComponent_C_AttackShockWave::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CrashVisionComponent_C_AttackShockWave, Temp_int_Loop_Num_Variable) == 0x000004, "Member 'BP_CrashVisionComponent_C_AttackShockWave::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_CrashVisionComponent_C_AttackShockWave, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_CrashVisionComponent_C_AttackShockWave::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CrashVisionComponent_C_AttackShockWave, CallFunc_Less_IntInt_ReturnValue) == 0x00000C, "Member 'BP_CrashVisionComponent_C_AttackShockWave::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CrashVisionComponent_C_AttackShockWave, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_CrashVisionComponent_C_AttackShockWave::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CrashVisionComponent_C_AttackShockWave, CallFunc_GetCrashTargetList_ReturnValue) == 0x000018, "Member 'BP_CrashVisionComponent_C_AttackShockWave::CallFunc_GetCrashTargetList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CrashVisionComponent_C_AttackShockWave, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_CrashVisionComponent_C_AttackShockWave::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CrashVisionComponent_C_AttackShockWave, K2Node_DynamicCast_AsBPI_Battle_Character_Interface) == 0x000030, "Member 'BP_CrashVisionComponent_C_AttackShockWave::K2Node_DynamicCast_AsBPI_Battle_Character_Interface' has a wrong offset!");
static_assert(offsetof(BP_CrashVisionComponent_C_AttackShockWave, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_CrashVisionComponent_C_AttackShockWave::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CrashVisionComponent_C_AttackShockWave, CallFunc_ReserveCrashVisionShockWave_bDummy) == 0x000041, "Member 'BP_CrashVisionComponent_C_AttackShockWave::CallFunc_ReserveCrashVisionShockWave_bDummy' has a wrong offset!");

// Function BP_CrashVisionComponent.BP_CrashVisionComponent_C.IsPlayerInputCrashVision
// 0x0020 (0x0020 - 0x0000)
struct BP_CrashVisionComponent_C_IsPlayerInputCrashVision final
{
public:
	bool                                          bInput;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89CD[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      CallFunc_GetMainPlayer_Player;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTrgCrashVision_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CrashVisionComponent_C_IsPlayerInputCrashVision) == 0x000008, "Wrong alignment on BP_CrashVisionComponent_C_IsPlayerInputCrashVision");
static_assert(sizeof(BP_CrashVisionComponent_C_IsPlayerInputCrashVision) == 0x000020, "Wrong size on BP_CrashVisionComponent_C_IsPlayerInputCrashVision");
static_assert(offsetof(BP_CrashVisionComponent_C_IsPlayerInputCrashVision, bInput) == 0x000000, "Member 'BP_CrashVisionComponent_C_IsPlayerInputCrashVision::bInput' has a wrong offset!");
static_assert(offsetof(BP_CrashVisionComponent_C_IsPlayerInputCrashVision, CallFunc_GetPlayerManager_PlayerManager) == 0x000008, "Member 'BP_CrashVisionComponent_C_IsPlayerInputCrashVision::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_CrashVisionComponent_C_IsPlayerInputCrashVision, CallFunc_GetMainPlayer_Player) == 0x000010, "Member 'BP_CrashVisionComponent_C_IsPlayerInputCrashVision::CallFunc_GetMainPlayer_Player' has a wrong offset!");
static_assert(offsetof(BP_CrashVisionComponent_C_IsPlayerInputCrashVision, CallFunc_IsTrgCrashVision_ReturnValue) == 0x000018, "Member 'BP_CrashVisionComponent_C_IsPlayerInputCrashVision::CallFunc_IsTrgCrashVision_ReturnValue' has a wrong offset!");

}

