#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DropItemBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DropItemBase.BP_DropItemBase_C.ExecuteUbergraph_BP_DropItemBase
// 0x0008 (0x0008 - 0x0000)
struct BP_DropItemBase_C_ExecuteUbergraph_BP_DropItemBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DropItemBase_C_ExecuteUbergraph_BP_DropItemBase) == 0x000004, "Wrong alignment on BP_DropItemBase_C_ExecuteUbergraph_BP_DropItemBase");
static_assert(sizeof(BP_DropItemBase_C_ExecuteUbergraph_BP_DropItemBase) == 0x000008, "Wrong size on BP_DropItemBase_C_ExecuteUbergraph_BP_DropItemBase");
static_assert(offsetof(BP_DropItemBase_C_ExecuteUbergraph_BP_DropItemBase, EntryPoint) == 0x000000, "Member 'BP_DropItemBase_C_ExecuteUbergraph_BP_DropItemBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DropItemBase_C_ExecuteUbergraph_BP_DropItemBase, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_DropItemBase_C_ExecuteUbergraph_BP_DropItemBase::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_DropItemBase.BP_DropItemBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_DropItemBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DropItemBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_DropItemBase_C_ReceiveTick");
static_assert(sizeof(BP_DropItemBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_DropItemBase_C_ReceiveTick");
static_assert(offsetof(BP_DropItemBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_DropItemBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

