#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Discover_Component

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Discover_Component.BP_Discover_Component_C.ExecuteUbergraph_BP_Discover_Component
// 0x00B0 (0x00B0 - 0x0000)
struct BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4618[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_emactor_3;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattleCharacter_C*                   K2Node_DynamicCast_AsRSBattle_Character;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4619[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_emactor_2;                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461A[0x5];                                     // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_emactor_1;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461B[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattleCharacter_C*                   K2Node_DynamicCast_AsRSBattle_Character_1;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461C[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_emactor;                        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattleCharacter_C*                   K2Node_DynamicCast_AsRSBattle_Character_2;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_2;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInViewport_ReturnValue_1;               // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInViewport_ReturnValue_2;               // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         K2Node_DynamicCast_AsHUDMain_Game;                 // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461D[0x6];                                     // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461E[0x6];                                     // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         K2Node_DynamicCast_AsHUDMain_Game_1;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveDiscoverIndexList_ReturnValue;      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInViewport_ReturnValue_3;               // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component) == 0x000008, "Wrong alignment on BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component");
static_assert(sizeof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component) == 0x0000B0, "Wrong size on BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, EntryPoint) == 0x000000, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, K2Node_CustomEvent_emactor_3) == 0x000008, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::K2Node_CustomEvent_emactor_3' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, K2Node_DynamicCast_AsRSBattle_Character) == 0x000010, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::K2Node_DynamicCast_AsRSBattle_Character' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, K2Node_CustomEvent_emactor_2) == 0x000020, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::K2Node_CustomEvent_emactor_2' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, CallFunc_IsVisible_ReturnValue) == 0x000028, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, CallFunc_IsInViewport_ReturnValue) == 0x00002A, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, K2Node_CustomEvent_emactor_1) == 0x000030, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::K2Node_CustomEvent_emactor_1' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, K2Node_DynamicCast_AsRSBattle_Character_1) == 0x000040, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::K2Node_DynamicCast_AsRSBattle_Character_1' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, CallFunc_IsVisible_ReturnValue_1) == 0x000049, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, K2Node_CustomEvent_emactor) == 0x000050, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::K2Node_CustomEvent_emactor' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, K2Node_DynamicCast_AsRSBattle_Character_2) == 0x000058, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::K2Node_DynamicCast_AsRSBattle_Character_2' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, CallFunc_IsVisible_ReturnValue_2) == 0x000061, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::CallFunc_IsVisible_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, CallFunc_IsValid_ReturnValue_2) == 0x000062, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, CallFunc_IsInViewport_ReturnValue_1) == 0x000063, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::CallFunc_IsInViewport_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, CallFunc_IsValid_ReturnValue_3) == 0x000064, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, CallFunc_IsInViewport_ReturnValue_2) == 0x000065, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::CallFunc_IsInViewport_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, K2Node_Event_EndPlayReason) == 0x000066, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, CallFunc_IsValid_ReturnValue_4) == 0x000067, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, CallFunc_GetPlayerController_ReturnValue) == 0x000068, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, CallFunc_GetHUD_ReturnValue) == 0x000070, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, CallFunc_GetPlayerController_ReturnValue_1) == 0x000078, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, K2Node_DynamicCast_AsHUDMain_Game) == 0x000080, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::K2Node_DynamicCast_AsHUDMain_Game' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, K2Node_DynamicCast_bSuccess_3) == 0x000088, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, CallFunc_IsValid_ReturnValue_5) == 0x000089, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, CallFunc_GetHUD_ReturnValue_1) == 0x000090, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, CallFunc_IsValid_ReturnValue_6) == 0x000098, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, CallFunc_IsValid_ReturnValue_7) == 0x000099, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, K2Node_DynamicCast_AsHUDMain_Game_1) == 0x0000A0, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::K2Node_DynamicCast_AsHUDMain_Game_1' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, K2Node_DynamicCast_bSuccess_4) == 0x0000A8, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, CallFunc_RemoveDiscoverIndexList_ReturnValue) == 0x0000A9, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::CallFunc_RemoveDiscoverIndexList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, CallFunc_IsValid_ReturnValue_8) == 0x0000AA, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, CallFunc_IsValid_ReturnValue_9) == 0x0000AB, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component, CallFunc_IsInViewport_ReturnValue_3) == 0x0000AC, "Member 'BP_Discover_Component_C_ExecuteUbergraph_BP_Discover_Component::CallFunc_IsInViewport_ReturnValue_3' has a wrong offset!");

// Function BP_Discover_Component.BP_Discover_Component_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Discover_Component_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Discover_Component_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Discover_Component_C_ReceiveEndPlay");
static_assert(sizeof(BP_Discover_Component_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Discover_Component_C_ReceiveEndPlay");
static_assert(offsetof(BP_Discover_Component_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Discover_Component_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_Discover_Component.BP_Discover_Component_C.OnUnDiscoverOver
// 0x0008 (0x0008 - 0x0000)
struct BP_Discover_Component_C_OnUnDiscoverOver final
{
public:
	class AActor*                                 EmActor;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Discover_Component_C_OnUnDiscoverOver) == 0x000008, "Wrong alignment on BP_Discover_Component_C_OnUnDiscoverOver");
static_assert(sizeof(BP_Discover_Component_C_OnUnDiscoverOver) == 0x000008, "Wrong size on BP_Discover_Component_C_OnUnDiscoverOver");
static_assert(offsetof(BP_Discover_Component_C_OnUnDiscoverOver, EmActor) == 0x000000, "Member 'BP_Discover_Component_C_OnUnDiscoverOver::EmActor' has a wrong offset!");

// Function BP_Discover_Component.BP_Discover_Component_C.OnUnDiscoverAwareness
// 0x0008 (0x0008 - 0x0000)
struct BP_Discover_Component_C_OnUnDiscoverAwareness final
{
public:
	class AActor*                                 EmActor;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Discover_Component_C_OnUnDiscoverAwareness) == 0x000008, "Wrong alignment on BP_Discover_Component_C_OnUnDiscoverAwareness");
static_assert(sizeof(BP_Discover_Component_C_OnUnDiscoverAwareness) == 0x000008, "Wrong size on BP_Discover_Component_C_OnUnDiscoverAwareness");
static_assert(offsetof(BP_Discover_Component_C_OnUnDiscoverAwareness, EmActor) == 0x000000, "Member 'BP_Discover_Component_C_OnUnDiscoverAwareness::EmActor' has a wrong offset!");

// Function BP_Discover_Component.BP_Discover_Component_C.OnUnDiscover
// 0x0008 (0x0008 - 0x0000)
struct BP_Discover_Component_C_OnUnDiscover final
{
public:
	class AActor*                                 EmActor;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Discover_Component_C_OnUnDiscover) == 0x000008, "Wrong alignment on BP_Discover_Component_C_OnUnDiscover");
static_assert(sizeof(BP_Discover_Component_C_OnUnDiscover) == 0x000008, "Wrong size on BP_Discover_Component_C_OnUnDiscover");
static_assert(offsetof(BP_Discover_Component_C_OnUnDiscover, EmActor) == 0x000000, "Member 'BP_Discover_Component_C_OnUnDiscover::EmActor' has a wrong offset!");

// Function BP_Discover_Component.BP_Discover_Component_C.OnDiscover
// 0x0008 (0x0008 - 0x0000)
struct BP_Discover_Component_C_OnDiscover final
{
public:
	class AActor*                                 EmActor;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Discover_Component_C_OnDiscover) == 0x000008, "Wrong alignment on BP_Discover_Component_C_OnDiscover");
static_assert(sizeof(BP_Discover_Component_C_OnDiscover) == 0x000008, "Wrong size on BP_Discover_Component_C_OnDiscover");
static_assert(offsetof(BP_Discover_Component_C_OnDiscover, EmActor) == 0x000000, "Member 'BP_Discover_Component_C_OnDiscover::EmActor' has a wrong offset!");

// Function BP_Discover_Component.BP_Discover_Component_C.GetUIDiscover
// 0x0008 (0x0008 - 0x0000)
struct BP_Discover_Component_C_GetUIDiscover final
{
public:
	class UUIDiscover*                            Param_UIDiscover;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Discover_Component_C_GetUIDiscover) == 0x000008, "Wrong alignment on BP_Discover_Component_C_GetUIDiscover");
static_assert(sizeof(BP_Discover_Component_C_GetUIDiscover) == 0x000008, "Wrong size on BP_Discover_Component_C_GetUIDiscover");
static_assert(offsetof(BP_Discover_Component_C_GetUIDiscover, Param_UIDiscover) == 0x000000, "Member 'BP_Discover_Component_C_GetUIDiscover::Param_UIDiscover' has a wrong offset!");

// Function BP_Discover_Component.BP_Discover_Component_C.AddView
// 0x0028 (0x0028 - 0x0000)
struct BP_Discover_Component_C_AddView final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         K2Node_DynamicCast_AsHUDMain_Game;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461F[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CreateDiscoverIndexList_ReturnValue;      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Discover_Component_C_AddView) == 0x000008, "Wrong alignment on BP_Discover_Component_C_AddView");
static_assert(sizeof(BP_Discover_Component_C_AddView) == 0x000028, "Wrong size on BP_Discover_Component_C_AddView");
static_assert(offsetof(BP_Discover_Component_C_AddView, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'BP_Discover_Component_C_AddView::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_AddView, CallFunc_GetHUD_ReturnValue) == 0x000008, "Member 'BP_Discover_Component_C_AddView::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_AddView, K2Node_DynamicCast_AsHUDMain_Game) == 0x000010, "Member 'BP_Discover_Component_C_AddView::K2Node_DynamicCast_AsHUDMain_Game' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_AddView, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Discover_Component_C_AddView::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_AddView, CallFunc_CreateDiscoverIndexList_ReturnValue) == 0x00001C, "Member 'BP_Discover_Component_C_AddView::CallFunc_CreateDiscoverIndexList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_AddView, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_Discover_Component_C_AddView::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Discover_Component.BP_Discover_Component_C.TakeOverUI
// 0x0020 (0x0020 - 0x0000)
struct BP_Discover_Component_C_TakeOverUI final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 From;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Discover_Component_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Discover_Component_C_TakeOverUI) == 0x000008, "Wrong alignment on BP_Discover_Component_C_TakeOverUI");
static_assert(sizeof(BP_Discover_Component_C_TakeOverUI) == 0x000020, "Wrong size on BP_Discover_Component_C_TakeOverUI");
static_assert(offsetof(BP_Discover_Component_C_TakeOverUI, Owner) == 0x000000, "Member 'BP_Discover_Component_C_TakeOverUI::Owner' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_TakeOverUI, From) == 0x000008, "Member 'BP_Discover_Component_C_TakeOverUI::From' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_TakeOverUI, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'BP_Discover_Component_C_TakeOverUI::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Discover_Component_C_TakeOverUI, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_Discover_Component_C_TakeOverUI::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

