#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DriveSequenceParameter

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DriveSequenceParameter.BP_DriveSequenceParameter_C
// 0x0010 (0x0240 - 0x0230)
class ABP_DriveSequenceParameter_C final : public AActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         CameraTargetPlayer;                                // 0x0238(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         CameraTargetOffsetZ;                               // 0x023C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DriveSequenceParameter_C">();
	}
	static class ABP_DriveSequenceParameter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DriveSequenceParameter_C>();
	}
};
static_assert(alignof(ABP_DriveSequenceParameter_C) == 0x000008, "Wrong alignment on ABP_DriveSequenceParameter_C");
static_assert(sizeof(ABP_DriveSequenceParameter_C) == 0x000240, "Wrong size on ABP_DriveSequenceParameter_C");
static_assert(offsetof(ABP_DriveSequenceParameter_C, DefaultSceneRoot) == 0x000230, "Member 'ABP_DriveSequenceParameter_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DriveSequenceParameter_C, CameraTargetPlayer) == 0x000238, "Member 'ABP_DriveSequenceParameter_C::CameraTargetPlayer' has a wrong offset!");
static_assert(offsetof(ABP_DriveSequenceParameter_C, CameraTargetOffsetZ) == 0x00023C, "Member 'ABP_DriveSequenceParameter_C::CameraTargetOffsetZ' has a wrong offset!");

}

