#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventTriggerBox

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FEventTriggerCommand_structs.hpp"


namespace SDK::Params
{

// Function BP_EventTriggerBox.BP_EventTriggerBox_C.ExecuteUbergraph_BP_EventTriggerBox
// 0x0118 (0x0118 - 0x0000)
struct BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0008(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnEvent_Played;                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_579C[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_579D[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidEvent_IsValid;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_579E[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCutSceneEvent_IsCutSceneEvent;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_579F[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BattleManager_C*                    CallFunc_GetBattleManager_BattleManager;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBattleMode_ReturnValue;                 // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEnableEvent_Enable;                  // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57A0[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_1;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57A1[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57A2[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPlayerID TargetID, float bondsProgress)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_57A3[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserParamManager*                      CallFunc_GetUserParamManager_UserParamManager;     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     K2Node_CustomEvent_targetID;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57A4[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_bondsProgress;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57A5[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFadeAnimation_ReturnValue;              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57A6[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57A7[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_2;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEnableEvent_Enable_1;                // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57A8[0x6];                                     // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager_1;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStatusInScene_IsInScene;                // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox) == 0x000008, "Wrong alignment on BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox");
static_assert(sizeof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox) == 0x000118, "Wrong size on BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, EntryPoint) == 0x000000, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000008, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_OnEvent_Played) == 0x000020, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_OnEvent_Played' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000030, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, K2Node_Event_OtherActor) == 0x000038, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_IsValidEvent_IsValid) == 0x000040, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_IsValidEvent_IsValid' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000041, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000048, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_GetEventManager_EventManager) == 0x000050, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, K2Node_CustomEvent_DestroyedActor) == 0x000058, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_IsCutSceneEvent_IsCutSceneEvent) == 0x000060, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_IsCutSceneEvent_IsCutSceneEvent' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_GetBattleManager_BattleManager) == 0x000068, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_GetBattleManager_BattleManager' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, K2Node_Event_OtherActor_1) == 0x000070, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::K2Node_Event_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000079, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_IsBattleMode_ReturnValue) == 0x00007A, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_IsBattleMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_CheckEnableEvent_Enable) == 0x00007B, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_CheckEnableEvent_Enable' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_GetEventManager_EventManager_1) == 0x000080, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_GetEventManager_EventManager_1' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, K2Node_CreateDelegate_OutputDelegate) == 0x000088, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_IsValid_ReturnValue_1) == 0x000098, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_GetSceneManager_SceneManager) == 0x0000A0, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_GetSceneManager_SceneManager' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_IsValid_ReturnValue_2) == 0x0000A8, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000AC, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_GetUserParamManager_UserParamManager) == 0x0000C0, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_GetUserParamManager_UserParamManager' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, K2Node_CustomEvent_targetID) == 0x0000C8, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::K2Node_CustomEvent_targetID' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, K2Node_CustomEvent_bondsProgress) == 0x0000CC, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::K2Node_CustomEvent_bondsProgress' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_IsValid_ReturnValue_3) == 0x0000D0, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_GetHUDMainGame_HUDMainGame) == 0x0000D8, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_IsFadeAnimation_ReturnValue) == 0x0000E0, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_IsFadeAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_MakeColor_ReturnValue) == 0x0000E4, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_GetEventManager_EventManager_2) == 0x0000F8, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_GetEventManager_EventManager_2' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_IsValid_ReturnValue_4) == 0x000100, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_CheckEnableEvent_Enable_1) == 0x000101, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_CheckEnableEvent_Enable_1' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_GetSceneManager_SceneManager_1) == 0x000108, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_GetSceneManager_SceneManager_1' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_IsValid_ReturnValue_5) == 0x000110, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox, CallFunc_IsStatusInScene_IsInScene) == 0x000111, "Member 'BP_EventTriggerBox_C_ExecuteUbergraph_BP_EventTriggerBox::CallFunc_IsStatusInScene_IsInScene' has a wrong offset!");

// Function BP_EventTriggerBox.BP_EventTriggerBox_C.OnBondsProgressEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_EventTriggerBox_C_OnBondsProgressEvent final
{
public:
	EPlayerID                                     TargetID;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57A9[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bondsProgress;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventTriggerBox_C_OnBondsProgressEvent) == 0x000004, "Wrong alignment on BP_EventTriggerBox_C_OnBondsProgressEvent");
static_assert(sizeof(BP_EventTriggerBox_C_OnBondsProgressEvent) == 0x000008, "Wrong size on BP_EventTriggerBox_C_OnBondsProgressEvent");
static_assert(offsetof(BP_EventTriggerBox_C_OnBondsProgressEvent, TargetID) == 0x000000, "Member 'BP_EventTriggerBox_C_OnBondsProgressEvent::TargetID' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnBondsProgressEvent, bondsProgress) == 0x000004, "Member 'BP_EventTriggerBox_C_OnBondsProgressEvent::bondsProgress' has a wrong offset!");

// Function BP_EventTriggerBox.BP_EventTriggerBox_C.SetReturnMoveMainChara
// 0x0008 (0x0008 - 0x0000)
struct BP_EventTriggerBox_C_SetReturnMoveMainChara final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventTriggerBox_C_SetReturnMoveMainChara) == 0x000008, "Wrong alignment on BP_EventTriggerBox_C_SetReturnMoveMainChara");
static_assert(sizeof(BP_EventTriggerBox_C_SetReturnMoveMainChara) == 0x000008, "Wrong size on BP_EventTriggerBox_C_SetReturnMoveMainChara");
static_assert(offsetof(BP_EventTriggerBox_C_SetReturnMoveMainChara, DestroyedActor) == 0x000000, "Member 'BP_EventTriggerBox_C_SetReturnMoveMainChara::DestroyedActor' has a wrong offset!");

// Function BP_EventTriggerBox.BP_EventTriggerBox_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_EventTriggerBox_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventTriggerBox_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_EventTriggerBox_C_ReceiveTick");
static_assert(sizeof(BP_EventTriggerBox_C_ReceiveTick) == 0x000004, "Wrong size on BP_EventTriggerBox_C_ReceiveTick");
static_assert(offsetof(BP_EventTriggerBox_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_EventTriggerBox_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_EventTriggerBox.BP_EventTriggerBox_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_EventTriggerBox_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventTriggerBox_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on BP_EventTriggerBox_C_ReceiveActorEndOverlap");
static_assert(sizeof(BP_EventTriggerBox_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on BP_EventTriggerBox_C_ReceiveActorEndOverlap");
static_assert(offsetof(BP_EventTriggerBox_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'BP_EventTriggerBox_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// Function BP_EventTriggerBox.BP_EventTriggerBox_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_EventTriggerBox_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventTriggerBox_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_EventTriggerBox_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_EventTriggerBox_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_EventTriggerBox_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_EventTriggerBox_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_EventTriggerBox_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_EventTriggerBox.BP_EventTriggerBox_C.OnEvent
// 0x01E0 (0x01E0 - 0x0000)
struct BP_EventTriggerBox_C_OnEvent final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Played;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57AA[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                LocalEventActor;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnEvent_Played;                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57AB[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57AC[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> CallFunc_IsEventMove_self_CastInput;               // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEventMove_result;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57AD[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57AE[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57AF[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_SpawnActorFromBPFilePath_ReturnValue;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MakeEventActorBase_C*               K2Node_DynamicCast_AsBP_Make_Event_Actor_Base;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57B0[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Is_Performance_Sequencer_IsPerform;       // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57B1[0x2];                                     // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x00CC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_57B2[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_1;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57B3[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_2;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_3;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57B4[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFEventTriggerCommand                  K2Node_MakeStruct_FEventTriggerCommand;            // 0x0108(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_AddEventTriggerCommand_self_CastInput;    // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57B5[0x5];                                     // 0x0183(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager;             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetDebuggingManager_Manager;              // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57B6[0x2];                                     // 0x019A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57B7[0x3];                                     // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEnableEvent_Enable;                  // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57B8[0x2];                                     // 0x01AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_LoadMakeEvent_self_CastInput;             // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventTriggerBox_C_OnEvent) == 0x000010, "Wrong alignment on BP_EventTriggerBox_C_OnEvent");
static_assert(sizeof(BP_EventTriggerBox_C_OnEvent) == 0x0001E0, "Wrong size on BP_EventTriggerBox_C_OnEvent");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, OtherActor) == 0x000000, "Member 'BP_EventTriggerBox_C_OnEvent::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, Played) == 0x000008, "Member 'BP_EventTriggerBox_C_OnEvent::Played' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, LocalEventActor) == 0x000010, "Member 'BP_EventTriggerBox_C_OnEvent::LocalEventActor' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_GetPlayerPawn_ReturnValue) == 0x000018, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_OnEvent_Played) == 0x000020, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_OnEvent_Played' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, K2Node_DynamicCast_AsRSBattle_Player) == 0x000028, "Member 'BP_EventTriggerBox_C_OnEvent::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_EventTriggerBox_C_OnEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_IsEventMove_self_CastInput) == 0x000038, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_IsEventMove_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_IsEventMove_result) == 0x000048, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_IsEventMove_result' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_GetEventManager_EventManager) == 0x000050, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_IsValid_ReturnValue) == 0x00005C, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_Greater_IntInt_ReturnValue) == 0x000064, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_SpawnActorFromBPFilePath_ReturnValue) == 0x000068, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_SpawnActorFromBPFilePath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, K2Node_DynamicCast_AsBP_Make_Event_Actor_Base) == 0x000070, "Member 'BP_EventTriggerBox_C_OnEvent::K2Node_DynamicCast_AsBP_Make_Event_Actor_Base' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'BP_EventTriggerBox_C_OnEvent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_GetBrainFieldManager_Manager) == 0x0000B0, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_GetBrainFieldManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_GetVelocity_ReturnValue) == 0x0000B8, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_IsValid_ReturnValue_1) == 0x0000C4, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_Is_Performance_Sequencer_IsPerform) == 0x0000C5, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_Is_Performance_Sequencer_IsPerform' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, Temp_int_Loop_Num_Variable) == 0x0000C8, "Member 'BP_EventTriggerBox_C_OnEvent::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, K2Node_CreateDelegate_OutputDelegate) == 0x0000CC, "Member 'BP_EventTriggerBox_C_OnEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_GetEventManager_EventManager_1) == 0x0000E0, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_GetEventManager_EventManager_1' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_IsValid_ReturnValue_2) == 0x0000E8, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_GetEventManager_EventManager_2) == 0x0000F0, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_GetEventManager_EventManager_2' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_GetEventManager_EventManager_3) == 0x0000F8, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_GetEventManager_EventManager_3' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_IsValid_ReturnValue_3) == 0x000100, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, K2Node_MakeStruct_FEventTriggerCommand) == 0x000108, "Member 'BP_EventTriggerBox_C_OnEvent::K2Node_MakeStruct_FEventTriggerCommand' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_AddEventTriggerCommand_self_CastInput) == 0x000170, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_AddEventTriggerCommand_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_IsValidClass_ReturnValue) == 0x000180, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000181, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_NotEqual_NameName_ReturnValue) == 0x000182, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_GetSceneManager_SceneManager) == 0x000188, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_GetSceneManager_SceneManager' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_GetDebuggingManager_Manager) == 0x000190, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_GetDebuggingManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_Not_PreBool_ReturnValue) == 0x000198, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_Not_PreBool_ReturnValue_1) == 0x000199, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, Temp_int_Loop_Counter_Variable) == 0x00019C, "Member 'BP_EventTriggerBox_C_OnEvent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_Less_IntInt_ReturnValue) == 0x0001A0, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_Add_IntInt_ReturnValue) == 0x0001A4, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_CheckEnableEvent_Enable) == 0x0001A8, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_CheckEnableEvent_Enable' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, K2Node_SwitchEnum_CmpSuccess) == 0x0001A9, "Member 'BP_EventTriggerBox_C_OnEvent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, Temp_int_Array_Index_Variable) == 0x0001AC, "Member 'BP_EventTriggerBox_C_OnEvent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001B0, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001B8, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_LoadMakeEvent_self_CastInput) == 0x0001C0, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_LoadMakeEvent_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_OnEvent, CallFunc_IsValid_ReturnValue_4) == 0x0001D0, "Member 'BP_EventTriggerBox_C_OnEvent::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");

// Function BP_EventTriggerBox.BP_EventTriggerBox_C.CheckEnableEvent
// 0x0006 (0x0006 - 0x0000)
struct BP_EventTriggerBox_C_CheckEnableEvent final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnEnable;                                      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckBondsProgressID_ReturnEnable1;       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckScenarioFlagList_ReturnBool;         // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckProgressID_ReturnEnable1;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventTriggerBox_C_CheckEnableEvent) == 0x000001, "Wrong alignment on BP_EventTriggerBox_C_CheckEnableEvent");
static_assert(sizeof(BP_EventTriggerBox_C_CheckEnableEvent) == 0x000006, "Wrong size on BP_EventTriggerBox_C_CheckEnableEvent");
static_assert(offsetof(BP_EventTriggerBox_C_CheckEnableEvent, Enable) == 0x000000, "Member 'BP_EventTriggerBox_C_CheckEnableEvent::Enable' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_CheckEnableEvent, ReturnEnable) == 0x000001, "Member 'BP_EventTriggerBox_C_CheckEnableEvent::ReturnEnable' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_CheckEnableEvent, CallFunc_CheckBondsProgressID_ReturnEnable1) == 0x000002, "Member 'BP_EventTriggerBox_C_CheckEnableEvent::CallFunc_CheckBondsProgressID_ReturnEnable1' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_CheckEnableEvent, CallFunc_CheckScenarioFlagList_ReturnBool) == 0x000003, "Member 'BP_EventTriggerBox_C_CheckEnableEvent::CallFunc_CheckScenarioFlagList_ReturnBool' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_CheckEnableEvent, CallFunc_CheckProgressID_ReturnEnable1) == 0x000004, "Member 'BP_EventTriggerBox_C_CheckEnableEvent::CallFunc_CheckProgressID_ReturnEnable1' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_CheckEnableEvent, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'BP_EventTriggerBox_C_CheckEnableEvent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_EventTriggerBox.BP_EventTriggerBox_C.CheckWallCollisionEnabled
// 0x0001 (0x0001 - 0x0000)
struct BP_EventTriggerBox_C_CheckWallCollisionEnabled final
{
public:
	bool                                          CallFunc_CheckEnableEvent_Enable;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventTriggerBox_C_CheckWallCollisionEnabled) == 0x000001, "Wrong alignment on BP_EventTriggerBox_C_CheckWallCollisionEnabled");
static_assert(sizeof(BP_EventTriggerBox_C_CheckWallCollisionEnabled) == 0x000001, "Wrong size on BP_EventTriggerBox_C_CheckWallCollisionEnabled");
static_assert(offsetof(BP_EventTriggerBox_C_CheckWallCollisionEnabled, CallFunc_CheckEnableEvent_Enable) == 0x000000, "Member 'BP_EventTriggerBox_C_CheckWallCollisionEnabled::CallFunc_CheckEnableEvent_Enable' has a wrong offset!");

// Function BP_EventTriggerBox.BP_EventTriggerBox_C.CheckEnableEventBase
// 0x0002 (0x0002 - 0x0000)
struct BP_EventTriggerBox_C_CheckEnableEventBase final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEnableEvent_Enable;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventTriggerBox_C_CheckEnableEventBase) == 0x000001, "Wrong alignment on BP_EventTriggerBox_C_CheckEnableEventBase");
static_assert(sizeof(BP_EventTriggerBox_C_CheckEnableEventBase) == 0x000002, "Wrong size on BP_EventTriggerBox_C_CheckEnableEventBase");
static_assert(offsetof(BP_EventTriggerBox_C_CheckEnableEventBase, Return) == 0x000000, "Member 'BP_EventTriggerBox_C_CheckEnableEventBase::Return' has a wrong offset!");
static_assert(offsetof(BP_EventTriggerBox_C_CheckEnableEventBase, CallFunc_CheckEnableEvent_Enable) == 0x000001, "Member 'BP_EventTriggerBox_C_CheckEnableEventBase::CallFunc_CheckEnableEvent_Enable' has a wrong offset!");

}

