#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Event3DWidgetActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Event3DWidgetActor.BP_Event3DWidgetActor_C
// 0x0050 (0x0280 - 0x0230)
class ABP_Event3DWidgetActor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URSWidgetComponent*                     RSWidget_Backface;                                 // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URSWidgetComponent*                     RSWidget;                                          // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 ThreadID;                                          // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Interp, HasGetValueTypeHash)
	class FName                                   BeforeThreadID;                                    // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     OverrideWidgetMaterial;                            // 0x0268(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     PreviousOverrideWidgetMaterial;                    // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCapWaitTAA;                                      // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor)

public:
	void ExecuteUbergraph_BP_Event3DWidgetActor(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void SetBrainMesCurrentThreadID(class FName Param_ThreadID);
	void UpdateOverrideMaterial();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Event3DWidgetActor_C">();
	}
	static class ABP_Event3DWidgetActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Event3DWidgetActor_C>();
	}
};
static_assert(alignof(ABP_Event3DWidgetActor_C) == 0x000008, "Wrong alignment on ABP_Event3DWidgetActor_C");
static_assert(sizeof(ABP_Event3DWidgetActor_C) == 0x000280, "Wrong size on ABP_Event3DWidgetActor_C");
static_assert(offsetof(ABP_Event3DWidgetActor_C, UberGraphFrame) == 0x000230, "Member 'ABP_Event3DWidgetActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Event3DWidgetActor_C, RSWidget_Backface) == 0x000238, "Member 'ABP_Event3DWidgetActor_C::RSWidget_Backface' has a wrong offset!");
static_assert(offsetof(ABP_Event3DWidgetActor_C, RSWidget) == 0x000240, "Member 'ABP_Event3DWidgetActor_C::RSWidget' has a wrong offset!");
static_assert(offsetof(ABP_Event3DWidgetActor_C, DefaultSceneRoot) == 0x000248, "Member 'ABP_Event3DWidgetActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Event3DWidgetActor_C, ThreadID) == 0x000250, "Member 'ABP_Event3DWidgetActor_C::ThreadID' has a wrong offset!");
static_assert(offsetof(ABP_Event3DWidgetActor_C, BeforeThreadID) == 0x000260, "Member 'ABP_Event3DWidgetActor_C::BeforeThreadID' has a wrong offset!");
static_assert(offsetof(ABP_Event3DWidgetActor_C, OverrideWidgetMaterial) == 0x000268, "Member 'ABP_Event3DWidgetActor_C::OverrideWidgetMaterial' has a wrong offset!");
static_assert(offsetof(ABP_Event3DWidgetActor_C, PreviousOverrideWidgetMaterial) == 0x000270, "Member 'ABP_Event3DWidgetActor_C::PreviousOverrideWidgetMaterial' has a wrong offset!");
static_assert(offsetof(ABP_Event3DWidgetActor_C, IsCapWaitTAA) == 0x000278, "Member 'ABP_Event3DWidgetActor_C::IsCapWaitTAA' has a wrong offset!");

}

