#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventPPStream

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EventPPStream.BP_EventPPStream_C.ExecuteUbergraph_BP_EventPPStream
// 0x0028 (0x0028 - 0x0000)
struct BP_EventPPStream_C_ExecuteUbergraph_BP_EventPPStream final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431C[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0014(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431D[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPPStream_C_ExecuteUbergraph_BP_EventPPStream) == 0x000008, "Wrong alignment on BP_EventPPStream_C_ExecuteUbergraph_BP_EventPPStream");
static_assert(sizeof(BP_EventPPStream_C_ExecuteUbergraph_BP_EventPPStream) == 0x000028, "Wrong size on BP_EventPPStream_C_ExecuteUbergraph_BP_EventPPStream");
static_assert(offsetof(BP_EventPPStream_C_ExecuteUbergraph_BP_EventPPStream, EntryPoint) == 0x000000, "Member 'BP_EventPPStream_C_ExecuteUbergraph_BP_EventPPStream::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EventPPStream_C_ExecuteUbergraph_BP_EventPPStream, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000004, "Member 'BP_EventPPStream_C_ExecuteUbergraph_BP_EventPPStream::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPPStream_C_ExecuteUbergraph_BP_EventPPStream, CallFunc_GetEventManager_EventManager) == 0x000008, "Member 'BP_EventPPStream_C_ExecuteUbergraph_BP_EventPPStream::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_EventPPStream_C_ExecuteUbergraph_BP_EventPPStream, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_EventPPStream_C_ExecuteUbergraph_BP_EventPPStream::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPPStream_C_ExecuteUbergraph_BP_EventPPStream, Temp_name_Variable) == 0x000014, "Member 'BP_EventPPStream_C_ExecuteUbergraph_BP_EventPPStream::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventPPStream_C_ExecuteUbergraph_BP_EventPPStream, K2Node_Event_EndPlayReason) == 0x00001C, "Member 'BP_EventPPStream_C_ExecuteUbergraph_BP_EventPPStream::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_EventPPStream_C_ExecuteUbergraph_BP_EventPPStream, CallFunc_Array_Add_ReturnValue) == 0x000020, "Member 'BP_EventPPStream_C_ExecuteUbergraph_BP_EventPPStream::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_EventPPStream.BP_EventPPStream_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_EventPPStream_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPPStream_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_EventPPStream_C_ReceiveEndPlay");
static_assert(sizeof(BP_EventPPStream_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_EventPPStream_C_ReceiveEndPlay");
static_assert(offsetof(BP_EventPPStream_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_EventPPStream_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

