#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ElevatorBase

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ElevatorBase.BP_ElevatorBase_C.ExecuteUbergraph_BP_ElevatorBase
// 0x02B0 (0x02B0 - 0x0000)
struct BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ElevatorMoveEnd_Dummy;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A85[0xB];                                     // 0x0005(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A86[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_3;  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_3;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_3;            // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_3;       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A87[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_2;  // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_2;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_2;            // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_2;       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_2;           // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A88[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_2;          // 0x0098(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_1;           // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A89[0x3];                                     // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_1;          // 0x0140(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ElevatorMoveStart_Dummy;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ElevatorMoveStart_Dummy_1;                // 0x01D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A8A[0x3];                                     // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Floor;                                // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x01DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanPlayCutScene_OK;                       // 0x01DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A8B[0x3];                                     // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0200(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InMenu;                               // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A8C[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase) == 0x000010, "Wrong alignment on BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase");
static_assert(sizeof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase) == 0x0002B0, "Wrong size on BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, EntryPoint) == 0x000000, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, CallFunc_ElevatorMoveEnd_Dummy) == 0x000004, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::CallFunc_ElevatorMoveEnd_Dummy' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, CallFunc_FinishSpawningActor_ReturnValue) == 0x000048, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_Event_DeltaSeconds) == 0x000050, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_ComponentBoundEvent_OverlappedComponent_3) == 0x000058, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_ComponentBoundEvent_OverlappedComponent_3' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_ComponentBoundEvent_OtherActor_3) == 0x000060, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_ComponentBoundEvent_OtherActor_3' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_ComponentBoundEvent_OtherComp_3) == 0x000068, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_ComponentBoundEvent_OtherComp_3' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_ComponentBoundEvent_OtherBodyIndex_3) == 0x000070, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_ComponentBoundEvent_OtherBodyIndex_3' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_ComponentBoundEvent_OverlappedComponent_2) == 0x000078, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_ComponentBoundEvent_OverlappedComponent_2' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_ComponentBoundEvent_OtherActor_2) == 0x000080, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_ComponentBoundEvent_OtherActor_2' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_ComponentBoundEvent_OtherComp_2) == 0x000088, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_ComponentBoundEvent_OtherComp_2' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_ComponentBoundEvent_OtherBodyIndex_2) == 0x000090, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_ComponentBoundEvent_OtherBodyIndex_2' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_ComponentBoundEvent_bFromSweep_2) == 0x000094, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_ComponentBoundEvent_bFromSweep_2' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_ComponentBoundEvent_SweepResult_2) == 0x000098, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_ComponentBoundEvent_SweepResult_2' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000120, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000128, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000130, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000138, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_ComponentBoundEvent_bFromSweep_1) == 0x00013C, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_ComponentBoundEvent_bFromSweep_1' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_ComponentBoundEvent_SweepResult_1) == 0x000140, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_ComponentBoundEvent_SweepResult_1' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, CallFunc_GetPlayerPawn_ReturnValue) == 0x0001C8, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, CallFunc_ElevatorMoveStart_Dummy) == 0x0001D0, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::CallFunc_ElevatorMoveStart_Dummy' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001D1, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001D2, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, CallFunc_ElevatorMoveStart_Dummy_1) == 0x0001D3, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::CallFunc_ElevatorMoveStart_Dummy_1' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001D4, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_Event_Floor) == 0x0001D8, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_Event_Floor' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, CallFunc_IsPlaying_ReturnValue) == 0x0001DC, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_Event_EndPlayReason) == 0x0001DD, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, CallFunc_IsValid_ReturnValue) == 0x0001DE, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, CallFunc_CanPlayCutScene_OK) == 0x0001DF, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::CallFunc_CanPlayCutScene_OK' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0001E0, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_ComponentBoundEvent_OtherActor) == 0x0001E8, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_ComponentBoundEvent_OtherComp) == 0x0001F0, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0001F8, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_ComponentBoundEvent_bFromSweep) == 0x0001FC, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_ComponentBoundEvent_SweepResult) == 0x000200, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, CallFunc_GetObjectName_ReturnValue) == 0x000288, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, K2Node_Event_InMenu) == 0x000298, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::K2Node_Event_InMenu' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase, CallFunc_Concat_StrStr_ReturnValue) == 0x0002A0, "Member 'BP_ElevatorBase_C_ExecuteUbergraph_BP_ElevatorBase::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BP_ElevatorBase.BP_ElevatorBase_C.SetupMenu
// 0x0001 (0x0001 - 0x0000)
struct BP_ElevatorBase_C_SetupMenu final
{
public:
	bool                                          InMenu;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ElevatorBase_C_SetupMenu) == 0x000001, "Wrong alignment on BP_ElevatorBase_C_SetupMenu");
static_assert(sizeof(BP_ElevatorBase_C_SetupMenu) == 0x000001, "Wrong size on BP_ElevatorBase_C_SetupMenu");
static_assert(offsetof(BP_ElevatorBase_C_SetupMenu, InMenu) == 0x000000, "Member 'BP_ElevatorBase_C_SetupMenu::InMenu' has a wrong offset!");

// Function BP_ElevatorBase.BP_ElevatorBase_C.BndEvt__PsyInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_ElevatorBase_C_BndEvt__PsyInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A8D[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ElevatorBase_C_BndEvt__PsyInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_ElevatorBase_C_BndEvt__PsyInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_ElevatorBase_C_BndEvt__PsyInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_ElevatorBase_C_BndEvt__PsyInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_ElevatorBase_C_BndEvt__PsyInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_ElevatorBase_C_BndEvt__PsyInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_BndEvt__PsyInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_ElevatorBase_C_BndEvt__PsyInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_BndEvt__PsyInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_ElevatorBase_C_BndEvt__PsyInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_BndEvt__PsyInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_ElevatorBase_C_BndEvt__PsyInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_BndEvt__PsyInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_ElevatorBase_C_BndEvt__PsyInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_BndEvt__PsyInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_ElevatorBase_C_BndEvt__PsyInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_ElevatorBase.BP_ElevatorBase_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_ElevatorBase_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ElevatorBase_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_ElevatorBase_C_ReceiveEndPlay");
static_assert(sizeof(BP_ElevatorBase_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_ElevatorBase_C_ReceiveEndPlay");
static_assert(offsetof(BP_ElevatorBase_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_ElevatorBase_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_ElevatorBase.BP_ElevatorBase_C.EV_MoveFloorForce
// 0x0004 (0x0004 - 0x0000)
struct BP_ElevatorBase_C_EV_MoveFloorForce final
{
public:
	int32                                         Floor;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ElevatorBase_C_EV_MoveFloorForce) == 0x000004, "Wrong alignment on BP_ElevatorBase_C_EV_MoveFloorForce");
static_assert(sizeof(BP_ElevatorBase_C_EV_MoveFloorForce) == 0x000004, "Wrong size on BP_ElevatorBase_C_EV_MoveFloorForce");
static_assert(offsetof(BP_ElevatorBase_C_EV_MoveFloorForce, Floor) == 0x000000, "Member 'BP_ElevatorBase_C_EV_MoveFloorForce::Floor' has a wrong offset!");

// Function BP_ElevatorBase.BP_ElevatorBase_C.BndEvt__ElevatorInnerInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_ElevatorBase_C_BndEvt__ElevatorInnerInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A8E[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ElevatorBase_C_BndEvt__ElevatorInnerInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_ElevatorBase_C_BndEvt__ElevatorInnerInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_ElevatorBase_C_BndEvt__ElevatorInnerInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_ElevatorBase_C_BndEvt__ElevatorInnerInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_ElevatorBase_C_BndEvt__ElevatorInnerInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_ElevatorBase_C_BndEvt__ElevatorInnerInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_BndEvt__ElevatorInnerInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_ElevatorBase_C_BndEvt__ElevatorInnerInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_BndEvt__ElevatorInnerInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_ElevatorBase_C_BndEvt__ElevatorInnerInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_BndEvt__ElevatorInnerInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_ElevatorBase_C_BndEvt__ElevatorInnerInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_BndEvt__ElevatorInnerInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_ElevatorBase_C_BndEvt__ElevatorInnerInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_BndEvt__ElevatorInnerInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_ElevatorBase_C_BndEvt__ElevatorInnerInsideCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_ElevatorBase.BP_ElevatorBase_C.BndEvt__ElevatorMoveStartCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_ElevatorBase_C_BndEvt__ElevatorMoveStartCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A8F[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ElevatorBase_C_BndEvt__ElevatorMoveStartCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_ElevatorBase_C_BndEvt__ElevatorMoveStartCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_ElevatorBase_C_BndEvt__ElevatorMoveStartCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_ElevatorBase_C_BndEvt__ElevatorMoveStartCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_ElevatorBase_C_BndEvt__ElevatorMoveStartCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_ElevatorBase_C_BndEvt__ElevatorMoveStartCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_BndEvt__ElevatorMoveStartCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_ElevatorBase_C_BndEvt__ElevatorMoveStartCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_BndEvt__ElevatorMoveStartCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_ElevatorBase_C_BndEvt__ElevatorMoveStartCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_BndEvt__ElevatorMoveStartCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_ElevatorBase_C_BndEvt__ElevatorMoveStartCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_BndEvt__ElevatorMoveStartCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_ElevatorBase_C_BndEvt__ElevatorMoveStartCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_BndEvt__ElevatorMoveStartCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_ElevatorBase_C_BndEvt__ElevatorMoveStartCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_ElevatorBase.BP_ElevatorBase_C.BndEvt__MoveStartCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_ElevatorBase_C_BndEvt__MoveStartCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ElevatorBase_C_BndEvt__MoveStartCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_ElevatorBase_C_BndEvt__MoveStartCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_ElevatorBase_C_BndEvt__MoveStartCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_ElevatorBase_C_BndEvt__MoveStartCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_ElevatorBase_C_BndEvt__MoveStartCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_ElevatorBase_C_BndEvt__MoveStartCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_BndEvt__MoveStartCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_ElevatorBase_C_BndEvt__MoveStartCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_BndEvt__MoveStartCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_ElevatorBase_C_BndEvt__MoveStartCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_BndEvt__MoveStartCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_ElevatorBase_C_BndEvt__MoveStartCollision_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_ElevatorBase.BP_ElevatorBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ElevatorBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ElevatorBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ElevatorBase_C_ReceiveTick");
static_assert(sizeof(BP_ElevatorBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_ElevatorBase_C_ReceiveTick");
static_assert(offsetof(BP_ElevatorBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ElevatorBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ElevatorBase.BP_ElevatorBase_C.ElevatorMove
// 0x03A0 (0x03A0 - 0x0000)
struct BP_ElevatorBase_C_ElevatorMove final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LDeltaMove;                                        // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          ElevatorMoveSound;                                 // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          LMoveSound;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OldActorLocation;                                  // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaAlpha;                                        // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MovePos;                                           // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CalcElevatorMove;                                  // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A90[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x00B8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A91[0x3];                                     // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A92[0x3];                                     // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0158(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsPlaying_ReturnValue_1;                  // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A93[0x6];                                     // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAtomComponentBase*                   CallFunc_SpawnSoundAtLocationRS_ReturnValue;       // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A94[0x3];                                     // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_7;        // 0x0230(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_8;        // 0x023C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0248(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ElevatorMoveEnd_Dummy;                    // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A95[0x3];                                     // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VEase_ReturnValue;                        // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x0264(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A96[0x3];                                     // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_2;     // 0x02F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_2;        // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_2;    // 0x037A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A97[0x1];                                     // 0x037B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VEase_ReturnValue_1;                      // 0x0388(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ElevatorBase_C_ElevatorMove) == 0x000008, "Wrong alignment on BP_ElevatorBase_C_ElevatorMove");
static_assert(sizeof(BP_ElevatorBase_C_ElevatorMove) == 0x0003A0, "Wrong size on BP_ElevatorBase_C_ElevatorMove");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, DeltaSeconds) == 0x000000, "Member 'BP_ElevatorBase_C_ElevatorMove::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, LDeltaMove) == 0x000004, "Member 'BP_ElevatorBase_C_ElevatorMove::LDeltaMove' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, ElevatorMoveSound) == 0x000010, "Member 'BP_ElevatorBase_C_ElevatorMove::ElevatorMoveSound' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, LMoveSound) == 0x000018, "Member 'BP_ElevatorBase_C_ElevatorMove::LMoveSound' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, OldActorLocation) == 0x000020, "Member 'BP_ElevatorBase_C_ElevatorMove::OldActorLocation' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, DeltaAlpha) == 0x00002C, "Member 'BP_ElevatorBase_C_ElevatorMove::DeltaAlpha' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, MovePos) == 0x000030, "Member 'BP_ElevatorBase_C_ElevatorMove::MovePos' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CalcElevatorMove) == 0x00003C, "Member 'BP_ElevatorBase_C_ElevatorMove::CalcElevatorMove' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_IsPlaying_ReturnValue) == 0x000040, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_Not_PreBool_ReturnValue) == 0x000041, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_GetSocketLocation_ReturnValue) == 0x000044, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00005C, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000060, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_VSize_ReturnValue) == 0x00006C, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000070, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00007C, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000088, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000094, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x0000A0, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_Add_VectorVector_ReturnValue) == 0x0000AC, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0000B8, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000140, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000144, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000148, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x00014C, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000158, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_IsPlaying_ReturnValue_1) == 0x0001E0, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_IsPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_IsValid_ReturnValue) == 0x0001E1, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_SpawnSoundAtLocationRS_ReturnValue) == 0x0001E8, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_SpawnSoundAtLocationRS_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_K2_GetActorLocation_ReturnValue_6) == 0x0001F0, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_K2_GetActorLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0001FC, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000208, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_Add_FloatFloat_ReturnValue) == 0x000214, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000218, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x00021C, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ElevatorBase_C_ElevatorMove, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000228, "Member 'BP_ElevatorBase_C_ElevatorMove::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
