#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventPPAlphaMovie

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CriWareRuntime_structs.hpp"


namespace SDK::Params
{

// Function BP_EventPPAlphaMovie.BP_EventPPAlphaMovie_C.ExecuteUbergraph_BP_EventPPAlphaMovie
// 0x0080 (0x0080 - 0x0000)
struct BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsManaPlayerAvailable_ReturnValue;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_prepareAlphaMovie_succeeded;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50A0[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EManaComponentStatus Status, class UManaComponent* ManaComponent)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsManaPlayerAvailable_ReturnValue_1;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EManaComponentStatus                          CallFunc_GetStatus_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsManaPlayerAvailable_ReturnValue_2;      // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EManaComponentStatus                          CallFunc_GetStatus_ReturnValue_1;                  // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_applyMovieSource_result;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_prepareAlphaMovie_succeeded_1;            // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50A1[0x1];                                     // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_frameNumber;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EManaComponentStatus                          CallFunc_GetStatus_ReturnValue_2;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsManaPlayerAvailable_ReturnValue_3;      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsManaPlayerAvailable_ReturnValue_4;      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50A2[0x2];                                     // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MovieManager_C*                     CallFunc_GetMovieManager_AsBP_Movie_Manager;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EManaComponentStatus                          CallFunc_GetStatus_ReturnValue_3;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsManaPlayerAvailable_ReturnValue_5;      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EManaComponentStatus                          K2Node_CustomEvent_Status;                         // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50A3[0x2];                                     // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UManaComponent*                         K2Node_CustomEvent_ManaComponent;                  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsManaPlayerAvailable_ReturnValue_6;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50A4[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UManaTexture*                           CallFunc_GetManaTextureNative_ReturnValue;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsManaPlayerAvailable_ReturnValue_7;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_prepareAlphaMovie_succeeded_2;            // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_prepareAlphaMovie_succeeded_3;            // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_applyMovieSource_result_1;                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MovieManagerLoadedMovie_result;           // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie) == 0x000008, "Wrong alignment on BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie");
static_assert(sizeof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie) == 0x000080, "Wrong size on BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, EntryPoint) == 0x000000, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_IsManaPlayerAvailable_ReturnValue) == 0x000004, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_IsManaPlayerAvailable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_prepareAlphaMovie_succeeded) == 0x000005, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_prepareAlphaMovie_succeeded' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_IsManaPlayerAvailable_ReturnValue_1) == 0x000018, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_IsManaPlayerAvailable_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_GetStatus_ReturnValue) == 0x00001A, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_GetStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001B, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00001C, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_IsManaPlayerAvailable_ReturnValue_2) == 0x00001D, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_IsManaPlayerAvailable_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_GetStatus_ReturnValue_1) == 0x00001E, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_GetStatus_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00001F, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_Not_PreBool_ReturnValue_1) == 0x000020, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_BooleanOR_ReturnValue) == 0x000021, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_Not_PreBool_ReturnValue_2) == 0x000022, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_BooleanOR_ReturnValue_1) == 0x000023, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_GetEventManager_EventManager) == 0x000028, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_applyMovieSource_result) == 0x000031, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_applyMovieSource_result' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_prepareAlphaMovie_succeeded_1) == 0x000032, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_prepareAlphaMovie_succeeded_1' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000034, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_FClamp_ReturnValue) == 0x000038, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, K2Node_CustomEvent_frameNumber) == 0x00003C, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::K2Node_CustomEvent_frameNumber' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_GetStatus_ReturnValue_2) == 0x000040, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_GetStatus_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_IsManaPlayerAvailable_ReturnValue_3) == 0x000041, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_IsManaPlayerAvailable_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000042, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_BooleanOR_ReturnValue_2) == 0x000043, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_IsManaPlayerAvailable_ReturnValue_4) == 0x000044, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_IsManaPlayerAvailable_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, K2Node_Event_EndPlayReason) == 0x000045, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_GetMovieManager_AsBP_Movie_Manager) == 0x000048, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_GetMovieManager_AsBP_Movie_Manager' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_GetStatus_ReturnValue_3) == 0x000050, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_GetStatus_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_IsValid_ReturnValue_1) == 0x000051, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000052, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_BooleanOR_ReturnValue_3) == 0x000053, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_IsManaPlayerAvailable_ReturnValue_5) == 0x000054, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_IsManaPlayerAvailable_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, K2Node_CustomEvent_Status) == 0x000055, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::K2Node_CustomEvent_Status' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, K2Node_CustomEvent_ManaComponent) == 0x000058, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::K2Node_CustomEvent_ManaComponent' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_IsManaPlayerAvailable_ReturnValue_6) == 0x000060, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_IsManaPlayerAvailable_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, K2Node_SwitchEnum_CmpSuccess) == 0x000061, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_GetManaTextureNative_ReturnValue) == 0x000068, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_GetManaTextureNative_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_IsManaPlayerAvailable_ReturnValue_7) == 0x000070, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_IsManaPlayerAvailable_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_prepareAlphaMovie_succeeded_2) == 0x000071, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_prepareAlphaMovie_succeeded_2' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_IsValid_ReturnValue_2) == 0x000072, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_prepareAlphaMovie_succeeded_3) == 0x000073, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_prepareAlphaMovie_succeeded_3' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_applyMovieSource_result_1) == 0x000074, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_applyMovieSource_result_1' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_MovieManagerLoadedMovie_result) == 0x000075, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_MovieManagerLoadedMovie_result' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_IsValid_ReturnValue_3) == 0x000076, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_Not_PreBool_ReturnValue_3) == 0x000077, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie, CallFunc_BooleanOR_ReturnValue_4) == 0x000078, "Member 'BP_EventPPAlphaMovie_C_ExecuteUbergraph_BP_EventPPAlphaMovie::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");

// Function BP_EventPPAlphaMovie.BP_EventPPAlphaMovie_C.OnStatusChanged(manaComp)
// 0x0010 (0x0010 - 0x0000)
struct BP_EventPPAlphaMovie_C_OnStatusChanged_manaComp_ final
{
public:
	EManaComponentStatus                          Status;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50A5[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UManaComponent*                         ManaComponent;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPPAlphaMovie_C_OnStatusChanged_manaComp_) == 0x000008, "Wrong alignment on BP_EventPPAlphaMovie_C_OnStatusChanged_manaComp_");
static_assert(sizeof(BP_EventPPAlphaMovie_C_OnStatusChanged_manaComp_) == 0x000010, "Wrong size on BP_EventPPAlphaMovie_C_OnStatusChanged_manaComp_");
static_assert(offsetof(BP_EventPPAlphaMovie_C_OnStatusChanged_manaComp_, Status) == 0x000000, "Member 'BP_EventPPAlphaMovie_C_OnStatusChanged_manaComp_::Status' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_OnStatusChanged_manaComp_, ManaComponent) == 0x000008, "Member 'BP_EventPPAlphaMovie_C_OnStatusChanged_manaComp_::ManaComponent' has a wrong offset!");

// Function BP_EventPPAlphaMovie.BP_EventPPAlphaMovie_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_EventPPAlphaMovie_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPPAlphaMovie_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_EventPPAlphaMovie_C_ReceiveEndPlay");
static_assert(sizeof(BP_EventPPAlphaMovie_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_EventPPAlphaMovie_C_ReceiveEndPlay");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_EventPPAlphaMovie_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_EventPPAlphaMovie.BP_EventPPAlphaMovie_C.Seek
// 0x0004 (0x0004 - 0x0000)
struct BP_EventPPAlphaMovie_C_Seek final
{
public:
	int32                                         FrameNumber;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPPAlphaMovie_C_Seek) == 0x000004, "Wrong alignment on BP_EventPPAlphaMovie_C_Seek");
static_assert(sizeof(BP_EventPPAlphaMovie_C_Seek) == 0x000004, "Wrong size on BP_EventPPAlphaMovie_C_Seek");
static_assert(offsetof(BP_EventPPAlphaMovie_C_Seek, FrameNumber) == 0x000000, "Member 'BP_EventPPAlphaMovie_C_Seek::FrameNumber' has a wrong offset!");

// Function BP_EventPPAlphaMovie.BP_EventPPAlphaMovie_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_EventPPAlphaMovie_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPPAlphaMovie_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_EventPPAlphaMovie_C_ReceiveTick");
static_assert(sizeof(BP_EventPPAlphaMovie_C_ReceiveTick) == 0x000004, "Wrong size on BP_EventPPAlphaMovie_C_ReceiveTick");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_EventPPAlphaMovie_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_EventPPAlphaMovie.BP_EventPPAlphaMovie_C.playAlphaMovie
// 0x0004 (0x0004 - 0x0000)
struct BP_EventPPAlphaMovie_C_PlayAlphaMovie final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsManaPlayerAvailable_ReturnValue;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventPPAlphaMovie_C_PlayAlphaMovie) == 0x000001, "Wrong alignment on BP_EventPPAlphaMovie_C_PlayAlphaMovie");
static_assert(sizeof(BP_EventPPAlphaMovie_C_PlayAlphaMovie) == 0x000004, "Wrong size on BP_EventPPAlphaMovie_C_PlayAlphaMovie");
static_assert(offsetof(BP_EventPPAlphaMovie_C_PlayAlphaMovie, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_EventPPAlphaMovie_C_PlayAlphaMovie::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_PlayAlphaMovie, CallFunc_IsManaPlayerAvailable_ReturnValue) == 0x000001, "Member 'BP_EventPPAlphaMovie_C_PlayAlphaMovie::CallFunc_IsManaPlayerAvailable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_PlayAlphaMovie, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000002, "Member 'BP_EventPPAlphaMovie_C_PlayAlphaMovie::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_PlayAlphaMovie, CallFunc_IsValid_ReturnValue_1) == 0x000003, "Member 'BP_EventPPAlphaMovie_C_PlayAlphaMovie::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_EventPPAlphaMovie.BP_EventPPAlphaMovie_C.applyMovieSource
// 0x0028 (0x0028 - 0x0000)
struct BP_EventPPAlphaMovie_C_ApplyMovieSource final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50A6[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50A7[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UManaTexture*                           CallFunc_GetTexture_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPPAlphaMovie_C_ApplyMovieSource) == 0x000008, "Wrong alignment on BP_EventPPAlphaMovie_C_ApplyMovieSource");
static_assert(sizeof(BP_EventPPAlphaMovie_C_ApplyMovieSource) == 0x000028, "Wrong size on BP_EventPPAlphaMovie_C_ApplyMovieSource");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ApplyMovieSource, Result) == 0x000000, "Member 'BP_EventPPAlphaMovie_C_ApplyMovieSource::Result' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ApplyMovieSource, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_EventPPAlphaMovie_C_ApplyMovieSource::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ApplyMovieSource, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000010, "Member 'BP_EventPPAlphaMovie_C_ApplyMovieSource::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ApplyMovieSource, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_EventPPAlphaMovie_C_ApplyMovieSource::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_ApplyMovieSource, CallFunc_GetTexture_ReturnValue) == 0x000020, "Member 'BP_EventPPAlphaMovie_C_ApplyMovieSource::CallFunc_GetTexture_ReturnValue' has a wrong offset!");

// Function BP_EventPPAlphaMovie.BP_EventPPAlphaMovie_C.SetMovieSource
// 0x0008 (0x0008 - 0x0000)
struct BP_EventPPAlphaMovie_C_SetMovieSource final
{
public:
	class UManaSource*                            NewMovieSource;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPPAlphaMovie_C_SetMovieSource) == 0x000008, "Wrong alignment on BP_EventPPAlphaMovie_C_SetMovieSource");
static_assert(sizeof(BP_EventPPAlphaMovie_C_SetMovieSource) == 0x000008, "Wrong size on BP_EventPPAlphaMovie_C_SetMovieSource");
static_assert(offsetof(BP_EventPPAlphaMovie_C_SetMovieSource, NewMovieSource) == 0x000000, "Member 'BP_EventPPAlphaMovie_C_SetMovieSource::NewMovieSource' has a wrong offset!");

// Function BP_EventPPAlphaMovie.BP_EventPPAlphaMovie_C.prepareAlphaMovie
// 0x0002 (0x0002 - 0x0000)
struct BP_EventPPAlphaMovie_C_PrepareAlphaMovie final
{
public:
	bool                                          Succeeded;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsManaPlayerAvailable_ReturnValue;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventPPAlphaMovie_C_PrepareAlphaMovie) == 0x000001, "Wrong alignment on BP_EventPPAlphaMovie_C_PrepareAlphaMovie");
static_assert(sizeof(BP_EventPPAlphaMovie_C_PrepareAlphaMovie) == 0x000002, "Wrong size on BP_EventPPAlphaMovie_C_PrepareAlphaMovie");
static_assert(offsetof(BP_EventPPAlphaMovie_C_PrepareAlphaMovie, Succeeded) == 0x000000, "Member 'BP_EventPPAlphaMovie_C_PrepareAlphaMovie::Succeeded' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_PrepareAlphaMovie, CallFunc_IsManaPlayerAvailable_ReturnValue) == 0x000001, "Member 'BP_EventPPAlphaMovie_C_PrepareAlphaMovie::CallFunc_IsManaPlayerAvailable_ReturnValue' has a wrong offset!");

// Function BP_EventPPAlphaMovie.BP_EventPPAlphaMovie_C.seekAlphaMovie
// 0x0008 (0x0008 - 0x0000)
struct BP_EventPPAlphaMovie_C_SeekAlphaMovie final
{
public:
	int32                                         SeekFrameNumber;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsManaPlayerAvailable_ReturnValue;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventPPAlphaMovie_C_SeekAlphaMovie) == 0x000004, "Wrong alignment on BP_EventPPAlphaMovie_C_SeekAlphaMovie");
static_assert(sizeof(BP_EventPPAlphaMovie_C_SeekAlphaMovie) == 0x000008, "Wrong size on BP_EventPPAlphaMovie_C_SeekAlphaMovie");
static_assert(offsetof(BP_EventPPAlphaMovie_C_SeekAlphaMovie, SeekFrameNumber) == 0x000000, "Member 'BP_EventPPAlphaMovie_C_SeekAlphaMovie::SeekFrameNumber' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_SeekAlphaMovie, CallFunc_IsManaPlayerAvailable_ReturnValue) == 0x000004, "Member 'BP_EventPPAlphaMovie_C_SeekAlphaMovie::CallFunc_IsManaPlayerAvailable_ReturnValue' has a wrong offset!");

// Function BP_EventPPAlphaMovie.BP_EventPPAlphaMovie_C.LoadMovieFromPath
// 0x0028 (0x0028 - 0x0000)
struct BP_EventPPAlphaMovie_C_LoadMovieFromPath final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadObjectGeneric_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManaTexture*                           K2Node_DynamicCast_AsMana_Texture;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventPPAlphaMovie_C_LoadMovieFromPath) == 0x000008, "Wrong alignment on BP_EventPPAlphaMovie_C_LoadMovieFromPath");
static_assert(sizeof(BP_EventPPAlphaMovie_C_LoadMovieFromPath) == 0x000028, "Wrong size on BP_EventPPAlphaMovie_C_LoadMovieFromPath");
static_assert(offsetof(BP_EventPPAlphaMovie_C_LoadMovieFromPath, Path) == 0x000000, "Member 'BP_EventPPAlphaMovie_C_LoadMovieFromPath::Path' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_LoadMovieFromPath, CallFunc_LoadObjectGeneric_ReturnValue) == 0x000010, "Member 'BP_EventPPAlphaMovie_C_LoadMovieFromPath::CallFunc_LoadObjectGeneric_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_LoadMovieFromPath, K2Node_DynamicCast_AsMana_Texture) == 0x000018, "Member 'BP_EventPPAlphaMovie_C_LoadMovieFromPath::K2Node_DynamicCast_AsMana_Texture' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_LoadMovieFromPath, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_EventPPAlphaMovie_C_LoadMovieFromPath::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_EventPPAlphaMovie.BP_EventPPAlphaMovie_C.MovieManagerHasMovie
// 0x0018 (0x0018 - 0x0000)
struct BP_EventPPAlphaMovie_C_MovieManagerHasMovie final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50A8[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UManaTexture*                           CallFunc_GetManaTextureNative_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventPPAlphaMovie_C_MovieManagerHasMovie) == 0x000008, "Wrong alignment on BP_EventPPAlphaMovie_C_MovieManagerHasMovie");
static_assert(sizeof(BP_EventPPAlphaMovie_C_MovieManagerHasMovie) == 0x000018, "Wrong size on BP_EventPPAlphaMovie_C_MovieManagerHasMovie");
static_assert(offsetof(BP_EventPPAlphaMovie_C_MovieManagerHasMovie, Result) == 0x000000, "Member 'BP_EventPPAlphaMovie_C_MovieManagerHasMovie::Result' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_MovieManagerHasMovie, CallFunc_GetManaTextureNative_ReturnValue) == 0x000008, "Member 'BP_EventPPAlphaMovie_C_MovieManagerHasMovie::CallFunc_GetManaTextureNative_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_MovieManagerHasMovie, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_EventPPAlphaMovie_C_MovieManagerHasMovie::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_MovieManagerHasMovie, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'BP_EventPPAlphaMovie_C_MovieManagerHasMovie::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_EventPPAlphaMovie.BP_EventPPAlphaMovie_C.MovieManagerLoadedMovie
// 0x0004 (0x0004 - 0x0000)
struct BP_EventPPAlphaMovie_C_MovieManagerLoadedMovie final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReady_ReturnValue;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventPPAlphaMovie_C_MovieManagerLoadedMovie) == 0x000001, "Wrong alignment on BP_EventPPAlphaMovie_C_MovieManagerLoadedMovie");
static_assert(sizeof(BP_EventPPAlphaMovie_C_MovieManagerLoadedMovie) == 0x000004, "Wrong size on BP_EventPPAlphaMovie_C_MovieManagerLoadedMovie");
static_assert(offsetof(BP_EventPPAlphaMovie_C_MovieManagerLoadedMovie, Result) == 0x000000, "Member 'BP_EventPPAlphaMovie_C_MovieManagerLoadedMovie::Result' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_MovieManagerLoadedMovie, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_EventPPAlphaMovie_C_MovieManagerLoadedMovie::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_MovieManagerLoadedMovie, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'BP_EventPPAlphaMovie_C_MovieManagerLoadedMovie::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_MovieManagerLoadedMovie, CallFunc_IsReady_ReturnValue) == 0x000003, "Member 'BP_EventPPAlphaMovie_C_MovieManagerLoadedMovie::CallFunc_IsReady_ReturnValue' has a wrong offset!");

// Function BP_EventPPAlphaMovie.BP_EventPPAlphaMovie_C.EditorStopMovie
// 0x0001 (0x0001 - 0x0000)
struct BP_EventPPAlphaMovie_C_EditorStopMovie final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventPPAlphaMovie_C_EditorStopMovie) == 0x000001, "Wrong alignment on BP_EventPPAlphaMovie_C_EditorStopMovie");
static_assert(sizeof(BP_EventPPAlphaMovie_C_EditorStopMovie) == 0x000001, "Wrong size on BP_EventPPAlphaMovie_C_EditorStopMovie");
static_assert(offsetof(BP_EventPPAlphaMovie_C_EditorStopMovie, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_EventPPAlphaMovie_C_EditorStopMovie::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_EventPPAlphaMovie.BP_EventPPAlphaMovie_C.StopMovie
// 0x0002 (0x0002 - 0x0000)
struct BP_EventPPAlphaMovie_C_StopMovie final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventPPAlphaMovie_C_StopMovie) == 0x000001, "Wrong alignment on BP_EventPPAlphaMovie_C_StopMovie");
static_assert(sizeof(BP_EventPPAlphaMovie_C_StopMovie) == 0x000002, "Wrong size on BP_EventPPAlphaMovie_C_StopMovie");
static_assert(offsetof(BP_EventPPAlphaMovie_C_StopMovie, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_EventPPAlphaMovie_C_StopMovie::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPPAlphaMovie_C_StopMovie, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'BP_EventPPAlphaMovie_C_StopMovie::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

