#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventPPFuturePrediction

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EventPPFuturePrediction.BP_EventPPFuturePrediction_C.ExecuteUbergraph_BP_EventPPFuturePrediction
// 0x0018 (0x0018 - 0x0000)
struct BP_EventPPFuturePrediction_C_ExecuteUbergraph_BP_EventPPFuturePrediction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95EC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPPFuturePrediction_C_ExecuteUbergraph_BP_EventPPFuturePrediction) == 0x000008, "Wrong alignment on BP_EventPPFuturePrediction_C_ExecuteUbergraph_BP_EventPPFuturePrediction");
static_assert(sizeof(BP_EventPPFuturePrediction_C_ExecuteUbergraph_BP_EventPPFuturePrediction) == 0x000018, "Wrong size on BP_EventPPFuturePrediction_C_ExecuteUbergraph_BP_EventPPFuturePrediction");
static_assert(offsetof(BP_EventPPFuturePrediction_C_ExecuteUbergraph_BP_EventPPFuturePrediction, EntryPoint) == 0x000000, "Member 'BP_EventPPFuturePrediction_C_ExecuteUbergraph_BP_EventPPFuturePrediction::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EventPPFuturePrediction_C_ExecuteUbergraph_BP_EventPPFuturePrediction, CallFunc_GetEventManager_EventManager) == 0x000008, "Member 'BP_EventPPFuturePrediction_C_ExecuteUbergraph_BP_EventPPFuturePrediction::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_EventPPFuturePrediction_C_ExecuteUbergraph_BP_EventPPFuturePrediction, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_EventPPFuturePrediction_C_ExecuteUbergraph_BP_EventPPFuturePrediction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPPFuturePrediction_C_ExecuteUbergraph_BP_EventPPFuturePrediction, K2Node_Event_EndPlayReason) == 0x000011, "Member 'BP_EventPPFuturePrediction_C_ExecuteUbergraph_BP_EventPPFuturePrediction::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BP_EventPPFuturePrediction.BP_EventPPFuturePrediction_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_EventPPFuturePrediction_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPPFuturePrediction_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_EventPPFuturePrediction_C_ReceiveEndPlay");
static_assert(sizeof(BP_EventPPFuturePrediction_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_EventPPFuturePrediction_C_ReceiveEndPlay");
static_assert(offsetof(BP_EventPPFuturePrediction_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_EventPPFuturePrediction_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

