#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnemyChangeTimeDilationComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EnemyChangeTimeDilationComponent.BP_EnemyChangeTimeDilationComponent_C.ExecuteUbergraph_BP_EnemyChangeTimeDilationComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_EnemyChangeTimeDilationComponent_C_ExecuteUbergraph_BP_EnemyChangeTimeDilationComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyChangeTimeDilationComponent_C_ExecuteUbergraph_BP_EnemyChangeTimeDilationComponent) == 0x000004, "Wrong alignment on BP_EnemyChangeTimeDilationComponent_C_ExecuteUbergraph_BP_EnemyChangeTimeDilationComponent");
static_assert(sizeof(BP_EnemyChangeTimeDilationComponent_C_ExecuteUbergraph_BP_EnemyChangeTimeDilationComponent) == 0x000008, "Wrong size on BP_EnemyChangeTimeDilationComponent_C_ExecuteUbergraph_BP_EnemyChangeTimeDilationComponent");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_ExecuteUbergraph_BP_EnemyChangeTimeDilationComponent, EntryPoint) == 0x000000, "Member 'BP_EnemyChangeTimeDilationComponent_C_ExecuteUbergraph_BP_EnemyChangeTimeDilationComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_ExecuteUbergraph_BP_EnemyChangeTimeDilationComponent, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_EnemyChangeTimeDilationComponent_C_ExecuteUbergraph_BP_EnemyChangeTimeDilationComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_EnemyChangeTimeDilationComponent.BP_EnemyChangeTimeDilationComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_EnemyChangeTimeDilationComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyChangeTimeDilationComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_EnemyChangeTimeDilationComponent_C_ReceiveTick");
static_assert(sizeof(BP_EnemyChangeTimeDilationComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_EnemyChangeTimeDilationComponent_C_ReceiveTick");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_EnemyChangeTimeDilationComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_EnemyChangeTimeDilationComponent.BP_EnemyChangeTimeDilationComponent_C.Start
// 0x0040 (0x0040 - 0x0000)
struct BP_EnemyChangeTimeDilationComponent_C_Start final
{
public:
	float                                         Param_LearpTime;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEasingFunc                                   Param_EaseFunc;                                    // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5803[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Param_EaseBlendExp;                                // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Steps;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsChangeTimeDilation_bChange;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerAccelerating_bAccelerating;       // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5804[0x5];                                     // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5805[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHitStopComponent*                      CallFunc_GetHitStopComponent_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyChangeTimeDilationComponent_C_Start) == 0x000008, "Wrong alignment on BP_EnemyChangeTimeDilationComponent_C_Start");
static_assert(sizeof(BP_EnemyChangeTimeDilationComponent_C_Start) == 0x000040, "Wrong size on BP_EnemyChangeTimeDilationComponent_C_Start");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Start, Param_LearpTime) == 0x000000, "Member 'BP_EnemyChangeTimeDilationComponent_C_Start::Param_LearpTime' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Start, Param_EaseFunc) == 0x000004, "Member 'BP_EnemyChangeTimeDilationComponent_C_Start::Param_EaseFunc' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Start, Param_EaseBlendExp) == 0x000008, "Member 'BP_EnemyChangeTimeDilationComponent_C_Start::Param_EaseBlendExp' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Start, Param_Steps) == 0x00000C, "Member 'BP_EnemyChangeTimeDilationComponent_C_Start::Param_Steps' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Start, Animation) == 0x000010, "Member 'BP_EnemyChangeTimeDilationComponent_C_Start::Animation' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Start, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_EnemyChangeTimeDilationComponent_C_Start::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Start, CallFunc_IsChangeTimeDilation_bChange) == 0x000019, "Member 'BP_EnemyChangeTimeDilationComponent_C_Start::CallFunc_IsChangeTimeDilation_bChange' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Start, CallFunc_IsPlayerAccelerating_bAccelerating) == 0x00001A, "Member 'BP_EnemyChangeTimeDilationComponent_C_Start::CallFunc_IsPlayerAccelerating_bAccelerating' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Start, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BP_EnemyChangeTimeDilationComponent_C_Start::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Start, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'BP_EnemyChangeTimeDilationComponent_C_Start::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Start, CallFunc_GetHitStopComponent_ReturnValue) == 0x000030, "Member 'BP_EnemyChangeTimeDilationComponent_C_Start::CallFunc_GetHitStopComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Start, CallFunc_IsValid_ReturnValue_2) == 0x000038, "Member 'BP_EnemyChangeTimeDilationComponent_C_Start::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function BP_EnemyChangeTimeDilationComponent.BP_EnemyChangeTimeDilationComponent_C.Update
// 0x00A0 (0x00A0 - 0x0000)
struct BP_EnemyChangeTimeDilationComponent_C_Update final
{
public:
	float                                         DeltaSec;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LPlayerCustomTimeDilation;                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5806[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattleEnemy_C*                       K2Node_DynamicCast_AsRSBattle_Enemy;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5807[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetBaseMontage_BaseMontage;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5808[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5809[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      CallFunc_GetMainPlayer_Player;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_580A[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerAccelerating_bAccelerating;       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_580B[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_580C[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattleCharacter_C*                   K2Node_DynamicCast_AsRSBattle_Character;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_580D[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyChangeTimeDilationComponent_C_Update) == 0x000008, "Wrong alignment on BP_EnemyChangeTimeDilationComponent_C_Update");
static_assert(sizeof(BP_EnemyChangeTimeDilationComponent_C_Update) == 0x0000A0, "Wrong size on BP_EnemyChangeTimeDilationComponent_C_Update");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, DeltaSec) == 0x000000, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::DeltaSec' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, LPlayerCustomTimeDilation) == 0x000004, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::LPlayerCustomTimeDilation' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, K2Node_DynamicCast_AsRSBattle_Enemy) == 0x000018, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::K2Node_DynamicCast_AsRSBattle_Enemy' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, CallFunc_GetBaseMontage_BaseMontage) == 0x000028, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::CallFunc_GetBaseMontage_BaseMontage' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, CallFunc_IsValid_ReturnValue_2) == 0x000030, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, CallFunc_IsValid_ReturnValue_3) == 0x000031, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000032, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000033, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, CallFunc_FClamp_ReturnValue) == 0x000034, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000038, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, CallFunc_GetPlayerManager_PlayerManager) == 0x000040, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, CallFunc_IsValid_ReturnValue_4) == 0x000048, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, CallFunc_GetMainPlayer_Player) == 0x000050, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::CallFunc_GetMainPlayer_Player' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, CallFunc_IsValid_ReturnValue_5) == 0x000058, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, CallFunc_Add_FloatFloat_ReturnValue) == 0x00005C, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, CallFunc_IsPlayerAccelerating_bAccelerating) == 0x000060, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::CallFunc_IsPlayerAccelerating_bAccelerating' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, CallFunc_GetOwner_ReturnValue_1) == 0x000068, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000070, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, K2Node_DynamicCast_AsRSBattle_Character) == 0x000078, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::K2Node_DynamicCast_AsRSBattle_Character' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, CallFunc_Ease_ReturnValue) == 0x000084, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000088, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00008C, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000090, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, CallFunc_FClamp_ReturnValue_1) == 0x000094, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_Update, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000098, "Member 'BP_EnemyChangeTimeDilationComponent_C_Update::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function BP_EnemyChangeTimeDilationComponent.BP_EnemyChangeTimeDilationComponent_C.IsPlayerAccelerating
// 0x0038 (0x0038 - 0x0000)
struct BP_EnemyChangeTimeDilationComponent_C_IsPlayerAccelerating final
{
public:
	bool                                          bAccelerating;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LAccelerating;                                     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_580E[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_580F[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      CallFunc_GetMainPlayer_Player;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleCharacterInterface_C> K2Node_DynamicCast_AsBPI_Battle_Character_Interface; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAccelerating_Accelerating;             // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyChangeTimeDilationComponent_C_IsPlayerAccelerating) == 0x000008, "Wrong alignment on BP_EnemyChangeTimeDilationComponent_C_IsPlayerAccelerating");
static_assert(sizeof(BP_EnemyChangeTimeDilationComponent_C_IsPlayerAccelerating) == 0x000038, "Wrong size on BP_EnemyChangeTimeDilationComponent_C_IsPlayerAccelerating");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_IsPlayerAccelerating, bAccelerating) == 0x000000, "Member 'BP_EnemyChangeTimeDilationComponent_C_IsPlayerAccelerating::bAccelerating' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_IsPlayerAccelerating, LAccelerating) == 0x000001, "Member 'BP_EnemyChangeTimeDilationComponent_C_IsPlayerAccelerating::LAccelerating' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_IsPlayerAccelerating, CallFunc_GetPlayerManager_PlayerManager) == 0x000008, "Member 'BP_EnemyChangeTimeDilationComponent_C_IsPlayerAccelerating::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_IsPlayerAccelerating, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_EnemyChangeTimeDilationComponent_C_IsPlayerAccelerating::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_IsPlayerAccelerating, CallFunc_GetMainPlayer_Player) == 0x000018, "Member 'BP_EnemyChangeTimeDilationComponent_C_IsPlayerAccelerating::CallFunc_GetMainPlayer_Player' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_IsPlayerAccelerating, K2Node_DynamicCast_AsBPI_Battle_Character_Interface) == 0x000020, "Member 'BP_EnemyChangeTimeDilationComponent_C_IsPlayerAccelerating::K2Node_DynamicCast_AsBPI_Battle_Character_Interface' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_IsPlayerAccelerating, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_EnemyChangeTimeDilationComponent_C_IsPlayerAccelerating::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_IsPlayerAccelerating, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'BP_EnemyChangeTimeDilationComponent_C_IsPlayerAccelerating::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_IsPlayerAccelerating, CallFunc_GetAccelerating_Accelerating) == 0x000032, "Member 'BP_EnemyChangeTimeDilationComponent_C_IsPlayerAccelerating::CallFunc_GetAccelerating_Accelerating' has a wrong offset!");

// Function BP_EnemyChangeTimeDilationComponent.BP_EnemyChangeTimeDilationComponent_C.End
// 0x0020 (0x0020 - 0x0000)
struct BP_EnemyChangeTimeDilationComponent_C_End final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattleCharacter_C*                   K2Node_DynamicCast_AsRSBattle_Character;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5810[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHitStopComponent*                      CallFunc_GetHitStopComponent_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyChangeTimeDilationComponent_C_End) == 0x000008, "Wrong alignment on BP_EnemyChangeTimeDilationComponent_C_End");
static_assert(sizeof(BP_EnemyChangeTimeDilationComponent_C_End) == 0x000020, "Wrong size on BP_EnemyChangeTimeDilationComponent_C_End");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_End, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_EnemyChangeTimeDilationComponent_C_End::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_End, K2Node_DynamicCast_AsRSBattle_Character) == 0x000008, "Member 'BP_EnemyChangeTimeDilationComponent_C_End::K2Node_DynamicCast_AsRSBattle_Character' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_End, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_EnemyChangeTimeDilationComponent_C_End::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_End, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_EnemyChangeTimeDilationComponent_C_End::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_End, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_EnemyChangeTimeDilationComponent_C_End::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_End, CallFunc_GetHitStopComponent_ReturnValue) == 0x000018, "Member 'BP_EnemyChangeTimeDilationComponent_C_End::CallFunc_GetHitStopComponent_ReturnValue' has a wrong offset!");

// Function BP_EnemyChangeTimeDilationComponent.BP_EnemyChangeTimeDilationComponent_C.IsChangeTimeDilation
// 0x0001 (0x0001 - 0x0000)
struct BP_EnemyChangeTimeDilationComponent_C_IsChangeTimeDilation final
{
public:
	bool                                          bChange;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyChangeTimeDilationComponent_C_IsChangeTimeDilation) == 0x000001, "Wrong alignment on BP_EnemyChangeTimeDilationComponent_C_IsChangeTimeDilation");
static_assert(sizeof(BP_EnemyChangeTimeDilationComponent_C_IsChangeTimeDilation) == 0x000001, "Wrong size on BP_EnemyChangeTimeDilationComponent_C_IsChangeTimeDilation");
static_assert(offsetof(BP_EnemyChangeTimeDilationComponent_C_IsChangeTimeDilation, bChange) == 0x000000, "Member 'BP_EnemyChangeTimeDilationComponent_C_IsChangeTimeDilation::bChange' has a wrong offset!");

}

