#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventTypeSwitchBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EventTypeSwitchBase.BP_EventTypeSwitchBase_C
// 0x0040 (0x0270 - 0x0230)
class ABP_EventTypeSwitchBase_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          DynamicCutScene;                                   // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31C5[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     EventManager;                                      // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PostProcessManager_C*               PostProcessManager;                                // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRuntimeSequencer;                                // 0x0258(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          SetupEventUnknownIsDynamic;                        // 0x0259(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UseNoEventFlow;                                    // 0x025A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EventSceneOnly;                                    // 0x025B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          FirstSetup;                                        // 0x025C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NoCutScene;                                        // 0x025D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31C6[0x2];                                     // 0x025E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPostProcessComponent*                  NoEventPPC;                                        // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PreTickEventManager;                               // 0x0268(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_EventTypeSwitchBase(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void UpdateStaticCutScene();
	void UpdateDynamicCutScene();
	void EndPlayStaticCutScene();
	void EndPlayDynamicCutScene();
	void BeginPlayStaticCutScene();
	void BeginPlayDynamicCutScene();
	void PrivateSetupPlaySimulate();
	void ForceUpdateStaticPPS();
	void UpdateNoEventScene();
	void UpdateSimulate();
	void PrivateGetManagers();
	void BeginPlayNoEventScene();
	void EndPlayNoEventCutScene();
	void SetupNoEventPPM(TSoftObjectPtr<class UMaterialInterface> PPM, class UMaterialInstanceDynamic** Mid);
	void DestroyNoEventPPM();
	void UseNoEventPPM(class UMaterialInterface* Material, bool Enabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EventTypeSwitchBase_C">();
	}
	static class ABP_EventTypeSwitchBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EventTypeSwitchBase_C>();
	}
};
static_assert(alignof(ABP_EventTypeSwitchBase_C) == 0x000008, "Wrong alignment on ABP_EventTypeSwitchBase_C");
static_assert(sizeof(ABP_EventTypeSwitchBase_C) == 0x000270, "Wrong size on ABP_EventTypeSwitchBase_C");
static_assert(offsetof(ABP_EventTypeSwitchBase_C, UberGraphFrame) == 0x000230, "Member 'ABP_EventTypeSwitchBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EventTypeSwitchBase_C, DefaultSceneRoot) == 0x000238, "Member 'ABP_EventTypeSwitchBase_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_EventTypeSwitchBase_C, DynamicCutScene) == 0x000240, "Member 'ABP_EventTypeSwitchBase_C::DynamicCutScene' has a wrong offset!");
static_assert(offsetof(ABP_EventTypeSwitchBase_C, EventManager) == 0x000248, "Member 'ABP_EventTypeSwitchBase_C::EventManager' has a wrong offset!");
static_assert(offsetof(ABP_EventTypeSwitchBase_C, PostProcessManager) == 0x000250, "Member 'ABP_EventTypeSwitchBase_C::PostProcessManager' has a wrong offset!");
static_assert(offsetof(ABP_EventTypeSwitchBase_C, IsRuntimeSequencer) == 0x000258, "Member 'ABP_EventTypeSwitchBase_C::IsRuntimeSequencer' has a wrong offset!");
static_assert(offsetof(ABP_EventTypeSwitchBase_C, SetupEventUnknownIsDynamic) == 0x000259, "Member 'ABP_EventTypeSwitchBase_C::SetupEventUnknownIsDynamic' has a wrong offset!");
static_assert(offsetof(ABP_EventTypeSwitchBase_C, UseNoEventFlow) == 0x00025A, "Member 'ABP_EventTypeSwitchBase_C::UseNoEventFlow' has a wrong offset!");
static_assert(offsetof(ABP_EventTypeSwitchBase_C, EventSceneOnly) == 0x00025B, "Member 'ABP_EventTypeSwitchBase_C::EventSceneOnly' has a wrong offset!");
static_assert(offsetof(ABP_EventTypeSwitchBase_C, FirstSetup) == 0x00025C, "Member 'ABP_EventTypeSwitchBase_C::FirstSetup' has a wrong offset!");
static_assert(offsetof(ABP_EventTypeSwitchBase_C, NoCutScene) == 0x00025D, "Member 'ABP_EventTypeSwitchBase_C::NoCutScene' has a wrong offset!");
static_assert(offsetof(ABP_EventTypeSwitchBase_C, NoEventPPC) == 0x000260, "Member 'ABP_EventTypeSwitchBase_C::NoEventPPC' has a wrong offset!");
static_assert(offsetof(ABP_EventTypeSwitchBase_C, PreTickEventManager) == 0x000268, "Member 'ABP_EventTypeSwitchBase_C::PreTickEventManager' has a wrong offset!");

}

