#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ENPCSequencerComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MovieScene_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BP_ENPCSequencerComponent.BP_ENPCSequencerComponent_C.ExecuteUbergraph_BP_ENPCSequencerComponent
// 0x0048 (0x0048 - 0x0000)
struct BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88D8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88D9[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattleCharacter_C*                   K2Node_DynamicCast_AsRSBattle_Character;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88DA[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DelayRestartTime;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88DB[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_1;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent) == 0x000008, "Wrong alignment on BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent");
static_assert(sizeof(BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent) == 0x000048, "Wrong size on BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent");
static_assert(offsetof(BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent, EntryPoint) == 0x000000, "Member 'BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent, CallFunc_GetSequencePlayer_ReturnValue) == 0x000008, "Member 'BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent, K2Node_DynamicCast_AsRSBattle_Character) == 0x000020, "Member 'BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent::K2Node_DynamicCast_AsRSBattle_Character' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent, K2Node_CustomEvent_DelayRestartTime) == 0x00002C, "Member 'BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent::K2Node_CustomEvent_DelayRestartTime' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent, CallFunc_IsValid_ReturnValue_2) == 0x000030, "Member 'BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent, CallFunc_GetSequencePlayer_ReturnValue_1) == 0x000038, "Member 'BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent::CallFunc_GetSequencePlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent, CallFunc_IsValid_ReturnValue_3) == 0x000040, "Member 'BP_ENPCSequencerComponent_C_ExecuteUbergraph_BP_ENPCSequencerComponent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function BP_ENPCSequencerComponent.BP_ENPCSequencerComponent_C.PauseDelayRestart
// 0x0004 (0x0004 - 0x0000)
struct BP_ENPCSequencerComponent_C_PauseDelayRestart final
{
public:
	float                                         DelayRestartTime;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ENPCSequencerComponent_C_PauseDelayRestart) == 0x000004, "Wrong alignment on BP_ENPCSequencerComponent_C_PauseDelayRestart");
static_assert(sizeof(BP_ENPCSequencerComponent_C_PauseDelayRestart) == 0x000004, "Wrong size on BP_ENPCSequencerComponent_C_PauseDelayRestart");
static_assert(offsetof(BP_ENPCSequencerComponent_C_PauseDelayRestart, DelayRestartTime) == 0x000000, "Member 'BP_ENPCSequencerComponent_C_PauseDelayRestart::DelayRestartTime' has a wrong offset!");

// Function BP_ENPCSequencerComponent.BP_ENPCSequencerComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ENPCSequencerComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ENPCSequencerComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ENPCSequencerComponent_C_ReceiveTick");
static_assert(sizeof(BP_ENPCSequencerComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_ENPCSequencerComponent_C_ReceiveTick");
static_assert(offsetof(BP_ENPCSequencerComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ENPCSequencerComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ENPCSequencerComponent.BP_ENPCSequencerComponent_C.EndSequencer
// 0x02D0 (0x02D0 - 0x0000)
struct BP_ENPCSequencerComponent_C_EndSequencer final
{
public:
	int32                                         Param_SequencerIndex;                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88DC[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         L_CorrectX;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88DD[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARSCharacterBase*>               L_playerList;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      L_mainPlayer;                                      // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88DE[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EnemyManager_C*                     CallFunc_GetEnemyManager_Manager;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88DF[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      CallFunc_GetMainPlayer_Player;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88E0[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleSimulatorManager*                CallFunc_GetBattleSimulatorManager_BattleSimulatorManager; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88E1[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IRSGameModeBPInterface_C> K2Node_DynamicCast_AsRSGame_Mode_BPInterface;      // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88E2[0x6];                                     // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_GetMainPlayerBP_Player;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface;         // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayerCameraReset_Dummy;                  // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88E3[0x1];                                     // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88E4[0x2];                                     // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88E5[0x3];                                     // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x013C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88E6[0x3];                                     // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88E7[0x4];                                     // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager_1;         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInvalidDamage_Dummy;                   // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88E8[0x5];                                     // 0x01DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARSCharacterBase*>               CallFunc_GetPlayerList_ReturnValue;                // 0x01E0(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_Array_Get_Item_1;                         // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface_1;       // 0x01F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88E9[0x7];                                     // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface_2;       // 0x0210(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayerCameraReset_Dummy_1;                // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayerCameraReset_Dummy_2;                // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0223(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult_1; // 0x0224(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue_1; // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88EA[0x3];                                     // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager_2;         // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88EB[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      CallFunc_GetMainPlayer_Player_1;                   // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ENPCSequencerComponent_C_EndSequencer) == 0x000008, "Wrong alignment on BP_ENPCSequencerComponent_C_EndSequencer");
static_assert(sizeof(BP_ENPCSequencerComponent_C_EndSequencer) == 0x0002D0, "Wrong size on BP_ENPCSequencerComponent_C_EndSequencer");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, Param_SequencerIndex) == 0x000000, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::Param_SequencerIndex' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, Dummy) == 0x000004, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::Dummy' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, L_CorrectX) == 0x000008, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::L_CorrectX' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, L_playerList) == 0x000010, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::L_playerList' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, L_mainPlayer) == 0x000020, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::L_mainPlayer' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, K2Node_SwitchInteger_CmpSuccess) == 0x00002C, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_GetEnemyManager_Manager) == 0x000030, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_GetEnemyManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_GetPlayerManager_PlayerManager) == 0x000038, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_GetMainPlayer_Player) == 0x000048, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_GetMainPlayer_Player' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_IsValid_ReturnValue_2) == 0x000050, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_IsValid_ReturnValue_3) == 0x000051, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_GetBattleSimulatorManager_BattleSimulatorManager) == 0x000058, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_GetBattleSimulatorManager_BattleSimulatorManager' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000060, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_IsValid_ReturnValue_4) == 0x000068, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_GetGameMode_ReturnValue) == 0x000070, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, K2Node_DynamicCast_AsRSGame_Mode_BPInterface) == 0x000078, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::K2Node_DynamicCast_AsRSGame_Mode_BPInterface' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_IsValid_ReturnValue_5) == 0x000089, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_GetMainPlayerBP_Player) == 0x000090, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_GetMainPlayerBP_Player' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, K2Node_DynamicCast_AsBPI_Player_Interface) == 0x000098, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::K2Node_DynamicCast_AsBPI_Player_Interface' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_PlayerCameraReset_Dummy) == 0x0000A9, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_PlayerCameraReset_Dummy' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_IsValid_ReturnValue_6) == 0x0000AA, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_MakeVector_ReturnValue) == 0x0000AC, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_IsValid_ReturnValue_7) == 0x0000C4, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, K2Node_SwitchInteger_CmpSuccess_1) == 0x0000C5, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000C8, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_GetActorForwardVector_ReturnValue) == 0x0000D4, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, Temp_int_Loop_Counter_Variable) == 0x0000E0, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000E4, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000F0, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000FC, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_Add_VectorVector_ReturnValue) == 0x000108, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000114, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000120, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_FindLookAtRotation_ReturnValue) == 0x00012C, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_Less_IntInt_ReturnValue) == 0x000138, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x00013C, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x0001C4, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_Add_IntInt_ReturnValue) == 0x0001C8, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_GetPlayerManager_PlayerManager_1) == 0x0001D0, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_GetPlayerManager_PlayerManager_1' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_IsValid_ReturnValue_8) == 0x0001D8, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_IsValid_ReturnValue_9) == 0x0001D9, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_SetInvalidDamage_Dummy) == 0x0001DA, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_SetInvalidDamage_Dummy' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_GetPlayerList_ReturnValue) == 0x0001E0, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_GetPlayerList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_Array_Get_Item_1) == 0x0001F0, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, K2Node_DynamicCast_AsBPI_Player_Interface_1) == 0x0001F8, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::K2Node_DynamicCast_AsBPI_Player_Interface_1' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, K2Node_DynamicCast_bSuccess_2) == 0x000208, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, K2Node_DynamicCast_AsBPI_Player_Interface_2) == 0x000210, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::K2Node_DynamicCast_AsBPI_Player_Interface_2' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, K2Node_DynamicCast_bSuccess_3) == 0x000220, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_PlayerCameraReset_Dummy_1) == 0x000221, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_PlayerCameraReset_Dummy_1' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_PlayerCameraReset_Dummy_2) == 0x000222, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_PlayerCameraReset_Dummy_2' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_IsValid_ReturnValue_10) == 0x000223, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult_1) == 0x000224, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_K2_SetActorLocationAndRotation_ReturnValue_1) == 0x0002AC, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_K2_SetActorLocationAndRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_GetPlayerManager_PlayerManager_2) == 0x0002B0, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_GetPlayerManager_PlayerManager_2' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_IsValid_ReturnValue_11) == 0x0002B8, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_GetMainPlayer_Player_1) == 0x0002C0, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_GetMainPlayer_Player_1' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_EndSequencer, CallFunc_IsValid_ReturnValue_12) == 0x0002C8, "Member 'BP_ENPCSequencerComponent_C_EndSequencer::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");

// Function BP_ENPCSequencerComponent.BP_ENPCSequencerComponent_C.Update
// 0x0310 (0x0310 - 0x0000)
struct BP_ENPCSequencerComponent_C_Update final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88EC[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARSCharacterBase*>               LPlayerList;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	uint8                                         Pad_88ED[0x8];                                     // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LCalcTrans;                                        // 0x0020(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88EE[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      K2Node_DynamicCast_AsPlayer_Interface;             // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue;                  // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88EF[0x5];                                     // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ENpcInterface_C>  CallFunc_Em8000_GetPartner_self_CastInput;         // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_Em8000_GetPartner_PartnerActor;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88F0[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       K2Node_DynamicCast_AsRSCharacter_Base;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88F1[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88F2[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARSCharacterBase*>               CallFunc_GetPlayerList_ReturnValue;                // 0x00E8(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88F3[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IRSGameModeBPInterface_C> K2Node_DynamicCast_AsRSGame_Mode_BPInterface;      // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88F4[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_GetMainPlayerBP_Player;                   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88F5[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface;         // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayerCameraReset_Dummy;                  // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88F6[0x5];                                     // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_Array_Get_Item;                           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88F7[0x2];                                     // 0x015E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88F8[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IRSGameModeBPInterface_C> K2Node_DynamicCast_AsRSGame_Mode_BPInterface_1;    // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88F9[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_GetRightPlayerBP_Player;                  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IRSGameModeBPInterface_C> K2Node_DynamicCast_AsRSGame_Mode_BPInterface_2;    // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88FA[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_GetLeftPlayerBP_Player;                   // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88FB[0xE];                                     // 0x01B2(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_1;         // 0x01C0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_2;         // 0x01F0(0x0030)(IsPlainOldData, NoDestructor)
	TScriptInterface<class IRSGameModeBPInterface_C> K2Node_DynamicCast_AsRSGame_Mode_BPInterface_3;    // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88FC[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_GetMainPlayerBP_Player_1;                 // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88FD[0xE];                                     // 0x0242(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_3;         // 0x0250(0x0030)(IsPlainOldData, NoDestructor)
	EPlayerID                                     Temp_byte_Variable;                                // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88FE[0xE];                                     // 0x0282(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0290(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88FF[0xF];                                     // 0x02C1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_4;         // 0x02D0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Update_Dummy;                             // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ENPCSequencerComponent_C_Update) == 0x000010, "Wrong alignment on BP_ENPCSequencerComponent_C_Update");
static_assert(sizeof(BP_ENPCSequencerComponent_C_Update) == 0x000310, "Wrong size on BP_ENPCSequencerComponent_C_Update");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, Dummy) == 0x000000, "Member 'BP_ENPCSequencerComponent_C_Update::Dummy' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, LPlayerList) == 0x000008, "Member 'BP_ENPCSequencerComponent_C_Update::LPlayerList' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, LCalcTrans) == 0x000020, "Member 'BP_ENPCSequencerComponent_C_Update::LCalcTrans' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, K2Node_DynamicCast_AsRSBattle_Player) == 0x000050, "Member 'BP_ENPCSequencerComponent_C_Update::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_ENPCSequencerComponent_C_Update::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, K2Node_DynamicCast_AsPlayer_Interface) == 0x000060, "Member 'BP_ENPCSequencerComponent_C_Update::K2Node_DynamicCast_AsPlayer_Interface' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'BP_ENPCSequencerComponent_C_Update::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_IsValid_ReturnValue) == 0x000071, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_GetPlayerID_ReturnValue) == 0x000072, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_GetPlayerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_Em8000_GetPartner_self_CastInput) == 0x000078, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_Em8000_GetPartner_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_Em8000_GetPartner_PartnerActor) == 0x000088, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_Em8000_GetPartner_PartnerActor' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_IsValid_ReturnValue_1) == 0x000090, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, K2Node_DynamicCast_AsRSCharacter_Base) == 0x000098, "Member 'BP_ENPCSequencerComponent_C_Update::K2Node_DynamicCast_AsRSCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'BP_ENPCSequencerComponent_C_Update::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_GetPlayerManager_PlayerManager) == 0x0000A8, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_GetSocketTransform_ReturnValue) == 0x0000B0, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_IsValid_ReturnValue_2) == 0x0000E0, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_GetPlayerList_ReturnValue) == 0x0000E8, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_GetPlayerList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, Temp_int_Loop_Counter_Variable) == 0x0000F8, "Member 'BP_ENPCSequencerComponent_C_Update::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_Add_IntInt_ReturnValue) == 0x0000FC, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, Temp_int_Array_Index_Variable) == 0x000100, "Member 'BP_ENPCSequencerComponent_C_Update::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_GetGameMode_ReturnValue) == 0x000108, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, K2Node_DynamicCast_AsRSGame_Mode_BPInterface) == 0x000110, "Member 'BP_ENPCSequencerComponent_C_Update::K2Node_DynamicCast_AsRSGame_Mode_BPInterface' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, K2Node_DynamicCast_bSuccess_3) == 0x000120, "Member 'BP_ENPCSequencerComponent_C_Update::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_GetMainPlayerBP_Player) == 0x000128, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_GetMainPlayerBP_Player' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_IsValid_ReturnValue_3) == 0x000130, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, K2Node_DynamicCast_AsBPI_Player_Interface) == 0x000138, "Member 'BP_ENPCSequencerComponent_C_Update::K2Node_DynamicCast_AsBPI_Player_Interface' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, K2Node_DynamicCast_bSuccess_4) == 0x000148, "Member 'BP_ENPCSequencerComponent_C_Update::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_IsValid_ReturnValue_4) == 0x000149, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_PlayerCameraReset_Dummy) == 0x00014A, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_PlayerCameraReset_Dummy' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_Array_Get_Item) == 0x000150, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_Array_Length_ReturnValue) == 0x000158, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_IsValid_ReturnValue_5) == 0x00015C, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_Less_IntInt_ReturnValue) == 0x00015D, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_GetGameMode_ReturnValue_1) == 0x000160, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_IsValid_ReturnValue_6) == 0x000168, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, K2Node_DynamicCast_AsRSGame_Mode_BPInterface_1) == 0x000170, "Member 'BP_ENPCSequencerComponent_C_Update::K2Node_DynamicCast_AsRSGame_Mode_BPInterface_1' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, K2Node_DynamicCast_bSuccess_5) == 0x000180, "Member 'BP_ENPCSequencerComponent_C_Update::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_GetRightPlayerBP_Player) == 0x000188, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_GetRightPlayerBP_Player' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, K2Node_DynamicCast_AsRSGame_Mode_BPInterface_2) == 0x000190, "Member 'BP_ENPCSequencerComponent_C_Update::K2Node_DynamicCast_AsRSGame_Mode_BPInterface_2' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, K2Node_DynamicCast_bSuccess_6) == 0x0001A0, "Member 'BP_ENPCSequencerComponent_C_Update::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_GetLeftPlayerBP_Player) == 0x0001A8, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_GetLeftPlayerBP_Player' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_IsValid_ReturnValue_7) == 0x0001B0, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ENPCSequencerComponent_C_Update, CallFunc_IsValid_ReturnValue_8) == 0x0001B1, "Member 'BP_ENPCSequencerComponent_C_Update::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
