#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventSettings

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EventSettings.BP_EventSettings_C.ExecuteUbergraph_BP_EventSettings
// 0x0F20 (0x0F20 - 0x0000)
struct BP_EventSettings_C_ExecuteUbergraph_BP_EventSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_70F0[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   CallFunc_AddPostProcessSettings_ReturnValue;       // 0x0010(0x0780)()
	struct FPostProcessSettings                   CallFunc_AddPostProcessSettings_ReturnValue_1;     // 0x0790(0x0780)()
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x0F10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventSettings_C_ExecuteUbergraph_BP_EventSettings) == 0x000010, "Wrong alignment on BP_EventSettings_C_ExecuteUbergraph_BP_EventSettings");
static_assert(sizeof(BP_EventSettings_C_ExecuteUbergraph_BP_EventSettings) == 0x000F20, "Wrong size on BP_EventSettings_C_ExecuteUbergraph_BP_EventSettings");
static_assert(offsetof(BP_EventSettings_C_ExecuteUbergraph_BP_EventSettings, EntryPoint) == 0x000000, "Member 'BP_EventSettings_C_ExecuteUbergraph_BP_EventSettings::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EventSettings_C_ExecuteUbergraph_BP_EventSettings, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_EventSettings_C_ExecuteUbergraph_BP_EventSettings::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_EventSettings_C_ExecuteUbergraph_BP_EventSettings, CallFunc_AddPostProcessSettings_ReturnValue) == 0x000010, "Member 'BP_EventSettings_C_ExecuteUbergraph_BP_EventSettings::CallFunc_AddPostProcessSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventSettings_C_ExecuteUbergraph_BP_EventSettings, CallFunc_AddPostProcessSettings_ReturnValue_1) == 0x000790, "Member 'BP_EventSettings_C_ExecuteUbergraph_BP_EventSettings::CallFunc_AddPostProcessSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventSettings_C_ExecuteUbergraph_BP_EventSettings, CallFunc_IsEditor_ReturnValue) == 0x000F10, "Member 'BP_EventSettings_C_ExecuteUbergraph_BP_EventSettings::CallFunc_IsEditor_ReturnValue' has a wrong offset!");

// Function BP_EventSettings.BP_EventSettings_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_EventSettings_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventSettings_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_EventSettings_C_ReceiveTick");
static_assert(sizeof(BP_EventSettings_C_ReceiveTick) == 0x000004, "Wrong size on BP_EventSettings_C_ReceiveTick");
static_assert(offsetof(BP_EventSettings_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_EventSettings_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_EventSettings.BP_EventSettings_C.PrivateUpdate
// 0x0018 (0x0018 - 0x0000)
struct BP_EventSettings_C_PrivateUpdate final
{
public:
	float                                         DeltaTimeSeconds;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rate;                                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_70F1[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventSettings_C_PrivateUpdate) == 0x000004, "Wrong alignment on BP_EventSettings_C_PrivateUpdate");
static_assert(sizeof(BP_EventSettings_C_PrivateUpdate) == 0x000018, "Wrong size on BP_EventSettings_C_PrivateUpdate");
static_assert(offsetof(BP_EventSettings_C_PrivateUpdate, DeltaTimeSeconds) == 0x000000, "Member 'BP_EventSettings_C_PrivateUpdate::DeltaTimeSeconds' has a wrong offset!");
static_assert(offsetof(BP_EventSettings_C_PrivateUpdate, Rate) == 0x000004, "Member 'BP_EventSettings_C_PrivateUpdate::Rate' has a wrong offset!");
static_assert(offsetof(BP_EventSettings_C_PrivateUpdate, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_EventSettings_C_PrivateUpdate::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventSettings_C_PrivateUpdate, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_EventSettings_C_PrivateUpdate::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventSettings_C_PrivateUpdate, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_EventSettings_C_PrivateUpdate::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventSettings_C_PrivateUpdate, CallFunc_Add_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_EventSettings_C_PrivateUpdate::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_EventSettings.BP_EventSettings_C.StartStaticEventShadowRes
// 0x0010 (0x0010 - 0x0000)
struct BP_EventSettings_C_StartStaticEventShadowRes final
{
public:
	float                                         CallFunc_GetShadowResolution_TexelsPerPixel;       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetShadowResolution_TexelsPerPixelPointlight; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetShadowResolution_TexelsPerPixelSpotlight; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetShadowResolution_TexelsPerPixelRectlight; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventSettings_C_StartStaticEventShadowRes) == 0x000004, "Wrong alignment on BP_EventSettings_C_StartStaticEventShadowRes");
static_assert(sizeof(BP_EventSettings_C_StartStaticEventShadowRes) == 0x000010, "Wrong size on BP_EventSettings_C_StartStaticEventShadowRes");
static_assert(offsetof(BP_EventSettings_C_StartStaticEventShadowRes, CallFunc_GetShadowResolution_TexelsPerPixel) == 0x000000, "Member 'BP_EventSettings_C_StartStaticEventShadowRes::CallFunc_GetShadowResolution_TexelsPerPixel' has a wrong offset!");
static_assert(offsetof(BP_EventSettings_C_StartStaticEventShadowRes, CallFunc_GetShadowResolution_TexelsPerPixelPointlight) == 0x000004, "Member 'BP_EventSettings_C_StartStaticEventShadowRes::CallFunc_GetShadowResolution_TexelsPerPixelPointlight' has a wrong offset!");
static_assert(offsetof(BP_EventSettings_C_StartStaticEventShadowRes, CallFunc_GetShadowResolution_TexelsPerPixelSpotlight) == 0x000008, "Member 'BP_EventSettings_C_StartStaticEventShadowRes::CallFunc_GetShadowResolution_TexelsPerPixelSpotlight' has a wrong offset!");
static_assert(offsetof(BP_EventSettings_C_StartStaticEventShadowRes, CallFunc_GetShadowResolution_TexelsPerPixelRectlight) == 0x00000C, "Member 'BP_EventSettings_C_StartStaticEventShadowRes::CallFunc_GetShadowResolution_TexelsPerPixelRectlight' has a wrong offset!");

}

