#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EffectBackground

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EffectBackground.BP_EffectBackground_C
// 0x00A8 (0x0330 - 0x0288)
class ABP_EffectBackground_C final : public AEffectBackground
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_RSParticleBackgroundComponent_C*    ParticleBackgroundComponent;                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_RSParticleBackgroundComponent_C*    Emitter;                                           // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 AttachParent;                                      // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          AttachmentParticle;                                // 0x02B8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseDistanceCulling;                                // 0x02B9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8343[0x6];                                     // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEffectBackgroundParameter             EmitterParameter;                                  // 0x02C0(0x0060)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_             SpawnBGEmitter;                                    // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void SpawnBGEmitter__DelegateSignature(class UBP_RSParticleBackgroundComponent_C* Param_Emitter);
	void ExecuteUbergraph_BP_EffectBackground(int32 EntryPoint);
	void CallParticleSE(class FName EventName, float EmitterTime, const struct FVector& Location, const struct FVector& Velocity);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void PrivateRetryRegistParticleManager();
	void PlayParticleImplements();
	void StopAndHideParticleImplements();
	void StopParticleImplements();
	void ProtectedAttachParticle(class AActor* Parent);
	void ProtectedDetachParticle();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void PlayParticle();
	void StopParticle();
	void PrivateUpdateAttachParent();
	void SetEventCulling(bool Culling);
	bool SetDitherValue(float Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EffectBackground_C">();
	}
	static class ABP_EffectBackground_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EffectBackground_C>();
	}
};
static_assert(alignof(ABP_EffectBackground_C) == 0x000008, "Wrong alignment on ABP_EffectBackground_C");
static_assert(sizeof(ABP_EffectBackground_C) == 0x000330, "Wrong size on ABP_EffectBackground_C");
static_assert(offsetof(ABP_EffectBackground_C, UberGraphFrame) == 0x000288, "Member 'ABP_EffectBackground_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EffectBackground_C, Billboard) == 0x000290, "Member 'ABP_EffectBackground_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_EffectBackground_C, Arrow) == 0x000298, "Member 'ABP_EffectBackground_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_EffectBackground_C, ParticleBackgroundComponent) == 0x0002A0, "Member 'ABP_EffectBackground_C::ParticleBackgroundComponent' has a wrong offset!");
static_assert(offsetof(ABP_EffectBackground_C, Emitter) == 0x0002A8, "Member 'ABP_EffectBackground_C::Emitter' has a wrong offset!");
static_assert(offsetof(ABP_EffectBackground_C, AttachParent) == 0x0002B0, "Member 'ABP_EffectBackground_C::AttachParent' has a wrong offset!");
static_assert(offsetof(ABP_EffectBackground_C, AttachmentParticle) == 0x0002B8, "Member 'ABP_EffectBackground_C::AttachmentParticle' has a wrong offset!");
static_assert(offsetof(ABP_EffectBackground_C, UseDistanceCulling) == 0x0002B9, "Member 'ABP_EffectBackground_C::UseDistanceCulling' has a wrong offset!");
static_assert(offsetof(ABP_EffectBackground_C, EmitterParameter) == 0x0002C0, "Member 'ABP_EffectBackground_C::EmitterParameter' has a wrong offset!");
static_assert(offsetof(ABP_EffectBackground_C, SpawnBGEmitter) == 0x000320, "Member 'ABP_EffectBackground_C::SpawnBGEmitter' has a wrong offset!");

}

