#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnemyGoalComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_EnemyGoalType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EnemyGoalComponent.BP_EnemyGoalComponent_C
// 0x0048 (0x0148 - 0x0100)
class UBP_EnemyGoalComponent_C final : public UEnemyGoalComponentBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0100(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_EnemyGoalActor_C*                   MoveGoalActor;                                     // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattleEnemy_C*                       MyEnemy;                                           // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattleCharacter_C*                   TargetCharacter;                                   // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation;                                    // 0x0120(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_EnemyGoalType                            GoalType;                                          // 0x012C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41B6[0x3];                                     // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HitWallRadius;                                     // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitWallHeight;                                     // 0x0134(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEnemyCalcGoalComponent*                CalcComponent;                                     // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisableUpdateCharacter;                           // 0x0140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_EnemyGoalComponent(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void Initialize();
	void SetTargetActor(class ARSBattleCharacter_C* Character);
	void SetTargetLocation(const struct FVector& Location);
	void MainTick(float DeltaSeconds);
	void UpdateTargetCharacter(float DeltaSeconds);
	void SetGoalIntervalTime(float NewIntervalTime);
	void ReSetGoalIntervalTime();
	class AActor* InitializeSpawnMoveGoalActor_FromNative(class AActor* Owner);
	float InitializeGetCapsuleRadius_FromNative(class AActor* Owner);
	class UEnemyCalcGoalComponent* InitializeGetEnemyCalcComponent_FromNative(class AActor* Owner);

	void GetTargetActor(class ARSBattleCharacter_C** Character) const;
	void GetTargetLocation(struct FVector* Location) const;
	void DebugDraw() const;
	void GetGoalActor(class AActor** Actor) const;
	void CorrectionHitCollision(const struct FVector& SrcLocation, const struct FVector& DstLocation, float Radius, struct FVector* Location) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EnemyGoalComponent_C">();
	}
	static class UBP_EnemyGoalComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_EnemyGoalComponent_C>();
	}
};
static_assert(alignof(UBP_EnemyGoalComponent_C) == 0x000008, "Wrong alignment on UBP_EnemyGoalComponent_C");
static_assert(sizeof(UBP_EnemyGoalComponent_C) == 0x000148, "Wrong size on UBP_EnemyGoalComponent_C");
static_assert(offsetof(UBP_EnemyGoalComponent_C, UberGraphFrame) == 0x000100, "Member 'UBP_EnemyGoalComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_EnemyGoalComponent_C, MoveGoalActor) == 0x000108, "Member 'UBP_EnemyGoalComponent_C::MoveGoalActor' has a wrong offset!");
static_assert(offsetof(UBP_EnemyGoalComponent_C, MyEnemy) == 0x000110, "Member 'UBP_EnemyGoalComponent_C::MyEnemy' has a wrong offset!");
static_assert(offsetof(UBP_EnemyGoalComponent_C, TargetCharacter) == 0x000118, "Member 'UBP_EnemyGoalComponent_C::TargetCharacter' has a wrong offset!");
static_assert(offsetof(UBP_EnemyGoalComponent_C, TargetLocation) == 0x000120, "Member 'UBP_EnemyGoalComponent_C::TargetLocation' has a wrong offset!");
static_assert(offsetof(UBP_EnemyGoalComponent_C, GoalType) == 0x00012C, "Member 'UBP_EnemyGoalComponent_C::GoalType' has a wrong offset!");
static_assert(offsetof(UBP_EnemyGoalComponent_C, HitWallRadius) == 0x000130, "Member 'UBP_EnemyGoalComponent_C::HitWallRadius' has a wrong offset!");
static_assert(offsetof(UBP_EnemyGoalComponent_C, HitWallHeight) == 0x000134, "Member 'UBP_EnemyGoalComponent_C::HitWallHeight' has a wrong offset!");
static_assert(offsetof(UBP_EnemyGoalComponent_C, CalcComponent) == 0x000138, "Member 'UBP_EnemyGoalComponent_C::CalcComponent' has a wrong offset!");
static_assert(offsetof(UBP_EnemyGoalComponent_C, bDisableUpdateCharacter) == 0x000140, "Member 'UBP_EnemyGoalComponent_C::bDisableUpdateCharacter' has a wrong offset!");

}

