#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnemyManager

#include "Basic.hpp"

#include "EPlayerAIBattleThinkType_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CopyCharacterParameterStruct_structs.hpp"
#include "Engine_structs.hpp"
#include "FPlayerAIBattleThinkData_structs.hpp"
#include "Enum_EnemySound_structs.hpp"


namespace SDK::Params
{

// Function BP_EnemyManager.BP_EnemyManager_C.OnDeadDispatcher__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_EnemyManager_C_OnDeadDispatcher__DelegateSignature final
{
public:
	int32                                         GroupID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubGroupID;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FenceBattleRate;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   UniqueId;                                          // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOnceOnly;                                        // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyManager_C_OnDeadDispatcher__DelegateSignature) == 0x000004, "Wrong alignment on BP_EnemyManager_C_OnDeadDispatcher__DelegateSignature");
static_assert(sizeof(BP_EnemyManager_C_OnDeadDispatcher__DelegateSignature) == 0x000018, "Wrong size on BP_EnemyManager_C_OnDeadDispatcher__DelegateSignature");
static_assert(offsetof(BP_EnemyManager_C_OnDeadDispatcher__DelegateSignature, GroupID) == 0x000000, "Member 'BP_EnemyManager_C_OnDeadDispatcher__DelegateSignature::GroupID' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_OnDeadDispatcher__DelegateSignature, SubGroupID) == 0x000004, "Member 'BP_EnemyManager_C_OnDeadDispatcher__DelegateSignature::SubGroupID' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_OnDeadDispatcher__DelegateSignature, FenceBattleRate) == 0x000008, "Member 'BP_EnemyManager_C_OnDeadDispatcher__DelegateSignature::FenceBattleRate' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_OnDeadDispatcher__DelegateSignature, UniqueId) == 0x00000C, "Member 'BP_EnemyManager_C_OnDeadDispatcher__DelegateSignature::UniqueId' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_OnDeadDispatcher__DelegateSignature, IsOnceOnly) == 0x000014, "Member 'BP_EnemyManager_C_OnDeadDispatcher__DelegateSignature::IsOnceOnly' has a wrong offset!");

// Function BP_EnemyManager.BP_EnemyManager_C.GroupBattleStartDispatcher__DelegateSignature
// 0x0014 (0x0014 - 0x0000)
struct BP_EnemyManager_C_GroupBattleStartDispatcher__DelegateSignature final
{
public:
	int32                                         GroupID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FenceBattleRate;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   UniqueId;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOnceOnly;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyManager_C_GroupBattleStartDispatcher__DelegateSignature) == 0x000004, "Wrong alignment on BP_EnemyManager_C_GroupBattleStartDispatcher__DelegateSignature");
static_assert(sizeof(BP_EnemyManager_C_GroupBattleStartDispatcher__DelegateSignature) == 0x000014, "Wrong size on BP_EnemyManager_C_GroupBattleStartDispatcher__DelegateSignature");
static_assert(offsetof(BP_EnemyManager_C_GroupBattleStartDispatcher__DelegateSignature, GroupID) == 0x000000, "Member 'BP_EnemyManager_C_GroupBattleStartDispatcher__DelegateSignature::GroupID' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_GroupBattleStartDispatcher__DelegateSignature, FenceBattleRate) == 0x000004, "Member 'BP_EnemyManager_C_GroupBattleStartDispatcher__DelegateSignature::FenceBattleRate' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_GroupBattleStartDispatcher__DelegateSignature, UniqueId) == 0x000008, "Member 'BP_EnemyManager_C_GroupBattleStartDispatcher__DelegateSignature::UniqueId' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_GroupBattleStartDispatcher__DelegateSignature, IsOnceOnly) == 0x000010, "Member 'BP_EnemyManager_C_GroupBattleStartDispatcher__DelegateSignature::IsOnceOnly' has a wrong offset!");

// Function BP_EnemyManager.BP_EnemyManager_C.DebugUniqueEventDispatcher__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_EnemyManager_C_DebugUniqueEventDispatcher__DelegateSignature final
{
public:
	int32                                         EventNo;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyManager_C_DebugUniqueEventDispatcher__DelegateSignature) == 0x000004, "Wrong alignment on BP_EnemyManager_C_DebugUniqueEventDispatcher__DelegateSignature");
static_assert(sizeof(BP_EnemyManager_C_DebugUniqueEventDispatcher__DelegateSignature) == 0x000004, "Wrong size on BP_EnemyManager_C_DebugUniqueEventDispatcher__DelegateSignature");
static_assert(offsetof(BP_EnemyManager_C_DebugUniqueEventDispatcher__DelegateSignature, EventNo) == 0x000000, "Member 'BP_EnemyManager_C_DebugUniqueEventDispatcher__DelegateSignature::EventNo' has a wrong offset!");

// Function BP_EnemyManager.BP_EnemyManager_C.ExecuteUbergraph_BP_EnemyManager
// 0x0128 (0x0128 - 0x0000)
struct BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_602B[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_602C[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool IsCameraCutPhotoMode)>    K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_2;                      // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_602D[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EChangeAreaStatus Status, bool IsChangeLocation)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bBeginActor_1;                        // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bBeginActor;                          // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_602E[0x2];                                     // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Event_PlayerEndMontage;                     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BrainCrash_C>     K2Node_DynamicCast_AsBPI_Brain_Crash;              // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_602F[0x2];                                     // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BrainCrash_C>     K2Node_DynamicCast_AsBPI_Brain_Crash_1;            // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6030[0x1];                                     // 0x00B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BrainCrash_C>     K2Node_DynamicCast_AsBPI_Brain_Crash_2;            // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6031[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BrainCrash_C>     K2Node_DynamicCast_AsBPI_Brain_Crash_3;            // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6032[0x1];                                     // 0x00E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RigitBodyEmptyUpdateSeconds;          // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InitBadStateMaterialParam_Dummy;          // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InitDropItem_Dummy;                       // 0x00F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6033[0x1];                                     // 0x00F7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame_1;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnReturnFromPartyMenu_Dummy;              // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6034[0x1];                                     // 0x010B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6035[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager;             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChangeAreaStatus                             K2Node_CustomEvent_Status;                         // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsChangeLocation;               // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_isCameraCutPhotoMode;           // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnReturnFromPartyMenu_Dummy_1;            // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager) == 0x000008, "Wrong alignment on BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager");
static_assert(sizeof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager) == 0x000128, "Wrong size on BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, EntryPoint) == 0x000000, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, Temp_int_Loop_Num_Variable) == 0x000004, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, Temp_int_Loop_Num_Variable_1) == 0x000024, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_Less_IntInt_ReturnValue_1) == 0x000028, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, Temp_int_Array_Index_Variable_2) == 0x00003C, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, Temp_int_Loop_Counter_Variable_2) == 0x000040, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_Add_IntInt_ReturnValue_2) == 0x000044, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, Temp_int_Array_Index_Variable_3) == 0x000048, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, Temp_int_Loop_Num_Variable_2) == 0x00004C, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::Temp_int_Loop_Num_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_Less_IntInt_ReturnValue_2) == 0x000050, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, K2Node_CreateDelegate_OutputDelegate_1) == 0x000054, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, K2Node_CreateDelegate_OutputDelegate_2) == 0x000064, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, K2Node_Event_bBeginActor_1) == 0x000074, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::K2Node_Event_bBeginActor_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, K2Node_Event_bBeginActor) == 0x000075, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::K2Node_Event_bBeginActor' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, K2Node_Event_PlayerEndMontage) == 0x000078, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::K2Node_Event_PlayerEndMontage' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, K2Node_DynamicCast_AsBPI_Brain_Crash) == 0x000080, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::K2Node_DynamicCast_AsBPI_Brain_Crash' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_IsValid_ReturnValue) == 0x000091, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_Array_AddUnique_ReturnValue) == 0x000098, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_Array_Length_ReturnValue_1) == 0x00009C, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, K2Node_DynamicCast_AsBPI_Brain_Crash_1) == 0x0000A0, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::K2Node_DynamicCast_AsBPI_Brain_Crash_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_Less_IntInt_ReturnValue_3) == 0x0000B1, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_IsValid_ReturnValue_1) == 0x0000B2, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_Array_Length_ReturnValue_2) == 0x0000B4, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, K2Node_DynamicCast_AsBPI_Brain_Crash_2) == 0x0000B8, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::K2Node_DynamicCast_AsBPI_Brain_Crash_2' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, K2Node_DynamicCast_bSuccess_2) == 0x0000C8, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, K2Node_DynamicCast_AsBPI_Brain_Crash_3) == 0x0000D0, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::K2Node_DynamicCast_AsBPI_Brain_Crash_3' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, K2Node_DynamicCast_bSuccess_3) == 0x0000E0, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_IsValid_ReturnValue_2) == 0x0000E1, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_IsValid_ReturnValue_3) == 0x0000E2, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_Array_Length_ReturnValue_3) == 0x0000E4, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_Array_Length_ReturnValue_4) == 0x0000E8, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, K2Node_Event_DeltaSeconds) == 0x0000EC, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, K2Node_Event_RigitBodyEmptyUpdateSeconds) == 0x0000F0, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::K2Node_Event_RigitBodyEmptyUpdateSeconds' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, K2Node_Event_EndPlayReason) == 0x0000F4, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_InitBadStateMaterialParam_Dummy) == 0x0000F5, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_InitBadStateMaterialParam_Dummy' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_InitDropItem_Dummy) == 0x0000F6, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_InitDropItem_Dummy' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_GetHUDMainGame_HUDMainGame) == 0x0000F8, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_GetHUDMainGame_HUDMainGame_1) == 0x000100, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_GetHUDMainGame_HUDMainGame_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_IsValid_ReturnValue_4) == 0x000108, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_IsValid_ReturnValue_5) == 0x000109, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_OnReturnFromPartyMenu_Dummy) == 0x00010A, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_OnReturnFromPartyMenu_Dummy' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, Temp_int_Loop_Counter_Variable_3) == 0x00010C, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_Less_IntInt_ReturnValue_4) == 0x000110, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_Add_IntInt_ReturnValue_3) == 0x000114, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_GetSceneManager_SceneManager) == 0x000118, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_GetSceneManager_SceneManager' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, K2Node_CustomEvent_Status) == 0x000120, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::K2Node_CustomEvent_Status' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, K2Node_CustomEvent_IsChangeLocation) == 0x000121, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::K2Node_CustomEvent_IsChangeLocation' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_IsValid_ReturnValue_6) == 0x000122, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, K2Node_CustomEvent_isCameraCutPhotoMode) == 0x000123, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::K2Node_CustomEvent_isCameraCutPhotoMode' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager, CallFunc_OnReturnFromPartyMenu_Dummy_1) == 0x000124, "Member 'BP_EnemyManager_C_ExecuteUbergraph_BP_EnemyManager::CallFunc_OnReturnFromPartyMenu_Dummy_1' has a wrong offset!");

// Function BP_EnemyManager.BP_EnemyManager_C.EventReturnFromPhotoMode
// 0x0001 (0x0001 - 0x0000)
struct BP_EnemyManager_C_EventReturnFromPhotoMode final
{
public:
	bool                                          IsCameraCutPhotoMode;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyManager_C_EventReturnFromPhotoMode) == 0x000001, "Wrong alignment on BP_EnemyManager_C_EventReturnFromPhotoMode");
static_assert(sizeof(BP_EnemyManager_C_EventReturnFromPhotoMode) == 0x000001, "Wrong size on BP_EnemyManager_C_EventReturnFromPhotoMode");
static_assert(offsetof(BP_EnemyManager_C_EventReturnFromPhotoMode, IsCameraCutPhotoMode) == 0x000000, "Member 'BP_EnemyManager_C_EventReturnFromPhotoMode::IsCameraCutPhotoMode' has a wrong offset!");

// Function BP_EnemyManager.BP_EnemyManager_C.OnChangeAreaLoadStatus
// 0x0002 (0x0002 - 0x0000)
struct BP_EnemyManager_C_OnChangeAreaLoadStatus final
{
public:
	EChangeAreaStatus                             Status;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsChangeLocation;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyManager_C_OnChangeAreaLoadStatus) == 0x000001, "Wrong alignment on BP_EnemyManager_C_OnChangeAreaLoadStatus");
static_assert(sizeof(BP_EnemyManager_C_OnChangeAreaLoadStatus) == 0x000002, "Wrong size on BP_EnemyManager_C_OnChangeAreaLoadStatus");
static_assert(offsetof(BP_EnemyManager_C_OnChangeAreaLoadStatus, Status) == 0x000000, "Member 'BP_EnemyManager_C_OnChangeAreaLoadStatus::Status' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_OnChangeAreaLoadStatus, IsChangeLocation) == 0x000001, "Member 'BP_EnemyManager_C_OnChangeAreaLoadStatus::IsChangeLocation' has a wrong offset!");

// Function BP_EnemyManager.BP_EnemyManager_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_EnemyManager_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyManager_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_EnemyManager_C_ReceiveEndPlay");
static_assert(sizeof(BP_EnemyManager_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_EnemyManager_C_ReceiveEndPlay");
static_assert(offsetof(BP_EnemyManager_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_EnemyManager_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_EnemyManager.BP_EnemyManager_C.EventManagerRigitBodyEmptyUpdateSeconds
// 0x0004 (0x0004 - 0x0000)
struct BP_EnemyManager_C_EventManagerRigitBodyEmptyUpdateSeconds final
{
public:
	float                                         RigitBodyEmptyUpdateSeconds;                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyManager_C_EventManagerRigitBodyEmptyUpdateSeconds) == 0x000004, "Wrong alignment on BP_EnemyManager_C_EventManagerRigitBodyEmptyUpdateSeconds");
static_assert(sizeof(BP_EnemyManager_C_EventManagerRigitBodyEmptyUpdateSeconds) == 0x000004, "Wrong size on BP_EnemyManager_C_EventManagerRigitBodyEmptyUpdateSeconds");
static_assert(offsetof(BP_EnemyManager_C_EventManagerRigitBodyEmptyUpdateSeconds, RigitBodyEmptyUpdateSeconds) == 0x000000, "Member 'BP_EnemyManager_C_EventManagerRigitBodyEmptyUpdateSeconds::RigitBodyEmptyUpdateSeconds' has a wrong offset!");

// Function BP_EnemyManager.BP_EnemyManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_EnemyManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_EnemyManager_C_ReceiveTick");
static_assert(sizeof(BP_EnemyManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_EnemyManager_C_ReceiveTick");
static_assert(offsetof(BP_EnemyManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_EnemyManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_EnemyManager.BP_EnemyManager_C.OnBrainCrashEnd
// 0x0010 (0x0010 - 0x0000)
struct BP_EnemyManager_C_OnBrainCrashEnd final
{
public:
	bool                                          bBeginActor;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6036[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           PlayerEndMontage;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyManager_C_OnBrainCrashEnd) == 0x000008, "Wrong alignment on BP_EnemyManager_C_OnBrainCrashEnd");
static_assert(sizeof(BP_EnemyManager_C_OnBrainCrashEnd) == 0x000010, "Wrong size on BP_EnemyManager_C_OnBrainCrashEnd");
static_assert(offsetof(BP_EnemyManager_C_OnBrainCrashEnd, bBeginActor) == 0x000000, "Member 'BP_EnemyManager_C_OnBrainCrashEnd::bBeginActor' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_OnBrainCrashEnd, PlayerEndMontage) == 0x000008, "Member 'BP_EnemyManager_C_OnBrainCrashEnd::PlayerEndMontage' has a wrong offset!");

// Function BP_EnemyManager.BP_EnemyManager_C.OnBrainCrashStart
// 0x0001 (0x0001 - 0x0000)
struct BP_EnemyManager_C_OnBrainCrashStart final
{
public:
	bool                                          bBeginActor;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyManager_C_OnBrainCrashStart) == 0x000001, "Wrong alignment on BP_EnemyManager_C_OnBrainCrashStart");
static_assert(sizeof(BP_EnemyManager_C_OnBrainCrashStart) == 0x000001, "Wrong size on BP_EnemyManager_C_OnBrainCrashStart");
static_assert(offsetof(BP_EnemyManager_C_OnBrainCrashStart, bBeginActor) == 0x000000, "Member 'BP_EnemyManager_C_OnBrainCrashStart::bBeginActor' has a wrong offset!");

// Function BP_EnemyManager.BP_EnemyManager_C.UpdateTick
// 0x00C8 (0x00C8 - 0x0000)
struct BP_EnemyManager_C_UpdateTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6037[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARSCharacterBase*>               LEnemyList;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	class AActor*                                 LPlayerActor;                                      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CheckEnemyListNum;                                 // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipUpdateTickEnable;                              // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6038[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 EnemyActor;                                        // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EnemyListNum;                                      // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6039[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleSimulatorManager*                CallFunc_GetBattleSimulatorManager_BattleSimulatorManager; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMissionActive_ReturnValue;              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_603A[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARSCharacterBase*>               CallFunc_GetEnemyListRef_ReturnValue;              // 0x0048(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_603B[0x2];                                     // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_603C[0x1];                                     // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_603D[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_603E[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_603F[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PreUpdateEnemyTickEnable_ReturnValue;     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6040[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattleCharacter_C*                   K2Node_DynamicCast_AsRSBattle_Character;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanSetTickDistance_result;                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanSetTick_result;                        // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6041[0x5];                                     // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattleEnemy_C*                       K2Node_DynamicCast_AsRSBattle_Enemy;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DebugDrawInfomation_Dummy;                // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6042[0x2];                                     // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyManager_C_UpdateTick) == 0x000008, "Wrong alignment on BP_EnemyManager_C_UpdateTick");
static_assert(sizeof(BP_EnemyManager_C_UpdateTick) == 0x0000C8, "Wrong size on BP_EnemyManager_C_UpdateTick");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, DeltaSeconds) == 0x000000, "Member 'BP_EnemyManager_C_UpdateTick::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, LEnemyList) == 0x000008, "Member 'BP_EnemyManager_C_UpdateTick::LEnemyList' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, LPlayerActor) == 0x000018, "Member 'BP_EnemyManager_C_UpdateTick::LPlayerActor' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CheckEnemyListNum) == 0x000020, "Member 'BP_EnemyManager_C_UpdateTick::CheckEnemyListNum' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, SkipUpdateTickEnable) == 0x000024, "Member 'BP_EnemyManager_C_UpdateTick::SkipUpdateTickEnable' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, EnemyActor) == 0x000028, "Member 'BP_EnemyManager_C_UpdateTick::EnemyActor' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, EnemyListNum) == 0x000030, "Member 'BP_EnemyManager_C_UpdateTick::EnemyListNum' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CallFunc_GetBattleSimulatorManager_BattleSimulatorManager) == 0x000038, "Member 'BP_EnemyManager_C_UpdateTick::CallFunc_GetBattleSimulatorManager_BattleSimulatorManager' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_EnemyManager_C_UpdateTick::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CallFunc_IsMissionActive_ReturnValue) == 0x000041, "Member 'BP_EnemyManager_C_UpdateTick::CallFunc_IsMissionActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CallFunc_GetEnemyListRef_ReturnValue) == 0x000048, "Member 'BP_EnemyManager_C_UpdateTick::CallFunc_GetEnemyListRef_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'BP_EnemyManager_C_UpdateTick::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000059, "Member 'BP_EnemyManager_C_UpdateTick::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'BP_EnemyManager_C_UpdateTick::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000060, "Member 'BP_EnemyManager_C_UpdateTick::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CallFunc_IsValid_ReturnValue_2) == 0x000061, "Member 'BP_EnemyManager_C_UpdateTick::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CallFunc_Greater_IntInt_ReturnValue) == 0x000062, "Member 'BP_EnemyManager_C_UpdateTick::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, Temp_int_Variable) == 0x000064, "Member 'BP_EnemyManager_C_UpdateTick::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000068, "Member 'BP_EnemyManager_C_UpdateTick::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'BP_EnemyManager_C_UpdateTick::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000070, "Member 'BP_EnemyManager_C_UpdateTick::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CallFunc_Divide_IntInt_ReturnValue) == 0x000074, "Member 'BP_EnemyManager_C_UpdateTick::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CallFunc_Subtract_IntInt_ReturnValue) == 0x000078, "Member 'BP_EnemyManager_C_UpdateTick::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CallFunc_GetPlayerPawn_ReturnValue) == 0x000080, "Member 'BP_EnemyManager_C_UpdateTick::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CallFunc_PreUpdateEnemyTickEnable_ReturnValue) == 0x000088, "Member 'BP_EnemyManager_C_UpdateTick::CallFunc_PreUpdateEnemyTickEnable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, K2Node_DynamicCast_AsRSBattle_Character) == 0x000090, "Member 'BP_EnemyManager_C_UpdateTick::K2Node_DynamicCast_AsRSBattle_Character' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BP_EnemyManager_C_UpdateTick::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CallFunc_CanSetTickDistance_result) == 0x000099, "Member 'BP_EnemyManager_C_UpdateTick::CallFunc_CanSetTickDistance_result' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CallFunc_CanSetTick_result) == 0x00009A, "Member 'BP_EnemyManager_C_UpdateTick::CallFunc_CanSetTick_result' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, K2Node_DynamicCast_AsRSBattle_Enemy) == 0x0000A0, "Member 'BP_EnemyManager_C_UpdateTick::K2Node_DynamicCast_AsRSBattle_Enemy' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'BP_EnemyManager_C_UpdateTick::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CallFunc_DebugDrawInfomation_Dummy) == 0x0000A9, "Member 'BP_EnemyManager_C_UpdateTick::CallFunc_DebugDrawInfomation_Dummy' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, Temp_int_Variable_1) == 0x0000AC, "Member 'BP_EnemyManager_C_UpdateTick::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'BP_EnemyManager_C_UpdateTick::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000B8, "Member 'BP_EnemyManager_C_UpdateTick::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CallFunc_Array_Length_ReturnValue_1) == 0x0000BC, "Member 'BP_EnemyManager_C_UpdateTick::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyManager_C_UpdateTick, CallFunc_GreaterEqual_IntInt_ReturnValue_2) == 0x0000C0, "Member 'BP_EnemyManager_C_UpdateTick::CallFunc_GreaterEqual_IntInt_ReturnValue_2' has a wrong offset!");

// Function BP_EnemyManager.BP_EnemyManager_C.SetTickEnable
// 0x02F0 (0x02F0 - 0x0000)
struct BP_EnemyManager_C_SetTickEnable final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          L_ForceEnable;                                     // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6043[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                L_PlayerLocation;                                  // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                L_EnemyLocation;                                   // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L_HeightDistance;                                  // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UActorComponent*>                ComponentList;                                     // 0x0028(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          IsTickEnable;                                      // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6044[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6045[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshFromActor_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EnemyInterface_C> K2Node_DynamicCast_AsBPI_Enemy_Interface;          // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
