#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventTypeSwitchBase

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EventTypeSwitchBase.BP_EventTypeSwitchBase_C.ExecuteUbergraph_BP_EventTypeSwitchBase
// 0x00B8 (0x00B8 - 0x0000)
struct BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaySimulate_ReturnValue;               // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayMovieCapture_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31C7[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31C8[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase) == 0x000008, "Wrong alignment on BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase");
static_assert(sizeof(BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase) == 0x0000B8, "Wrong size on BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase");
static_assert(offsetof(BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase, EntryPoint) == 0x000000, "Member 'BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase, K2Node_Event_EndPlayReason) == 0x000009, "Member 'BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase, CallFunc_IsValid_ReturnValue_1) == 0x00000A, "Member 'BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase, CallFunc_IsValid_ReturnValue_2) == 0x00000B, "Member 'BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase, CallFunc_BooleanAND_ReturnValue) == 0x00000C, "Member 'BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase, CallFunc_IsValid_ReturnValue_3) == 0x00000D, "Member 'BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase, CallFunc_BooleanAND_ReturnValue_1) == 0x00000E, "Member 'BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase, CallFunc_IsPlaySimulate_ReturnValue) == 0x00000F, "Member 'BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase::CallFunc_IsPlaySimulate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase, CallFunc_IsPlayMovieCapture_ReturnValue) == 0x000010, "Member 'BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase::CallFunc_IsPlayMovieCapture_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase, CallFunc_IsEditor_ReturnValue) == 0x000011, "Member 'BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase::CallFunc_IsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase, CallFunc_GetDisplayName_ReturnValue) == 0x000018, "Member 'BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase, CallFunc_BooleanAND_ReturnValue_2) == 0x000040, "Member 'BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase, K2Node_MakeArray_Array) == 0x000088, "Member 'BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase, CallFunc_Format_ReturnValue) == 0x000098, "Member 'BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase, CallFunc_BooleanAND_ReturnValue_3) == 0x0000B0, "Member 'BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase, CallFunc_IsValid_ReturnValue_4) == 0x0000B1, "Member 'BP_EventTypeSwitchBase_C_ExecuteUbergraph_BP_EventTypeSwitchBase::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");

// Function BP_EventTypeSwitchBase.BP_EventTypeSwitchBase_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_EventTypeSwitchBase_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventTypeSwitchBase_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_EventTypeSwitchBase_C_ReceiveEndPlay");
static_assert(sizeof(BP_EventTypeSwitchBase_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_EventTypeSwitchBase_C_ReceiveEndPlay");
static_assert(offsetof(BP_EventTypeSwitchBase_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_EventTypeSwitchBase_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_EventTypeSwitchBase.BP_EventTypeSwitchBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_EventTypeSwitchBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventTypeSwitchBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_EventTypeSwitchBase_C_ReceiveTick");
static_assert(sizeof(BP_EventTypeSwitchBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_EventTypeSwitchBase_C_ReceiveTick");
static_assert(offsetof(BP_EventTypeSwitchBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_EventTypeSwitchBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_EventTypeSwitchBase.BP_EventTypeSwitchBase_C.PrivateSetupPlaySimulate
// 0x0020 (0x0020 - 0x0000)
struct BP_EventTypeSwitchBase_C_PrivateSetupPlaySimulate final
{
public:
	class ABP_PostProcessManager_C*               CallFunc_GetPostProcessManager_Manager;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31C9[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPostProcessComponent*                  CallFunc_GetPerformPostProcess_PostProcess;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventTypeSwitchBase_C_PrivateSetupPlaySimulate) == 0x000008, "Wrong alignment on BP_EventTypeSwitchBase_C_PrivateSetupPlaySimulate");
static_assert(sizeof(BP_EventTypeSwitchBase_C_PrivateSetupPlaySimulate) == 0x000020, "Wrong size on BP_EventTypeSwitchBase_C_PrivateSetupPlaySimulate");
static_assert(offsetof(BP_EventTypeSwitchBase_C_PrivateSetupPlaySimulate, CallFunc_GetPostProcessManager_Manager) == 0x000000, "Member 'BP_EventTypeSwitchBase_C_PrivateSetupPlaySimulate::CallFunc_GetPostProcessManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_PrivateSetupPlaySimulate, CallFunc_GetEventManager_EventManager) == 0x000008, "Member 'BP_EventTypeSwitchBase_C_PrivateSetupPlaySimulate::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_PrivateSetupPlaySimulate, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_EventTypeSwitchBase_C_PrivateSetupPlaySimulate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_PrivateSetupPlaySimulate, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'BP_EventTypeSwitchBase_C_PrivateSetupPlaySimulate::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_PrivateSetupPlaySimulate, CallFunc_GetPerformPostProcess_PostProcess) == 0x000018, "Member 'BP_EventTypeSwitchBase_C_PrivateSetupPlaySimulate::CallFunc_GetPerformPostProcess_PostProcess' has a wrong offset!");

// Function BP_EventTypeSwitchBase.BP_EventTypeSwitchBase_C.PrivateGetManagers
// 0x0028 (0x0028 - 0x0000)
struct BP_EventTypeSwitchBase_C_PrivateGetManagers final
{
public:
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEventType                                    CallFunc_GetEventType_EventType;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31CA[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEventType                                    CallFunc_GetEventType_EventType_1;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31CB[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PostProcessManager_C*               CallFunc_GetPostProcessManager_Manager;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventTypeSwitchBase_C_PrivateGetManagers) == 0x000008, "Wrong alignment on BP_EventTypeSwitchBase_C_PrivateGetManagers");
static_assert(sizeof(BP_EventTypeSwitchBase_C_PrivateGetManagers) == 0x000028, "Wrong size on BP_EventTypeSwitchBase_C_PrivateGetManagers");
static_assert(offsetof(BP_EventTypeSwitchBase_C_PrivateGetManagers, CallFunc_BooleanAND_ReturnValue) == 0x000000, "Member 'BP_EventTypeSwitchBase_C_PrivateGetManagers::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_PrivateGetManagers, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_EventTypeSwitchBase_C_PrivateGetManagers::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_PrivateGetManagers, CallFunc_GetEventType_EventType) == 0x000002, "Member 'BP_EventTypeSwitchBase_C_PrivateGetManagers::CallFunc_GetEventType_EventType' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_PrivateGetManagers, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000003, "Member 'BP_EventTypeSwitchBase_C_PrivateGetManagers::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_PrivateGetManagers, CallFunc_ActorHasTag_ReturnValue) == 0x000004, "Member 'BP_EventTypeSwitchBase_C_PrivateGetManagers::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_PrivateGetManagers, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'BP_EventTypeSwitchBase_C_PrivateGetManagers::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_PrivateGetManagers, CallFunc_IsValid_ReturnValue_2) == 0x000006, "Member 'BP_EventTypeSwitchBase_C_PrivateGetManagers::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_PrivateGetManagers, CallFunc_GetEventManager_EventManager) == 0x000008, "Member 'BP_EventTypeSwitchBase_C_PrivateGetManagers::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_PrivateGetManagers, CallFunc_IsValid_ReturnValue_3) == 0x000010, "Member 'BP_EventTypeSwitchBase_C_PrivateGetManagers::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_PrivateGetManagers, CallFunc_GetEventType_EventType_1) == 0x000011, "Member 'BP_EventTypeSwitchBase_C_PrivateGetManagers::CallFunc_GetEventType_EventType_1' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_PrivateGetManagers, CallFunc_GetPostProcessManager_Manager) == 0x000018, "Member 'BP_EventTypeSwitchBase_C_PrivateGetManagers::CallFunc_GetPostProcessManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_PrivateGetManagers, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'BP_EventTypeSwitchBase_C_PrivateGetManagers::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_EventTypeSwitchBase.BP_EventTypeSwitchBase_C.SetupNoEventPPM
// 0x0080 (0x0080 - 0x0000)
struct BP_EventTypeSwitchBase_C_SetupNoEventPPM final
{
public:
	TSoftObjectPtr<class UMaterialInterface>      PPM;                                               // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PPM_MID;                                           // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31CC[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31CD[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31CE[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        CallFunc_AddActorComponent_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  K2Node_DynamicCast_AsPost_Process_Component;       // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventTypeSwitchBase_C_SetupNoEventPPM) == 0x000008, "Wrong alignment on BP_EventTypeSwitchBase_C_SetupNoEventPPM");
static_assert(sizeof(BP_EventTypeSwitchBase_C_SetupNoEventPPM) == 0x000080, "Wrong size on BP_EventTypeSwitchBase_C_SetupNoEventPPM");
static_assert(offsetof(BP_EventTypeSwitchBase_C_SetupNoEventPPM, PPM) == 0x000000, "Member 'BP_EventTypeSwitchBase_C_SetupNoEventPPM::PPM' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_SetupNoEventPPM, Mid) == 0x000028, "Member 'BP_EventTypeSwitchBase_C_SetupNoEventPPM::Mid' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_SetupNoEventPPM, PPM_MID) == 0x000030, "Member 'BP_EventTypeSwitchBase_C_SetupNoEventPPM::PPM_MID' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_SetupNoEventPPM, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_EventTypeSwitchBase_C_SetupNoEventPPM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_SetupNoEventPPM, CallFunc_IsValid_ReturnValue_1) == 0x000039, "Member 'BP_EventTypeSwitchBase_C_SetupNoEventPPM::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_SetupNoEventPPM, CallFunc_LoadSoftObject_ReturnValue) == 0x000040, "Member 'BP_EventTypeSwitchBase_C_SetupNoEventPPM::CallFunc_LoadSoftObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_SetupNoEventPPM, CallFunc_IsValid_ReturnValue_2) == 0x000048, "Member 'BP_EventTypeSwitchBase_C_SetupNoEventPPM::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_SetupNoEventPPM, K2Node_DynamicCast_AsMaterial_Interface) == 0x000050, "Member 'BP_EventTypeSwitchBase_C_SetupNoEventPPM::K2Node_DynamicCast_AsMaterial_Interface' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_SetupNoEventPPM, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_EventTypeSwitchBase_C_SetupNoEventPPM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_SetupNoEventPPM, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000060, "Member 'BP_EventTypeSwitchBase_C_SetupNoEventPPM::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_SetupNoEventPPM, CallFunc_AddActorComponent_ReturnValue) == 0x000068, "Member 'BP_EventTypeSwitchBase_C_SetupNoEventPPM::CallFunc_AddActorComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_SetupNoEventPPM, K2Node_DynamicCast_AsPost_Process_Component) == 0x000070, "Member 'BP_EventTypeSwitchBase_C_SetupNoEventPPM::K2Node_DynamicCast_AsPost_Process_Component' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_SetupNoEventPPM, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'BP_EventTypeSwitchBase_C_SetupNoEventPPM::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_EventTypeSwitchBase.BP_EventTypeSwitchBase_C.DestroyNoEventPPM
// 0x0001 (0x0001 - 0x0000)
struct BP_EventTypeSwitchBase_C_DestroyNoEventPPM final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventTypeSwitchBase_C_DestroyNoEventPPM) == 0x000001, "Wrong alignment on BP_EventTypeSwitchBase_C_DestroyNoEventPPM");
static_assert(sizeof(BP_EventTypeSwitchBase_C_DestroyNoEventPPM) == 0x000001, "Wrong size on BP_EventTypeSwitchBase_C_DestroyNoEventPPM");
static_assert(offsetof(BP_EventTypeSwitchBase_C_DestroyNoEventPPM, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_EventTypeSwitchBase_C_DestroyNoEventPPM::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_EventTypeSwitchBase.BP_EventTypeSwitchBase_C.UseNoEventPPM
// 0x0028 (0x0028 - 0x0000)
struct BP_EventTypeSwitchBase_C_UseNoEventPPM final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enabled;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31CF[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31D0[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventTypeSwitchBase_C_UseNoEventPPM) == 0x000008, "Wrong alignment on BP_EventTypeSwitchBase_C_UseNoEventPPM");
static_assert(sizeof(BP_EventTypeSwitchBase_C_UseNoEventPPM) == 0x000028, "Wrong size on BP_EventTypeSwitchBase_C_UseNoEventPPM");
static_assert(offsetof(BP_EventTypeSwitchBase_C_UseNoEventPPM, Material) == 0x000000, "Member 'BP_EventTypeSwitchBase_C_UseNoEventPPM::Material' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_UseNoEventPPM, Enabled) == 0x000008, "Member 'BP_EventTypeSwitchBase_C_UseNoEventPPM::Enabled' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_UseNoEventPPM, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00000C, "Member 'BP_EventTypeSwitchBase_C_UseNoEventPPM::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_UseNoEventPPM, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_EventTypeSwitchBase_C_UseNoEventPPM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventTypeSwitchBase_C_UseNoEventPPM, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000018, "Member 'BP_EventTypeSwitchBase_C_UseNoEventPPM::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");

}

