#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnemySpawnComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EnemySpawnComponent.BP_EnemySpawnComponent_C
// 0x00E0 (0x01A0 - 0x00C0)
class UBP_EnemySpawnComponent_C final : public UActorComponent
{
public:
	float                                         ScatterEffectScale;                                // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnEffectScale;                                  // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        StartEffect;                                       // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        BreakEffect;                                       // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OffsetLocation;                                    // 0x00D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisableSound;                                     // 0x00E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_510F[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UParticleSystem>         StartEffectSoftRef;                                // 0x00E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UParticleSystem>         BreakEffectSoftRef;                                // 0x0110(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FRotator                               OffsetRotation_enpc;                               // 0x0138(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FName                                   SocketName_enpc;                                   // 0x0144(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5110[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UParticleSystem>         StartEffectVisionSimulatorSoftRef;                 // 0x0150(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UParticleSystem>         BreakEffectVisionSimulatorSoftRef;                 // 0x0178(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void StartSpawnEffect(bool IsStartEffect, const struct FVector& Location, const struct FRotator& Rotation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EnemySpawnComponent_C">();
	}
	static class UBP_EnemySpawnComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_EnemySpawnComponent_C>();
	}
};
static_assert(alignof(UBP_EnemySpawnComponent_C) == 0x000008, "Wrong alignment on UBP_EnemySpawnComponent_C");
static_assert(sizeof(UBP_EnemySpawnComponent_C) == 0x0001A0, "Wrong size on UBP_EnemySpawnComponent_C");
static_assert(offsetof(UBP_EnemySpawnComponent_C, ScatterEffectScale) == 0x0000C0, "Member 'UBP_EnemySpawnComponent_C::ScatterEffectScale' has a wrong offset!");
static_assert(offsetof(UBP_EnemySpawnComponent_C, SpawnEffectScale) == 0x0000C4, "Member 'UBP_EnemySpawnComponent_C::SpawnEffectScale' has a wrong offset!");
static_assert(offsetof(UBP_EnemySpawnComponent_C, StartEffect) == 0x0000C8, "Member 'UBP_EnemySpawnComponent_C::StartEffect' has a wrong offset!");
static_assert(offsetof(UBP_EnemySpawnComponent_C, BreakEffect) == 0x0000D0, "Member 'UBP_EnemySpawnComponent_C::BreakEffect' has a wrong offset!");
static_assert(offsetof(UBP_EnemySpawnComponent_C, OffsetLocation) == 0x0000D8, "Member 'UBP_EnemySpawnComponent_C::OffsetLocation' has a wrong offset!");
static_assert(offsetof(UBP_EnemySpawnComponent_C, bDisableSound) == 0x0000E4, "Member 'UBP_EnemySpawnComponent_C::bDisableSound' has a wrong offset!");
static_assert(offsetof(UBP_EnemySpawnComponent_C, StartEffectSoftRef) == 0x0000E8, "Member 'UBP_EnemySpawnComponent_C::StartEffectSoftRef' has a wrong offset!");
static_assert(offsetof(UBP_EnemySpawnComponent_C, BreakEffectSoftRef) == 0x000110, "Member 'UBP_EnemySpawnComponent_C::BreakEffectSoftRef' has a wrong offset!");
static_assert(offsetof(UBP_EnemySpawnComponent_C, OffsetRotation_enpc) == 0x000138, "Member 'UBP_EnemySpawnComponent_C::OffsetRotation_enpc' has a wrong offset!");
static_assert(offsetof(UBP_EnemySpawnComponent_C, SocketName_enpc) == 0x000144, "Member 'UBP_EnemySpawnComponent_C::SocketName_enpc' has a wrong offset!");
static_assert(offsetof(UBP_EnemySpawnComponent_C, StartEffectVisionSimulatorSoftRef) == 0x000150, "Member 'UBP_EnemySpawnComponent_C::StartEffectVisionSimulatorSoftRef' has a wrong offset!");
static_assert(offsetof(UBP_EnemySpawnComponent_C, BreakEffectVisionSimulatorSoftRef) == 0x000178, "Member 'UBP_EnemySpawnComponent_C::BreakEffectVisionSimulatorSoftRef' has a wrong offset!");

}

