#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventSettings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EventSettings.BP_EventSettings_C
// 0x0800 (0x0A30 - 0x0230)
class ABP_EventSettings_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  EventManagerPostProcess;                           // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  SequencerPostProcess;                              // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  DynamicToStaticPostProcess;                        // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  StaticCutscenePostProcess;                         // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDynamicToStatic;                                 // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_70ED[0x3];                                     // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DynamicToStaticInterpolateTime;                    // 0x0264(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_70EE[0x8];                                     // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   CurentPostProcessSetting;                          // 0x0270(0x0780)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         SequencerPostProcessWeight;                        // 0x09F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         EventManagerPostProcessWeight;                     // 0x09F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EditorSetting;                                     // 0x09F8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor)
	uint8                                         Pad_70EF[0x3];                                     // 0x09F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RestoreShadowRes;                                  // 0x09FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RestoreShadowResPoint;                             // 0x0A00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RestoreShadowResSpot;                              // 0x0A04(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RestoreShadowResRect;                              // 0x0A08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DynamicToStaticTime;                               // 0x0A0C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StaticCutShadowRes;                                // 0x0A10(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StaticCutShadowResPointLight;                      // 0x0A14(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StaticCutShadowResSpotLight;                       // 0x0A18(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StaticCutShadowResRectLight;                       // 0x0A1C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SetupRestoreShadowRes;                             // 0x0A20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_EventSettings(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void StartEvent();
	void EndEvent();
	void SetupDynamicToStatic();
	void PrivateUpdate(float DeltaTimeSeconds);
	void StoreCurrentPPS();
	void StartStaticEventShadowRes();
	void RestoreStaticEventShadowRes();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EventSettings_C">();
	}
	static class ABP_EventSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EventSettings_C>();
	}
};
static_assert(alignof(ABP_EventSettings_C) == 0x000010, "Wrong alignment on ABP_EventSettings_C");
static_assert(sizeof(ABP_EventSettings_C) == 0x000A30, "Wrong size on ABP_EventSettings_C");
static_assert(offsetof(ABP_EventSettings_C, UberGraphFrame) == 0x000230, "Member 'ABP_EventSettings_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EventSettings_C, EventManagerPostProcess) == 0x000238, "Member 'ABP_EventSettings_C::EventManagerPostProcess' has a wrong offset!");
static_assert(offsetof(ABP_EventSettings_C, SequencerPostProcess) == 0x000240, "Member 'ABP_EventSettings_C::SequencerPostProcess' has a wrong offset!");
static_assert(offsetof(ABP_EventSettings_C, DynamicToStaticPostProcess) == 0x000248, "Member 'ABP_EventSettings_C::DynamicToStaticPostProcess' has a wrong offset!");
static_assert(offsetof(ABP_EventSettings_C, StaticCutscenePostProcess) == 0x000250, "Member 'ABP_EventSettings_C::StaticCutscenePostProcess' has a wrong offset!");
static_assert(offsetof(ABP_EventSettings_C, DefaultSceneRoot) == 0x000258, "Member 'ABP_EventSettings_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_EventSettings_C, IsDynamicToStatic) == 0x000260, "Member 'ABP_EventSettings_C::IsDynamicToStatic' has a wrong offset!");
static_assert(offsetof(ABP_EventSettings_C, DynamicToStaticInterpolateTime) == 0x000264, "Member 'ABP_EventSettings_C::DynamicToStaticInterpolateTime' has a wrong offset!");
static_assert(offsetof(ABP_EventSettings_C, CurentPostProcessSetting) == 0x000270, "Member 'ABP_EventSettings_C::CurentPostProcessSetting' has a wrong offset!");
static_assert(offsetof(ABP_EventSettings_C, SequencerPostProcessWeight) == 0x0009F0, "Member 'ABP_EventSettings_C::SequencerPostProcessWeight' has a wrong offset!");
static_assert(offsetof(ABP_EventSettings_C, EventManagerPostProcessWeight) == 0x0009F4, "Member 'ABP_EventSettings_C::EventManagerPostProcessWeight' has a wrong offset!");
static_assert(offsetof(ABP_EventSettings_C, EditorSetting) == 0x0009F8, "Member 'ABP_EventSettings_C::EditorSetting' has a wrong offset!");
static_assert(offsetof(ABP_EventSettings_C, RestoreShadowRes) == 0x0009FC, "Member 'ABP_EventSettings_C::RestoreShadowRes' has a wrong offset!");
static_assert(offsetof(ABP_EventSettings_C, RestoreShadowResPoint) == 0x000A00, "Member 'ABP_EventSettings_C::RestoreShadowResPoint' has a wrong offset!");
static_assert(offsetof(ABP_EventSettings_C, RestoreShadowResSpot) == 0x000A04, "Member 'ABP_EventSettings_C::RestoreShadowResSpot' has a wrong offset!");
static_assert(offsetof(ABP_EventSettings_C, RestoreShadowResRect) == 0x000A08, "Member 'ABP_EventSettings_C::RestoreShadowResRect' has a wrong offset!");
static_assert(offsetof(ABP_EventSettings_C, DynamicToStaticTime) == 0x000A0C, "Member 'ABP_EventSettings_C::DynamicToStaticTime' has a wrong offset!");
static_assert(offsetof(ABP_EventSettings_C, StaticCutShadowRes) == 0x000A10, "Member 'ABP_EventSettings_C::StaticCutShadowRes' has a wrong offset!");
static_assert(offsetof(ABP_EventSettings_C, StaticCutShadowResPointLight) == 0x000A14, "Member 'ABP_EventSettings_C::StaticCutShadowResPointLight' has a wrong offset!");
static_assert(offsetof(ABP_EventSettings_C, StaticCutShadowResSpotLight) == 0x000A18, "Member 'ABP_EventSettings_C::StaticCutShadowResSpotLight' has a wrong offset!");
static_assert(offsetof(ABP_EventSettings_C, StaticCutShadowResRectLight) == 0x000A1C, "Member 'ABP_EventSettings_C::StaticCutShadowResRectLight' has a wrong offset!");
static_assert(offsetof(ABP_EventSettings_C, SetupRestoreShadowRes) == 0x000A20, "Member 'ABP_EventSettings_C::SetupRestoreShadowRes' has a wrong offset!");

}

