#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventCaptureCamera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_CaptureCineCameraActor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EventCaptureCamera.BP_EventCaptureCamera_C
// 0x0F70 (0x19E0 - 0x0A70)
class ABP_EventCaptureCamera_C final : public ABP_CaptureCineCameraActor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_EventCaptureCamera_C;            // 0x0A70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_6665[0x8];                                     // 0x0A78(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   DefaultPPS;                                        // 0x0A80(0x0780)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UMaterialInterface>      PPOutlineAsset;                                    // 0x1200(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, HasGetValueTypeHash)
	class UMaterialInterface*                     PPOutlineObject;                                   // 0x1228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      PPOutlineFrontAsset;                               // 0x1230(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, HasGetValueTypeHash)
	class UMaterialInterface*                     PPOutlineFrontObject;                              // 0x1258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPostProcessSettings                   DefaultPPSOutlineFront;                            // 0x1260(0x0780)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_EventCaptureCamera(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void SetTicks(bool bEnabled);
	void SetCaptureCompFOVToCamComp();
	void GetDefaultPPS(struct FPostProcessSettings* PPS);
	void LoadAssets();
	void GetDefaultPPS_OutlineFront(struct FPostProcessSettings* PPS);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EventCaptureCamera_C">();
	}
	static class ABP_EventCaptureCamera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EventCaptureCamera_C>();
	}
};
static_assert(alignof(ABP_EventCaptureCamera_C) == 0x000010, "Wrong alignment on ABP_EventCaptureCamera_C");
static_assert(sizeof(ABP_EventCaptureCamera_C) == 0x0019E0, "Wrong size on ABP_EventCaptureCamera_C");
static_assert(offsetof(ABP_EventCaptureCamera_C, UberGraphFrame_BP_EventCaptureCamera_C) == 0x000A70, "Member 'ABP_EventCaptureCamera_C::UberGraphFrame_BP_EventCaptureCamera_C' has a wrong offset!");
static_assert(offsetof(ABP_EventCaptureCamera_C, DefaultPPS) == 0x000A80, "Member 'ABP_EventCaptureCamera_C::DefaultPPS' has a wrong offset!");
static_assert(offsetof(ABP_EventCaptureCamera_C, PPOutlineAsset) == 0x001200, "Member 'ABP_EventCaptureCamera_C::PPOutlineAsset' has a wrong offset!");
static_assert(offsetof(ABP_EventCaptureCamera_C, PPOutlineObject) == 0x001228, "Member 'ABP_EventCaptureCamera_C::PPOutlineObject' has a wrong offset!");
static_assert(offsetof(ABP_EventCaptureCamera_C, PPOutlineFrontAsset) == 0x001230, "Member 'ABP_EventCaptureCamera_C::PPOutlineFrontAsset' has a wrong offset!");
static_assert(offsetof(ABP_EventCaptureCamera_C, PPOutlineFrontObject) == 0x001258, "Member 'ABP_EventCaptureCamera_C::PPOutlineFrontObject' has a wrong offset!");
static_assert(offsetof(ABP_EventCaptureCamera_C, DefaultPPSOutlineFront) == 0x001260, "Member 'ABP_EventCaptureCamera_C::DefaultPPSOutlineFront' has a wrong offset!");

}

