#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnemyAvatarMaterial

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EnemyAvatarMaterial.BP_EnemyAvatarMaterial_C.ExecuteUbergraph_BP_EnemyAvatarMaterial
// 0x0050 (0x0050 - 0x0000)
struct BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_623B[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Update_Dummy;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_623C[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattleEnemy_C*                       K2Node_DynamicCast_AsRSBattle_Enemy;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_623D[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_623E[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial) == 0x000008, "Wrong alignment on BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial");
static_assert(sizeof(BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial) == 0x000050, "Wrong size on BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial, EntryPoint) == 0x000000, "Member 'BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial, CallFunc_Update_Dummy) == 0x000020, "Member 'BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial::CallFunc_Update_Dummy' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial, K2Node_DynamicCast_AsRSBattle_Enemy) == 0x000028, "Member 'BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial::K2Node_DynamicCast_AsRSBattle_Enemy' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial, CallFunc_Array_Get_Item) == 0x000034, "Member 'BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000044, "Member 'BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial, CallFunc_Array_Add_ReturnValue) == 0x000048, "Member 'BP_EnemyAvatarMaterial_C_ExecuteUbergraph_BP_EnemyAvatarMaterial::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_EnemyAvatarMaterial.BP_EnemyAvatarMaterial_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_EnemyAvatarMaterial_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyAvatarMaterial_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_EnemyAvatarMaterial_C_ReceiveTick");
static_assert(sizeof(BP_EnemyAvatarMaterial_C_ReceiveTick) == 0x000004, "Wrong size on BP_EnemyAvatarMaterial_C_ReceiveTick");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_EnemyAvatarMaterial_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_EnemyAvatarMaterial.BP_EnemyAvatarMaterial_C.Initialize
// 0x0008 (0x0008 - 0x0000)
struct BP_EnemyAvatarMaterial_C_Initialize final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Reverse;                                           // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyAvatarMaterial_C_Initialize) == 0x000004, "Wrong alignment on BP_EnemyAvatarMaterial_C_Initialize");
static_assert(sizeof(BP_EnemyAvatarMaterial_C_Initialize) == 0x000008, "Wrong size on BP_EnemyAvatarMaterial_C_Initialize");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_Initialize, Duration) == 0x000000, "Member 'BP_EnemyAvatarMaterial_C_Initialize::Duration' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_Initialize, Reverse) == 0x000004, "Member 'BP_EnemyAvatarMaterial_C_Initialize::Reverse' has a wrong offset!");

// Function BP_EnemyAvatarMaterial.BP_EnemyAvatarMaterial_C.Update
// 0x0024 (0x0024 - 0x0000)
struct BP_EnemyAvatarMaterial_C_Update final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_623F[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Alpha;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6240[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ApplyMaterial_bDummy;                     // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6241[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyAvatarMaterial_C_Update) == 0x000004, "Wrong alignment on BP_EnemyAvatarMaterial_C_Update");
static_assert(sizeof(BP_EnemyAvatarMaterial_C_Update) == 0x000024, "Wrong size on BP_EnemyAvatarMaterial_C_Update");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_Update, DeltaSeconds) == 0x000000, "Member 'BP_EnemyAvatarMaterial_C_Update::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_Update, Dummy) == 0x000004, "Member 'BP_EnemyAvatarMaterial_C_Update::Dummy' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_Update, Alpha) == 0x000008, "Member 'BP_EnemyAvatarMaterial_C_Update::Alpha' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_Update, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_EnemyAvatarMaterial_C_Update::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_Update, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00000D, "Member 'BP_EnemyAvatarMaterial_C_Update::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_Update, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_EnemyAvatarMaterial_C_Update::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_Update, CallFunc_ApplyMaterial_bDummy) == 0x000014, "Member 'BP_EnemyAvatarMaterial_C_Update::CallFunc_ApplyMaterial_bDummy' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_Update, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_EnemyAvatarMaterial_C_Update::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_Update, CallFunc_Add_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_EnemyAvatarMaterial_C_Update::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_Update, CallFunc_FClamp_ReturnValue) == 0x000020, "Member 'BP_EnemyAvatarMaterial_C_Update::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function BP_EnemyAvatarMaterial.BP_EnemyAvatarMaterial_C.Cancel
// 0x0008 (0x0008 - 0x0000)
struct BP_EnemyAvatarMaterial_C_Cancel final
{
public:
	float                                         Alpha;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDummy;                                            // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsComponentTickEnabled_ReturnValue;       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ApplyMaterial_bDummy;                     // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyAvatarMaterial_C_Cancel) == 0x000004, "Wrong alignment on BP_EnemyAvatarMaterial_C_Cancel");
static_assert(sizeof(BP_EnemyAvatarMaterial_C_Cancel) == 0x000008, "Wrong size on BP_EnemyAvatarMaterial_C_Cancel");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_Cancel, Alpha) == 0x000000, "Member 'BP_EnemyAvatarMaterial_C_Cancel::Alpha' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_Cancel, bDummy) == 0x000004, "Member 'BP_EnemyAvatarMaterial_C_Cancel::bDummy' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_Cancel, CallFunc_IsComponentTickEnabled_ReturnValue) == 0x000005, "Member 'BP_EnemyAvatarMaterial_C_Cancel::CallFunc_IsComponentTickEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_Cancel, CallFunc_ApplyMaterial_bDummy) == 0x000006, "Member 'BP_EnemyAvatarMaterial_C_Cancel::CallFunc_ApplyMaterial_bDummy' has a wrong offset!");

// Function BP_EnemyAvatarMaterial.BP_EnemyAvatarMaterial_C.ApplyMaterial
// 0x0028 (0x0028 - 0x0000)
struct BP_EnemyAvatarMaterial_C_ApplyMaterial final
{
public:
	float                                         Alpha;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDummy;                                            // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EEasingFunc                                   Fnc;                                               // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6242[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6243[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyAvatarMaterial_C_ApplyMaterial) == 0x000004, "Wrong alignment on BP_EnemyAvatarMaterial_C_ApplyMaterial");
static_assert(sizeof(BP_EnemyAvatarMaterial_C_ApplyMaterial) == 0x000028, "Wrong size on BP_EnemyAvatarMaterial_C_ApplyMaterial");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ApplyMaterial, Alpha) == 0x000000, "Member 'BP_EnemyAvatarMaterial_C_ApplyMaterial::Alpha' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ApplyMaterial, bDummy) == 0x000004, "Member 'BP_EnemyAvatarMaterial_C_ApplyMaterial::bDummy' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ApplyMaterial, Fnc) == 0x000005, "Member 'BP_EnemyAvatarMaterial_C_ApplyMaterial::Fnc' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ApplyMaterial, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_EnemyAvatarMaterial_C_ApplyMaterial::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ApplyMaterial, Temp_int_Loop_Num_Variable) == 0x00000C, "Member 'BP_EnemyAvatarMaterial_C_ApplyMaterial::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ApplyMaterial, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_EnemyAvatarMaterial_C_ApplyMaterial::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ApplyMaterial, CallFunc_Less_IntInt_ReturnValue) == 0x000014, "Member 'BP_EnemyAvatarMaterial_C_ApplyMaterial::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ApplyMaterial, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_EnemyAvatarMaterial_C_ApplyMaterial::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ApplyMaterial, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_EnemyAvatarMaterial_C_ApplyMaterial::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ApplyMaterial, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_EnemyAvatarMaterial_C_ApplyMaterial::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EnemyAvatarMaterial_C_ApplyMaterial, CallFunc_Ease_ReturnValue) == 0x000024, "Member 'BP_EnemyAvatarMaterial_C_ApplyMaterial::CallFunc_Ease_ReturnValue' has a wrong offset!");

}

