#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_en_BattleField

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_en_BattleField.BP_en_BattleField_C.ExecuteUbergraph_BP_en_BattleField
// 0x01A8 (0x01A8 - 0x0000)
struct BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_Variable_1;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8ADA[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Enable;                               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Visible;                              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8ADB[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8ADC[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8ADD[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_HitComponent;                   // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_NormalImpulse;                  // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x0084(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8ADE[0x2];                                     // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8ADF[0x4];                                     // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager;           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue;                    // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AE0[0x2];                                     // 0x01A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField) == 0x000008, "Wrong alignment on BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField");
static_assert(sizeof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField) == 0x0001A8, "Wrong size on BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, EntryPoint) == 0x000000, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, Temp_float_Variable) == 0x000004, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, Temp_float_Variable_1) == 0x000018, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, Temp_int_Array_Index_Variable) == 0x000024, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, Temp_int_Loop_Num_Variable) == 0x000028, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, Temp_int_Array_Index_Variable_1) == 0x000030, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, K2Node_Event_Enable) == 0x000034, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::K2Node_Event_Enable' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, K2Node_Event_Visible) == 0x000035, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::K2Node_Event_Visible' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, Temp_int_Loop_Counter_Variable_1) == 0x000038, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_Add_IntInt_ReturnValue_1) == 0x00003C, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_Less_IntInt_ReturnValue_1) == 0x00004C, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, K2Node_Event_OtherActor) == 0x000050, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, K2Node_Event_DeltaSeconds) == 0x000058, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, K2Node_CustomEvent_HitComponent) == 0x000060, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::K2Node_CustomEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, K2Node_CustomEvent_OtherActor) == 0x000068, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, K2Node_CustomEvent_OtherComp) == 0x000070, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, K2Node_CustomEvent_NormalImpulse) == 0x000078, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::K2Node_CustomEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, K2Node_CustomEvent_Hit) == 0x000084, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_BreakHitResult_bBlockingHit) == 0x00010C, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_BreakHitResult_bInitialOverlap) == 0x00010D, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_BreakHitResult_Time) == 0x000110, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_BreakHitResult_Distance) == 0x000114, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_BreakHitResult_Location) == 0x000118, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_BreakHitResult_ImpactPoint) == 0x000124, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_BreakHitResult_Normal) == 0x000130, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_BreakHitResult_ImpactNormal) == 0x00013C, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_BreakHitResult_PhysMat) == 0x000148, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_BreakHitResult_HitActor) == 0x000150, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_BreakHitResult_HitComponent) == 0x000158, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_BreakHitResult_HitBoneName) == 0x000160, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_BreakHitResult_HitItem) == 0x000168, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_BreakHitResult_FaceIndex) == 0x00016C, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_BreakHitResult_TraceStart) == 0x000170, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_BreakHitResult_TraceEnd) == 0x00017C, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_Array_Length_ReturnValue_1) == 0x000188, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_GetPlayerManager_PlayerManager) == 0x000190, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_GetPlayer_ReturnValue) == 0x000198, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_GetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001A0, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, Temp_bool_Variable) == 0x0001A1, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField, K2Node_Select_Default) == 0x0001A4, "Member 'BP_en_BattleField_C_ExecuteUbergraph_BP_en_BattleField::K2Node_Select_Default' has a wrong offset!");

// Function BP_en_BattleField.BP_en_BattleField_C.OnComponentHit_§ŸÛ»_0
// 0x00B0 (0x00B0 - 0x0000)
struct BP_en_BattleField_C_OnComponentHit______0 final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0024(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_en_BattleField_C_OnComponentHit______0) == 0x000008, "Wrong alignment on BP_en_BattleField_C_OnComponentHit______0");
static_assert(sizeof(BP_en_BattleField_C_OnComponentHit______0) == 0x0000B0, "Wrong size on BP_en_BattleField_C_OnComponentHit______0");
static_assert(offsetof(BP_en_BattleField_C_OnComponentHit______0, HitComponent) == 0x000000, "Member 'BP_en_BattleField_C_OnComponentHit______0::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_OnComponentHit______0, OtherActor) == 0x000008, "Member 'BP_en_BattleField_C_OnComponentHit______0::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_OnComponentHit______0, OtherComp) == 0x000010, "Member 'BP_en_BattleField_C_OnComponentHit______0::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_OnComponentHit______0, NormalImpulse) == 0x000018, "Member 'BP_en_BattleField_C_OnComponentHit______0::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_OnComponentHit______0, Hit) == 0x000024, "Member 'BP_en_BattleField_C_OnComponentHit______0::Hit' has a wrong offset!");

// Function BP_en_BattleField.BP_en_BattleField_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_en_BattleField_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_en_BattleField_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_en_BattleField_C_ReceiveTick");
static_assert(sizeof(BP_en_BattleField_C_ReceiveTick) == 0x000004, "Wrong size on BP_en_BattleField_C_ReceiveTick");
static_assert(offsetof(BP_en_BattleField_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_en_BattleField_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_en_BattleField.BP_en_BattleField_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_en_BattleField_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_en_BattleField_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_en_BattleField_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_en_BattleField_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_en_BattleField_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_en_BattleField_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_en_BattleField_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_en_BattleField.BP_en_BattleField_C.SetBattlefieldVisibleForce
// 0x0001 (0x0001 - 0x0000)
struct BP_en_BattleField_C_SetBattlefieldVisibleForce final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_en_BattleField_C_SetBattlefieldVisibleForce) == 0x000001, "Wrong alignment on BP_en_BattleField_C_SetBattlefieldVisibleForce");
static_assert(sizeof(BP_en_BattleField_C_SetBattlefieldVisibleForce) == 0x000001, "Wrong size on BP_en_BattleField_C_SetBattlefieldVisibleForce");
static_assert(offsetof(BP_en_BattleField_C_SetBattlefieldVisibleForce, Visible) == 0x000000, "Member 'BP_en_BattleField_C_SetBattlefieldVisibleForce::Visible' has a wrong offset!");

// Function BP_en_BattleField.BP_en_BattleField_C.SetBattlefieldEnable
// 0x0001 (0x0001 - 0x0000)
struct BP_en_BattleField_C_SetBattlefieldEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_en_BattleField_C_SetBattlefieldEnable) == 0x000001, "Wrong alignment on BP_en_BattleField_C_SetBattlefieldEnable");
static_assert(sizeof(BP_en_BattleField_C_SetBattlefieldEnable) == 0x000001, "Wrong size on BP_en_BattleField_C_SetBattlefieldEnable");
static_assert(offsetof(BP_en_BattleField_C_SetBattlefieldEnable, Enable) == 0x000000, "Member 'BP_en_BattleField_C_SetBattlefieldEnable::Enable' has a wrong offset!");

// Function BP_en_BattleField.BP_en_BattleField_C.SetBattlefieldEnableOld
// 0x0038 (0x0038 - 0x0000)
struct BP_en_BattleField_C_SetBattlefieldEnableOld final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AE1[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AE2[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionEnabled                             Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8AE3[0x1];                                     // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AE4[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             K2Node_Select_Default_1;                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AE5[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_en_BattleField_C_SetBattlefieldEnableOld) == 0x000008, "Wrong alignment on BP_en_BattleField_C_SetBattlefieldEnableOld");
static_assert(sizeof(BP_en_BattleField_C_SetBattlefieldEnableOld) == 0x000038, "Wrong size on BP_en_BattleField_C_SetBattlefieldEnableOld");
static_assert(offsetof(BP_en_BattleField_C_SetBattlefieldEnableOld, Enable) == 0x000000, "Member 'BP_en_BattleField_C_SetBattlefieldEnableOld::Enable' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_SetBattlefieldEnableOld, Temp_float_Variable) == 0x000004, "Member 'BP_en_BattleField_C_SetBattlefieldEnableOld::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_SetBattlefieldEnableOld, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'BP_en_BattleField_C_SetBattlefieldEnableOld::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_SetBattlefieldEnableOld, Temp_float_Variable_1) == 0x00000C, "Member 'BP_en_BattleField_C_SetBattlefieldEnableOld::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_SetBattlefieldEnableOld, Temp_bool_Variable) == 0x000010, "Member 'BP_en_BattleField_C_SetBattlefieldEnableOld::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_SetBattlefieldEnableOld, Temp_byte_Variable) == 0x000011, "Member 'BP_en_BattleField_C_SetBattlefieldEnableOld::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_SetBattlefieldEnableOld, Temp_byte_Variable_1) == 0x000012, "Member 'BP_en_BattleField_C_SetBattlefieldEnableOld::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_SetBattlefieldEnableOld, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_en_BattleField_C_SetBattlefieldEnableOld::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_SetBattlefieldEnableOld, Temp_bool_Variable_1) == 0x000018, "Member 'BP_en_BattleField_C_SetBattlefieldEnableOld::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_SetBattlefieldEnableOld, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_en_BattleField_C_SetBattlefieldEnableOld::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_SetBattlefieldEnableOld, K2Node_Select_Default) == 0x000020, "Member 'BP_en_BattleField_C_SetBattlefieldEnableOld::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_SetBattlefieldEnableOld, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_en_BattleField_C_SetBattlefieldEnableOld::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_SetBattlefieldEnableOld, K2Node_Select_Default_1) == 0x000028, "Member 'BP_en_BattleField_C_SetBattlefieldEnableOld::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_SetBattlefieldEnableOld, CallFunc_Less_IntInt_ReturnValue) == 0x000029, "Member 'BP_en_BattleField_C_SetBattlefieldEnableOld::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_SetBattlefieldEnableOld, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_en_BattleField_C_SetBattlefieldEnableOld::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_SetBattlefieldEnableOld, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_en_BattleField_C_SetBattlefieldEnableOld::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BP_en_BattleField.BP_en_BattleField_C.UpdateFence
// 0x0008 (0x0008 - 0x0000)
struct BP_en_BattleField_C_UpdateFence final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_en_BattleField_C_UpdateFence) == 0x000004, "Wrong alignment on BP_en_BattleField_C_UpdateFence");
static_assert(sizeof(BP_en_BattleField_C_UpdateFence) == 0x000008, "Wrong size on BP_en_BattleField_C_UpdateFence");
static_assert(offsetof(BP_en_BattleField_C_UpdateFence, DeltaSeconds) == 0x000000, "Member 'BP_en_BattleField_C_UpdateFence::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_UpdateFence, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'BP_en_BattleField_C_UpdateFence::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_en_BattleField.BP_en_BattleField_C.SetVisible
// 0x0002 (0x0002 - 0x0000)
struct BP_en_BattleField_C_SetVisible final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_en_BattleField_C_SetVisible) == 0x000001, "Wrong alignment on BP_en_BattleField_C_SetVisible");
static_assert(sizeof(BP_en_BattleField_C_SetVisible) == 0x000002, "Wrong size on BP_en_BattleField_C_SetVisible");
static_assert(offsetof(BP_en_BattleField_C_SetVisible, Visible) == 0x000000, "Member 'BP_en_BattleField_C_SetVisible::Visible' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_SetVisible, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'BP_en_BattleField_C_SetVisible::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_en_BattleField.BP_en_BattleField_C.UpdateFenceStart
// 0x0010 (0x0010 - 0x0000)
struct BP_en_BattleField_C_UpdateFenceStart final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AE6[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_en_BattleField_C_UpdateFenceStart) == 0x000004, "Wrong alignment on BP_en_BattleField_C_UpdateFenceStart");
static_assert(sizeof(BP_en_BattleField_C_UpdateFenceStart) == 0x000010, "Wrong size on BP_en_BattleField_C_UpdateFenceStart");
static_assert(offsetof(BP_en_BattleField_C_UpdateFenceStart, DeltaSeconds) == 0x000000, "Member 'BP_en_BattleField_C_UpdateFenceStart::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_UpdateFenceStart, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_en_BattleField_C_UpdateFenceStart::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_UpdateFenceStart, CallFunc_Add_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_en_BattleField_C_UpdateFenceStart::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_UpdateFenceStart, CallFunc_FClamp_ReturnValue) == 0x00000C, "Member 'BP_en_BattleField_C_UpdateFenceStart::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function BP_en_BattleField.BP_en_BattleField_C.UpdateFenceEnd
// 0x0010 (0x0010 - 0x0000)
struct BP_en_BattleField_C_UpdateFenceEnd final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AE7[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_en_BattleField_C_UpdateFenceEnd) == 0x000004, "Wrong alignment on BP_en_BattleField_C_UpdateFenceEnd");
static_assert(sizeof(BP_en_BattleField_C_UpdateFenceEnd) == 0x000010, "Wrong size on BP_en_BattleField_C_UpdateFenceEnd");
static_assert(offsetof(BP_en_BattleField_C_UpdateFenceEnd, DeltaSeconds) == 0x000000, "Member 'BP_en_BattleField_C_UpdateFenceEnd::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_UpdateFenceEnd, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_en_BattleField_C_UpdateFenceEnd::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_UpdateFenceEnd, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_en_BattleField_C_UpdateFenceEnd::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_UpdateFenceEnd, CallFunc_FClamp_ReturnValue) == 0x00000C, "Member 'BP_en_BattleField_C_UpdateFenceEnd::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function BP_en_BattleField.BP_en_BattleField_C.CheckBrainTalk
// 0x0040 (0x0040 - 0x0000)
struct BP_en_BattleField_C_CheckBrainTalk final
{
public:
	float                                         DeltaSec;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AE8[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABrainTalkManager*                      CallFunc_GetBrainTalkManager_BrainTalkManager;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BrainTalkBt_TouchBFWall_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AE9[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AEA[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_en_BattleField_C_CheckBrainTalk) == 0x000008, "Wrong alignment on BP_en_BattleField_C_CheckBrainTalk");
static_assert(sizeof(BP_en_BattleField_C_CheckBrainTalk) == 0x000040, "Wrong size on BP_en_BattleField_C_CheckBrainTalk");
static_assert(offsetof(BP_en_BattleField_C_CheckBrainTalk, DeltaSec) == 0x000000, "Member 'BP_en_BattleField_C_CheckBrainTalk::DeltaSec' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_CheckBrainTalk, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_en_BattleField_C_CheckBrainTalk::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_CheckBrainTalk, CallFunc_GetBrainTalkManager_BrainTalkManager) == 0x000008, "Member 'BP_en_BattleField_C_CheckBrainTalk::CallFunc_GetBrainTalkManager_BrainTalkManager' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_CheckBrainTalk, CallFunc_BrainTalkBt_TouchBFWall_ReturnValue) == 0x000010, "Member 'BP_en_BattleField_C_CheckBrainTalk::CallFunc_BrainTalkBt_TouchBFWall_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_CheckBrainTalk, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000011, "Member 'BP_en_BattleField_C_CheckBrainTalk::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_CheckBrainTalk, CallFunc_Add_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_en_BattleField_C_CheckBrainTalk::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_CheckBrainTalk, CallFunc_GetPlayerManager_PlayerManager) == 0x000018, "Member 'BP_en_BattleField_C_CheckBrainTalk::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_CheckBrainTalk, CallFunc_GetPlayer_ReturnValue) == 0x000020, "Member 'BP_en_BattleField_C_CheckBrainTalk::CallFunc_GetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_CheckBrainTalk, CallFunc_BooleanAND_ReturnValue) == 0x000028, "Member 'BP_en_BattleField_C_CheckBrainTalk::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_CheckBrainTalk, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00002C, "Member 'BP_en_BattleField_C_CheckBrainTalk::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_CheckBrainTalk, CallFunc_Vector_Distance_ReturnValue) == 0x000038, "Member 'BP_en_BattleField_C_CheckBrainTalk::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_CheckBrainTalk, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x00003C, "Member 'BP_en_BattleField_C_CheckBrainTalk::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");

// Function BP_en_BattleField.BP_en_BattleField_C.GetBattlefieldSpline
// 0x0008 (0x0008 - 0x0000)
struct BP_en_BattleField_C_GetBattlefieldSpline final
{
public:
	class USplineComponent*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_en_BattleField_C_GetBattlefieldSpline) == 0x000008, "Wrong alignment on BP_en_BattleField_C_GetBattlefieldSpline");
static_assert(sizeof(BP_en_BattleField_C_GetBattlefieldSpline) == 0x000008, "Wrong size on BP_en_BattleField_C_GetBattlefieldSpline");
static_assert(offsetof(BP_en_BattleField_C_GetBattlefieldSpline, ReturnValue) == 0x000000, "Member 'BP_en_BattleField_C_GetBattlefieldSpline::ReturnValue' has a wrong offset!");

// Function BP_en_BattleField.BP_en_BattleField_C.GetBattlefieldEnable
// 0x0004 (0x0004 - 0x0000)
struct BP_en_BattleField_C_GetBattlefieldEnable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_en_BattleField_C_GetBattlefieldEnable) == 0x000001, "Wrong alignment on BP_en_BattleField_C_GetBattlefieldEnable");
static_assert(sizeof(BP_en_BattleField_C_GetBattlefieldEnable) == 0x000004, "Wrong size on BP_en_BattleField_C_GetBattlefieldEnable");
static_assert(offsetof(BP_en_BattleField_C_GetBattlefieldEnable, ReturnValue) == 0x000000, "Member 'BP_en_BattleField_C_GetBattlefieldEnable::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_GetBattlefieldEnable, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BP_en_BattleField_C_GetBattlefieldEnable::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_en_BattleField_C_GetBattlefieldEnable, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000002, "Member 'BP_en_BattleField_C_GetBattlefieldEnable::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
