#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnemyTransformationComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_EnemyTransformationComponent.BP_EnemyTransformationComponent_C.ExecuteUbergraph_BP_EnemyTransformationComponent
// 0x0040 (0x0040 - 0x0000)
struct BP_EnemyTransformationComponent_C_ExecuteUbergraph_BP_EnemyTransformationComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5025[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5026[0xC];                                     // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_GetScreenUVRectFromBoundSphere_Rect;      // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyTransformationComponent_C_ExecuteUbergraph_BP_EnemyTransformationComponent) == 0x000010, "Wrong alignment on BP_EnemyTransformationComponent_C_ExecuteUbergraph_BP_EnemyTransformationComponent");
static_assert(sizeof(BP_EnemyTransformationComponent_C_ExecuteUbergraph_BP_EnemyTransformationComponent) == 0x000040, "Wrong size on BP_EnemyTransformationComponent_C_ExecuteUbergraph_BP_EnemyTransformationComponent");
static_assert(offsetof(BP_EnemyTransformationComponent_C_ExecuteUbergraph_BP_EnemyTransformationComponent, EntryPoint) == 0x000000, "Member 'BP_EnemyTransformationComponent_C_ExecuteUbergraph_BP_EnemyTransformationComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_ExecuteUbergraph_BP_EnemyTransformationComponent, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_EnemyTransformationComponent_C_ExecuteUbergraph_BP_EnemyTransformationComponent::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_ExecuteUbergraph_BP_EnemyTransformationComponent, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_EnemyTransformationComponent_C_ExecuteUbergraph_BP_EnemyTransformationComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_ExecuteUbergraph_BP_EnemyTransformationComponent, CallFunc_GetScreenUVRectFromBoundSphere_Rect) == 0x000020, "Member 'BP_EnemyTransformationComponent_C_ExecuteUbergraph_BP_EnemyTransformationComponent::CallFunc_GetScreenUVRectFromBoundSphere_Rect' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_ExecuteUbergraph_BP_EnemyTransformationComponent, K2Node_MakeStruct_LinearColor) == 0x000030, "Member 'BP_EnemyTransformationComponent_C_ExecuteUbergraph_BP_EnemyTransformationComponent::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function BP_EnemyTransformationComponent.BP_EnemyTransformationComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_EnemyTransformationComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyTransformationComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_EnemyTransformationComponent_C_ReceiveTick");
static_assert(sizeof(BP_EnemyTransformationComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_EnemyTransformationComponent_C_ReceiveTick");
static_assert(offsetof(BP_EnemyTransformationComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_EnemyTransformationComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_EnemyTransformationComponent.BP_EnemyTransformationComponent_C.Initialize
// 0x0148 (0x0148 - 0x0000)
struct BP_EnemyTransformationComponent_C_Initialize final
{
public:
	class AActor*                                 ParentActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 ParentSkeletalMesh;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_WeaponBase_C*                       Weapon;                                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5027[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5028[0x1];                                     // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5029[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_502A[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_502B[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetExtraMesh_ExtraMesh;                   // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_502C[0x6];                                     // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface;         // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_502D[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_WeaponBase_C*>               CallFunc_GetPlayerWeaponList_WeaponList;           // 0x0088(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_SearchMeshMaterialFromSlotName_ReturnValue; // 0x0098(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_502E[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_502F[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface;           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5030[0x6];                                     // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5031[0x2];                                     // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_1; // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5032[0x6];                                     // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_AddActorComponent_ReturnValue;            // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  K2Node_DynamicCast_AsPost_Process_Component;       // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5033[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue_1;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface_1;         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5034[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyTransformationComponent_C_Initialize) == 0x000008, "Wrong alignment on BP_EnemyTransformationComponent_C_Initialize");
static_assert(sizeof(BP_EnemyTransformationComponent_C_Initialize) == 0x000148, "Wrong size on BP_EnemyTransformationComponent_C_Initialize");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, ParentActor) == 0x000000, "Member 'BP_EnemyTransformationComponent_C_Initialize::ParentActor' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, ParentSkeletalMesh) == 0x000008, "Member 'BP_EnemyTransformationComponent_C_Initialize::ParentSkeletalMesh' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, Weapon) == 0x000010, "Member 'BP_EnemyTransformationComponent_C_Initialize::Weapon' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, Temp_int_Variable) == 0x000018, "Member 'BP_EnemyTransformationComponent_C_Initialize::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_Conv_IntToByte_ReturnValue) == 0x00001C, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_GetValidValue_ReturnValue) == 0x00001D, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, Temp_int_Variable_1) == 0x000020, "Member 'BP_EnemyTransformationComponent_C_Initialize::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000029, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x00002A, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00002C, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_IsValid_ReturnValue_2) == 0x000031, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, Temp_int_Loop_Num_Variable) == 0x000034, "Member 'BP_EnemyTransformationComponent_C_Initialize::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'BP_EnemyTransformationComponent_C_Initialize::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'BP_EnemyTransformationComponent_C_Initialize::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_IsValid_ReturnValue_3) == 0x000048, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_GetExtraMesh_ExtraMesh) == 0x000050, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_GetExtraMesh_ExtraMesh' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_Array_Add_ReturnValue) == 0x000060, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_MakeLiteralInt_ReturnValue) == 0x000064, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_IsValid_ReturnValue_4) == 0x000068, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_Less_IntInt_ReturnValue_1) == 0x000069, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, K2Node_DynamicCast_AsBPI_Player_Interface) == 0x000070, "Member 'BP_EnemyTransformationComponent_C_Initialize::K2Node_DynamicCast_AsBPI_Player_Interface' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'BP_EnemyTransformationComponent_C_Initialize::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_GetPlayerWeaponList_WeaponList) == 0x000088, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_GetPlayerWeaponList_WeaponList' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_SearchMeshMaterialFromSlotName_ReturnValue) == 0x000098, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_SearchMeshMaterialFromSlotName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000A8, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000B0, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x0000C0, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_LoadSoftObject_ReturnValue) == 0x0000D0, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_LoadSoftObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, K2Node_DynamicCast_AsMaterial_Interface) == 0x0000D8, "Member 'BP_EnemyTransformationComponent_C_Initialize::K2Node_DynamicCast_AsMaterial_Interface' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'BP_EnemyTransformationComponent_C_Initialize::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_IsValid_ReturnValue_5) == 0x0000E1, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x0000E8, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_IsValid_ReturnValue_6) == 0x0000F0, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_IsValid_ReturnValue_7) == 0x0000F1, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_IsValid_ReturnValue_8) == 0x0000F2, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_BooleanAND_ReturnValue) == 0x0000F3, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_BooleanAND_ReturnValue_1) == 0x0000F4, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_BooleanAND_ReturnValue_2) == 0x0000F5, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_1) == 0x0000F8, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_BooleanAND_ReturnValue_3) == 0x000108, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_IsValid_ReturnValue_9) == 0x000109, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_AddActorComponent_ReturnValue) == 0x000110, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_AddActorComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, K2Node_DynamicCast_AsPost_Process_Component) == 0x000118, "Member 'BP_EnemyTransformationComponent_C_Initialize::K2Node_DynamicCast_AsPost_Process_Component' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, K2Node_DynamicCast_bSuccess_2) == 0x000120, "Member 'BP_EnemyTransformationComponent_C_Initialize::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_LoadSoftObject_ReturnValue_1) == 0x000128, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_LoadSoftObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, K2Node_DynamicCast_AsMaterial_Interface_1) == 0x000130, "Member 'BP_EnemyTransformationComponent_C_Initialize::K2Node_DynamicCast_AsMaterial_Interface_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, K2Node_DynamicCast_bSuccess_3) == 0x000138, "Member 'BP_EnemyTransformationComponent_C_Initialize::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Initialize, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000140, "Member 'BP_EnemyTransformationComponent_C_Initialize::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");

// Function BP_EnemyTransformationComponent.BP_EnemyTransformationComponent_C.StartIn
// 0x0028 (0x0028 - 0x0000)
struct BP_EnemyTransformationComponent_C_StartIn final
{
public:
	bool                                          bCancel;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5035[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5036[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyTransformationComponent_C_StartIn) == 0x000008, "Wrong alignment on BP_EnemyTransformationComponent_C_StartIn");
static_assert(sizeof(BP_EnemyTransformationComponent_C_StartIn) == 0x000028, "Wrong size on BP_EnemyTransformationComponent_C_StartIn");
static_assert(offsetof(BP_EnemyTransformationComponent_C_StartIn, bCancel) == 0x000000, "Member 'BP_EnemyTransformationComponent_C_StartIn::bCancel' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_StartIn, K2Node_DynamicCast_AsRSBattle_Player) == 0x000008, "Member 'BP_EnemyTransformationComponent_C_StartIn::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_StartIn, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_EnemyTransformationComponent_C_StartIn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_StartIn, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000018, "Member 'BP_EnemyTransformationComponent_C_StartIn::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");

// Function BP_EnemyTransformationComponent.BP_EnemyTransformationComponent_C.PrivateUpdateTransformation
// 0x00A0 (0x00A0 - 0x0000)
struct BP_EnemyTransformationComponent_C_PrivateUpdateTransformation final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5037[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        RibbonEffectType;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CurveValue;                                        // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeRange_MinTime;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeRange_MaxTime;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5038[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5039[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PostProcessManager_C*               CallFunc_GetPostProcessManager_Manager;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_503A[0x5];                                     // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_503B[0x6];                                     // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVectorValue_ReturnValue;               // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_503C[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_UpdateTimer_ReturnValue;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation) == 0x000008, "Wrong alignment on BP_EnemyTransformationComponent_C_PrivateUpdateTransformation");
static_assert(sizeof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation) == 0x0000A0, "Wrong size on BP_EnemyTransformationComponent_C_PrivateUpdateTransformation");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, DeltaSeconds) == 0x000000, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, RibbonEffectType) == 0x000008, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::RibbonEffectType' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, CurveValue) == 0x000010, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::CurveValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, CallFunc_GetTimeRange_MinTime) == 0x00001C, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::CallFunc_GetTimeRange_MinTime' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, CallFunc_GetTimeRange_MaxTime) == 0x000020, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::CallFunc_GetTimeRange_MaxTime' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, K2Node_DynamicCast_AsRSBattle_Player) == 0x000028, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, CallFunc_GetPostProcessManager_Manager) == 0x000038, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::CallFunc_GetPostProcessManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000042, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000048, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, CallFunc_BreakVector_X) == 0x000050, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, CallFunc_BreakVector_Y) == 0x000054, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, CallFunc_BreakVector_Z) == 0x000058, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, CallFunc_BreakVector_X_1) == 0x00005C, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, CallFunc_BreakVector_Y_1) == 0x000060, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, CallFunc_BreakVector_Z_1) == 0x000064, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, CallFunc_IsValid_ReturnValue_2) == 0x000068, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000069, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000070, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, CallFunc_GetVectorValue_ReturnValue) == 0x000080, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::CallFunc_GetVectorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00008C, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000090, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, CallFunc_UpdateTimer_ReturnValue) == 0x000094, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::CallFunc_UpdateTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000098, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateTransformation, CallFunc_Add_FloatFloat_ReturnValue) == 0x00009C, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateTransformation::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_EnemyTransformationComponent.BP_EnemyTransformationComponent_C.PrivateStart
// 0x0010 (0x0010 - 0x0000)
struct BP_EnemyTransformationComponent_C_PrivateStart final
{
public:
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_503D[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyTransformationComponent_C_PrivateStart) == 0x000008, "Wrong alignment on BP_EnemyTransformationComponent_C_PrivateStart");
static_assert(sizeof(BP_EnemyTransformationComponent_C_PrivateStart) == 0x000010, "Wrong size on BP_EnemyTransformationComponent_C_PrivateStart");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateStart, CallFunc_BooleanOR_ReturnValue) == 0x000000, "Member 'BP_EnemyTransformationComponent_C_PrivateStart::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateStart, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000008, "Member 'BP_EnemyTransformationComponent_C_PrivateStart::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");

// Function BP_EnemyTransformationComponent.BP_EnemyTransformationComponent_C.Start Out
// 0x0030 (0x0030 - 0x0000)
struct BP_EnemyTransformationComponent_C_Start_Out final
{
public:
	bool                                          bCancel;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Param_bBfCancel;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_503E[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeRange_MinTime;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeRange_MaxTime;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_503F[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5040[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyTransformationComponent_C_Start_Out) == 0x000008, "Wrong alignment on BP_EnemyTransformationComponent_C_Start_Out");
static_assert(sizeof(BP_EnemyTransformationComponent_C_Start_Out) == 0x000030, "Wrong size on BP_EnemyTransformationComponent_C_Start_Out");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Start_Out, bCancel) == 0x000000, "Member 'BP_EnemyTransformationComponent_C_Start_Out::bCancel' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Start_Out, Param_bBfCancel) == 0x000001, "Member 'BP_EnemyTransformationComponent_C_Start_Out::Param_bBfCancel' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Start_Out, CallFunc_GetTimeRange_MinTime) == 0x000004, "Member 'BP_EnemyTransformationComponent_C_Start_Out::CallFunc_GetTimeRange_MinTime' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Start_Out, CallFunc_GetTimeRange_MaxTime) == 0x000008, "Member 'BP_EnemyTransformationComponent_C_Start_Out::CallFunc_GetTimeRange_MaxTime' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Start_Out, K2Node_DynamicCast_AsRSBattle_Player) == 0x000010, "Member 'BP_EnemyTransformationComponent_C_Start_Out::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Start_Out, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_EnemyTransformationComponent_C_Start_Out::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_Start_Out, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000020, "Member 'BP_EnemyTransformationComponent_C_Start_Out::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");

// Function BP_EnemyTransformationComponent.BP_EnemyTransformationComponent_C.OnDamage
// 0x0010 (0x0010 - 0x0000)
struct BP_EnemyTransformationComponent_C_OnDamage final
{
public:
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyTransformationComponent_C_OnDamage) == 0x000008, "Wrong alignment on BP_EnemyTransformationComponent_C_OnDamage");
static_assert(sizeof(BP_EnemyTransformationComponent_C_OnDamage) == 0x000010, "Wrong size on BP_EnemyTransformationComponent_C_OnDamage");
static_assert(offsetof(BP_EnemyTransformationComponent_C_OnDamage, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000000, "Member 'BP_EnemyTransformationComponent_C_OnDamage::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");

// Function BP_EnemyTransformationComponent.BP_EnemyTransformationComponent_C.PrivateUpdateDamage
// 0x0030 (0x0030 - 0x0000)
struct BP_EnemyTransformationComponent_C_PrivateUpdateDamage final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5041[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeRange_MinTime;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeRange_MaxTime;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyTransformationComponent_C_PrivateUpdateDamage) == 0x000008, "Wrong alignment on BP_EnemyTransformationComponent_C_PrivateUpdateDamage");
static_assert(sizeof(BP_EnemyTransformationComponent_C_PrivateUpdateDamage) == 0x000030, "Wrong size on BP_EnemyTransformationComponent_C_PrivateUpdateDamage");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateDamage, DeltaSeconds) == 0x000000, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateDamage::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateDamage, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000008, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateDamage::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateDamage, CallFunc_GetFloatValue_ReturnValue) == 0x000018, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateDamage::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateDamage, CallFunc_GetTimeRange_MinTime) == 0x00001C, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateDamage::CallFunc_GetTimeRange_MinTime' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateDamage, CallFunc_GetTimeRange_MaxTime) == 0x000020, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateDamage::CallFunc_GetTimeRange_MaxTime' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateDamage, CallFunc_Add_FloatFloat_ReturnValue) == 0x000024, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateDamage::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivateUpdateDamage, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000028, "Member 'BP_EnemyTransformationComponent_C_PrivateUpdateDamage::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_EnemyTransformationComponent.BP_EnemyTransformationComponent_C.PrivatePostUpdate
// 0x0008 (0x0008 - 0x0000)
struct BP_EnemyTransformationComponent_C_PrivatePostUpdate final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyTransformationComponent_C_PrivatePostUpdate) == 0x000004, "Wrong alignment on BP_EnemyTransformationComponent_C_PrivatePostUpdate");
static_assert(sizeof(BP_EnemyTransformationComponent_C_PrivatePostUpdate) == 0x000008, "Wrong size on BP_EnemyTransformationComponent_C_PrivatePostUpdate");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivatePostUpdate, DeltaSeconds) == 0x000000, "Member 'BP_EnemyTransformationComponent_C_PrivatePostUpdate::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivatePostUpdate, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_EnemyTransformationComponent_C_PrivatePostUpdate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivatePostUpdate, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'BP_EnemyTransformationComponent_C_PrivatePostUpdate::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivatePostUpdate, CallFunc_IsValid_ReturnValue_2) == 0x000006, "Member 'BP_EnemyTransformationComponent_C_PrivatePostUpdate::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EnemyTransformationComponent_C_PrivatePostUpdate, CallFunc_IsValid_ReturnValue_3) == 0x000007, "Member 'BP_EnemyTransformationComponent_C_PrivatePostUpdate::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function BP_EnemyTransformationComponent.BP_EnemyTransformationComponent_C.SetCustomStencil
// 0x0030 (0x0030 - 0x0000)
struct BP_EnemyTransformationComponent_C_SetCustomStencil final
{
public:
	int32                                         StencilValue;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCustomDepth;                                    // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5042[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5043[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
