#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Enemy_Weapon

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Enemy_Weapon.BP_Enemy_Weapon_C.ExecuteUbergraph_BP_Enemy_Weapon
// 0x0658 (0x0658 - 0x0000)
struct BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHCHitResult                           K2Node_ComponentBoundEvent_Result_1;               // 0x0008(0x01C0)(ContainsInstancedReference)
	bool                                          CallFunc_OnHitAttack_Result;                       // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B22[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHCHitResult                           K2Node_ComponentBoundEvent_Result;                 // 0x01D0(0x01C0)(ContainsInstancedReference)
	bool                                          CallFunc_OnHitDamage_Result;                       // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B23[0x6];                                     // 0x0392(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHitManager_C*                          CallFunc_GetHitManager_Manager;                    // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B24[0x7];                                     // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHitCheckComponent*                     CallFunc_GetHitCheckComponentFromActor_ReturnValue; // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattleCharacter_C*                   K2Node_DynamicCast_AsRSBattle_Character;           // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnAttackActorHit_Dummy;                   // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B25[0x6];                                     // 0x03BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x03D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x03E4(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_8B26[0x4];                                     // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0470(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0480(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x048C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B27[0x3];                                     // 0x048D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0490(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0519(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B28[0x2];                                     // 0x051A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0524(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0530(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x053C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0548(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B29[0x4];                                     // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0568(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x057C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0580(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x058C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0599(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B2A[0x2];                                     // 0x059A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x059C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x05A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x05B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x05BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x05C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B2B[0x4];                                     // 0x05D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x05E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x05FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0600(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x060C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0619(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B2C[0x6];                                     // 0x061A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PsychicObjectBasic_C*               K2Node_DynamicCast_AsBP_Psychic_Object_Basic;      // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B2D[0x7];                                     // 0x0629(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PsychicObjectBasic_C*               K2Node_DynamicCast_AsBP_Psychic_Object_Basic_1;    // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B2E[0x3];                                     // 0x0639(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Sec;                                  // 0x063C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EndCurveTargetMove_Return;                // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAttackCollisionPrimitiveNative_IsSphere; // 0x0641(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B2F[0x6];                                     // 0x0642(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_GetAttackCollisionPrimitiveNative_ReturnValue; // 0x0648(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CancelAllEffect_bDummy;                   // 0x0650(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon) == 0x000008, "Wrong alignment on BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon");
static_assert(sizeof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon) == 0x000658, "Wrong size on BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, EntryPoint) == 0x000000, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, K2Node_ComponentBoundEvent_Result_1) == 0x000008, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::K2Node_ComponentBoundEvent_Result_1' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_OnHitAttack_Result) == 0x0001C8, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_OnHitAttack_Result' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, K2Node_ComponentBoundEvent_Result) == 0x0001D0, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::K2Node_ComponentBoundEvent_Result' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_OnHitDamage_Result) == 0x000390, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_OnHitDamage_Result' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, K2Node_Event_EndPlayReason) == 0x000391, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_GetHitManager_Manager) == 0x000398, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_GetHitManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_IsValid_ReturnValue) == 0x0003A0, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_GetHitCheckComponentFromActor_ReturnValue) == 0x0003A8, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_GetHitCheckComponentFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, K2Node_DynamicCast_AsRSBattle_Character) == 0x0003B0, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::K2Node_DynamicCast_AsRSBattle_Character' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, K2Node_DynamicCast_bSuccess) == 0x0003B8, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_OnAttackActorHit_Dummy) == 0x0003B9, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_OnAttackActorHit_Dummy' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, K2Node_ComponentBoundEvent_HitComponent) == 0x0003C0, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, K2Node_ComponentBoundEvent_OtherActor_1) == 0x0003C8, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, K2Node_ComponentBoundEvent_OtherComp_1) == 0x0003D0, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, K2Node_ComponentBoundEvent_NormalImpulse) == 0x0003D8, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, K2Node_ComponentBoundEvent_Hit) == 0x0003E4, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000470, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, K2Node_ComponentBoundEvent_OtherActor) == 0x000478, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, K2Node_ComponentBoundEvent_OtherComp) == 0x000480, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000488, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, K2Node_ComponentBoundEvent_bFromSweep) == 0x00048C, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, K2Node_ComponentBoundEvent_SweepResult) == 0x000490, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_bBlockingHit) == 0x000518, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_bInitialOverlap) == 0x000519, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_Time) == 0x00051C, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_Distance) == 0x000520, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_Location) == 0x000524, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_ImpactPoint) == 0x000530, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_Normal) == 0x00053C, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_ImpactNormal) == 0x000548, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_PhysMat) == 0x000558, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_HitActor) == 0x000560, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_HitComponent) == 0x000568, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_HitBoneName) == 0x000570, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_HitItem) == 0x000578, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_FaceIndex) == 0x00057C, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_TraceStart) == 0x000580, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_TraceEnd) == 0x00058C, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000598, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000599, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_Time_1) == 0x00059C, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_Distance_1) == 0x0005A0, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_Location_1) == 0x0005A4, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0005B0, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_Normal_1) == 0x0005BC, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0005C8, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_PhysMat_1) == 0x0005D8, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_HitActor_1) == 0x0005E0, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_HitComponent_1) == 0x0005E8, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_HitBoneName_1) == 0x0005F0, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_HitItem_1) == 0x0005F8, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_FaceIndex_1) == 0x0005FC, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_TraceStart_1) == 0x000600, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_BreakHitResult_TraceEnd_1) == 0x00060C, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_IsValid_ReturnValue_1) == 0x000618, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_IsValid_ReturnValue_2) == 0x000619, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, K2Node_DynamicCast_AsBP_Psychic_Object_Basic) == 0x000620, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::K2Node_DynamicCast_AsBP_Psychic_Object_Basic' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, K2Node_DynamicCast_bSuccess_1) == 0x000628, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, K2Node_DynamicCast_AsBP_Psychic_Object_Basic_1) == 0x000630, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::K2Node_DynamicCast_AsBP_Psychic_Object_Basic_1' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, K2Node_DynamicCast_bSuccess_2) == 0x000638, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, K2Node_Event_Sec) == 0x00063C, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::K2Node_Event_Sec' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_EndCurveTargetMove_Return) == 0x000640, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_EndCurveTargetMove_Return' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_GetAttackCollisionPrimitiveNative_IsSphere) == 0x000641, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_GetAttackCollisionPrimitiveNative_IsSphere' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_GetAttackCollisionPrimitiveNative_ReturnValue) == 0x000648, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_GetAttackCollisionPrimitiveNative_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon, CallFunc_CancelAllEffect_bDummy) == 0x000650, "Member 'BP_Enemy_Weapon_C_ExecuteUbergraph_BP_Enemy_Weapon::CallFunc_CancelAllEffect_bDummy' has a wrong offset!");

// Function BP_Enemy_Weapon.BP_Enemy_Weapon_C.EndCurveTargetMove_FromNative
// 0x0004 (0x0004 - 0x0000)
struct BP_Enemy_Weapon_C_EndCurveTargetMove_FromNative final
{
public:
	float                                         Sec;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Enemy_Weapon_C_EndCurveTargetMove_FromNative) == 0x000004, "Wrong alignment on BP_Enemy_Weapon_C_EndCurveTargetMove_FromNative");
static_assert(sizeof(BP_Enemy_Weapon_C_EndCurveTargetMove_FromNative) == 0x000004, "Wrong size on BP_Enemy_Weapon_C_EndCurveTargetMove_FromNative");
static_assert(offsetof(BP_Enemy_Weapon_C_EndCurveTargetMove_FromNative, Sec) == 0x000000, "Member 'BP_Enemy_Weapon_C_EndCurveTargetMove_FromNative::Sec' has a wrong offset!");

// Function BP_Enemy_Weapon.BP_Enemy_Weapon_C.BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B30[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_Enemy_Weapon.BP_Enemy_Weapon_C.BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0024(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x0000B0, "Wrong size on BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Hit) == 0x000024, "Member 'BP_Enemy_Weapon_C_BndEvt__PhysicsCollision_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function BP_Enemy_Weapon.BP_Enemy_Weapon_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Enemy_Weapon_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Enemy_Weapon_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Enemy_Weapon_C_ReceiveEndPlay");
static_assert(sizeof(BP_Enemy_Weapon_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Enemy_Weapon_C_ReceiveEndPlay");
static_assert(offsetof(BP_Enemy_Weapon_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Enemy_Weapon_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_Enemy_Weapon.BP_Enemy_Weapon_C.BndEvt__BaseHitCheckReceiver_K2Node_ComponentBoundEvent_2_HitResultDelegate__DelegateSignature
// 0x01C0 (0x01C0 - 0x0000)
struct BP_Enemy_Weapon_C_BndEvt__BaseHitCheckReceiver_K2Node_ComponentBoundEvent_2_HitResultDelegate__DelegateSignature final
{
public:
	struct FHCHitResult                           Result;                                            // 0x0000(0x01C0)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_Enemy_Weapon_C_BndEvt__BaseHitCheckReceiver_K2Node_ComponentBoundEvent_2_HitResultDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_Enemy_Weapon_C_BndEvt__BaseHitCheckReceiver_K2Node_ComponentBoundEvent_2_HitResultDelegate__DelegateSignature");
static_assert(sizeof(BP_Enemy_Weapon_C_BndEvt__BaseHitCheckReceiver_K2Node_ComponentBoundEvent_2_HitResultDelegate__DelegateSignature) == 0x0001C0, "Wrong size on BP_Enemy_Weapon_C_BndEvt__BaseHitCheckReceiver_K2Node_ComponentBoundEvent_2_HitResultDelegate__DelegateSignature");
static_assert(offsetof(BP_Enemy_Weapon_C_BndEvt__BaseHitCheckReceiver_K2Node_ComponentBoundEvent_2_HitResultDelegate__DelegateSignature, Result) == 0x000000, "Member 'BP_Enemy_Weapon_C_BndEvt__BaseHitCheckReceiver_K2Node_ComponentBoundEvent_2_HitResultDelegate__DelegateSignature::Result' has a wrong offset!");

// Function BP_Enemy_Weapon.BP_Enemy_Weapon_C.BndEvt__BaseHitCheckReceiver_K2Node_ComponentBoundEvent_1_HitResultDelegate__DelegateSignature
// 0x01C0 (0x01C0 - 0x0000)
struct BP_Enemy_Weapon_C_BndEvt__BaseHitCheckReceiver_K2Node_ComponentBoundEvent_1_HitResultDelegate__DelegateSignature final
{
public:
	struct FHCHitResult                           Result;                                            // 0x0000(0x01C0)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_Enemy_Weapon_C_BndEvt__BaseHitCheckReceiver_K2Node_ComponentBoundEvent_1_HitResultDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_Enemy_Weapon_C_BndEvt__BaseHitCheckReceiver_K2Node_ComponentBoundEvent_1_HitResultDelegate__DelegateSignature");
static_assert(sizeof(BP_Enemy_Weapon_C_BndEvt__BaseHitCheckReceiver_K2Node_ComponentBoundEvent_1_HitResultDelegate__DelegateSignature) == 0x0001C0, "Wrong size on BP_Enemy_Weapon_C_BndEvt__BaseHitCheckReceiver_K2Node_ComponentBoundEvent_1_HitResultDelegate__DelegateSignature");
static_assert(offsetof(BP_Enemy_Weapon_C_BndEvt__BaseHitCheckReceiver_K2Node_ComponentBoundEvent_1_HitResultDelegate__DelegateSignature, Result) == 0x000000, "Member 'BP_Enemy_Weapon_C_BndEvt__BaseHitCheckReceiver_K2Node_ComponentBoundEvent_1_HitResultDelegate__DelegateSignature::Result' has a wrong offset!");

// Function BP_Enemy_Weapon.BP_Enemy_Weapon_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Enemy_Weapon_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Enemy_Weapon_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Enemy_Weapon_C_ReceiveTick");
static_assert(sizeof(BP_Enemy_Weapon_C_ReceiveTick) == 0x000004, "Wrong size on BP_Enemy_Weapon_C_ReceiveTick");
static_assert(offsetof(BP_Enemy_Weapon_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Enemy_Weapon_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Enemy_Weapon.BP_Enemy_Weapon_C.CreateAttackCollosion
// 0x0170 (0x0170 - 0x0000)
struct BP_Enemy_Weapon_C_CreateAttackCollosion final
{
public:
	class UDataTable*                             DataTable;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SkillName;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Param_Owner;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timer;                                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHCHitEffectInfo                       LEffectInfo;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, NoDestructor)
	class UPrimitiveComponent*                    Primitive;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAttackCollisionPrimitiveNative_IsSphere; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B31[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_GetAttackCollisionPrimitiveNative_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHitManager_C*                          CallFunc_GetHitManager_Manager;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B32[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHitCheckComponent*                     CallFunc_GetHitCheckComponentFromActor_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B33[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattleEnemy_C*                       K2Node_DynamicCast_AsRSBattle_Enemy;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B34[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHCSkillCommonInfo                     CallFunc_GetSkillParameterTableWithReplace_SkillCommonInfo; // 0x0078(0x00F0)()
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Enemy_Weapon_C_CreateAttackCollosion) == 0x000008, "Wrong alignment on BP_Enemy_Weapon_C_CreateAttackCollosion");
static_assert(sizeof(BP_Enemy_Weapon_C_CreateAttackCollosion) == 0x000170, "Wrong size on BP_Enemy_Weapon_C_CreateAttackCollosion");
static_assert(offsetof(BP_Enemy_Weapon_C_CreateAttackCollosion, DataTable) == 0x000000, "Member 'BP_Enemy_Weapon_C_CreateAttackCollosion::DataTable' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_CreateAttackCollosion, SkillName) == 0x000008, "Member 'BP_Enemy_Weapon_C_CreateAttackCollosion::SkillName' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_CreateAttackCollosion, Param_Owner) == 0x000010, "Member 'BP_Enemy_Weapon_C_CreateAttackCollosion::Param_Owner' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_CreateAttackCollosion, Timer) == 0x000018, "Member 'BP_Enemy_Weapon_C_CreateAttackCollosion::Timer' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_CreateAttackCollosion, Location) == 0x00001C, "Member 'BP_Enemy_Weapon_C_CreateAttackCollosion::Location' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_CreateAttackCollosion, LEffectInfo) == 0x000028, "Member 'BP_Enemy_Weapon_C_CreateAttackCollosion::LEffectInfo' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_CreateAttackCollosion, Primitive) == 0x000030, "Member 'BP_Enemy_Weapon_C_CreateAttackCollosion::Primitive' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_CreateAttackCollosion, CallFunc_GetAttackCollisionPrimitiveNative_IsSphere) == 0x000038, "Member 'BP_Enemy_Weapon_C_CreateAttackCollosion::CallFunc_GetAttackCollisionPrimitiveNative_IsSphere' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_CreateAttackCollosion, CallFunc_GetAttackCollisionPrimitiveNative_ReturnValue) == 0x000040, "Member 'BP_Enemy_Weapon_C_CreateAttackCollosion::CallFunc_GetAttackCollisionPrimitiveNative_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_CreateAttackCollosion, CallFunc_GetHitManager_Manager) == 0x000048, "Member 'BP_Enemy_Weapon_C_CreateAttackCollosion::CallFunc_GetHitManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_CreateAttackCollosion, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_Enemy_Weapon_C_CreateAttackCollosion::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_CreateAttackCollosion, CallFunc_GetHitCheckComponentFromActor_ReturnValue) == 0x000058, "Member 'BP_Enemy_Weapon_C_CreateAttackCollosion::CallFunc_GetHitCheckComponentFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_CreateAttackCollosion, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'BP_Enemy_Weapon_C_CreateAttackCollosion::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_CreateAttackCollosion, K2Node_DynamicCast_AsRSBattle_Enemy) == 0x000068, "Member 'BP_Enemy_Weapon_C_CreateAttackCollosion::K2Node_DynamicCast_AsRSBattle_Enemy' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_CreateAttackCollosion, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BP_Enemy_Weapon_C_CreateAttackCollosion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_CreateAttackCollosion, CallFunc_GetSkillParameterTableWithReplace_SkillCommonInfo) == 0x000078, "Member 'BP_Enemy_Weapon_C_CreateAttackCollosion::CallFunc_GetSkillParameterTableWithReplace_SkillCommonInfo' has a wrong offset!");
static_assert(offsetof(BP_Enemy_Weapon_C_CreateAttackCollosion, CallFunc_IsValid_ReturnValue_2) == 0x000168, "Member 'BP_Enemy_Weapon_C_CreateAttackCollosion::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function BP_Enemy_Weapon.BP_Enemy_Weapon_C.UpdateCurveTargetMove
// 0x0278 (0x0278 - 0x0000)
struct BP_Enemy_Weapon_C_UpdateCurveTargetMove final
{
public:
	float                                         Sec;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                L_Location;                                        // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L_Distance;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EndCurveTargetMove_Return;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B35[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B36[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTargetDistance_ReturnValue;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHitLineCheck_IsAnyHit;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B37[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_IsHitLineCheck_HitResult;                 // 0x0054(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B38[0x2];                                     // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueRange_MinValue;                   // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueRange_MaxValue;                   // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
