#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventPlayerMaterial

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EventPlayerMaterial.BP_EventPlayerMaterial_C.ExecuteUbergraph_BP_EventPlayerMaterial
// 0x0040 (0x0040 - 0x0000)
struct BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_960A[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      CallFunc_GetEventAttachedMeshWithSub_Player;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuPlayerBase_C*                   CallFunc_GetEventAttachedMeshWithSub_MenuPlayer;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetEventAttachedMeshWithSub_SkeletalMeshComp; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_GetEventAttachedMeshWithSub_PrimitiveComp; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial) == 0x000008, "Wrong alignment on BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial");
static_assert(sizeof(BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial) == 0x000040, "Wrong size on BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial");
static_assert(offsetof(BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial, EntryPoint) == 0x000000, "Member 'BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial, K2Node_Event_EndPlayReason) == 0x000005, "Member 'BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial, K2Node_MakeArray_Array) == 0x000008, "Member 'BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial, CallFunc_GetEventAttachedMeshWithSub_Player) == 0x000018, "Member 'BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial::CallFunc_GetEventAttachedMeshWithSub_Player' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial, CallFunc_GetEventAttachedMeshWithSub_MenuPlayer) == 0x000020, "Member 'BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial::CallFunc_GetEventAttachedMeshWithSub_MenuPlayer' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial, CallFunc_GetEventAttachedMeshWithSub_SkeletalMeshComp) == 0x000028, "Member 'BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial::CallFunc_GetEventAttachedMeshWithSub_SkeletalMeshComp' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial, CallFunc_GetEventAttachedMeshWithSub_PrimitiveComp) == 0x000030, "Member 'BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial::CallFunc_GetEventAttachedMeshWithSub_PrimitiveComp' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial, CallFunc_IsValid_ReturnValue_2) == 0x000039, "Member 'BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial, CallFunc_IsValid_ReturnValue_3) == 0x00003A, "Member 'BP_EventPlayerMaterial_C_ExecuteUbergraph_BP_EventPlayerMaterial::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function BP_EventPlayerMaterial.BP_EventPlayerMaterial_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_EventPlayerMaterial_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPlayerMaterial_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_EventPlayerMaterial_C_ReceiveEndPlay");
static_assert(sizeof(BP_EventPlayerMaterial_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_EventPlayerMaterial_C_ReceiveEndPlay");
static_assert(offsetof(BP_EventPlayerMaterial_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_EventPlayerMaterial_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_EventPlayerMaterial.BP_EventPlayerMaterial_C.Initialize
// 0x0010 (0x0010 - 0x0000)
struct BP_EventPlayerMaterial_C_Initialize final
{
public:
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventPlayerMaterial_C_Initialize) == 0x000008, "Wrong alignment on BP_EventPlayerMaterial_C_Initialize");
static_assert(sizeof(BP_EventPlayerMaterial_C_Initialize) == 0x000010, "Wrong size on BP_EventPlayerMaterial_C_Initialize");
static_assert(offsetof(BP_EventPlayerMaterial_C_Initialize, SkeletalMesh) == 0x000000, "Member 'BP_EventPlayerMaterial_C_Initialize::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_Initialize, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_EventPlayerMaterial_C_Initialize::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_EventPlayerMaterial.BP_EventPlayerMaterial_C.IniitalizePlayer
// 0x0098 (0x0098 - 0x0000)
struct BP_EventPlayerMaterial_C_IniitalizePlayer final
{
public:
	class ARSBattlePlayer_C*                      Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMeshComponent*>                 AppendMeshes;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IPlayerInterface>      CallFunc_GetPlayerID_self_CastInput;               // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_960B[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 CallFunc_GetMeshes_MeshComps;                      // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_960C[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_OptimizeSwitchMaterial_C*          CallFunc_GetOptimizeMaterialSwitcher_OptimizeSwitchComp; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_960D[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_WeaponBase_C*                       CallFunc_GetPlayerWeapon_Weapon;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_960E[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CallFunc_GetExtraMesh_ExtraMesh;                   // 0x0088(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPlayerMaterial_C_IniitalizePlayer) == 0x000008, "Wrong alignment on BP_EventPlayerMaterial_C_IniitalizePlayer");
static_assert(sizeof(BP_EventPlayerMaterial_C_IniitalizePlayer) == 0x000098, "Wrong size on BP_EventPlayerMaterial_C_IniitalizePlayer");
static_assert(offsetof(BP_EventPlayerMaterial_C_IniitalizePlayer, Player) == 0x000000, "Member 'BP_EventPlayerMaterial_C_IniitalizePlayer::Player' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_IniitalizePlayer, AppendMeshes) == 0x000008, "Member 'BP_EventPlayerMaterial_C_IniitalizePlayer::AppendMeshes' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_IniitalizePlayer, Temp_int_Loop_Num_Variable) == 0x000018, "Member 'BP_EventPlayerMaterial_C_IniitalizePlayer::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_IniitalizePlayer, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_EventPlayerMaterial_C_IniitalizePlayer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_IniitalizePlayer, CallFunc_GetPlayerID_self_CastInput) == 0x000020, "Member 'BP_EventPlayerMaterial_C_IniitalizePlayer::CallFunc_GetPlayerID_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_IniitalizePlayer, CallFunc_GetPlayerID_ReturnValue) == 0x000030, "Member 'BP_EventPlayerMaterial_C_IniitalizePlayer::CallFunc_GetPlayerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_IniitalizePlayer, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000031, "Member 'BP_EventPlayerMaterial_C_IniitalizePlayer::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_IniitalizePlayer, CallFunc_GetMeshes_MeshComps) == 0x000038, "Member 'BP_EventPlayerMaterial_C_IniitalizePlayer::CallFunc_GetMeshes_MeshComps' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_IniitalizePlayer, Temp_int_Array_Index_Variable) == 0x000048, "Member 'BP_EventPlayerMaterial_C_IniitalizePlayer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_IniitalizePlayer, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'BP_EventPlayerMaterial_C_IniitalizePlayer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_IniitalizePlayer, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_EventPlayerMaterial_C_IniitalizePlayer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_IniitalizePlayer, CallFunc_GetOptimizeMaterialSwitcher_OptimizeSwitchComp) == 0x000058, "Member 'BP_EventPlayerMaterial_C_IniitalizePlayer::CallFunc_GetOptimizeMaterialSwitcher_OptimizeSwitchComp' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_IniitalizePlayer, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'BP_EventPlayerMaterial_C_IniitalizePlayer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_IniitalizePlayer, CallFunc_GetPlayerWeapon_Weapon) == 0x000068, "Member 'BP_EventPlayerMaterial_C_IniitalizePlayer::CallFunc_GetPlayerWeapon_Weapon' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_IniitalizePlayer, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BP_EventPlayerMaterial_C_IniitalizePlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_IniitalizePlayer, K2Node_MakeArray_Array) == 0x000078, "Member 'BP_EventPlayerMaterial_C_IniitalizePlayer::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_IniitalizePlayer, CallFunc_GetExtraMesh_ExtraMesh) == 0x000088, "Member 'BP_EventPlayerMaterial_C_IniitalizePlayer::CallFunc_GetExtraMesh_ExtraMesh' has a wrong offset!");

// Function BP_EventPlayerMaterial.BP_EventPlayerMaterial_C.InitializeMenuPlayer
// 0x0080 (0x0080 - 0x0000)
struct BP_EventPlayerMaterial_C_InitializeMenuPlayer final
{
public:
	class ABP_MenuPlayerBase_C*                   MenuPlayer;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMeshComponent*>                 AppendMeshes;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	class UBPC_OptimizeSwitchMaterial_C*          OptimizeSwitcher;                                  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_960F[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CallFunc_GetWeaponMeshes_Meshes;                   // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9610[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 CallFunc_GetMeshes_MeshComps;                      // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9611[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9612[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_OptimizeSwitchMaterial_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CallFunc_GetOptionalMeshes_Meshes;                 // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPlayerMaterial_C_InitializeMenuPlayer) == 0x000008, "Wrong alignment on BP_EventPlayerMaterial_C_InitializeMenuPlayer");
static_assert(sizeof(BP_EventPlayerMaterial_C_InitializeMenuPlayer) == 0x000080, "Wrong size on BP_EventPlayerMaterial_C_InitializeMenuPlayer");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeMenuPlayer, MenuPlayer) == 0x000000, "Member 'BP_EventPlayerMaterial_C_InitializeMenuPlayer::MenuPlayer' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeMenuPlayer, AppendMeshes) == 0x000008, "Member 'BP_EventPlayerMaterial_C_InitializeMenuPlayer::AppendMeshes' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeMenuPlayer, OptimizeSwitcher) == 0x000018, "Member 'BP_EventPlayerMaterial_C_InitializeMenuPlayer::OptimizeSwitcher' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeMenuPlayer, Temp_int_Loop_Num_Variable) == 0x000020, "Member 'BP_EventPlayerMaterial_C_InitializeMenuPlayer::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeMenuPlayer, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'BP_EventPlayerMaterial_C_InitializeMenuPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeMenuPlayer, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_EventPlayerMaterial_C_InitializeMenuPlayer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeMenuPlayer, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_EventPlayerMaterial_C_InitializeMenuPlayer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeMenuPlayer, CallFunc_GetWeaponMeshes_Meshes) == 0x000030, "Member 'BP_EventPlayerMaterial_C_InitializeMenuPlayer::CallFunc_GetWeaponMeshes_Meshes' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeMenuPlayer, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000040, "Member 'BP_EventPlayerMaterial_C_InitializeMenuPlayer::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeMenuPlayer, CallFunc_GetMeshes_MeshComps) == 0x000048, "Member 'BP_EventPlayerMaterial_C_InitializeMenuPlayer::CallFunc_GetMeshes_MeshComps' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeMenuPlayer, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'BP_EventPlayerMaterial_C_InitializeMenuPlayer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeMenuPlayer, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'BP_EventPlayerMaterial_C_InitializeMenuPlayer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeMenuPlayer, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'BP_EventPlayerMaterial_C_InitializeMenuPlayer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeMenuPlayer, CallFunc_GetComponentByClass_ReturnValue) == 0x000068, "Member 'BP_EventPlayerMaterial_C_InitializeMenuPlayer::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeMenuPlayer, CallFunc_GetOptionalMeshes_Meshes) == 0x000070, "Member 'BP_EventPlayerMaterial_C_InitializeMenuPlayer::CallFunc_GetOptionalMeshes_Meshes' has a wrong offset!");

// Function BP_EventPlayerMaterial.BP_EventPlayerMaterial_C.InitializeSekeletalMesh
// 0x00C0 (0x00C0 - 0x0000)
struct BP_EventPlayerMaterial_C_InitializeSekeletalMesh final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMeshComponent*>                 AppendMeshes;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	class UBPC_OptimizeSwitchMaterial_C*          OptimizeSwitcher;                                  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9613[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventCopyPlayer_C*                  K2Node_DynamicCast_AsBP_Event_Copy_Player;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9614[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 CallFunc_GetMeshes_MeshComps;                      // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9615[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_OptimizeSwitchMaterial_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_WeaponBase_C*                       K2Node_DynamicCast_AsBP_Weapon_Base;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9616[0x5];                                     // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ANpcSkeletalMeshActor*                  K2Node_DynamicCast_AsNpc_Skeletal_Mesh_Actor;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9617[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetValidSkeletalMeshComponents_MeshComps; // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UBPC_OptimizeSwitchMaterial_C*          CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9618[0x6];                                     // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh) == 0x000008, "Wrong alignment on BP_EventPlayerMaterial_C_InitializeSekeletalMesh");
static_assert(sizeof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh) == 0x0000C0, "Wrong size on BP_EventPlayerMaterial_C_InitializeSekeletalMesh");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, SkeletalMeshComponent) == 0x000000, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, AppendMeshes) == 0x000008, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::AppendMeshes' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, OptimizeSwitcher) == 0x000018, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::OptimizeSwitcher' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, Actor) == 0x000020, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::Actor' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000028, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, K2Node_DynamicCast_AsBP_Event_Copy_Player) == 0x000030, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::K2Node_DynamicCast_AsBP_Event_Copy_Player' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, CallFunc_GetMeshes_MeshComps) == 0x000040, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::CallFunc_GetMeshes_MeshComps' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, CallFunc_GetComponentByClass_ReturnValue) == 0x000058, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, K2Node_DynamicCast_AsBP_Weapon_Base) == 0x000060, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::K2Node_DynamicCast_AsBP_Weapon_Base' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, CallFunc_IsValid_ReturnValue_1) == 0x000069, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, CallFunc_IsValid_ReturnValue_2) == 0x00006A, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, K2Node_DynamicCast_AsNpc_Skeletal_Mesh_Actor) == 0x000070, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::K2Node_DynamicCast_AsNpc_Skeletal_Mesh_Actor' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, CallFunc_GetValidSkeletalMeshComponents_MeshComps) == 0x000080, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::CallFunc_GetValidSkeletalMeshComponents_MeshComps' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000090, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, CallFunc_Array_Get_Item) == 0x000098, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, CallFunc_Array_Length_ReturnValue_1) == 0x0000A4, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, CallFunc_Greater_IntInt_ReturnValue) == 0x0000A8, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000A9, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, CallFunc_GetOwner_ReturnValue) == 0x0000B0, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_InitializeSekeletalMesh, CallFunc_IsValid_ReturnValue_3) == 0x0000B8, "Member 'BP_EventPlayerMaterial_C_InitializeSekeletalMesh::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function BP_EventPlayerMaterial.BP_EventPlayerMaterial_C.FinalizeWeapon
// 0x0001 (0x0001 - 0x0000)
struct BP_EventPlayerMaterial_C_FinalizeWeapon final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventPlayerMaterial_C_FinalizeWeapon) == 0x000001, "Wrong alignment on BP_EventPlayerMaterial_C_FinalizeWeapon");
static_assert(sizeof(BP_EventPlayerMaterial_C_FinalizeWeapon) == 0x000001, "Wrong size on BP_EventPlayerMaterial_C_FinalizeWeapon");
static_assert(offsetof(BP_EventPlayerMaterial_C_FinalizeWeapon, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_EventPlayerMaterial_C_FinalizeWeapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_EventPlayerMaterial.BP_EventPlayerMaterial_C.SetUsedNormalFixed
// 0x0010 (0x0010 - 0x0000)
struct BP_EventPlayerMaterial_C_SetUsedNormalFixed final
{
public:
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPlayerMaterial_C_SetUsedNormalFixed) == 0x000008, "Wrong alignment on BP_EventPlayerMaterial_C_SetUsedNormalFixed");
static_assert(sizeof(BP_EventPlayerMaterial_C_SetUsedNormalFixed) == 0x000010, "Wrong size on BP_EventPlayerMaterial_C_SetUsedNormalFixed");
static_assert(offsetof(BP_EventPlayerMaterial_C_SetUsedNormalFixed, K2Node_MakeArray_Array) == 0x000000, "Member 'BP_EventPlayerMaterial_C_SetUsedNormalFixed::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_EventPlayerMaterial.BP_EventPlayerMaterial_C.ProtectedSetupEventOptimizeCustomStencil
// 0x0028 (0x0028 - 0x0000)
struct BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9619[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     EventManager;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetOptimizeCacheCustomStencilWeapon_IsFind; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetOptimizeCacheCustomStencilWeapon_UseCustomDepth; // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_961A[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetOptimizeCacheCustomStencilPlayer_IsFind; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetOptimizeCacheCustomStencilPlayer_UseCustomDepth; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_1;          // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil) == 0x000008, "Wrong alignment on BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil");
static_assert(sizeof(BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil) == 0x000028, "Wrong size on BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil");
static_assert(offsetof(BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil, Enable) == 0x000000, "Member 'BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil::Enable' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil, EventManager) == 0x000008, "Member 'BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil::EventManager' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil, CallFunc_GetOptimizeCacheCustomStencilWeapon_IsFind) == 0x000010, "Member 'BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil::CallFunc_GetOptimizeCacheCustomStencilWeapon_IsFind' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil, CallFunc_GetOptimizeCacheCustomStencilWeapon_UseCustomDepth) == 0x000011, "Member 'BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil::CallFunc_GetOptimizeCacheCustomStencilWeapon_UseCustomDepth' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil, CallFunc_IsValid_ReturnValue) == 0x000012, "Member 'BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000013, "Member 'BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil, CallFunc_GetEventManager_EventManager) == 0x000018, "Member 'BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil, CallFunc_GetOptimizeCacheCustomStencilPlayer_IsFind) == 0x000020, "Member 'BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil::CallFunc_GetOptimizeCacheCustomStencilPlayer_IsFind' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil, CallFunc_GetOptimizeCacheCustomStencilPlayer_UseCustomDepth) == 0x000021, "Member 'BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil::CallFunc_GetOptimizeCacheCustomStencilPlayer_UseCustomDepth' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil, CallFunc_IsValid_ReturnValue_1) == 0x000022, "Member 'BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil, CallFunc_NotEqual_BoolBool_ReturnValue_1) == 0x000023, "Member 'BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil::CallFunc_NotEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil, CallFunc_IsValid_ReturnValue_2) == 0x000024, "Member 'BP_EventPlayerMaterial_C_ProtectedSetupEventOptimizeCustomStencil::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function BP_EventPlayerMaterial.BP_EventPlayerMaterial_C.GetMeshCustomStencil
// 0x0038 (0x0038 - 0x0000)
struct BP_EventPlayerMaterial_C_GetMeshCustomStencil final
{
public:
	class USkeletalMeshComponent*                 SkelMeshComp;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasCustomStencil;                                  // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_961B[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CustomStencil;                                     // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     EventManager;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMeshCustomStencil_HasCustomStencil;    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_961C[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMeshCustomStencil_CustomStencil;       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetOptimizeCacheCustomStencilWeapon_IsFind; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetOptimizeCacheCustomStencilWeapon_UseCustomDepth; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_961D[0x5];                                     // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetOptimizeCacheCustomStencilPlayer_IsFind; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetOptimizeCacheCustomStencilPlayer_UseCustomDepth; // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventPlayerMaterial_C_GetMeshCustomStencil) == 0x000008, "Wrong alignment on BP_EventPlayerMaterial_C_GetMeshCustomStencil");
static_assert(sizeof(BP_EventPlayerMaterial_C_GetMeshCustomStencil) == 0x000038, "Wrong size on BP_EventPlayerMaterial_C_GetMeshCustomStencil");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetMeshCustomStencil, SkelMeshComp) == 0x000000, "Member 'BP_EventPlayerMaterial_C_GetMeshCustomStencil::SkelMeshComp' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetMeshCustomStencil, HasCustomStencil) == 0x000008, "Member 'BP_EventPlayerMaterial_C_GetMeshCustomStencil::HasCustomStencil' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetMeshCustomStencil, CustomStencil) == 0x00000C, "Member 'BP_EventPlayerMaterial_C_GetMeshCustomStencil::CustomStencil' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetMeshCustomStencil, EventManager) == 0x000010, "Member 'BP_EventPlayerMaterial_C_GetMeshCustomStencil::EventManager' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetMeshCustomStencil, CallFunc_GetMeshCustomStencil_HasCustomStencil) == 0x000018, "Member 'BP_EventPlayerMaterial_C_GetMeshCustomStencil::CallFunc_GetMeshCustomStencil_HasCustomStencil' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetMeshCustomStencil, CallFunc_GetMeshCustomStencil_CustomStencil) == 0x00001C, "Member 'BP_EventPlayerMaterial_C_GetMeshCustomStencil::CallFunc_GetMeshCustomStencil_CustomStencil' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetMeshCustomStencil, CallFunc_GetOptimizeCacheCustomStencilWeapon_IsFind) == 0x000020, "Member 'BP_EventPlayerMaterial_C_GetMeshCustomStencil::CallFunc_GetOptimizeCacheCustomStencilWeapon_IsFind' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetMeshCustomStencil, CallFunc_GetOptimizeCacheCustomStencilWeapon_UseCustomDepth) == 0x000021, "Member 'BP_EventPlayerMaterial_C_GetMeshCustomStencil::CallFunc_GetOptimizeCacheCustomStencilWeapon_UseCustomDepth' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetMeshCustomStencil, CallFunc_IsValid_ReturnValue) == 0x000022, "Member 'BP_EventPlayerMaterial_C_GetMeshCustomStencil::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetMeshCustomStencil, CallFunc_GetEventManager_EventManager) == 0x000028, "Member 'BP_EventPlayerMaterial_C_GetMeshCustomStencil::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetMeshCustomStencil, CallFunc_GetOptimizeCacheCustomStencilPlayer_IsFind) == 0x000030, "Member 'BP_EventPlayerMaterial_C_GetMeshCustomStencil::CallFunc_GetOptimizeCacheCustomStencilPlayer_IsFind' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetMeshCustomStencil, CallFunc_GetOptimizeCacheCustomStencilPlayer_UseCustomDepth) == 0x000031, "Member 'BP_EventPlayerMaterial_C_GetMeshCustomStencil::CallFunc_GetOptimizeCacheCustomStencilPlayer_UseCustomDepth' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetMeshCustomStencil, CallFunc_IsValid_ReturnValue_1) == 0x000032, "Member 'BP_EventPlayerMaterial_C_GetMeshCustomStencil::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetMeshCustomStencil, CallFunc_IsValid_ReturnValue_2) == 0x000033, "Member 'BP_EventPlayerMaterial_C_GetMeshCustomStencil::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function BP_EventPlayerMaterial.BP_EventPlayerMaterial_C.GetAttachedMeshes
// 0x0088 (0x0088 - 0x0000)
struct BP_EventPlayerMaterial_C_GetAttachedMeshes final
{
public:
	class UMeshComponent*                         MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMeshComponent*>                 Meshes;                                            // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class USceneComponent*>                ChildrenComps;                                     // 0x0018(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UMeshComponent*>                 RetMeshes;                                         // 0x0028(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class AActor*>                         AttachedActors;                                    // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_961E[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_961F[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         K2Node_DynamicCast_AsMesh_Component;               // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9620[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPlayerMaterial_C_GetAttachedMeshes) == 0x000008, "Wrong alignment on BP_EventPlayerMaterial_C_GetAttachedMeshes");
static_assert(sizeof(BP_EventPlayerMaterial_C_GetAttachedMeshes) == 0x000088, "Wrong size on BP_EventPlayerMaterial_C_GetAttachedMeshes");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetAttachedMeshes, MeshComp) == 0x000000, "Member 'BP_EventPlayerMaterial_C_GetAttachedMeshes::MeshComp' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetAttachedMeshes, Meshes) == 0x000008, "Member 'BP_EventPlayerMaterial_C_GetAttachedMeshes::Meshes' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetAttachedMeshes, ChildrenComps) == 0x000018, "Member 'BP_EventPlayerMaterial_C_GetAttachedMeshes::ChildrenComps' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetAttachedMeshes, RetMeshes) == 0x000028, "Member 'BP_EventPlayerMaterial_C_GetAttachedMeshes::RetMeshes' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetAttachedMeshes, AttachedActors) == 0x000038, "Member 'BP_EventPlayerMaterial_C_GetAttachedMeshes::AttachedActors' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetAttachedMeshes, CallFunc_GetChildrenComponents_Children) == 0x000048, "Member 'BP_EventPlayerMaterial_C_GetAttachedMeshes::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetAttachedMeshes, Temp_int_Array_Index_Variable) == 0x000058, "Member 'BP_EventPlayerMaterial_C_GetAttachedMeshes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetAttachedMeshes, Temp_int_Loop_Num_Variable) == 0x00005C, "Member 'BP_EventPlayerMaterial_C_GetAttachedMeshes::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetAttachedMeshes, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'BP_EventPlayerMaterial_C_GetAttachedMeshes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetAttachedMeshes, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'BP_EventPlayerMaterial_C_GetAttachedMeshes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetAttachedMeshes, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'BP_EventPlayerMaterial_C_GetAttachedMeshes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetAttachedMeshes, K2Node_DynamicCast_AsMesh_Component) == 0x000070, "Member 'BP_EventPlayerMaterial_C_GetAttachedMeshes::K2Node_DynamicCast_AsMesh_Component' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetAttachedMeshes, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_EventPlayerMaterial_C_GetAttachedMeshes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetAttachedMeshes, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'BP_EventPlayerMaterial_C_GetAttachedMeshes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_GetAttachedMeshes, CallFunc_Array_Add_ReturnValue) == 0x000080, "Member 'BP_EventPlayerMaterial_C_GetAttachedMeshes::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_EventPlayerMaterial.BP_EventPlayerMaterial_C.SetupNeonWireDepthTick
// 0x0030 (0x0030 - 0x0000)
struct BP_EventPlayerMaterial_C_SetupNeonWireDepthTick final
{
public:
	class UMeshComponent*                         MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9621[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9622[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_NeonWireDepth_C*                   CallFunc_SetNeonWireDepthTick_NeonWireDepthComp;   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventPlayerMaterial_C_SetupNeonWireDepthTick) == 0x000008, "Wrong alignment on BP_EventPlayerMaterial_C_SetupNeonWireDepthTick");
static_assert(sizeof(BP_EventPlayerMaterial_C_SetupNeonWireDepthTick) == 0x000030, "Wrong size on BP_EventPlayerMaterial_C_SetupNeonWireDepthTick");
static_assert(offsetof(BP_EventPlayerMaterial_C_SetupNeonWireDepthTick, MeshComp) == 0x000000, "Member 'BP_EventPlayerMaterial_C_SetupNeonWireDepthTick::MeshComp' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_SetupNeonWireDepthTick, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_EventPlayerMaterial_C_SetupNeonWireDepthTick::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_SetupNeonWireDepthTick, CallFunc_GetEventManager_EventManager) == 0x000010, "Member 'BP_EventPlayerMaterial_C_SetupNeonWireDepthTick::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_SetupNeonWireDepthTick, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'BP_EventPlayerMaterial_C_SetupNeonWireDepthTick::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterial_C_SetupNeonWireDepthTick, CallFunc_SetNeonWireDepthTick_NeonWireDepthComp) == 0x000020, "Member 'BP_EventPlayerMaterial_C_SetupNeonWireDepthTick::CallFunc_SetNeonWireDepthTick_NeonWireDepthComp' has a wrong offset!");
