#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventParamComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_EventParamComponent.BP_EventParamComponent_C.ExecuteUbergraph_BP_EventParamComponent
// 0x0060 (0x0060 - 0x0000)
struct BP_EventParamComponent_C_ExecuteUbergraph_BP_EventParamComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8474[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8475[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshFromActor_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8476[0xF];                                     // 0x0021(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventParamComponent_C_ExecuteUbergraph_BP_EventParamComponent) == 0x000010, "Wrong alignment on BP_EventParamComponent_C_ExecuteUbergraph_BP_EventParamComponent");
static_assert(sizeof(BP_EventParamComponent_C_ExecuteUbergraph_BP_EventParamComponent) == 0x000060, "Wrong size on BP_EventParamComponent_C_ExecuteUbergraph_BP_EventParamComponent");
static_assert(offsetof(BP_EventParamComponent_C_ExecuteUbergraph_BP_EventParamComponent, EntryPoint) == 0x000000, "Member 'BP_EventParamComponent_C_ExecuteUbergraph_BP_EventParamComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_ExecuteUbergraph_BP_EventParamComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_EventParamComponent_C_ExecuteUbergraph_BP_EventParamComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_ExecuteUbergraph_BP_EventParamComponent, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_EventParamComponent_C_ExecuteUbergraph_BP_EventParamComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_ExecuteUbergraph_BP_EventParamComponent, CallFunc_GetSkeletalMeshFromActor_ReturnValue) == 0x000018, "Member 'BP_EventParamComponent_C_ExecuteUbergraph_BP_EventParamComponent::CallFunc_GetSkeletalMeshFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_ExecuteUbergraph_BP_EventParamComponent, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'BP_EventParamComponent_C_ExecuteUbergraph_BP_EventParamComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_ExecuteUbergraph_BP_EventParamComponent, CallFunc_GetSocketTransform_ReturnValue) == 0x000030, "Member 'BP_EventParamComponent_C_ExecuteUbergraph_BP_EventParamComponent::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");

// Function BP_EventParamComponent.BP_EventParamComponent_C.DynamicEventStart
// 0x0150 (0x0150 - 0x0000)
struct BP_EventParamComponent_C_DynamicEventStart final
{
public:
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       K2Node_DynamicCast_AsRSCharacter_Base;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8477[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0088(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8478[0xF];                                     // 0x0111(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0120(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventParamComponent_C_DynamicEventStart) == 0x000010, "Wrong alignment on BP_EventParamComponent_C_DynamicEventStart");
static_assert(sizeof(BP_EventParamComponent_C_DynamicEventStart) == 0x000150, "Wrong size on BP_EventParamComponent_C_DynamicEventStart");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventStart, Mesh) == 0x000000, "Member 'BP_EventParamComponent_C_DynamicEventStart::Mesh' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventStart, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_EventParamComponent_C_DynamicEventStart::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventStart, K2Node_DynamicCast_AsRSCharacter_Base) == 0x000010, "Member 'BP_EventParamComponent_C_DynamicEventStart::K2Node_DynamicCast_AsRSCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventStart, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_EventParamComponent_C_DynamicEventStart::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventStart, CallFunc_GetRelativeTransform_ReturnValue) == 0x000020, "Member 'BP_EventParamComponent_C_DynamicEventStart::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventStart, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'BP_EventParamComponent_C_DynamicEventStart::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventStart, CallFunc_GetOwner_ReturnValue_1) == 0x000080, "Member 'BP_EventParamComponent_C_DynamicEventStart::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventStart, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000088, "Member 'BP_EventParamComponent_C_DynamicEventStart::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventStart, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000110, "Member 'BP_EventParamComponent_C_DynamicEventStart::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventStart, CallFunc_GetTransform_ReturnValue) == 0x000120, "Member 'BP_EventParamComponent_C_DynamicEventStart::CallFunc_GetTransform_ReturnValue' has a wrong offset!");

// Function BP_EventParamComponent.BP_EventParamComponent_C.DynamicEventEnd
// 0x0328 (0x0328 - 0x0000)
struct BP_EventParamComponent_C_DynamicEventEnd final
{
public:
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRestoreTransform;                                // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8479[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCapsuleComponent*                      CapsuleComponent;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X_1;                          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0094(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_847A[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_847B[0x4];                                     // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0138(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_847C[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IEventInterface>       K2Node_DynamicCast_AsEvent_Interface;              // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_847D[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       K2Node_DynamicCast_AsRSCharacter_Base;             // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_847E[0x7];                                     // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattleEnemy_C*                       K2Node_DynamicCast_AsRSBattle_Enemy;               // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_847F[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0210(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0298(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventParamComponent_C_DynamicEventEnd) == 0x000008, "Wrong alignment on BP_EventParamComponent_C_DynamicEventEnd");
static_assert(sizeof(BP_EventParamComponent_C_DynamicEventEnd) == 0x000328, "Wrong size on BP_EventParamComponent_C_DynamicEventEnd");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, Mesh) == 0x000000, "Member 'BP_EventParamComponent_C_DynamicEventEnd::Mesh' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, IsRestoreTransform) == 0x000008, "Member 'BP_EventParamComponent_C_DynamicEventEnd::IsRestoreTransform' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CapsuleComponent) == 0x000010, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CapsuleComponent' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_BreakTransform_Location) == 0x000018, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_BreakTransform_Rotation) == 0x000024, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_BreakTransform_Scale) == 0x000030, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00003C, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_BreakRotator_Roll) == 0x000040, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_BreakRotator_Pitch) == 0x000044, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_BreakRotator_Yaw) == 0x000048, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_BreakVector_X) == 0x00004C, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_BreakVector_Y) == 0x000050, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_BreakVector_Z) == 0x000054, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_Add_FloatFloat_ReturnValue) == 0x000058, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00005C, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000060, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_MakeVector_ReturnValue) == 0x000064, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_MakeRotator_ReturnValue) == 0x000070, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_BreakVector_X_1) == 0x00007C, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_BreakVector_Y_1) == 0x000080, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_BreakVector_Z_1) == 0x000084, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_GetOwner_ReturnValue) == 0x000088, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000090, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000094, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_K2_SetActorLocation_ReturnValue) == 0x00011C, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_MakeVector_ReturnValue_1) == 0x000120, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_GetOwner_ReturnValue_1) == 0x000130, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x000138, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x0001C0, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, K2Node_DynamicCast_AsEvent_Interface) == 0x0001C8, "Member 'BP_EventParamComponent_C_DynamicEventEnd::K2Node_DynamicCast_AsEvent_Interface' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, K2Node_DynamicCast_bSuccess) == 0x0001D8, "Member 'BP_EventParamComponent_C_DynamicEventEnd::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_GetOwner_ReturnValue_2) == 0x0001E0, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, K2Node_DynamicCast_AsRSCharacter_Base) == 0x0001E8, "Member 'BP_EventParamComponent_C_DynamicEventEnd::K2Node_DynamicCast_AsRSCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, K2Node_DynamicCast_bSuccess_1) == 0x0001F0, "Member 'BP_EventParamComponent_C_DynamicEventEnd::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, K2Node_DynamicCast_AsRSBattle_Enemy) == 0x0001F8, "Member 'BP_EventParamComponent_C_DynamicEventEnd::K2Node_DynamicCast_AsRSBattle_Enemy' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, K2Node_DynamicCast_bSuccess_2) == 0x000200, "Member 'BP_EventParamComponent_C_DynamicEventEnd::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_GetOwner_ReturnValue_3) == 0x000208, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x000210, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000298, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_DynamicEventEnd, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000320, "Member 'BP_EventParamComponent_C_DynamicEventEnd::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");

// Function BP_EventParamComponent.BP_EventParamComponent_C.TalkEventStart
// 0x0040 (0x0040 - 0x0000)
struct BP_EventParamComponent_C_TalkEventStart final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8480[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventParamComponent_C_TalkEventStart) == 0x000010, "Wrong alignment on BP_EventParamComponent_C_TalkEventStart");
static_assert(sizeof(BP_EventParamComponent_C_TalkEventStart) == 0x000040, "Wrong size on BP_EventParamComponent_C_TalkEventStart");
static_assert(offsetof(BP_EventParamComponent_C_TalkEventStart, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_EventParamComponent_C_TalkEventStart::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_TalkEventStart, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'BP_EventParamComponent_C_TalkEventStart::CallFunc_GetTransform_ReturnValue' has a wrong offset!");

// Function BP_EventParamComponent.BP_EventParamComponent_C.TalkEventEnd
// 0x00A0 (0x00A0 - 0x0000)
struct BP_EventParamComponent_C_TalkEventEnd final
{
public:
	bool                                          IsTransformRestore;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8481[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0010(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventParamComponent_C_TalkEventEnd) == 0x000008, "Wrong alignment on BP_EventParamComponent_C_TalkEventEnd");
static_assert(sizeof(BP_EventParamComponent_C_TalkEventEnd) == 0x0000A0, "Wrong size on BP_EventParamComponent_C_TalkEventEnd");
static_assert(offsetof(BP_EventParamComponent_C_TalkEventEnd, IsTransformRestore) == 0x000000, "Member 'BP_EventParamComponent_C_TalkEventEnd::IsTransformRestore' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_TalkEventEnd, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_EventParamComponent_C_TalkEventEnd::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_TalkEventEnd, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000010, "Member 'BP_EventParamComponent_C_TalkEventEnd::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_TalkEventEnd, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000098, "Member 'BP_EventParamComponent_C_TalkEventEnd::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");

// Function BP_EventParamComponent.BP_EventParamComponent_C.StaticEventStart
// 0x00B0 (0x00B0 - 0x0000)
struct BP_EventParamComponent_C_StaticEventStart final
{
public:
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8482[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8483[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshFromActor_ReturnValue;     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       K2Node_DynamicCast_AsRSCharacter_Base;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8484[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8485[0x8];                                     // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0080(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventParamComponent_C_StaticEventStart) == 0x000010, "Wrong alignment on BP_EventParamComponent_C_StaticEventStart");
static_assert(sizeof(BP_EventParamComponent_C_StaticEventStart) == 0x0000B0, "Wrong size on BP_EventParamComponent_C_StaticEventStart");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventStart, SkeletalMesh) == 0x000000, "Member 'BP_EventParamComponent_C_StaticEventStart::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventStart, CallFunc_GetRelativeTransform_ReturnValue) == 0x000010, "Member 'BP_EventParamComponent_C_StaticEventStart::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventStart, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_EventParamComponent_C_StaticEventStart::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventStart, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'BP_EventParamComponent_C_StaticEventStart::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventStart, CallFunc_GetSkeletalMeshFromActor_ReturnValue) == 0x000050, "Member 'BP_EventParamComponent_C_StaticEventStart::CallFunc_GetSkeletalMeshFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventStart, CallFunc_GetOwner_ReturnValue_1) == 0x000058, "Member 'BP_EventParamComponent_C_StaticEventStart::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventStart, K2Node_DynamicCast_AsRSCharacter_Base) == 0x000060, "Member 'BP_EventParamComponent_C_StaticEventStart::K2Node_DynamicCast_AsRSCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventStart, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_EventParamComponent_C_StaticEventStart::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventStart, CallFunc_GetOwner_ReturnValue_2) == 0x000070, "Member 'BP_EventParamComponent_C_StaticEventStart::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventStart, CallFunc_GetTransform_ReturnValue) == 0x000080, "Member 'BP_EventParamComponent_C_StaticEventStart::CallFunc_GetTransform_ReturnValue' has a wrong offset!");

// Function BP_EventParamComponent.BP_EventParamComponent_C.StaticEventEnd
// 0x04B8 (0x04B8 - 0x0000)
struct BP_EventParamComponent_C_StaticEventEnd final
{
public:
	bool                                          IsTransformRestore;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8486[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCapsuleComponent*                      CapsuleComponent;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       K2Node_DynamicCast_AsRSCharacter_Base;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8487[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattleEnemy_C*                       K2Node_DynamicCast_AsRSBattle_Enemy;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8488[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8489[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x00AC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_848A[0x3];                                     // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_1;                          // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_848B[0x4];                                     // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IEventInterface>       K2Node_DynamicCast_AsEvent_Interface;              // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_848C[0x3];                                     // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0174(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_848D[0x2];                                     // 0x01FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_4;                   // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0228(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0244(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x02CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x02E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x02F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x02FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0318(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0330(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x033C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionChannel                             CallFunc_GetCollisionObjectType_ReturnValue;       // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_848E[0x2];                                     // 0x034A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_2;                          // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_848F[0x4];                                     // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_5;                   // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0368(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8490[0x4];                                     // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshFromActor_ReturnValue;     // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x0380(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8491[0x7];                                     // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_6;                   // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshFromActor_ReturnValue_1;   // 0x0418(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_7;                   // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0428(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventParamComponent_C_StaticEventEnd) == 0x000008, "Wrong alignment on BP_EventParamComponent_C_StaticEventEnd");
static_assert(sizeof(BP_EventParamComponent_C_StaticEventEnd) == 0x0004B8, "Wrong size on BP_EventParamComponent_C_StaticEventEnd");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, IsTransformRestore) == 0x000000, "Member 'BP_EventParamComponent_C_StaticEventEnd::IsTransformRestore' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CapsuleComponent) == 0x000008, "Member 'BP_EventParamComponent_C_StaticEventEnd::CapsuleComponent' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, SkeletalMesh) == 0x000010, "Member 'BP_EventParamComponent_C_StaticEventEnd::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, K2Node_DynamicCast_AsRSCharacter_Base) == 0x000020, "Member 'BP_EventParamComponent_C_StaticEventEnd::K2Node_DynamicCast_AsRSCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_EventParamComponent_C_StaticEventEnd::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, K2Node_DynamicCast_AsRSBattle_Enemy) == 0x000030, "Member 'BP_EventParamComponent_C_StaticEventEnd::K2Node_DynamicCast_AsRSBattle_Enemy' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_EventParamComponent_C_StaticEventEnd::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00003C, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_BreakTransform_Location) == 0x000040, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_BreakTransform_Rotation) == 0x00004C, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_BreakTransform_Scale) == 0x000058, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_GetOwner_ReturnValue_1) == 0x000068, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_BreakRotator_Roll) == 0x000070, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_BreakRotator_Pitch) == 0x000074, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_BreakRotator_Yaw) == 0x000078, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_BreakVector_X) == 0x00007C, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_BreakVector_Y) == 0x000080, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_BreakVector_Z) == 0x000084, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_Add_FloatFloat_ReturnValue) == 0x000088, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00008C, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000090, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_MakeVector_ReturnValue) == 0x000094, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_MakeRotator_ReturnValue) == 0x0000A0, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0000AC, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000134, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_BreakVector_X_1) == 0x000138, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_BreakVector_Y_1) == 0x00013C, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_BreakVector_Z_1) == 0x000140, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000144, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_GetOwner_ReturnValue_2) == 0x000148, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_MakeVector_ReturnValue_1) == 0x000150, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, K2Node_DynamicCast_AsEvent_Interface) == 0x000160, "Member 'BP_EventParamComponent_C_StaticEventEnd::K2Node_DynamicCast_AsEvent_Interface' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, K2Node_DynamicCast_bSuccess_2) == 0x000170, "Member 'BP_EventParamComponent_C_StaticEventEnd::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x000174, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x0001FC, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_IsValid_ReturnValue) == 0x0001FD, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventParamComponent_C_StaticEventEnd, CallFunc_GetOwner_ReturnValue_3) == 0x000200, "Member 'BP_EventParamComponent_C_StaticEventEnd::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
