#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventPlayerMaterialBase

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EventPlayerMaterialBase.BP_EventPlayerMaterialBase_C.ExecuteUbergraph_BP_EventPlayerMaterialBase
// 0x0008 (0x0008 - 0x0000)
struct BP_EventPlayerMaterialBase_C_ExecuteUbergraph_BP_EventPlayerMaterialBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPlayerMaterialBase_C_ExecuteUbergraph_BP_EventPlayerMaterialBase) == 0x000004, "Wrong alignment on BP_EventPlayerMaterialBase_C_ExecuteUbergraph_BP_EventPlayerMaterialBase");
static_assert(sizeof(BP_EventPlayerMaterialBase_C_ExecuteUbergraph_BP_EventPlayerMaterialBase) == 0x000008, "Wrong size on BP_EventPlayerMaterialBase_C_ExecuteUbergraph_BP_EventPlayerMaterialBase");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_ExecuteUbergraph_BP_EventPlayerMaterialBase, EntryPoint) == 0x000000, "Member 'BP_EventPlayerMaterialBase_C_ExecuteUbergraph_BP_EventPlayerMaterialBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_ExecuteUbergraph_BP_EventPlayerMaterialBase, K2Node_Event_EndPlayReason) == 0x000004, "Member 'BP_EventPlayerMaterialBase_C_ExecuteUbergraph_BP_EventPlayerMaterialBase::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BP_EventPlayerMaterialBase.BP_EventPlayerMaterialBase_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_EventPlayerMaterialBase_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPlayerMaterialBase_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_EventPlayerMaterialBase_C_ReceiveEndPlay");
static_assert(sizeof(BP_EventPlayerMaterialBase_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_EventPlayerMaterialBase_C_ReceiveEndPlay");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_EventPlayerMaterialBase_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_EventPlayerMaterialBase.BP_EventPlayerMaterialBase_C.PrivateSetupOutlineSetting
// 0x0020 (0x0020 - 0x0000)
struct BP_EventPlayerMaterialBase_C_PrivateSetupOutlineSetting final
{
public:
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayerMaterialAccessorComponent_C*  AccessorComponent;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMeshCustomStencil_HasCustomStencil;    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6558[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMeshCustomStencil_CustomStencil;       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventPlayerMaterialBase_C_PrivateSetupOutlineSetting) == 0x000008, "Wrong alignment on BP_EventPlayerMaterialBase_C_PrivateSetupOutlineSetting");
static_assert(sizeof(BP_EventPlayerMaterialBase_C_PrivateSetupOutlineSetting) == 0x000020, "Wrong size on BP_EventPlayerMaterialBase_C_PrivateSetupOutlineSetting");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_PrivateSetupOutlineSetting, SkeletalMesh) == 0x000000, "Member 'BP_EventPlayerMaterialBase_C_PrivateSetupOutlineSetting::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_PrivateSetupOutlineSetting, AccessorComponent) == 0x000008, "Member 'BP_EventPlayerMaterialBase_C_PrivateSetupOutlineSetting::AccessorComponent' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_PrivateSetupOutlineSetting, CallFunc_GetMeshCustomStencil_HasCustomStencil) == 0x000010, "Member 'BP_EventPlayerMaterialBase_C_PrivateSetupOutlineSetting::CallFunc_GetMeshCustomStencil_HasCustomStencil' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_PrivateSetupOutlineSetting, CallFunc_GetMeshCustomStencil_CustomStencil) == 0x000014, "Member 'BP_EventPlayerMaterialBase_C_PrivateSetupOutlineSetting::CallFunc_GetMeshCustomStencil_CustomStencil' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_PrivateSetupOutlineSetting, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'BP_EventPlayerMaterialBase_C_PrivateSetupOutlineSetting::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_PrivateSetupOutlineSetting, CallFunc_InRange_IntInt_ReturnValue) == 0x00001C, "Member 'BP_EventPlayerMaterialBase_C_PrivateSetupOutlineSetting::CallFunc_InRange_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_PrivateSetupOutlineSetting, CallFunc_IsValid_ReturnValue) == 0x00001D, "Member 'BP_EventPlayerMaterialBase_C_PrivateSetupOutlineSetting::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_EventPlayerMaterialBase.BP_EventPlayerMaterialBase_C.ProtectedInitialize
// 0x0018 (0x0018 - 0x0000)
struct BP_EventPlayerMaterialBase_C_ProtectedInitialize final
{
public:
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayerMaterialAccessorComponent_C*  AccessorComponent;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventPlayerMaterialBase_C_ProtectedInitialize) == 0x000008, "Wrong alignment on BP_EventPlayerMaterialBase_C_ProtectedInitialize");
static_assert(sizeof(BP_EventPlayerMaterialBase_C_ProtectedInitialize) == 0x000018, "Wrong size on BP_EventPlayerMaterialBase_C_ProtectedInitialize");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_ProtectedInitialize, SkeletalMesh) == 0x000000, "Member 'BP_EventPlayerMaterialBase_C_ProtectedInitialize::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_ProtectedInitialize, AccessorComponent) == 0x000008, "Member 'BP_EventPlayerMaterialBase_C_ProtectedInitialize::AccessorComponent' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_ProtectedInitialize, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_EventPlayerMaterialBase_C_ProtectedInitialize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_ProtectedInitialize, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'BP_EventPlayerMaterialBase_C_ProtectedInitialize::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_EventPlayerMaterialBase.BP_EventPlayerMaterialBase_C.ProtectedSetupOutlineMesh
// 0x0028 (0x0028 - 0x0000)
struct BP_EventPlayerMaterialBase_C_ProtectedSetupOutlineMesh final
{
public:
	class UMeshComponent*                         MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousIndex;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6559[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventPlayerMaterialBase_C_ProtectedSetupOutlineMesh) == 0x000008, "Wrong alignment on BP_EventPlayerMaterialBase_C_ProtectedSetupOutlineMesh");
static_assert(sizeof(BP_EventPlayerMaterialBase_C_ProtectedSetupOutlineMesh) == 0x000028, "Wrong size on BP_EventPlayerMaterialBase_C_ProtectedSetupOutlineMesh");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_ProtectedSetupOutlineMesh, MeshComp) == 0x000000, "Member 'BP_EventPlayerMaterialBase_C_ProtectedSetupOutlineMesh::MeshComp' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_ProtectedSetupOutlineMesh, PreviousIndex) == 0x000008, "Member 'BP_EventPlayerMaterialBase_C_ProtectedSetupOutlineMesh::PreviousIndex' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_ProtectedSetupOutlineMesh, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'BP_EventPlayerMaterialBase_C_ProtectedSetupOutlineMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_ProtectedSetupOutlineMesh, CallFunc_Array_Find_ReturnValue) == 0x000010, "Member 'BP_EventPlayerMaterialBase_C_ProtectedSetupOutlineMesh::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_ProtectedSetupOutlineMesh, CallFunc_Array_Add_ReturnValue) == 0x000014, "Member 'BP_EventPlayerMaterialBase_C_ProtectedSetupOutlineMesh::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_ProtectedSetupOutlineMesh, CallFunc_Array_Add_ReturnValue_1) == 0x000018, "Member 'BP_EventPlayerMaterialBase_C_ProtectedSetupOutlineMesh::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_ProtectedSetupOutlineMesh, CallFunc_Array_Add_ReturnValue_2) == 0x00001C, "Member 'BP_EventPlayerMaterialBase_C_ProtectedSetupOutlineMesh::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_ProtectedSetupOutlineMesh, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000020, "Member 'BP_EventPlayerMaterialBase_C_ProtectedSetupOutlineMesh::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_ProtectedSetupOutlineMesh, CallFunc_Greater_IntInt_ReturnValue) == 0x000021, "Member 'BP_EventPlayerMaterialBase_C_ProtectedSetupOutlineMesh::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BP_EventPlayerMaterialBase.BP_EventPlayerMaterialBase_C.ProtectedSetupEventOptimizeCustomStencil
// 0x0010 (0x0010 - 0x0000)
struct BP_EventPlayerMaterialBase_C_ProtectedSetupEventOptimizeCustomStencil final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_655A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     EventManager;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPlayerMaterialBase_C_ProtectedSetupEventOptimizeCustomStencil) == 0x000008, "Wrong alignment on BP_EventPlayerMaterialBase_C_ProtectedSetupEventOptimizeCustomStencil");
static_assert(sizeof(BP_EventPlayerMaterialBase_C_ProtectedSetupEventOptimizeCustomStencil) == 0x000010, "Wrong size on BP_EventPlayerMaterialBase_C_ProtectedSetupEventOptimizeCustomStencil");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_ProtectedSetupEventOptimizeCustomStencil, Enable) == 0x000000, "Member 'BP_EventPlayerMaterialBase_C_ProtectedSetupEventOptimizeCustomStencil::Enable' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_ProtectedSetupEventOptimizeCustomStencil, EventManager) == 0x000008, "Member 'BP_EventPlayerMaterialBase_C_ProtectedSetupEventOptimizeCustomStencil::EventManager' has a wrong offset!");

// Function BP_EventPlayerMaterialBase.BP_EventPlayerMaterialBase_C.Finalize
// 0x0028 (0x0028 - 0x0000)
struct BP_EventPlayerMaterialBase_C_Finalize final
{
public:
	class UMeshComponent*                         MeshComp;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_655B[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_655C[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPlayerMaterialBase_C_Finalize) == 0x000008, "Wrong alignment on BP_EventPlayerMaterialBase_C_Finalize");
static_assert(sizeof(BP_EventPlayerMaterialBase_C_Finalize) == 0x000028, "Wrong size on BP_EventPlayerMaterialBase_C_Finalize");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_Finalize, MeshComp) == 0x000000, "Member 'BP_EventPlayerMaterialBase_C_Finalize::MeshComp' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_Finalize, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_EventPlayerMaterialBase_C_Finalize::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_Finalize, Temp_int_Loop_Num_Variable) == 0x00000C, "Member 'BP_EventPlayerMaterialBase_C_Finalize::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_Finalize, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_EventPlayerMaterialBase_C_Finalize::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_Finalize, CallFunc_Less_IntInt_ReturnValue) == 0x000014, "Member 'BP_EventPlayerMaterialBase_C_Finalize::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_Finalize, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_EventPlayerMaterialBase_C_Finalize::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_Finalize, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'BP_EventPlayerMaterialBase_C_Finalize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_Finalize, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_EventPlayerMaterialBase_C_Finalize::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function BP_EventPlayerMaterialBase.BP_EventPlayerMaterialBase_C.GetMeshCustomStencil
// 0x0010 (0x0010 - 0x0000)
struct BP_EventPlayerMaterialBase_C_GetMeshCustomStencil final
{
public:
	class USkeletalMeshComponent*                 SkelMeshComp;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasCustomStencil;                                  // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_655D[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CustomStencil;                                     // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPlayerMaterialBase_C_GetMeshCustomStencil) == 0x000008, "Wrong alignment on BP_EventPlayerMaterialBase_C_GetMeshCustomStencil");
static_assert(sizeof(BP_EventPlayerMaterialBase_C_GetMeshCustomStencil) == 0x000010, "Wrong size on BP_EventPlayerMaterialBase_C_GetMeshCustomStencil");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_GetMeshCustomStencil, SkelMeshComp) == 0x000000, "Member 'BP_EventPlayerMaterialBase_C_GetMeshCustomStencil::SkelMeshComp' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_GetMeshCustomStencil, HasCustomStencil) == 0x000008, "Member 'BP_EventPlayerMaterialBase_C_GetMeshCustomStencil::HasCustomStencil' has a wrong offset!");
static_assert(offsetof(BP_EventPlayerMaterialBase_C_GetMeshCustomStencil, CustomStencil) == 0x00000C, "Member 'BP_EventPlayerMaterialBase_C_GetMeshCustomStencil::CustomStencil' has a wrong offset!");

}

