#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventPlayerMaterialBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EventPlayerMaterialBase.BP_EventPlayerMaterialBase_C
// 0x0060 (0x0290 - 0x0230)
class ABP_EventPlayerMaterialBase_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         TargetMesh;                                        // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoOutlineSetting;                                // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OutlineSettingENPC;                                // 0x0249(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6556[0x2];                                     // 0x024A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OutlineSettingPlayer;                              // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RestoreOverrideParameter;                          // 0x0250(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsInitialized;                                     // 0x0251(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SetupEventOptimizeCustomStencil;                   // 0x0252(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6557[0x5];                                     // 0x0253(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  AutoOutlineRestore;                                // 0x0258(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<int32>                                 AutoOutlineRestoreStencil;                         // 0x0268(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UMeshComponent*>                 AutoOutlineRestoreMesh;                            // 0x0278(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          RestoreCustomStencil;                              // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_EventPlayerMaterialBase(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void PrivateSetupOutlineSetting(class USkeletalMeshComponent* SkeletalMesh, class UBP_PlayerMaterialAccessorComponent_C* AccessorComponent);
	void ProtectedInitialize(class USkeletalMeshComponent* SkeletalMesh, class UBP_PlayerMaterialAccessorComponent_C* AccessorComponent);
	void ProtectedSetupOutlineMesh(class UMeshComponent* MeshComp);
	void ProtectedSetupEventOptimizeCustomStencil(bool Enable);
	void EnableEventOptimizeCustomStencil();
	void Finalize();
	void GetMeshCustomStencil(class USkeletalMeshComponent* SkelMeshComp, bool* HasCustomStencil, int32* CustomStencil);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EventPlayerMaterialBase_C">();
	}
	static class ABP_EventPlayerMaterialBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EventPlayerMaterialBase_C>();
	}
};
static_assert(alignof(ABP_EventPlayerMaterialBase_C) == 0x000008, "Wrong alignment on ABP_EventPlayerMaterialBase_C");
static_assert(sizeof(ABP_EventPlayerMaterialBase_C) == 0x000290, "Wrong size on ABP_EventPlayerMaterialBase_C");
static_assert(offsetof(ABP_EventPlayerMaterialBase_C, UberGraphFrame) == 0x000230, "Member 'ABP_EventPlayerMaterialBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EventPlayerMaterialBase_C, DefaultSceneRoot) == 0x000238, "Member 'ABP_EventPlayerMaterialBase_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_EventPlayerMaterialBase_C, TargetMesh) == 0x000240, "Member 'ABP_EventPlayerMaterialBase_C::TargetMesh' has a wrong offset!");
static_assert(offsetof(ABP_EventPlayerMaterialBase_C, AutoOutlineSetting) == 0x000248, "Member 'ABP_EventPlayerMaterialBase_C::AutoOutlineSetting' has a wrong offset!");
static_assert(offsetof(ABP_EventPlayerMaterialBase_C, OutlineSettingENPC) == 0x000249, "Member 'ABP_EventPlayerMaterialBase_C::OutlineSettingENPC' has a wrong offset!");
static_assert(offsetof(ABP_EventPlayerMaterialBase_C, OutlineSettingPlayer) == 0x00024C, "Member 'ABP_EventPlayerMaterialBase_C::OutlineSettingPlayer' has a wrong offset!");
static_assert(offsetof(ABP_EventPlayerMaterialBase_C, RestoreOverrideParameter) == 0x000250, "Member 'ABP_EventPlayerMaterialBase_C::RestoreOverrideParameter' has a wrong offset!");
static_assert(offsetof(ABP_EventPlayerMaterialBase_C, IsInitialized) == 0x000251, "Member 'ABP_EventPlayerMaterialBase_C::IsInitialized' has a wrong offset!");
static_assert(offsetof(ABP_EventPlayerMaterialBase_C, SetupEventOptimizeCustomStencil) == 0x000252, "Member 'ABP_EventPlayerMaterialBase_C::SetupEventOptimizeCustomStencil' has a wrong offset!");
static_assert(offsetof(ABP_EventPlayerMaterialBase_C, AutoOutlineRestore) == 0x000258, "Member 'ABP_EventPlayerMaterialBase_C::AutoOutlineRestore' has a wrong offset!");
static_assert(offsetof(ABP_EventPlayerMaterialBase_C, AutoOutlineRestoreStencil) == 0x000268, "Member 'ABP_EventPlayerMaterialBase_C::AutoOutlineRestoreStencil' has a wrong offset!");
static_assert(offsetof(ABP_EventPlayerMaterialBase_C, AutoOutlineRestoreMesh) == 0x000278, "Member 'ABP_EventPlayerMaterialBase_C::AutoOutlineRestoreMesh' has a wrong offset!");
static_assert(offsetof(ABP_EventPlayerMaterialBase_C, RestoreCustomStencil) == 0x000288, "Member 'ABP_EventPlayerMaterialBase_C::RestoreCustomStencil' has a wrong offset!");

}

