#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EffectBackground

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EffectBackground.BP_EffectBackground_C.SpawnBGEmitter__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_EffectBackground_C_SpawnBGEmitter__DelegateSignature final
{
public:
	class UBP_RSParticleBackgroundComponent_C*    Param_Emitter;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EffectBackground_C_SpawnBGEmitter__DelegateSignature) == 0x000008, "Wrong alignment on BP_EffectBackground_C_SpawnBGEmitter__DelegateSignature");
static_assert(sizeof(BP_EffectBackground_C_SpawnBGEmitter__DelegateSignature) == 0x000008, "Wrong size on BP_EffectBackground_C_SpawnBGEmitter__DelegateSignature");
static_assert(offsetof(BP_EffectBackground_C_SpawnBGEmitter__DelegateSignature, Param_Emitter) == 0x000000, "Member 'BP_EffectBackground_C_SpawnBGEmitter__DelegateSignature::Param_Emitter' has a wrong offset!");

// Function BP_EffectBackground.BP_EffectBackground_C.ExecuteUbergraph_BP_EffectBackground
// 0x0108 (0x0108 - 0x0000)
struct BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8344[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ParticleManager_C*                  CallFunc_GetParticleManager_Particle_Manager;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8345[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BackGroundEffect_C> CallFunc_RegistEffectBackGround_self_CastInput;    // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_RegistEffectBackGround_ArrayNumber;       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_Parent;                               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8346[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ParticleManager_C*                  CallFunc_GetParticleManager_Particle_Manager_1;    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8347[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BackGroundEffect_C> CallFunc_UnregistEffectBackGround_self_CastInput;  // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class URSParticleSystemComponentBase*         CallFunc_SpawnEmitterAtLocationOptional_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_RSParticleBackgroundComponent_C*    K2Node_DynamicCast_AsBP_RSParticle_Background_Component; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8348[0x2];                                     // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_EmitterTime;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Velocity;                       // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	class ABP_SoundManager_C*                     CallFunc_GetSoundManager_SoundManager;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8349[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARsBattleHero_C*                        K2Node_DynamicCast_AsRs_Battle_Hero;               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground) == 0x000008, "Wrong alignment on BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground");
static_assert(sizeof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground) == 0x000108, "Wrong size on BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, EntryPoint) == 0x000000, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, CallFunc_GetParticleManager_Particle_Manager) == 0x000018, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::CallFunc_GetParticleManager_Particle_Manager' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, CallFunc_RegistEffectBackGround_self_CastInput) == 0x000028, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::CallFunc_RegistEffectBackGround_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, CallFunc_RegistEffectBackGround_ArrayNumber) == 0x000038, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::CallFunc_RegistEffectBackGround_ArrayNumber' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00003C, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, CallFunc_GetActorScale3D_ReturnValue) == 0x000048, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, CallFunc_IsValid_ReturnValue_1) == 0x000054, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, CallFunc_IsValid_ReturnValue_2) == 0x000055, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, Temp_bool_Has_Been_Initd_Variable) == 0x000056, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, CallFunc_IsValid_ReturnValue_3) == 0x000057, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, K2Node_Event_Parent) == 0x000058, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::K2Node_Event_Parent' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, CallFunc_IsValid_ReturnValue_4) == 0x000060, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, CallFunc_IsValid_ReturnValue_5) == 0x000061, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, K2Node_Event_EndPlayReason) == 0x000062, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, Temp_bool_IsClosed_Variable) == 0x000063, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, CallFunc_GetParticleManager_Particle_Manager_1) == 0x000068, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::CallFunc_GetParticleManager_Particle_Manager_1' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, CallFunc_IsValid_ReturnValue_6) == 0x000070, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, CallFunc_UnregistEffectBackGround_self_CastInput) == 0x000078, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::CallFunc_UnregistEffectBackGround_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, CallFunc_SpawnEmitterAtLocationOptional_ReturnValue) == 0x000088, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::CallFunc_SpawnEmitterAtLocationOptional_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, K2Node_DynamicCast_AsBP_RSParticle_Background_Component) == 0x000090, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::K2Node_DynamicCast_AsBP_RSParticle_Background_Component' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, CallFunc_IsValid_ReturnValue_7) == 0x000099, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, K2Node_CustomEvent_EventName) == 0x00009C, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, K2Node_CustomEvent_EmitterTime) == 0x0000A4, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::K2Node_CustomEvent_EmitterTime' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, K2Node_CustomEvent_Location) == 0x0000A8, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, K2Node_CustomEvent_Velocity) == 0x0000B4, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::K2Node_CustomEvent_Velocity' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, K2Node_CreateDelegate_OutputDelegate) == 0x0000C0, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, CallFunc_GetSoundManager_SoundManager) == 0x0000D0, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::CallFunc_GetSoundManager_SoundManager' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000D8, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, CallFunc_IsValid_ReturnValue_8) == 0x0000E0, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, CallFunc_GetPlayerController_ReturnValue) == 0x0000E8, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, CallFunc_K2_GetPawn_ReturnValue) == 0x0000F0, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, K2Node_DynamicCast_AsRs_Battle_Hero) == 0x0000F8, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::K2Node_DynamicCast_AsRs_Battle_Hero' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground, K2Node_DynamicCast_bSuccess_1) == 0x000100, "Member 'BP_EffectBackground_C_ExecuteUbergraph_BP_EffectBackground::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_EffectBackground.BP_EffectBackground_C.CallParticleSE
// 0x0024 (0x0024 - 0x0000)
struct BP_EffectBackground_C_CallParticleSE final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmitterTime;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Velocity;                                          // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EffectBackground_C_CallParticleSE) == 0x000004, "Wrong alignment on BP_EffectBackground_C_CallParticleSE");
static_assert(sizeof(BP_EffectBackground_C_CallParticleSE) == 0x000024, "Wrong size on BP_EffectBackground_C_CallParticleSE");
static_assert(offsetof(BP_EffectBackground_C_CallParticleSE, EventName) == 0x000000, "Member 'BP_EffectBackground_C_CallParticleSE::EventName' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_CallParticleSE, EmitterTime) == 0x000008, "Member 'BP_EffectBackground_C_CallParticleSE::EmitterTime' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_CallParticleSE, Location) == 0x00000C, "Member 'BP_EffectBackground_C_CallParticleSE::Location' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_CallParticleSE, Velocity) == 0x000018, "Member 'BP_EffectBackground_C_CallParticleSE::Velocity' has a wrong offset!");

// Function BP_EffectBackground.BP_EffectBackground_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_EffectBackground_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EffectBackground_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_EffectBackground_C_ReceiveEndPlay");
static_assert(sizeof(BP_EffectBackground_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_EffectBackground_C_ReceiveEndPlay");
static_assert(offsetof(BP_EffectBackground_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_EffectBackground_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_EffectBackground.BP_EffectBackground_C.ProtectedAttachParticle
// 0x0008 (0x0008 - 0x0000)
struct BP_EffectBackground_C_ProtectedAttachParticle final
{
public:
	class AActor*                                 Parent;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EffectBackground_C_ProtectedAttachParticle) == 0x000008, "Wrong alignment on BP_EffectBackground_C_ProtectedAttachParticle");
static_assert(sizeof(BP_EffectBackground_C_ProtectedAttachParticle) == 0x000008, "Wrong size on BP_EffectBackground_C_ProtectedAttachParticle");
static_assert(offsetof(BP_EffectBackground_C_ProtectedAttachParticle, Parent) == 0x000000, "Member 'BP_EffectBackground_C_ProtectedAttachParticle::Parent' has a wrong offset!");

// Function BP_EffectBackground.BP_EffectBackground_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_EffectBackground_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EffectBackground_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_EffectBackground_C_ReceiveTick");
static_assert(sizeof(BP_EffectBackground_C_ReceiveTick) == 0x000004, "Wrong size on BP_EffectBackground_C_ReceiveTick");
static_assert(offsetof(BP_EffectBackground_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_EffectBackground_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_EffectBackground.BP_EffectBackground_C.PlayParticle
// 0x0001 (0x0001 - 0x0000)
struct BP_EffectBackground_C_PlayParticle final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EffectBackground_C_PlayParticle) == 0x000001, "Wrong alignment on BP_EffectBackground_C_PlayParticle");
static_assert(sizeof(BP_EffectBackground_C_PlayParticle) == 0x000001, "Wrong size on BP_EffectBackground_C_PlayParticle");
static_assert(offsetof(BP_EffectBackground_C_PlayParticle, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_EffectBackground_C_PlayParticle::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_EffectBackground.BP_EffectBackground_C.StopParticle
// 0x0001 (0x0001 - 0x0000)
struct BP_EffectBackground_C_StopParticle final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EffectBackground_C_StopParticle) == 0x000001, "Wrong alignment on BP_EffectBackground_C_StopParticle");
static_assert(sizeof(BP_EffectBackground_C_StopParticle) == 0x000001, "Wrong size on BP_EffectBackground_C_StopParticle");
static_assert(offsetof(BP_EffectBackground_C_StopParticle, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_EffectBackground_C_StopParticle::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_EffectBackground.BP_EffectBackground_C.PrivateUpdateAttachParent
// 0x009C (0x009C - 0x0000)
struct BP_EffectBackground_C_PrivateUpdateAttachParent final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_834A[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0010(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EffectBackground_C_PrivateUpdateAttachParent) == 0x000004, "Wrong alignment on BP_EffectBackground_C_PrivateUpdateAttachParent");
static_assert(sizeof(BP_EffectBackground_C_PrivateUpdateAttachParent) == 0x00009C, "Wrong size on BP_EffectBackground_C_PrivateUpdateAttachParent");
static_assert(offsetof(BP_EffectBackground_C_PrivateUpdateAttachParent, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_EffectBackground_C_PrivateUpdateAttachParent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_PrivateUpdateAttachParent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'BP_EffectBackground_C_PrivateUpdateAttachParent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_PrivateUpdateAttachParent, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000010, "Member 'BP_EffectBackground_C_PrivateUpdateAttachParent::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_PrivateUpdateAttachParent, CallFunc_IsActive_ReturnValue) == 0x000098, "Member 'BP_EffectBackground_C_PrivateUpdateAttachParent::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_PrivateUpdateAttachParent, CallFunc_IsValid_ReturnValue_1) == 0x000099, "Member 'BP_EffectBackground_C_PrivateUpdateAttachParent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_EffectBackground.BP_EffectBackground_C.SetEventCulling
// 0x0002 (0x0002 - 0x0000)
struct BP_EffectBackground_C_SetEventCulling final
{
public:
	bool                                          Culling;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EffectBackground_C_SetEventCulling) == 0x000001, "Wrong alignment on BP_EffectBackground_C_SetEventCulling");
static_assert(sizeof(BP_EffectBackground_C_SetEventCulling) == 0x000002, "Wrong size on BP_EffectBackground_C_SetEventCulling");
static_assert(offsetof(BP_EffectBackground_C_SetEventCulling, Culling) == 0x000000, "Member 'BP_EffectBackground_C_SetEventCulling::Culling' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_SetEventCulling, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_EffectBackground_C_SetEventCulling::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_EffectBackground.BP_EffectBackground_C.SetDitherValue
// 0x0030 (0x0030 - 0x0000)
struct BP_EffectBackground_C_SetDitherValue final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_834B[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_834C[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       CallFunc_GetDynamicMaterialInstanceALL_ReturnValue; // 0x0018(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EffectBackground_C_SetDitherValue) == 0x000008, "Wrong alignment on BP_EffectBackground_C_SetDitherValue");
static_assert(sizeof(BP_EffectBackground_C_SetDitherValue) == 0x000030, "Wrong size on BP_EffectBackground_C_SetDitherValue");
static_assert(offsetof(BP_EffectBackground_C_SetDitherValue, Value) == 0x000000, "Member 'BP_EffectBackground_C_SetDitherValue::Value' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_SetDitherValue, ReturnValue) == 0x000004, "Member 'BP_EffectBackground_C_SetDitherValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectBackground_C_SetDitherValue, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_EffectBackground_C_SetDitherValue::Temp_int_Array_Index_Variable' has a wrong offset!");
