#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Event3DWidgetActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BP_Event3DWidgetActor.BP_Event3DWidgetActor_C.ExecuteUbergraph_BP_Event3DWidgetActor
// 0x0068 (0x0068 - 0x0000)
struct BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96C2[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96C3[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96C4[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_BrainMes_C*                      K2Node_DynamicCast_AsWB_Ui_Brain_Mes;              // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96C5[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_2;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEventType                                    CallFunc_GetEventType_EventType;                   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCutSceneEvent_IsCutSceneEvent;          // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96C6[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor) == 0x000008, "Wrong alignment on BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor");
static_assert(sizeof(BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor) == 0x000068, "Wrong size on BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor");
static_assert(offsetof(BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor, EntryPoint) == 0x000000, "Member 'BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor, K2Node_Event_EndPlayReason) == 0x000008, "Member 'BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor, CallFunc_GetEventManager_EventManager) == 0x000010, "Member 'BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor, CallFunc_Conv_StringToName_ReturnValue) == 0x000018, "Member 'BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor, CallFunc_GetEventManager_EventManager_1) == 0x000028, "Member 'BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor::CallFunc_GetEventManager_EventManager_1' has a wrong offset!");
static_assert(offsetof(BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor, CallFunc_Array_Add_ReturnValue) == 0x000030, "Member 'BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor, CallFunc_IsValid_ReturnValue_1) == 0x000034, "Member 'BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor, CallFunc_Array_RemoveItem_ReturnValue) == 0x000035, "Member 'BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000038, "Member 'BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor, K2Node_DynamicCast_AsWB_Ui_Brain_Mes) == 0x000040, "Member 'BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor::K2Node_DynamicCast_AsWB_Ui_Brain_Mes' has a wrong offset!");
static_assert(offsetof(BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor, CallFunc_GetEventManager_EventManager_2) == 0x000050, "Member 'BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor::CallFunc_GetEventManager_EventManager_2' has a wrong offset!");
static_assert(offsetof(BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor, CallFunc_IsValid_ReturnValue_2) == 0x000058, "Member 'BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor, CallFunc_GetEventType_EventType) == 0x000059, "Member 'BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor::CallFunc_GetEventType_EventType' has a wrong offset!");
static_assert(offsetof(BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor, K2Node_SwitchEnum_CmpSuccess) == 0x00005A, "Member 'BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor, CallFunc_IsCutSceneEvent_IsCutSceneEvent) == 0x00005B, "Member 'BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor::CallFunc_IsCutSceneEvent_IsCutSceneEvent' has a wrong offset!");
static_assert(offsetof(BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor, Temp_int_Variable) == 0x00005C, "Member 'BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000060, "Member 'BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'BP_Event3DWidgetActor_C_ExecuteUbergraph_BP_Event3DWidgetActor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Event3DWidgetActor.BP_Event3DWidgetActor_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Event3DWidgetActor_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Event3DWidgetActor_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Event3DWidgetActor_C_ReceiveEndPlay");
static_assert(sizeof(BP_Event3DWidgetActor_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Event3DWidgetActor_C_ReceiveEndPlay");
static_assert(offsetof(BP_Event3DWidgetActor_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Event3DWidgetActor_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_Event3DWidgetActor.BP_Event3DWidgetActor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Event3DWidgetActor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Event3DWidgetActor_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Event3DWidgetActor_C_ReceiveTick");
static_assert(sizeof(BP_Event3DWidgetActor_C_ReceiveTick) == 0x000004, "Wrong size on BP_Event3DWidgetActor_C_ReceiveTick");
static_assert(offsetof(BP_Event3DWidgetActor_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Event3DWidgetActor_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Event3DWidgetActor.BP_Event3DWidgetActor_C.SetBrainMesCurrentThreadID
// 0x0020 (0x0020 - 0x0000)
struct BP_Event3DWidgetActor_C_SetBrainMesCurrentThreadID final
{
public:
	class FName                                   Param_ThreadID;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_BrainMes_C*                      K2Node_DynamicCast_AsWB_Ui_Brain_Mes;              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Event3DWidgetActor_C_SetBrainMesCurrentThreadID) == 0x000008, "Wrong alignment on BP_Event3DWidgetActor_C_SetBrainMesCurrentThreadID");
static_assert(sizeof(BP_Event3DWidgetActor_C_SetBrainMesCurrentThreadID) == 0x000020, "Wrong size on BP_Event3DWidgetActor_C_SetBrainMesCurrentThreadID");
static_assert(offsetof(BP_Event3DWidgetActor_C_SetBrainMesCurrentThreadID, Param_ThreadID) == 0x000000, "Member 'BP_Event3DWidgetActor_C_SetBrainMesCurrentThreadID::Param_ThreadID' has a wrong offset!");
static_assert(offsetof(BP_Event3DWidgetActor_C_SetBrainMesCurrentThreadID, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000008, "Member 'BP_Event3DWidgetActor_C_SetBrainMesCurrentThreadID::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Event3DWidgetActor_C_SetBrainMesCurrentThreadID, K2Node_DynamicCast_AsWB_Ui_Brain_Mes) == 0x000010, "Member 'BP_Event3DWidgetActor_C_SetBrainMesCurrentThreadID::K2Node_DynamicCast_AsWB_Ui_Brain_Mes' has a wrong offset!");
static_assert(offsetof(BP_Event3DWidgetActor_C_SetBrainMesCurrentThreadID, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Event3DWidgetActor_C_SetBrainMesCurrentThreadID::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_Event3DWidgetActor.BP_Event3DWidgetActor_C.UpdateOverrideMaterial
// 0x0002 (0x0002 - 0x0000)
struct BP_Event3DWidgetActor_C_UpdateOverrideMaterial final
{
public:
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Event3DWidgetActor_C_UpdateOverrideMaterial) == 0x000001, "Wrong alignment on BP_Event3DWidgetActor_C_UpdateOverrideMaterial");
static_assert(sizeof(BP_Event3DWidgetActor_C_UpdateOverrideMaterial) == 0x000002, "Wrong size on BP_Event3DWidgetActor_C_UpdateOverrideMaterial");
static_assert(offsetof(BP_Event3DWidgetActor_C_UpdateOverrideMaterial, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000000, "Member 'BP_Event3DWidgetActor_C_UpdateOverrideMaterial::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Event3DWidgetActor_C_UpdateOverrideMaterial, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_Event3DWidgetActor_C_UpdateOverrideMaterial::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

