#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnemyWeaponManageComponent

#include "Basic.hpp"

#include "FBulletManageData_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_EnemyWeaponManageComponent.BP_EnemyWeaponManageComponent_C.ExecuteUbergraph_BP_EnemyWeaponManageComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_EnemyWeaponManageComponent_C_ExecuteUbergraph_BP_EnemyWeaponManageComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyWeaponManageComponent_C_ExecuteUbergraph_BP_EnemyWeaponManageComponent) == 0x000004, "Wrong alignment on BP_EnemyWeaponManageComponent_C_ExecuteUbergraph_BP_EnemyWeaponManageComponent");
static_assert(sizeof(BP_EnemyWeaponManageComponent_C_ExecuteUbergraph_BP_EnemyWeaponManageComponent) == 0x000008, "Wrong size on BP_EnemyWeaponManageComponent_C_ExecuteUbergraph_BP_EnemyWeaponManageComponent");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_ExecuteUbergraph_BP_EnemyWeaponManageComponent, EntryPoint) == 0x000000, "Member 'BP_EnemyWeaponManageComponent_C_ExecuteUbergraph_BP_EnemyWeaponManageComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_ExecuteUbergraph_BP_EnemyWeaponManageComponent, K2Node_Event_EndPlayReason) == 0x000004, "Member 'BP_EnemyWeaponManageComponent_C_ExecuteUbergraph_BP_EnemyWeaponManageComponent::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BP_EnemyWeaponManageComponent.BP_EnemyWeaponManageComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_EnemyWeaponManageComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyWeaponManageComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_EnemyWeaponManageComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_EnemyWeaponManageComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_EnemyWeaponManageComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_EnemyWeaponManageComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_EnemyWeaponManageComponent.BP_EnemyWeaponManageComponent_C.AddWeapon
// 0x0090 (0x0090 - 0x0000)
struct BP_EnemyWeaponManageComponent_C_AddWeapon final
{
public:
	class UClass*                                 WeaponClass;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WeaponNum;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          L_bSuccess;                                        // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58E9[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58EA[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Enemy_Weapon_C*                     CallFunc_FinishSpawningActor_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetWeaponVisibility_Dummy;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetWeaponActivate_Dummy;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58EB[0x2];                                     // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58EC[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFBulletManageData                     K2Node_MakeStruct_FBulletManageData;               // 0x0074(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58ED[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFBulletManageData                     CallFunc_Map_Find_Value;                           // 0x0080(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyWeaponManageComponent_C_AddWeapon) == 0x000010, "Wrong alignment on BP_EnemyWeaponManageComponent_C_AddWeapon");
static_assert(sizeof(BP_EnemyWeaponManageComponent_C_AddWeapon) == 0x000090, "Wrong size on BP_EnemyWeaponManageComponent_C_AddWeapon");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_AddWeapon, WeaponClass) == 0x000000, "Member 'BP_EnemyWeaponManageComponent_C_AddWeapon::WeaponClass' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_AddWeapon, WeaponNum) == 0x000008, "Member 'BP_EnemyWeaponManageComponent_C_AddWeapon::WeaponNum' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_AddWeapon, bSuccess) == 0x00000C, "Member 'BP_EnemyWeaponManageComponent_C_AddWeapon::bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_AddWeapon, L_bSuccess) == 0x00000D, "Member 'BP_EnemyWeaponManageComponent_C_AddWeapon::L_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_AddWeapon, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_EnemyWeaponManageComponent_C_AddWeapon::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_AddWeapon, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'BP_EnemyWeaponManageComponent_C_AddWeapon::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_AddWeapon, Temp_int_Variable) == 0x000048, "Member 'BP_EnemyWeaponManageComponent_C_AddWeapon::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_AddWeapon, CallFunc_FinishSpawningActor_ReturnValue) == 0x000050, "Member 'BP_EnemyWeaponManageComponent_C_AddWeapon::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_AddWeapon, CallFunc_SetWeaponVisibility_Dummy) == 0x000058, "Member 'BP_EnemyWeaponManageComponent_C_AddWeapon::CallFunc_SetWeaponVisibility_Dummy' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_AddWeapon, CallFunc_SetWeaponActivate_Dummy) == 0x000059, "Member 'BP_EnemyWeaponManageComponent_C_AddWeapon::CallFunc_SetWeaponActivate_Dummy' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_AddWeapon, CallFunc_Array_Add_ReturnValue) == 0x00005C, "Member 'BP_EnemyWeaponManageComponent_C_AddWeapon::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_AddWeapon, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000060, "Member 'BP_EnemyWeaponManageComponent_C_AddWeapon::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_AddWeapon, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'BP_EnemyWeaponManageComponent_C_AddWeapon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_AddWeapon, CallFunc_Subtract_IntInt_ReturnValue) == 0x000068, "Member 'BP_EnemyWeaponManageComponent_C_AddWeapon::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_AddWeapon, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'BP_EnemyWeaponManageComponent_C_AddWeapon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_AddWeapon, CallFunc_Add_IntInt_ReturnValue_1) == 0x000070, "Member 'BP_EnemyWeaponManageComponent_C_AddWeapon::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_AddWeapon, K2Node_MakeStruct_FBulletManageData) == 0x000074, "Member 'BP_EnemyWeaponManageComponent_C_AddWeapon::K2Node_MakeStruct_FBulletManageData' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_AddWeapon, CallFunc_Greater_IntInt_ReturnValue) == 0x00007C, "Member 'BP_EnemyWeaponManageComponent_C_AddWeapon::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_AddWeapon, CallFunc_Map_Find_Value) == 0x000080, "Member 'BP_EnemyWeaponManageComponent_C_AddWeapon::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_AddWeapon, CallFunc_Map_Find_ReturnValue) == 0x000088, "Member 'BP_EnemyWeaponManageComponent_C_AddWeapon::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_AddWeapon, CallFunc_Not_PreBool_ReturnValue) == 0x000089, "Member 'BP_EnemyWeaponManageComponent_C_AddWeapon::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_AddWeapon, CallFunc_IsValidClass_ReturnValue) == 0x00008A, "Member 'BP_EnemyWeaponManageComponent_C_AddWeapon::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");

// Function BP_EnemyWeaponManageComponent.BP_EnemyWeaponManageComponent_C.GetUnusedWeapon
// 0x00E8 (0x00E8 - 0x0000)
struct BP_EnemyWeaponManageComponent_C_GetUnusedWeapon final
{
public:
	class UClass*                                 WeaponClass;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Enemy_Weapon_C*                     Weapon;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Enemy_Weapon_C*                     L_Weapon;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFBulletManageData                     L_data;                                            // 0x0018(0x0008)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58EE[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58EF[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_IsWeaponActiveNative_ReturnValue;         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58F0[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B8(0x0018)()
	class ABP_Enemy_Weapon_C*                     CallFunc_Array_Get_Item;                           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58F1[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFBulletManageData                     CallFunc_Map_Find_Value;                           // 0x00DC(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyWeaponManageComponent_C_GetUnusedWeapon) == 0x000008, "Wrong alignment on BP_EnemyWeaponManageComponent_C_GetUnusedWeapon");
static_assert(sizeof(BP_EnemyWeaponManageComponent_C_GetUnusedWeapon) == 0x0000E8, "Wrong size on BP_EnemyWeaponManageComponent_C_GetUnusedWeapon");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeapon, WeaponClass) == 0x000000, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeapon::WeaponClass' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeapon, Weapon) == 0x000008, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeapon::Weapon' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeapon, L_Weapon) == 0x000010, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeapon::L_Weapon' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeapon, L_data) == 0x000018, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeapon::L_data' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeapon, Temp_int_Variable) == 0x000020, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeapon::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeapon, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeapon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeapon, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000028, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeapon::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeapon, CallFunc_GetClassDisplayName_ReturnValue) == 0x000030, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeapon::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeapon, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeapon, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeapon::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeapon, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeapon::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeapon, CallFunc_IsWeaponActiveNative_ReturnValue) == 0x0000A0, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeapon::CallFunc_IsWeaponActiveNative_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeapon, K2Node_MakeArray_Array) == 0x0000A8, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeapon::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeapon, CallFunc_Format_ReturnValue) == 0x0000B8, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeapon::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeapon, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeapon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeapon, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000D8, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeapon::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeapon, CallFunc_Map_Find_Value) == 0x0000DC, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeapon::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeapon, CallFunc_Map_Find_ReturnValue) == 0x0000E4, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeapon::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function BP_EnemyWeaponManageComponent.BP_EnemyWeaponManageComponent_C.RemoveAllWeapon
// 0x0020 (0x0020 - 0x0000)
struct BP_EnemyWeaponManageComponent_C_RemoveAllWeapon final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58F2[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Enemy_Weapon_C*                     CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyWeaponManageComponent_C_RemoveAllWeapon) == 0x000008, "Wrong alignment on BP_EnemyWeaponManageComponent_C_RemoveAllWeapon");
static_assert(sizeof(BP_EnemyWeaponManageComponent_C_RemoveAllWeapon) == 0x000020, "Wrong size on BP_EnemyWeaponManageComponent_C_RemoveAllWeapon");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_RemoveAllWeapon, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_EnemyWeaponManageComponent_C_RemoveAllWeapon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_RemoveAllWeapon, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_EnemyWeaponManageComponent_C_RemoveAllWeapon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_RemoveAllWeapon, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_EnemyWeaponManageComponent_C_RemoveAllWeapon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_RemoveAllWeapon, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_EnemyWeaponManageComponent_C_RemoveAllWeapon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_RemoveAllWeapon, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_EnemyWeaponManageComponent_C_RemoveAllWeapon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_RemoveAllWeapon, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_EnemyWeaponManageComponent_C_RemoveAllWeapon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_RemoveAllWeapon, CallFunc_IsValid_ReturnValue) == 0x00001D, "Member 'BP_EnemyWeaponManageComponent_C_RemoveAllWeapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_EnemyWeaponManageComponent.BP_EnemyWeaponManageComponent_C.GetUsedWeaponAllList
// 0x0040 (0x0040 - 0x0000)
struct BP_EnemyWeaponManageComponent_C_GetUsedWeaponAllList final
{
public:
	TArray<class ABP_Enemy_Weapon_C*>             Param_WeaponList;                                  // 0x0000(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	TArray<class ABP_Enemy_Weapon_C*>             L_list;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	class ABP_Enemy_Weapon_C*                     L_Weapon;                                          // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattleEnemy_C*                       K2Node_DynamicCast_AsRSBattle_Enemy;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyWeaponManageComponent_C_GetUsedWeaponAllList) == 0x000008, "Wrong alignment on BP_EnemyWeaponManageComponent_C_GetUsedWeaponAllList");
static_assert(sizeof(BP_EnemyWeaponManageComponent_C_GetUsedWeaponAllList) == 0x000040, "Wrong size on BP_EnemyWeaponManageComponent_C_GetUsedWeaponAllList");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUsedWeaponAllList, Param_WeaponList) == 0x000000, "Member 'BP_EnemyWeaponManageComponent_C_GetUsedWeaponAllList::Param_WeaponList' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUsedWeaponAllList, L_list) == 0x000010, "Member 'BP_EnemyWeaponManageComponent_C_GetUsedWeaponAllList::L_list' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUsedWeaponAllList, L_Weapon) == 0x000020, "Member 'BP_EnemyWeaponManageComponent_C_GetUsedWeaponAllList::L_Weapon' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUsedWeaponAllList, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'BP_EnemyWeaponManageComponent_C_GetUsedWeaponAllList::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUsedWeaponAllList, K2Node_DynamicCast_AsRSBattle_Enemy) == 0x000030, "Member 'BP_EnemyWeaponManageComponent_C_GetUsedWeaponAllList::K2Node_DynamicCast_AsRSBattle_Enemy' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUsedWeaponAllList, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_EnemyWeaponManageComponent_C_GetUsedWeaponAllList::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_EnemyWeaponManageComponent.BP_EnemyWeaponManageComponent_C.SetEnabledUsedWeapon
// 0x0048 (0x0048 - 0x0000)
struct BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58F3[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Enemy_Weapon_C*                     LWeapon;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58F4[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Enemy_Weapon_C*>             CallFunc_GetUsedWeaponAllList_WeaponList;          // 0x0020(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class ABP_Enemy_Weapon_C*                     CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58F5[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetWeaponVisibility_Dummy;                // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon) == 0x000008, "Wrong alignment on BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon");
static_assert(sizeof(BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon) == 0x000048, "Wrong size on BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon, Enabled) == 0x000000, "Member 'BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon::Enabled' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon, LWeapon) == 0x000008, "Member 'BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon::LWeapon' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon, CallFunc_GetUsedWeaponAllList_WeaponList) == 0x000020, "Member 'BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon::CallFunc_GetUsedWeaponAllList_WeaponList' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon, CallFunc_Array_Length_ReturnValue_1) == 0x000040, "Member 'BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon, CallFunc_Greater_IntInt_ReturnValue) == 0x000044, "Member 'BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon, CallFunc_SetWeaponVisibility_Dummy) == 0x000045, "Member 'BP_EnemyWeaponManageComponent_C_SetEnabledUsedWeapon::CallFunc_SetWeaponVisibility_Dummy' has a wrong offset!");

// Function BP_EnemyWeaponManageComponent.BP_EnemyWeaponManageComponent_C.GetUnusedWeaponList
// 0x0060 (0x0060 - 0x0000)
struct BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList final
{
public:
	class UClass*                                 WeaponClass;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Enemy_Weapon_C*>             Param_WeaponList;                                  // 0x0008(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	TArray<class ABP_Enemy_Weapon_C*>             L_list;                                            // 0x0018(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	class ABP_Enemy_Weapon_C*                     L_Weapon;                                          // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFBulletManageData                     L_data;                                            // 0x0030(0x0008)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58F6[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Enemy_Weapon_C*                     CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWeaponActiveNative_ReturnValue;         // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58F7[0x1];                                     // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFBulletManageData                     CallFunc_Map_Find_Value;                           // 0x0054(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList) == 0x000008, "Wrong alignment on BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList");
static_assert(sizeof(BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList) == 0x000060, "Wrong size on BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList, WeaponClass) == 0x000000, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList::WeaponClass' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList, Param_WeaponList) == 0x000008, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList::Param_WeaponList' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList, L_list) == 0x000018, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList::L_list' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList, L_Weapon) == 0x000028, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList::L_Weapon' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList, L_data) == 0x000030, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList::L_data' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList, Temp_int_Variable) == 0x000038, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000040, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList, CallFunc_Array_Add_ReturnValue) == 0x000044, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList, CallFunc_IsWeaponActiveNative_ReturnValue) == 0x000051, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList::CallFunc_IsWeaponActiveNative_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000052, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList, CallFunc_Map_Find_Value) == 0x000054, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList, CallFunc_Map_Find_ReturnValue) == 0x00005C, "Member 'BP_EnemyWeaponManageComponent_C_GetUnusedWeaponList::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function BP_EnemyWeaponManageComponent.BP_EnemyWeaponManageComponent_C.GetUsedWeaponList
// 0x0060 (0x0060 - 0x0000)
struct BP_EnemyWeaponManageComponent_C_GetUsedWeaponList final
{
public:
	class UClass*                                 WeaponClass;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Enemy_Weapon_C*>             Param_WeaponList;                                  // 0x0008(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	class ABP_Enemy_Weapon_C*                     L_Weapon;                                          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFBulletManageData                     L_data;                                            // 0x0020(0x0008)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Enemy_Weapon_C*>             L_list;                                            // 0x0028(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58F8[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Enemy_Weapon_C*                     CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWeaponActiveNative_ReturnValue;         // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58F9[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFBulletManageData                     CallFunc_Map_Find_Value;                           // 0x0054(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyWeaponManageComponent_C_GetUsedWeaponList) == 0x000008, "Wrong alignment on BP_EnemyWeaponManageComponent_C_GetUsedWeaponList");
static_assert(sizeof(BP_EnemyWeaponManageComponent_C_GetUsedWeaponList) == 0x000060, "Wrong size on BP_EnemyWeaponManageComponent_C_GetUsedWeaponList");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUsedWeaponList, WeaponClass) == 0x000000, "Member 'BP_EnemyWeaponManageComponent_C_GetUsedWeaponList::WeaponClass' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUsedWeaponList, Param_WeaponList) == 0x000008, "Member 'BP_EnemyWeaponManageComponent_C_GetUsedWeaponList::Param_WeaponList' has a wrong offset!");
static_assert(offsetof(BP_EnemyWeaponManageComponent_C_GetUsedWeaponList, L_Weapon) == 0x000018, "Member 'BP_EnemyWeaponManageComponent_C_GetUsedWeaponList::L_Weapon' has a wrong offset!");
