#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EffectBackGroundMother

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EffectBackGroundMother.BP_EffectBackGroundMother_C
// 0x0020 (0x0258 - 0x0238)
class ABP_EffectBackGroundMother_C final : public AEffectBackgroundMother
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_RSParticleBackgroundComponent_C*> EffectBGComponents;                                // 0x0248(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_EffectBackGroundMother(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void PrivateRetryRegistParticleManager();
	void ReceiveBeginPlay();
	void BurstComponentToActor();
	void MergeEffectbackGround();
	bool MergeEffectBG();
	void PortingComponentSate(class UBP_RSParticleBackgroundComponent_C* FromComponent, class UBP_RSParticleBackgroundComponent_C*& ToComponent, bool SetWorldTransform, struct FTransform* Component_transform);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EffectBackGroundMother_C">();
	}
	static class ABP_EffectBackGroundMother_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EffectBackGroundMother_C>();
	}
};
static_assert(alignof(ABP_EffectBackGroundMother_C) == 0x000008, "Wrong alignment on ABP_EffectBackGroundMother_C");
static_assert(sizeof(ABP_EffectBackGroundMother_C) == 0x000258, "Wrong size on ABP_EffectBackGroundMother_C");
static_assert(offsetof(ABP_EffectBackGroundMother_C, UberGraphFrame) == 0x000238, "Member 'ABP_EffectBackGroundMother_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EffectBackGroundMother_C, DefaultSceneRoot) == 0x000240, "Member 'ABP_EffectBackGroundMother_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_EffectBackGroundMother_C, EffectBGComponents) == 0x000248, "Member 'ABP_EffectBackGroundMother_C::EffectBGComponents' has a wrong offset!");

}

