#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventSplineMovePoint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_EventSplineMovePoint.BP_EventSplineMovePoint_C.GetSplineTransformPoints
// 0x0080 (0x0080 - 0x0000)
struct BP_EventSplineMovePoint_C_GetSplineTransformPoints final
{
public:
	TArray<struct FTransform>                     ReturnTransformPoint;                              // 0x0000(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	TArray<struct FTransform>                     TransformPoint;                                    // 0x0010(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46D2[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46D3[0xC];                                     // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransformAtSplinePoint_ReturnValue;    // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventSplineMovePoint_C_GetSplineTransformPoints) == 0x000010, "Wrong alignment on BP_EventSplineMovePoint_C_GetSplineTransformPoints");
static_assert(sizeof(BP_EventSplineMovePoint_C_GetSplineTransformPoints) == 0x000080, "Wrong size on BP_EventSplineMovePoint_C_GetSplineTransformPoints");
static_assert(offsetof(BP_EventSplineMovePoint_C_GetSplineTransformPoints, ReturnTransformPoint) == 0x000000, "Member 'BP_EventSplineMovePoint_C_GetSplineTransformPoints::ReturnTransformPoint' has a wrong offset!");
static_assert(offsetof(BP_EventSplineMovePoint_C_GetSplineTransformPoints, TransformPoint) == 0x000010, "Member 'BP_EventSplineMovePoint_C_GetSplineTransformPoints::TransformPoint' has a wrong offset!");
static_assert(offsetof(BP_EventSplineMovePoint_C_GetSplineTransformPoints, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000020, "Member 'BP_EventSplineMovePoint_C_GetSplineTransformPoints::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventSplineMovePoint_C_GetSplineTransformPoints, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'BP_EventSplineMovePoint_C_GetSplineTransformPoints::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventSplineMovePoint_C_GetSplineTransformPoints, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'BP_EventSplineMovePoint_C_GetSplineTransformPoints::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventSplineMovePoint_C_GetSplineTransformPoints, Temp_int_Variable) == 0x00002C, "Member 'BP_EventSplineMovePoint_C_GetSplineTransformPoints::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventSplineMovePoint_C_GetSplineTransformPoints, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_EventSplineMovePoint_C_GetSplineTransformPoints::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventSplineMovePoint_C_GetSplineTransformPoints, CallFunc_GetTransformAtSplinePoint_ReturnValue) == 0x000040, "Member 'BP_EventSplineMovePoint_C_GetSplineTransformPoints::CallFunc_GetTransformAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventSplineMovePoint_C_GetSplineTransformPoints, CallFunc_Array_Add_ReturnValue) == 0x000070, "Member 'BP_EventSplineMovePoint_C_GetSplineTransformPoints::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventSplineMovePoint_C_GetSplineTransformPoints, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000074, "Member 'BP_EventSplineMovePoint_C_GetSplineTransformPoints::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_EventSplineMovePoint.BP_EventSplineMovePoint_C.GetCurrentLocation
// 0x002C (0x002C - 0x0000)
struct BP_EventSplineMovePoint_C_GetCurrentLocation final
{
public:
	float                                         Length;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Loop;                                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46D4[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalLength;                                       // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventSplineMovePoint_C_GetCurrentLocation) == 0x000004, "Wrong alignment on BP_EventSplineMovePoint_C_GetCurrentLocation");
static_assert(sizeof(BP_EventSplineMovePoint_C_GetCurrentLocation) == 0x00002C, "Wrong size on BP_EventSplineMovePoint_C_GetCurrentLocation");
static_assert(offsetof(BP_EventSplineMovePoint_C_GetCurrentLocation, Length) == 0x000000, "Member 'BP_EventSplineMovePoint_C_GetCurrentLocation::Length' has a wrong offset!");
static_assert(offsetof(BP_EventSplineMovePoint_C_GetCurrentLocation, Loop) == 0x000004, "Member 'BP_EventSplineMovePoint_C_GetCurrentLocation::Loop' has a wrong offset!");
static_assert(offsetof(BP_EventSplineMovePoint_C_GetCurrentLocation, Location) == 0x000008, "Member 'BP_EventSplineMovePoint_C_GetCurrentLocation::Location' has a wrong offset!");
static_assert(offsetof(BP_EventSplineMovePoint_C_GetCurrentLocation, LocalLength) == 0x000014, "Member 'BP_EventSplineMovePoint_C_GetCurrentLocation::LocalLength' has a wrong offset!");
static_assert(offsetof(BP_EventSplineMovePoint_C_GetCurrentLocation, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000018, "Member 'BP_EventSplineMovePoint_C_GetCurrentLocation::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventSplineMovePoint_C_GetCurrentLocation, CallFunc_GetSplineLength_ReturnValue) == 0x000024, "Member 'BP_EventSplineMovePoint_C_GetCurrentLocation::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventSplineMovePoint_C_GetCurrentLocation, CallFunc_Percent_FloatFloat_ReturnValue) == 0x000028, "Member 'BP_EventSplineMovePoint_C_GetCurrentLocation::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_EventSplineMovePoint.BP_EventSplineMovePoint_C.GetSplineLength
// 0x0008 (0x0008 - 0x0000)
struct BP_EventSplineMovePoint_C_GetSplineLength final
{
public:
	float                                         Length;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventSplineMovePoint_C_GetSplineLength) == 0x000004, "Wrong alignment on BP_EventSplineMovePoint_C_GetSplineLength");
static_assert(sizeof(BP_EventSplineMovePoint_C_GetSplineLength) == 0x000008, "Wrong size on BP_EventSplineMovePoint_C_GetSplineLength");
static_assert(offsetof(BP_EventSplineMovePoint_C_GetSplineLength, Length) == 0x000000, "Member 'BP_EventSplineMovePoint_C_GetSplineLength::Length' has a wrong offset!");
static_assert(offsetof(BP_EventSplineMovePoint_C_GetSplineLength, CallFunc_GetSplineLength_ReturnValue) == 0x000004, "Member 'BP_EventSplineMovePoint_C_GetSplineLength::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");

// Function BP_EventSplineMovePoint.BP_EventSplineMovePoint_C.IsArrived
// 0x0010 (0x0010 - 0x0000)
struct BP_EventSplineMovePoint_C_IsArrived final
{
public:
	float                                         Length;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_IsArrived;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46D5[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventSplineMovePoint_C_IsArrived) == 0x000004, "Wrong alignment on BP_EventSplineMovePoint_C_IsArrived");
static_assert(sizeof(BP_EventSplineMovePoint_C_IsArrived) == 0x000010, "Wrong size on BP_EventSplineMovePoint_C_IsArrived");
static_assert(offsetof(BP_EventSplineMovePoint_C_IsArrived, Length) == 0x000000, "Member 'BP_EventSplineMovePoint_C_IsArrived::Length' has a wrong offset!");
static_assert(offsetof(BP_EventSplineMovePoint_C_IsArrived, Param_IsArrived) == 0x000004, "Member 'BP_EventSplineMovePoint_C_IsArrived::Param_IsArrived' has a wrong offset!");
static_assert(offsetof(BP_EventSplineMovePoint_C_IsArrived, CallFunc_GetSplineLength_ReturnValue) == 0x000008, "Member 'BP_EventSplineMovePoint_C_IsArrived::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventSplineMovePoint_C_IsArrived, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_EventSplineMovePoint_C_IsArrived::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

