#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnemyWeaponManageComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FBulletManageData_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EnemyWeaponManageComponent.BP_EnemyWeaponManageComponent_C
// 0x0068 (0x0128 - 0x00C0)
class UBP_EnemyWeaponManageComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class ABP_Enemy_Weapon_C*>             WeaponList;                                        // 0x00C8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	TMap<class UClass*, struct FFBulletManageData> ManageData;                                        // 0x00D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_EnemyWeaponManageComponent(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void AddWeapon(class UClass* WeaponClass, int32 WeaponNum, bool* bSuccess);
	void GetUnusedWeapon(class UClass* WeaponClass, class ABP_Enemy_Weapon_C** Weapon);
	void RemoveAllWeapon();
	void GetUsedWeaponAllList(TArray<class ABP_Enemy_Weapon_C*>* Param_WeaponList);
	void SetEnabledUsedWeapon(bool Enabled);
	void GetUnusedWeaponList(class UClass* WeaponClass, TArray<class ABP_Enemy_Weapon_C*>* Param_WeaponList);

	void GetUsedWeaponList(class UClass* WeaponClass, TArray<class ABP_Enemy_Weapon_C*>* Param_WeaponList) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EnemyWeaponManageComponent_C">();
	}
	static class UBP_EnemyWeaponManageComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_EnemyWeaponManageComponent_C>();
	}
};
static_assert(alignof(UBP_EnemyWeaponManageComponent_C) == 0x000008, "Wrong alignment on UBP_EnemyWeaponManageComponent_C");
static_assert(sizeof(UBP_EnemyWeaponManageComponent_C) == 0x000128, "Wrong size on UBP_EnemyWeaponManageComponent_C");
static_assert(offsetof(UBP_EnemyWeaponManageComponent_C, UberGraphFrame) == 0x0000C0, "Member 'UBP_EnemyWeaponManageComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_EnemyWeaponManageComponent_C, WeaponList) == 0x0000C8, "Member 'UBP_EnemyWeaponManageComponent_C::WeaponList' has a wrong offset!");
static_assert(offsetof(UBP_EnemyWeaponManageComponent_C, ManageData) == 0x0000D8, "Member 'UBP_EnemyWeaponManageComponent_C::ManageData' has a wrong offset!");

}

