#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventPostUpdateTask

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BP_EventPostUpdateTask.BP_EventPostUpdateTask_C.ExecuteUbergraph_BP_EventPostUpdateTask
// 0x0008 (0x0008 - 0x0000)
struct BP_EventPostUpdateTask_C_ExecuteUbergraph_BP_EventPostUpdateTask final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPostUpdateTask_C_ExecuteUbergraph_BP_EventPostUpdateTask) == 0x000004, "Wrong alignment on BP_EventPostUpdateTask_C_ExecuteUbergraph_BP_EventPostUpdateTask");
static_assert(sizeof(BP_EventPostUpdateTask_C_ExecuteUbergraph_BP_EventPostUpdateTask) == 0x000008, "Wrong size on BP_EventPostUpdateTask_C_ExecuteUbergraph_BP_EventPostUpdateTask");
static_assert(offsetof(BP_EventPostUpdateTask_C_ExecuteUbergraph_BP_EventPostUpdateTask, EntryPoint) == 0x000000, "Member 'BP_EventPostUpdateTask_C_ExecuteUbergraph_BP_EventPostUpdateTask::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_ExecuteUbergraph_BP_EventPostUpdateTask, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_EventPostUpdateTask_C_ExecuteUbergraph_BP_EventPostUpdateTask::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_EventPostUpdateTask.BP_EventPostUpdateTask_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_EventPostUpdateTask_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPostUpdateTask_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_EventPostUpdateTask_C_ReceiveTick");
static_assert(sizeof(BP_EventPostUpdateTask_C_ReceiveTick) == 0x000004, "Wrong size on BP_EventPostUpdateTask_C_ReceiveTick");
static_assert(offsetof(BP_EventPostUpdateTask_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_EventPostUpdateTask_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_EventPostUpdateTask.BP_EventPostUpdateTask_C.QueryPreSkinFacialNormalUpdate
// 0x0080 (0x0080 - 0x0000)
struct BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate final
{
public:
	TArray<class AActor*>                         SkeletalMeshActors;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkelMeshComp;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_SearchMeshMaterialFromSlot_FindMaterial;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SearchMeshMaterialFromSlot_Index;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9333[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9334[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       K2Node_DynamicCast_AsRSCharacter_Base;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9335[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MenuPlayerBase_C*                   K2Node_DynamicCast_AsBP_Menu_Player_Base;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9336[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASkeletalMeshActor*                     K2Node_DynamicCast_AsSkeletal_Mesh_Actor;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate) == 0x000008, "Wrong alignment on BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate");
static_assert(sizeof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate) == 0x000080, "Wrong size on BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate");
static_assert(offsetof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate, SkeletalMeshActors) == 0x000000, "Member 'BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate::SkeletalMeshActors' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate, SkelMeshComp) == 0x000010, "Member 'BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate::SkelMeshComp' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate, TargetActor) == 0x000018, "Member 'BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate::TargetActor' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate, Temp_int_Loop_Num_Variable) == 0x000020, "Member 'BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate, Temp_int_Array_Index_Variable) == 0x000024, "Member 'BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate, CallFunc_SearchMeshMaterialFromSlot_FindMaterial) == 0x000028, "Member 'BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate::CallFunc_SearchMeshMaterialFromSlot_FindMaterial' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate, CallFunc_SearchMeshMaterialFromSlot_Index) == 0x000030, "Member 'BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate::CallFunc_SearchMeshMaterialFromSlot_Index' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate, CallFunc_Less_IntInt_ReturnValue) == 0x000039, "Member 'BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate, CallFunc_Array_Length_ReturnValue_1) == 0x000048, "Member 'BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate, CallFunc_Array_Length_ReturnValue_2) == 0x00004C, "Member 'BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate, K2Node_DynamicCast_AsRSCharacter_Base) == 0x000050, "Member 'BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate::K2Node_DynamicCast_AsRSCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate, CallFunc_Greater_IntInt_ReturnValue) == 0x000059, "Member 'BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate, K2Node_DynamicCast_AsBP_Menu_Player_Base) == 0x000060, "Member 'BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate::K2Node_DynamicCast_AsBP_Menu_Player_Base' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate, K2Node_DynamicCast_AsSkeletal_Mesh_Actor) == 0x000070, "Member 'BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate::K2Node_DynamicCast_AsSkeletal_Mesh_Actor' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate, CallFunc_ComponentHasTag_ReturnValue) == 0x000079, "Member 'BP_EventPostUpdateTask_C_QueryPreSkinFacialNormalUpdate::CallFunc_ComponentHasTag_ReturnValue' has a wrong offset!");

// Function BP_EventPostUpdateTask.BP_EventPostUpdateTask_C.UpdatePreSkinFacialNormal
// 0x0060 (0x0060 - 0x0000)
struct BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal final
{
public:
	class USkeletalMeshComponent*                 SkelMeshComp;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9337[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_SearchMaterialPreSkinFacialNormalSlots_MaterialSlots; // 0x0028(0x0010)(ReferenceParm, HasGetValueTypeHash)
	struct FArrayOfInt                            K2Node_MakeStruct_ArrayOfInt;                      // 0x0038(0x0010)()
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9338[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9339[0x2];                                     // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal) == 0x000008, "Wrong alignment on BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal");
static_assert(sizeof(BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal) == 0x000060, "Wrong size on BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal");
static_assert(offsetof(BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal, SkelMeshComp) == 0x000000, "Member 'BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal::SkelMeshComp' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal, Temp_int_Loop_Num_Variable) == 0x000014, "Member 'BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal, Temp_int_Loop_Counter_Variable_1) == 0x00001C, "Member 'BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal, CallFunc_SearchMaterialPreSkinFacialNormalSlots_MaterialSlots) == 0x000028, "Member 'BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal::CallFunc_SearchMaterialPreSkinFacialNormalSlots_MaterialSlots' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal, K2Node_MakeStruct_ArrayOfInt) == 0x000038, "Member 'BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal::K2Node_MakeStruct_ArrayOfInt' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal, Temp_int_Loop_Num_Variable_1) == 0x000048, "Member 'BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal, CallFunc_Less_IntInt_ReturnValue_1) == 0x00004C, "Member 'BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal, CallFunc_IsValid_ReturnValue) == 0x000054, "Member 'BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal, CallFunc_IsValid_ReturnValue_1) == 0x000055, "Member 'BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'BP_EventPostUpdateTask_C_UpdatePreSkinFacialNormal::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");

// Function BP_EventPostUpdateTask.BP_EventPostUpdateTask_C.Activate
// 0x0001 (0x0001 - 0x0000)
struct BP_EventPostUpdateTask_C_Activate final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventPostUpdateTask_C_Activate) == 0x000001, "Wrong alignment on BP_EventPostUpdateTask_C_Activate");
static_assert(sizeof(BP_EventPostUpdateTask_C_Activate) == 0x000001, "Wrong size on BP_EventPostUpdateTask_C_Activate");
static_assert(offsetof(BP_EventPostUpdateTask_C_Activate, Active) == 0x000000, "Member 'BP_EventPostUpdateTask_C_Activate::Active' has a wrong offset!");

// Function BP_EventPostUpdateTask.BP_EventPostUpdateTask_C.UpdatePostProcessMateiral
// 0x0010 (0x0010 - 0x0000)
struct BP_EventPostUpdateTask_C_UpdatePostProcessMateiral final
{
public:
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventPostUpdateTask_C_UpdatePostProcessMateiral) == 0x000008, "Wrong alignment on BP_EventPostUpdateTask_C_UpdatePostProcessMateiral");
static_assert(sizeof(BP_EventPostUpdateTask_C_UpdatePostProcessMateiral) == 0x000010, "Wrong size on BP_EventPostUpdateTask_C_UpdatePostProcessMateiral");
static_assert(offsetof(BP_EventPostUpdateTask_C_UpdatePostProcessMateiral, CallFunc_GetEventManager_EventManager) == 0x000000, "Member 'BP_EventPostUpdateTask_C_UpdatePostProcessMateiral::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_EventPostUpdateTask_C_UpdatePostProcessMateiral, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_EventPostUpdateTask_C_UpdatePostProcessMateiral::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

