#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnemySpawnComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_EnemySpawnComponent.BP_EnemySpawnComponent_C.StartSpawnEffect
// 0x0100 (0x0100 - 0x0000)
struct BP_EnemySpawnComponent_C_StartSpawnEffect final
{
public:
	bool                                          IsStartEffect;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5111[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5112[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        L_effect;                                          // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleSimulatorManager*                CallFunc_GetBattleSimulatorManager_BattleSimulatorManager; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMissionActive_ReturnValue;              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5113[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue_1;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5114[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System_1;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5115[0x5];                                     // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleSimulatorManager*                CallFunc_GetBattleSimulatorManager_BattleSimulatorManager_1; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5116[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue_2;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System_2;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_2; // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMissionActive_ReturnValue_1;            // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5117[0x5];                                     // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue_3;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_3; // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5118[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System_3;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5119[0x2];                                     // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SoundManager_C*                     CallFunc_GetSoundManager_SoundManager;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_511A[0x2];                                     // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SoundManager_C*                     CallFunc_GetSoundManager_SoundManager_1;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_511B[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_511C[0x3];                                     // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemySpawnComponent_C_StartSpawnEffect) == 0x000008, "Wrong alignment on BP_EnemySpawnComponent_C_StartSpawnEffect");
static_assert(sizeof(BP_EnemySpawnComponent_C_StartSpawnEffect) == 0x000100, "Wrong size on BP_EnemySpawnComponent_C_StartSpawnEffect");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, IsStartEffect) == 0x000000, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::IsStartEffect' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, Location) == 0x000004, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::Location' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, Rotation) == 0x000010, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::Rotation' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, L_effect) == 0x000020, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::L_effect' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_GetBattleSimulatorManager_BattleSimulatorManager) == 0x000028, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_GetBattleSimulatorManager_BattleSimulatorManager' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_IsMissionActive_ReturnValue) == 0x000031, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_IsMissionActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_LoadSoftObject_ReturnValue) == 0x000038, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_LoadSoftObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_LoadSoftObject_ReturnValue_1) == 0x000040, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_LoadSoftObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, K2Node_DynamicCast_AsParticle_System) == 0x000048, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::K2Node_DynamicCast_AsParticle_System' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, K2Node_DynamicCast_AsParticle_System_1) == 0x000058, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::K2Node_DynamicCast_AsParticle_System_1' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000061, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x000062, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_GetBattleSimulatorManager_BattleSimulatorManager_1) == 0x000068, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_GetBattleSimulatorManager_BattleSimulatorManager_1' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_LoadSoftObject_ReturnValue_2) == 0x000078, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_LoadSoftObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, K2Node_DynamicCast_AsParticle_System_2) == 0x000080, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::K2Node_DynamicCast_AsParticle_System_2' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, K2Node_DynamicCast_bSuccess_2) == 0x000088, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_IsValidSoftObjectReference_ReturnValue_2) == 0x000089, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_IsValidSoftObjectReference_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_IsMissionActive_ReturnValue_1) == 0x00008A, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_IsMissionActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_LoadSoftObject_ReturnValue_3) == 0x000090, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_LoadSoftObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_IsValidSoftObjectReference_ReturnValue_3) == 0x000098, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_IsValidSoftObjectReference_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, K2Node_DynamicCast_AsParticle_System_3) == 0x0000A0, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::K2Node_DynamicCast_AsParticle_System_3' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, K2Node_DynamicCast_bSuccess_3) == 0x0000A8, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_IsValid_ReturnValue_2) == 0x0000A9, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_Add_VectorVector_ReturnValue) == 0x0000AC, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_GetSoundManager_SoundManager) == 0x0000B8, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_GetSoundManager_SoundManager' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000C0, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_IsValid_ReturnValue_3) == 0x0000CC, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_IsValid_ReturnValue_4) == 0x0000CD, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_GetSoundManager_SoundManager_1) == 0x0000D0, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_GetSoundManager_SoundManager_1' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_IsValid_ReturnValue_5) == 0x0000D8, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_MakeVector_ReturnValue) == 0x0000DC, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0000E8, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_IsValid_ReturnValue_6) == 0x0000F4, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_EnemySpawnComponent_C_StartSpawnEffect, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000F8, "Member 'BP_EnemySpawnComponent_C_StartSpawnEffect::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

}

