#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ENpcComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "E_SASKind_structs.hpp"
#include "Engine_structs.hpp"
#include "FPlayerAIBattleThinkData_structs.hpp"
#include "FSASFireParam_structs.hpp"
#include "FSASMetalParam_structs.hpp"
#include "FSASElectricParam_structs.hpp"
#include "EPlayerAIBattleThinkType_structs.hpp"
#include "FNotifyAttackData_structs.hpp"
#include "Enum_EnemySound_structs.hpp"


namespace SDK::Params
{

// Function BP_ENpcComponent.BP_ENpcComponent_C.EventDispatcherSASStart__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_ENpcComponent_C_EventDispatcherSASStart__DelegateSignature final
{
public:
	EPlayerID                                     SAS_PlayerID;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ENpcComponent_C_EventDispatcherSASStart__DelegateSignature) == 0x000001, "Wrong alignment on BP_ENpcComponent_C_EventDispatcherSASStart__DelegateSignature");
static_assert(sizeof(BP_ENpcComponent_C_EventDispatcherSASStart__DelegateSignature) == 0x000001, "Wrong size on BP_ENpcComponent_C_EventDispatcherSASStart__DelegateSignature");
static_assert(offsetof(BP_ENpcComponent_C_EventDispatcherSASStart__DelegateSignature, SAS_PlayerID) == 0x000000, "Member 'BP_ENpcComponent_C_EventDispatcherSASStart__DelegateSignature::SAS_PlayerID' has a wrong offset!");

// Function BP_ENpcComponent.BP_ENpcComponent_C.ExecuteUbergraph_BP_ENpcComponent
// 0x0190 (0x0190 - 0x0000)
struct BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrainFieldENPCType                           Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9421[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9422[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateDiscoverIcon_bDummy;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrainFieldENPCType                           Temp_byte_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9423[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      CallFunc_GetPlayerID_self_CastInput;               // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9424[0x5];                                     // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EnemyManager_C*                     CallFunc_GetEnemyManager_Manager;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9425[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EnemyManager_C*                     CallFunc_GetEnemyManager_Manager_1;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBrainFieldENPCType                           K2Node_Select_Default;                             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9426[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager_1;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9427[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float DeltaSeconds)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_9428[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrainCrashManager_C*                CallFunc_GetBrainCrashManager_Manager;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9429[0x6];                                     // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrainCrashManager_C*                CallFunc_GetBrainCrashManager_Manager_1;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_942A[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      CallFunc_GetPlayerID_self_CastInput_1;             // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue_1;                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x00BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x00C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_10;       // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_11;       // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_9;                  // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_942B[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APsychicObjectManager_C*                CallFunc_GetPsychicObjectManager_PsyObjManager;    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APsychicObjectManager_C*                CallFunc_GetPsychicObjectManager_PsyObjManager_1;  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_942C[0x5];                                     // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_psy_obj_actor_in;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_target_actor_in;                // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IPlayerInterface>      CallFunc_GetPlayerID_self_CastInput_2;             // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue_2;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_942D[0x6];                                     // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager_2;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrainCrashManager_C*                CallFunc_GetBrainCrashManager_Manager_2;           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_942E[0x3];                                     // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x012C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Psy_obj_actor_in, class AActor* Target_actor_in)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0134(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0144(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_942F[0x3];                                     // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_10;                 // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_11;                 // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9430[0x2];                                     // 0x014E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0156(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0157(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_EnemyInterface_C> CallFunc_GetEnemySpawn_self_CastInput;             // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetEnemySpawn_return;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9431[0x6];                                     // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleSimulatorManager*                CallFunc_GetBattleSimulatorManager_BattleSimulatorManager; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMissionActive_ReturnValue;              // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableStartBattle_bBattleSimulator;     // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableStartBattle_bEnableStartBattle;   // 0x017B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9432[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LevelManager_C*                     CallFunc_GetLevelManager_LevelManager;             // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidCurrentSimulatorLevelInfosName_ReturnValue; // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent) == 0x000008, "Wrong alignment on BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent");
static_assert(sizeof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent) == 0x000190, "Wrong size on BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, EntryPoint) == 0x000000, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, Temp_byte_Variable) == 0x000005, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, K2Node_DynamicCast_AsRSBattle_Player) == 0x000018, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_UpdateDiscoverIcon_bDummy) == 0x000021, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_UpdateDiscoverIcon_bDummy' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, Temp_bool_Variable) == 0x000022, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, K2Node_Event_EndPlayReason) == 0x000023, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, Temp_byte_Variable_1) == 0x000024, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_GetPlayerID_self_CastInput) == 0x000028, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_GetPlayerID_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_GetPlayerID_ReturnValue) == 0x000038, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_GetPlayerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000039, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00003A, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_GetEnemyManager_Manager) == 0x000040, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_GetEnemyManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_BooleanOR_ReturnValue) == 0x000048, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_GetEnemyManager_Manager_1) == 0x000050, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_GetEnemyManager_Manager_1' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, K2Node_Select_Default) == 0x000058, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_GetBrainFieldManager_Manager) == 0x000060, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_GetBrainFieldManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_GetBrainFieldManager_Manager_1) == 0x000068, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_GetBrainFieldManager_Manager_1' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000074, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_GetBrainCrashManager_Manager) == 0x000088, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_GetBrainCrashManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_IsValid_ReturnValue_1) == 0x000090, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, Temp_bool_Has_Been_Initd_Variable_1) == 0x000091, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_GetBrainCrashManager_Manager_1) == 0x000098, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_GetBrainCrashManager_Manager_1' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_IsValid_ReturnValue_2) == 0x0000A0, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_GetPlayerID_self_CastInput_1) == 0x0000A8, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_GetPlayerID_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_GetPlayerID_ReturnValue_1) == 0x0000B8, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_GetPlayerID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0000B9, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x0000BA, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x0000BB, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_BooleanOR_ReturnValue_1) == 0x0000BC, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x0000BD, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_BooleanOR_ReturnValue_2) == 0x0000BE, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x0000BF, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_7) == 0x0000C0, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_BooleanOR_ReturnValue_3) == 0x0000C1, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_8) == 0x0000C2, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_BooleanOR_ReturnValue_4) == 0x0000C3, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_9) == 0x0000C4, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_BooleanOR_ReturnValue_5) == 0x0000C5, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_BooleanOR_ReturnValue_6) == 0x0000C6, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_BooleanOR_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_BooleanOR_ReturnValue_7) == 0x0000C7, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_BooleanOR_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_BooleanOR_ReturnValue_8) == 0x0000C8, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_BooleanOR_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_10) == 0x0000C9, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_11) == 0x0000CA, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_BooleanOR_ReturnValue_9) == 0x0000CB, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_BooleanOR_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, Temp_bool_IsClosed_Variable) == 0x0000CC, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_GetPsychicObjectManager_PsyObjManager) == 0x0000D0, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_GetPsychicObjectManager_PsyObjManager' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_GetPsychicObjectManager_PsyObjManager_1) == 0x0000D8, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_GetPsychicObjectManager_PsyObjManager_1' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_IsValid_ReturnValue_3) == 0x0000E0, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_IsValid_ReturnValue_4) == 0x0000E1, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, Temp_bool_IsClosed_Variable_1) == 0x0000E2, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, K2Node_CustomEvent_psy_obj_actor_in) == 0x0000E8, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::K2Node_CustomEvent_psy_obj_actor_in' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, K2Node_CustomEvent_target_actor_in) == 0x0000F0, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::K2Node_CustomEvent_target_actor_in' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, Temp_int_Variable) == 0x0000F8, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_Add_IntInt_ReturnValue) == 0x0000FC, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_GetPlayerID_self_CastInput_2) == 0x000100, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_GetPlayerID_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_GetPlayerID_ReturnValue_2) == 0x000110, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_GetPlayerID_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, K2Node_SwitchEnum_CmpSuccess) == 0x000111, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_GetBrainFieldManager_Manager_2) == 0x000118, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_GetBrainFieldManager_Manager_2' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_GetBrainCrashManager_Manager_2) == 0x000120, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_GetBrainCrashManager_Manager_2' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_IsValid_ReturnValue_5) == 0x000128, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, Temp_float_Variable) == 0x00012C, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_Array_Add_ReturnValue) == 0x000130, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000134, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, Temp_bool_Variable_1) == 0x000144, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_Array_Add_ReturnValue_1) == 0x000148, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_BooleanOR_ReturnValue_10) == 0x00014C, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_BooleanOR_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_BooleanOR_ReturnValue_11) == 0x00014D, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_BooleanOR_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_MakeLiteralInt_ReturnValue) == 0x000150, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000154, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_IsValid_ReturnValue_6) == 0x000155, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_IsValid_ReturnValue_7) == 0x000156, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_IsVisible_ReturnValue) == 0x000157, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_GetEnemySpawn_self_CastInput) == 0x000158, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_GetEnemySpawn_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_GetEnemySpawn_return) == 0x000168, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_GetEnemySpawn_return' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000169, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_GetBattleSimulatorManager_BattleSimulatorManager) == 0x000170, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_GetBattleSimulatorManager_BattleSimulatorManager' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_IsValid_ReturnValue_8) == 0x000178, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_IsMissionActive_ReturnValue) == 0x000179, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_IsMissionActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_IsEnableStartBattle_bBattleSimulator) == 0x00017A, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_IsEnableStartBattle_bBattleSimulator' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_IsEnableStartBattle_bEnableStartBattle) == 0x00017B, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_IsEnableStartBattle_bEnableStartBattle' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_GetLevelManager_LevelManager) == 0x000180, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_GetLevelManager_LevelManager' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent, CallFunc_IsValidCurrentSimulatorLevelInfosName_ReturnValue) == 0x000188, "Member 'BP_ENpcComponent_C_ExecuteUbergraph_BP_ENpcComponent::CallFunc_IsValidCurrentSimulatorLevelInfosName_ReturnValue' has a wrong offset!");

// Function BP_ENpcComponent.BP_ENpcComponent_C.OnInterceptableThrow
// 0x0010 (0x0010 - 0x0000)
struct BP_ENpcComponent_C_OnInterceptableThrow final
{
public:
	class AActor*                                 Psy_obj_actor_in;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target_actor_in;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ENpcComponent_C_OnInterceptableThrow) == 0x000008, "Wrong alignment on BP_ENpcComponent_C_OnInterceptableThrow");
static_assert(sizeof(BP_ENpcComponent_C_OnInterceptableThrow) == 0x000010, "Wrong size on BP_ENpcComponent_C_OnInterceptableThrow");
static_assert(offsetof(BP_ENpcComponent_C_OnInterceptableThrow, Psy_obj_actor_in) == 0x000000, "Member 'BP_ENpcComponent_C_OnInterceptableThrow::Psy_obj_actor_in' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_OnInterceptableThrow, Target_actor_in) == 0x000008, "Member 'BP_ENpcComponent_C_OnInterceptableThrow::Target_actor_in' has a wrong offset!");

// Function BP_ENpcComponent.BP_ENpcComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_ENpcComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ENpcComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_ENpcComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_ENpcComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_ENpcComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_ENpcComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_ENpcComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_ENpcComponent.BP_ENpcComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ENpcComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ENpcComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ENpcComponent_C_ReceiveTick");
static_assert(sizeof(BP_ENpcComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_ENpcComponent_C_ReceiveTick");
static_assert(offsetof(BP_ENpcComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ENpcComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ENpcComponent.BP_ENpcComponent_C.SetEnemyBrainCrashPerformance
// 0x0001 (0x0001 - 0x0000)
struct BP_ENpcComponent_C_SetEnemyBrainCrashPerformance final
{
public:
	bool                                          bReturn;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ENpcComponent_C_SetEnemyBrainCrashPerformance) == 0x000001, "Wrong alignment on BP_ENpcComponent_C_SetEnemyBrainCrashPerformance");
static_assert(sizeof(BP_ENpcComponent_C_SetEnemyBrainCrashPerformance) == 0x000001, "Wrong size on BP_ENpcComponent_C_SetEnemyBrainCrashPerformance");
static_assert(offsetof(BP_ENpcComponent_C_SetEnemyBrainCrashPerformance, bReturn) == 0x000000, "Member 'BP_ENpcComponent_C_SetEnemyBrainCrashPerformance::bReturn' has a wrong offset!");

// Function BP_ENpcComponent.BP_ENpcComponent_C.SetEnemyBrainFieldEnd
// 0x0003 (0x0003 - 0x0000)
struct BP_ENpcComponent_C_SetEnemyBrainFieldEnd final
{
public:
	bool                                          bMoveBrainField;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDummy;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Exec_Drive_bDummy;                        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ENpcComponent_C_SetEnemyBrainFieldEnd) == 0x000001, "Wrong alignment on BP_ENpcComponent_C_SetEnemyBrainFieldEnd");
static_assert(sizeof(BP_ENpcComponent_C_SetEnemyBrainFieldEnd) == 0x000003, "Wrong size on BP_ENpcComponent_C_SetEnemyBrainFieldEnd");
static_assert(offsetof(BP_ENpcComponent_C_SetEnemyBrainFieldEnd, bMoveBrainField) == 0x000000, "Member 'BP_ENpcComponent_C_SetEnemyBrainFieldEnd::bMoveBrainField' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_SetEnemyBrainFieldEnd, bDummy) == 0x000001, "Member 'BP_ENpcComponent_C_SetEnemyBrainFieldEnd::bDummy' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_SetEnemyBrainFieldEnd, CallFunc_Exec_Drive_bDummy) == 0x000002, "Member 'BP_ENpcComponent_C_SetEnemyBrainFieldEnd::CallFunc_Exec_Drive_bDummy' has a wrong offset!");

// Function BP_ENpcComponent.BP_ENpcComponent_C.OnSwitchVisibleBrainFieldLevel
// 0x0001 (0x0001 - 0x0000)
struct BP_ENpcComponent_C_OnSwitchVisibleBrainFieldLevel final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ENpcComponent_C_OnSwitchVisibleBrainFieldLevel) == 0x000001, "Wrong alignment on BP_ENpcComponent_C_OnSwitchVisibleBrainFieldLevel");
static_assert(sizeof(BP_ENpcComponent_C_OnSwitchVisibleBrainFieldLevel) == 0x000001, "Wrong size on BP_ENpcComponent_C_OnSwitchVisibleBrainFieldLevel");
static_assert(offsetof(BP_ENpcComponent_C_OnSwitchVisibleBrainFieldLevel, bVisible) == 0x000000, "Member 'BP_ENpcComponent_C_OnSwitchVisibleBrainFieldLevel::bVisible' has a wrong offset!");

// Function BP_ENpcComponent.BP_ENpcComponent_C.SetEnemyWait
// 0x0070 (0x0070 - 0x0000)
struct BP_ENpcComponent_C_SetEnemyWait final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9433[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IEventInterface>       K2Node_DynamicCast_AsEvent_Interface;              // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EventStart_ReturnValue;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9434[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EnemyInterface_C> K2Node_DynamicCast_AsBPI_Enemy_Interface;          // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnEnemyBrainFieldFinishWeapon_Dummy;      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9435[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EnemyInterface_C> K2Node_DynamicCast_AsBPI_Enemy_Interface_1;        // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnEnemyBrainFieldResetAction_bReset;      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9436[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EnemyInterface_C> K2Node_DynamicCast_AsBPI_Enemy_Interface_2;        // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnEnemyBrainFieldResetStatus_Dummy;       // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ENpcComponent_C_SetEnemyWait) == 0x000008, "Wrong alignment on BP_ENpcComponent_C_SetEnemyWait");
static_assert(sizeof(BP_ENpcComponent_C_SetEnemyWait) == 0x000070, "Wrong size on BP_ENpcComponent_C_SetEnemyWait");
static_assert(offsetof(BP_ENpcComponent_C_SetEnemyWait, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_ENpcComponent_C_SetEnemyWait::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_SetEnemyWait, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_ENpcComponent_C_SetEnemyWait::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_SetEnemyWait, K2Node_DynamicCast_AsEvent_Interface) == 0x000010, "Member 'BP_ENpcComponent_C_SetEnemyWait::K2Node_DynamicCast_AsEvent_Interface' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_SetEnemyWait, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_ENpcComponent_C_SetEnemyWait::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_SetEnemyWait, CallFunc_EventStart_ReturnValue) == 0x000021, "Member 'BP_ENpcComponent_C_SetEnemyWait::CallFunc_EventStart_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_SetEnemyWait, K2Node_DynamicCast_AsBPI_Enemy_Interface) == 0x000028, "Member 'BP_ENpcComponent_C_SetEnemyWait::K2Node_DynamicCast_AsBPI_Enemy_Interface' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_SetEnemyWait, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_ENpcComponent_C_SetEnemyWait::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_SetEnemyWait, CallFunc_OnEnemyBrainFieldFinishWeapon_Dummy) == 0x000039, "Member 'BP_ENpcComponent_C_SetEnemyWait::CallFunc_OnEnemyBrainFieldFinishWeapon_Dummy' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_SetEnemyWait, K2Node_DynamicCast_AsBPI_Enemy_Interface_1) == 0x000040, "Member 'BP_ENpcComponent_C_SetEnemyWait::K2Node_DynamicCast_AsBPI_Enemy_Interface_1' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_SetEnemyWait, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'BP_ENpcComponent_C_SetEnemyWait::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_SetEnemyWait, CallFunc_OnEnemyBrainFieldResetAction_bReset) == 0x000051, "Member 'BP_ENpcComponent_C_SetEnemyWait::CallFunc_OnEnemyBrainFieldResetAction_bReset' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_SetEnemyWait, K2Node_DynamicCast_AsBPI_Enemy_Interface_2) == 0x000058, "Member 'BP_ENpcComponent_C_SetEnemyWait::K2Node_DynamicCast_AsBPI_Enemy_Interface_2' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_SetEnemyWait, K2Node_DynamicCast_bSuccess_3) == 0x000068, "Member 'BP_ENpcComponent_C_SetEnemyWait::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_SetEnemyWait, CallFunc_OnEnemyBrainFieldResetStatus_Dummy) == 0x000069, "Member 'BP_ENpcComponent_C_SetEnemyWait::CallFunc_OnEnemyBrainFieldResetStatus_Dummy' has a wrong offset!");

// Function BP_ENpcComponent.BP_ENpcComponent_C.ResetEnemyWait
// 0x0070 (0x0070 - 0x0000)
struct BP_ENpcComponent_C_ResetEnemyWait final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9437[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IEventInterface>       K2Node_DynamicCast_AsEvent_Interface;              // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EventEnd_ReturnValue;                     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9438[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EnemyInterface_C> K2Node_DynamicCast_AsBPI_Enemy_Interface;          // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnEnemyBrainFieldFinishWeapon_Dummy;      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9439[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EnemyInterface_C> K2Node_DynamicCast_AsBPI_Enemy_Interface_1;        // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnEnemyBrainFieldResetAction_bReset;      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_943A[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EnemyInterface_C> K2Node_DynamicCast_AsBPI_Enemy_Interface_2;        // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnEnemyBrainFieldResetStatus_Dummy;       // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ENpcComponent_C_ResetEnemyWait) == 0x000008, "Wrong alignment on BP_ENpcComponent_C_ResetEnemyWait");
static_assert(sizeof(BP_ENpcComponent_C_ResetEnemyWait) == 0x000070, "Wrong size on BP_ENpcComponent_C_ResetEnemyWait");
static_assert(offsetof(BP_ENpcComponent_C_ResetEnemyWait, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_ENpcComponent_C_ResetEnemyWait::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ResetEnemyWait, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_ENpcComponent_C_ResetEnemyWait::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ResetEnemyWait, K2Node_DynamicCast_AsEvent_Interface) == 0x000010, "Member 'BP_ENpcComponent_C_ResetEnemyWait::K2Node_DynamicCast_AsEvent_Interface' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ResetEnemyWait, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_ENpcComponent_C_ResetEnemyWait::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ResetEnemyWait, CallFunc_EventEnd_ReturnValue) == 0x000021, "Member 'BP_ENpcComponent_C_ResetEnemyWait::CallFunc_EventEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ResetEnemyWait, K2Node_DynamicCast_AsBPI_Enemy_Interface) == 0x000028, "Member 'BP_ENpcComponent_C_ResetEnemyWait::K2Node_DynamicCast_AsBPI_Enemy_Interface' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ResetEnemyWait, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_ENpcComponent_C_ResetEnemyWait::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ResetEnemyWait, CallFunc_OnEnemyBrainFieldFinishWeapon_Dummy) == 0x000039, "Member 'BP_ENpcComponent_C_ResetEnemyWait::CallFunc_OnEnemyBrainFieldFinishWeapon_Dummy' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ResetEnemyWait, K2Node_DynamicCast_AsBPI_Enemy_Interface_1) == 0x000040, "Member 'BP_ENpcComponent_C_ResetEnemyWait::K2Node_DynamicCast_AsBPI_Enemy_Interface_1' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ResetEnemyWait, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'BP_ENpcComponent_C_ResetEnemyWait::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ResetEnemyWait, CallFunc_OnEnemyBrainFieldResetAction_bReset) == 0x000051, "Member 'BP_ENpcComponent_C_ResetEnemyWait::CallFunc_OnEnemyBrainFieldResetAction_bReset' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ResetEnemyWait, K2Node_DynamicCast_AsBPI_Enemy_Interface_2) == 0x000058, "Member 'BP_ENpcComponent_C_ResetEnemyWait::K2Node_DynamicCast_AsBPI_Enemy_Interface_2' has a wrong offset!");
static_assert(offsetof(BP_ENpcComponent_C_ResetEnemyWait, K2Node_DynamicCast_bSuccess_3) == 0x000068, "Member 'BP_ENpcComponent_C_ResetEnemyWait::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
