#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FinishMoveActorManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FinishMoveActorManager.BP_FinishMoveActorManager_C
// 0x0870 (0x0AF0 - 0x0280)
class ABP_FinishMoveActorManager_C final : public AFinishMoveActorManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_FinishMoveActor_C*                  FinishMoveActor;                                   // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       GameCameraComponent;                               // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           ChangeActor;                                       // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlendTimeRemaining;                                // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlendTimeMax;                                      // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMinimalViewInfo                       MinimalInfo;                                       // 0x02B0(0x0810)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsLastFrameInThisFunctionPlus;                     // 0x0AC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_478C[0x3];                                     // 0x0AC1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LastEffectSpringLength;                            // 0x0AC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RotateBeginNormalize;                              // 0x0AC8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_478D[0x4];                                     // 0x0AD4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 TargetMesh;                                        // 0x0AD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFinishMoving;                                    // 0x0AE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_FinishMoveActorManager(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void FinishMoveEnd();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void FinishmoveStart(class USkeletalMeshComponent* NewParam);
	void ComputeEndCameraBlendTransform(float DeltaTime);
	bool PauseFinishMove();
	bool RestartFinishMove();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FinishMoveActorManager_C">();
	}
	static class ABP_FinishMoveActorManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FinishMoveActorManager_C>();
	}
};
static_assert(alignof(ABP_FinishMoveActorManager_C) == 0x000010, "Wrong alignment on ABP_FinishMoveActorManager_C");
static_assert(sizeof(ABP_FinishMoveActorManager_C) == 0x000AF0, "Wrong size on ABP_FinishMoveActorManager_C");
static_assert(offsetof(ABP_FinishMoveActorManager_C, UberGraphFrame) == 0x000280, "Member 'ABP_FinishMoveActorManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FinishMoveActorManager_C, DefaultSceneRoot) == 0x000288, "Member 'ABP_FinishMoveActorManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_FinishMoveActorManager_C, FinishMoveActor) == 0x000290, "Member 'ABP_FinishMoveActorManager_C::FinishMoveActor' has a wrong offset!");
static_assert(offsetof(ABP_FinishMoveActorManager_C, GameCameraComponent) == 0x000298, "Member 'ABP_FinishMoveActorManager_C::GameCameraComponent' has a wrong offset!");
static_assert(offsetof(ABP_FinishMoveActorManager_C, ChangeActor) == 0x0002A0, "Member 'ABP_FinishMoveActorManager_C::ChangeActor' has a wrong offset!");
static_assert(offsetof(ABP_FinishMoveActorManager_C, BlendTimeRemaining) == 0x0002A8, "Member 'ABP_FinishMoveActorManager_C::BlendTimeRemaining' has a wrong offset!");
static_assert(offsetof(ABP_FinishMoveActorManager_C, BlendTimeMax) == 0x0002AC, "Member 'ABP_FinishMoveActorManager_C::BlendTimeMax' has a wrong offset!");
static_assert(offsetof(ABP_FinishMoveActorManager_C, MinimalInfo) == 0x0002B0, "Member 'ABP_FinishMoveActorManager_C::MinimalInfo' has a wrong offset!");
static_assert(offsetof(ABP_FinishMoveActorManager_C, IsLastFrameInThisFunctionPlus) == 0x000AC0, "Member 'ABP_FinishMoveActorManager_C::IsLastFrameInThisFunctionPlus' has a wrong offset!");
static_assert(offsetof(ABP_FinishMoveActorManager_C, LastEffectSpringLength) == 0x000AC4, "Member 'ABP_FinishMoveActorManager_C::LastEffectSpringLength' has a wrong offset!");
static_assert(offsetof(ABP_FinishMoveActorManager_C, RotateBeginNormalize) == 0x000AC8, "Member 'ABP_FinishMoveActorManager_C::RotateBeginNormalize' has a wrong offset!");
static_assert(offsetof(ABP_FinishMoveActorManager_C, TargetMesh) == 0x000AD8, "Member 'ABP_FinishMoveActorManager_C::TargetMesh' has a wrong offset!");
static_assert(offsetof(ABP_FinishMoveActorManager_C, IsFinishMoving) == 0x000AE0, "Member 'ABP_FinishMoveActorManager_C::IsFinishMoving' has a wrong offset!");

}

