#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FinishMoveActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FinishMoveActor.BP_FinishMoveActor_C.ExecuteUbergraph_BP_FinishMoveActor
// 0x02A8 (0x02A8 - 0x0000)
struct BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DBF[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DC0[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameSystemManager_C*                CallFunc_GetGameSystemManager_Manager;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameSystemManager_C*                CallFunc_GetGameSystemManager_Manager_1;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveGlobalCustomTimeDilation_Success;   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DC1[0x1];                                     // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentCustomTimeDilation_CustomTimeDilation; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DC2[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetFinishMoveManager_FinishMove_Manager;  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DC3[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FinishMoveActorManager_C*           K2Node_DynamicCast_AsBP_Finish_Move_Actor_Manager; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DC4[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue;                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DC5[0x1];                                     // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DC6[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DC7[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_2;                     // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager_1;         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DC8[0x2];                                     // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    K2Node_DynamicCast_AsBP_Player_Manager;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DC9[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      CallFunc_GetMainPlayer_Player;                     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DCA[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICameraInterface>      CallFunc_GetPlayerCameraRotation_self_CastInput;   // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetPlayerCameraRotation_ReturnValue;      // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SetGlobalCustomTimeDilation_CurrentCustomTimeDilation; // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_2;           // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_1;        // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DCB[0x3];                                     // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DCC[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICameraInterface>      CallFunc_GetPlayerCameraLocation_self_CastInput;   // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetPlayerCameraLocation_ReturnValue;      // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VLerp_ReturnValue_2;                      // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_2;        // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DCD[0x3];                                     // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0190(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DCE[0x3];                                     // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x021C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x02A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x02A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor) == 0x000008, "Wrong alignment on BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor");
static_assert(sizeof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor) == 0x0002A8, "Wrong size on BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, EntryPoint) == 0x000000, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_GetGameSystemManager_Manager) == 0x000010, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_GetGameSystemManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_GetGameSystemManager_Manager_1) == 0x000018, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_GetGameSystemManager_Manager_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_IsValid_ReturnValue_2) == 0x000020, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_IsValid_ReturnValue_3) == 0x000021, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_RemoveGlobalCustomTimeDilation_Success) == 0x000022, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_RemoveGlobalCustomTimeDilation_Success' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_GetCurrentCustomTimeDilation_CustomTimeDilation) == 0x000024, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_GetCurrentCustomTimeDilation_CustomTimeDilation' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000028, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_GetPlayerManager_PlayerManager) == 0x000030, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_GetFinishMoveManager_FinishMove_Manager) == 0x000038, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_GetFinishMoveManager_FinishMove_Manager' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_IsValid_ReturnValue_4) == 0x000040, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_IsValid_ReturnValue_5) == 0x000041, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, K2Node_DynamicCast_AsBP_Finish_Move_Actor_Manager) == 0x000048, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::K2Node_DynamicCast_AsBP_Finish_Move_Actor_Manager' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_GetPlayer_ReturnValue) == 0x000058, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_GetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, K2Node_DynamicCast_AsRSBattle_Player) == 0x000060, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_IsValid_ReturnValue_6) == 0x000069, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_IsValid_ReturnValue_7) == 0x00006A, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00006C, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_FClamp_ReturnValue) == 0x000078, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_IsValid_ReturnValue_8) == 0x00007C, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000080, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_GetForwardVector_ReturnValue) == 0x00008C, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_FClamp_ReturnValue_1) == 0x000098, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_IsValid_ReturnValue_9) == 0x00009C, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000A0, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000AC, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_FClamp_ReturnValue_2) == 0x0000B8, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_Normal_ReturnValue) == 0x0000BC, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_GetForwardVector_ReturnValue_1) == 0x0000C8, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_VLerp_ReturnValue) == 0x0000D4, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_GetPlayerManager_PlayerManager_1) == 0x0000E0, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_GetPlayerManager_PlayerManager_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0000E8, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_IsValid_ReturnValue_10) == 0x0000F4, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0000F5, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, K2Node_DynamicCast_AsBP_Player_Manager) == 0x0000F8, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::K2Node_DynamicCast_AsBP_Player_Manager' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, K2Node_DynamicCast_bSuccess_2) == 0x000100, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_GetMainPlayer_Player) == 0x000108, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_GetMainPlayer_Player' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000110, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_GetPlayerCameraRotation_self_CastInput) == 0x000118, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_GetPlayerCameraRotation_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_GetPlayerCameraRotation_ReturnValue) == 0x000128, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_GetPlayerCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_SetGlobalCustomTimeDilation_CurrentCustomTimeDilation) == 0x000134, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_SetGlobalCustomTimeDilation_CurrentCustomTimeDilation' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_GetForwardVector_ReturnValue_2) == 0x000138, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_GetForwardVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_K2_SetActorRotation_ReturnValue_1) == 0x000144, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_K2_SetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_VLerp_ReturnValue_1) == 0x000148, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_GetPlayerCameraLocation_self_CastInput) == 0x000158, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_GetPlayerCameraLocation_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_GetPlayerCameraLocation_ReturnValue) == 0x000168, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_GetPlayerCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_Conv_VectorToRotator_ReturnValue_1) == 0x000174, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_Conv_VectorToRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_VLerp_ReturnValue_2) == 0x000180, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_VLerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_K2_SetActorRotation_ReturnValue_2) == 0x00018C, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_K2_SetActorRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000190, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000218, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_K2_SetActorLocation_SweepHitResult_1) == 0x00021C, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_K2_SetActorLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_K2_SetActorLocation_ReturnValue_1) == 0x0002A4, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_K2_SetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, K2Node_Event_EndPlayReason) == 0x0002A5, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor, CallFunc_IsValid_ReturnValue_11) == 0x0002A6, "Member 'BP_FinishMoveActor_C_ExecuteUbergraph_BP_FinishMoveActor::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");

// Function BP_FinishMoveActor.BP_FinishMoveActor_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_FinishMoveActor_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FinishMoveActor_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_FinishMoveActor_C_ReceiveEndPlay");
static_assert(sizeof(BP_FinishMoveActor_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_FinishMoveActor_C_ReceiveEndPlay");
static_assert(offsetof(BP_FinishMoveActor_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_FinishMoveActor_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_FinishMoveActor.BP_FinishMoveActor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_FinishMoveActor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FinishMoveActor_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_FinishMoveActor_C_ReceiveTick");
static_assert(sizeof(BP_FinishMoveActor_C_ReceiveTick) == 0x000004, "Wrong size on BP_FinishMoveActor_C_ReceiveTick");
static_assert(offsetof(BP_FinishMoveActor_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_FinishMoveActor_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_FinishMoveActor.BP_FinishMoveActor_C.SwapSpawnCamera
// 0x01D0 (0x01D0 - 0x0000)
struct BP_FinishMoveActor_C_SwapSpawnCamera final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DCF[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DD0[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraActor*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerManager_C*                    K2Node_DynamicCast_AsBP_Player_Manager;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DD1[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      CallFunc_GetMainPlayer_Player;                     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICameraInterface>      CallFunc_GetPlayerCameraRotation_self_CastInput;   // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetPlayerCameraRotation_ReturnValue;      // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DD2[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICameraInterface>      CallFunc_GetPlayerCameraLocation_self_CastInput;   // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetPlayerCameraLocation_ReturnValue;      // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x00B4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x013C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_FinishMoveActor_C_SwapSpawnCamera) == 0x000010, "Wrong alignment on BP_FinishMoveActor_C_SwapSpawnCamera");
static_assert(sizeof(BP_FinishMoveActor_C_SwapSpawnCamera) == 0x0001D0, "Wrong size on BP_FinishMoveActor_C_SwapSpawnCamera");
static_assert(offsetof(BP_FinishMoveActor_C_SwapSpawnCamera, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'BP_FinishMoveActor_C_SwapSpawnCamera::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_SwapSpawnCamera, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_FinishMoveActor_C_SwapSpawnCamera::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_SwapSpawnCamera, CallFunc_GetPlayerManager_PlayerManager) == 0x000040, "Member 'BP_FinishMoveActor_C_SwapSpawnCamera::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_SwapSpawnCamera, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000048, "Member 'BP_FinishMoveActor_C_SwapSpawnCamera::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_SwapSpawnCamera, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_FinishMoveActor_C_SwapSpawnCamera::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_SwapSpawnCamera, CallFunc_FinishSpawningActor_ReturnValue) == 0x000058, "Member 'BP_FinishMoveActor_C_SwapSpawnCamera::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_SwapSpawnCamera, K2Node_DynamicCast_AsBP_Player_Manager) == 0x000060, "Member 'BP_FinishMoveActor_C_SwapSpawnCamera::K2Node_DynamicCast_AsBP_Player_Manager' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_SwapSpawnCamera, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_FinishMoveActor_C_SwapSpawnCamera::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_SwapSpawnCamera, CallFunc_GetMainPlayer_Player) == 0x000070, "Member 'BP_FinishMoveActor_C_SwapSpawnCamera::CallFunc_GetMainPlayer_Player' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_SwapSpawnCamera, CallFunc_GetPlayerCameraRotation_self_CastInput) == 0x000078, "Member 'BP_FinishMoveActor_C_SwapSpawnCamera::CallFunc_GetPlayerCameraRotation_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_SwapSpawnCamera, CallFunc_GetPlayerCameraRotation_ReturnValue) == 0x000088, "Member 'BP_FinishMoveActor_C_SwapSpawnCamera::CallFunc_GetPlayerCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_SwapSpawnCamera, CallFunc_IsValid_ReturnValue_1) == 0x000094, "Member 'BP_FinishMoveActor_C_SwapSpawnCamera::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_SwapSpawnCamera, CallFunc_GetPlayerCameraLocation_self_CastInput) == 0x000098, "Member 'BP_FinishMoveActor_C_SwapSpawnCamera::CallFunc_GetPlayerCameraLocation_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_SwapSpawnCamera, CallFunc_GetPlayerCameraLocation_ReturnValue) == 0x0000A8, "Member 'BP_FinishMoveActor_C_SwapSpawnCamera::CallFunc_GetPlayerCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_SwapSpawnCamera, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0000B4, "Member 'BP_FinishMoveActor_C_SwapSpawnCamera::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_SwapSpawnCamera, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x00013C, "Member 'BP_FinishMoveActor_C_SwapSpawnCamera::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function BP_FinishMoveActor.BP_FinishMoveActor_C.SetFOV
// 0x0008 (0x0008 - 0x0000)
struct BP_FinishMoveActor_C_SetFOV final
{
public:
	float                                         FOV;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FinishMoveActor_C_SetFOV) == 0x000004, "Wrong alignment on BP_FinishMoveActor_C_SetFOV");
static_assert(sizeof(BP_FinishMoveActor_C_SetFOV) == 0x000008, "Wrong size on BP_FinishMoveActor_C_SetFOV");
static_assert(offsetof(BP_FinishMoveActor_C_SetFOV, FOV) == 0x000000, "Member 'BP_FinishMoveActor_C_SetFOV::FOV' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActor_C_SetFOV, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_FinishMoveActor_C_SetFOV::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

