#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FaceCap_sky

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_FaceCap_sky.BP_FaceCap_sky_C.GetStaticMesh
// 0x0008 (0x0008 - 0x0000)
struct BP_FaceCap_sky_C_GetStaticMesh final
{
public:
	class UStaticMeshComponent*                   Param_StaticMesh;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FaceCap_sky_C_GetStaticMesh) == 0x000008, "Wrong alignment on BP_FaceCap_sky_C_GetStaticMesh");
static_assert(sizeof(BP_FaceCap_sky_C_GetStaticMesh) == 0x000008, "Wrong size on BP_FaceCap_sky_C_GetStaticMesh");
static_assert(offsetof(BP_FaceCap_sky_C_GetStaticMesh, Param_StaticMesh) == 0x000000, "Member 'BP_FaceCap_sky_C_GetStaticMesh::Param_StaticMesh' has a wrong offset!");

// Function BP_FaceCap_sky.BP_FaceCap_sky_C.GetSkeletalMesh
// 0x0008 (0x0008 - 0x0000)
struct BP_FaceCap_sky_C_GetSkeletalMesh final
{
public:
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FaceCap_sky_C_GetSkeletalMesh) == 0x000008, "Wrong alignment on BP_FaceCap_sky_C_GetSkeletalMesh");
static_assert(sizeof(BP_FaceCap_sky_C_GetSkeletalMesh) == 0x000008, "Wrong size on BP_FaceCap_sky_C_GetSkeletalMesh");
static_assert(offsetof(BP_FaceCap_sky_C_GetSkeletalMesh, SkeletalMesh) == 0x000000, "Member 'BP_FaceCap_sky_C_GetSkeletalMesh::SkeletalMesh' has a wrong offset!");

}

