#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FinishMoveActorManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FinishMoveActorManager.BP_FinishMoveActorManager_C.ExecuteUbergraph_BP_FinishMoveActorManager
// 0x01E0 (0x01E0 - 0x0000)
struct BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_478E[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARsBattleHero_C*                        K2Node_DynamicCast_AsRs_Battle_Hero;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_478F[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFOVAngle_ReturnValue;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4790[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4791[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4792[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFinishMoveActor*                       K2Node_DynamicCast_AsFinish_Move_Actor;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4793[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4794[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4795[0x8];                                     // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x00C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4796[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4797[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraActor*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFinishMoveActor*                       K2Node_DynamicCast_AsFinish_Move_Actor_1;          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4798[0x1];                                     // 0x0173(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4799[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager_1;         // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameSystemManager_C*                CallFunc_GetGameSystemManager_Manager;             // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_479A[0x6];                                     // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    K2Node_DynamicCast_AsBP_Player_Manager;            // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveGlobalCustomTimeDilation_Success;   // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_479B[0x6];                                     // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      CallFunc_GetMainPlayer_Player;                     // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICameraInterface>      CallFunc_SetPlayerCameraViewTarget_self_CastInput; // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetPlayerCameraViewTarget_ReturnValue;    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_479C[0x5];                                     // 0x01CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFinishMoveActor*                       K2Node_DynamicCast_AsFinish_Move_Actor_2;          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager) == 0x000010, "Wrong alignment on BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager");
static_assert(sizeof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager) == 0x0001E0, "Wrong size on BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, EntryPoint) == 0x000000, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, K2Node_DynamicCast_AsRs_Battle_Hero) == 0x000018, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::K2Node_DynamicCast_AsRs_Battle_Hero' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000028, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_GetPlayerManager_PlayerManager) == 0x000030, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_GetFOVAngle_ReturnValue) == 0x000038, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_GetFOVAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_IsValid_ReturnValue_2) == 0x00003C, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_GetPlayer_ReturnValue) == 0x000040, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_GetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, K2Node_DynamicCast_AsRSBattle_Player) == 0x000048, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_IsValid_ReturnValue_3) == 0x000051, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, K2Node_Event_DeltaSeconds) == 0x000054, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_IsValid_ReturnValue_4) == 0x000058, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, K2Node_DynamicCast_AsFinish_Move_Actor) == 0x000060, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::K2Node_DynamicCast_AsFinish_Move_Actor' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_IsValid_ReturnValue_5) == 0x000069, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00006C, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000078, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00007C, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0000C0, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000148, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000150, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, Temp_bool_Has_Been_Initd_Variable) == 0x000158, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_FinishSpawningActor_ReturnValue) == 0x000160, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, K2Node_DynamicCast_AsFinish_Move_Actor_1) == 0x000168, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::K2Node_DynamicCast_AsFinish_Move_Actor_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, K2Node_DynamicCast_bSuccess_3) == 0x000170, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_IsValid_ReturnValue_6) == 0x000171, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_IsValid_ReturnValue_7) == 0x000172, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_GetSocketLocation_ReturnValue) == 0x000174, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, Temp_bool_IsClosed_Variable) == 0x000180, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_GetPlayerManager_PlayerManager_1) == 0x000188, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_GetPlayerManager_PlayerManager_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_GetGameSystemManager_Manager) == 0x000190, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_GetGameSystemManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_IsValid_ReturnValue_8) == 0x000198, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_IsValid_ReturnValue_9) == 0x000199, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, K2Node_DynamicCast_AsBP_Player_Manager) == 0x0001A0, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::K2Node_DynamicCast_AsBP_Player_Manager' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, K2Node_DynamicCast_bSuccess_4) == 0x0001A8, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_RemoveGlobalCustomTimeDilation_Success) == 0x0001A9, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_RemoveGlobalCustomTimeDilation_Success' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_GetMainPlayer_Player) == 0x0001B0, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_GetMainPlayer_Player' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_SetPlayerCameraViewTarget_self_CastInput) == 0x0001B8, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_SetPlayerCameraViewTarget_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_SetPlayerCameraViewTarget_ReturnValue) == 0x0001C8, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_SetPlayerCameraViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, K2Node_Event_EndPlayReason) == 0x0001C9, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_IsValid_ReturnValue_10) == 0x0001CA, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, K2Node_DynamicCast_AsFinish_Move_Actor_2) == 0x0001D0, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::K2Node_DynamicCast_AsFinish_Move_Actor_2' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, K2Node_DynamicCast_bSuccess_5) == 0x0001D8, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_IsValid_ReturnValue_11) == 0x0001D9, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager, CallFunc_IsValid_ReturnValue_12) == 0x0001DA, "Member 'BP_FinishMoveActorManager_C_ExecuteUbergraph_BP_FinishMoveActorManager::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");

// Function BP_FinishMoveActorManager.BP_FinishMoveActorManager_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_FinishMoveActorManager_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FinishMoveActorManager_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_FinishMoveActorManager_C_ReceiveEndPlay");
static_assert(sizeof(BP_FinishMoveActorManager_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_FinishMoveActorManager_C_ReceiveEndPlay");
static_assert(offsetof(BP_FinishMoveActorManager_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_FinishMoveActorManager_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_FinishMoveActorManager.BP_FinishMoveActorManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_FinishMoveActorManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FinishMoveActorManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_FinishMoveActorManager_C_ReceiveTick");
static_assert(sizeof(BP_FinishMoveActorManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_FinishMoveActorManager_C_ReceiveTick");
static_assert(offsetof(BP_FinishMoveActorManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_FinishMoveActorManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_FinishMoveActorManager.BP_FinishMoveActorManager_C.FinishmoveStart
// 0x00C0 (0x00C0 - 0x0000)
struct BP_FinishMoveActorManager_C_FinishmoveStart final
{
public:
	class USkeletalMeshComponent*                 NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleSimulatorManager*                CallFunc_GetBattleSimulatorManager_BattleSimulatorManager; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMissionActive_ReturnValue;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_479D[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleSimulatorManager*                CallFunc_GetBattleSimulatorManager_BattleSimulatorManager_1; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_479E[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFinishMoveActor*                       K2Node_DynamicCast_AsFinish_Move_Actor;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMissionActive_ReturnValue_1;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_479F[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrainCrashManager_C*                CallFunc_GetBrainCrashManager_Manager;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingAnyBrainCrash_NowPlaying;        // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47A0[0x5];                                     // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameSystemManager_C*                CallFunc_GetGameSystemManager_Manager;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47A1[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentCustomTimeDilation_CustomTimeDilation; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47A2[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FinishMoveActor_C*                  K2Node_DynamicCast_AsBP_Finish_Move_Actor;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47A3[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A4[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FinishMoveActor_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FinishMoveActorManager_C_FinishmoveStart) == 0x000010, "Wrong alignment on BP_FinishMoveActorManager_C_FinishmoveStart");
static_assert(sizeof(BP_FinishMoveActorManager_C_FinishmoveStart) == 0x0000C0, "Wrong size on BP_FinishMoveActorManager_C_FinishmoveStart");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, NewParam) == 0x000000, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::NewParam' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, CallFunc_GetBattleSimulatorManager_BattleSimulatorManager) == 0x000008, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::CallFunc_GetBattleSimulatorManager_BattleSimulatorManager' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, CallFunc_IsMissionActive_ReturnValue) == 0x000011, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::CallFunc_IsMissionActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, CallFunc_GetBattleSimulatorManager_BattleSimulatorManager_1) == 0x000018, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::CallFunc_GetBattleSimulatorManager_BattleSimulatorManager_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, CallFunc_IsValid_ReturnValue_2) == 0x000021, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, K2Node_DynamicCast_AsFinish_Move_Actor) == 0x000028, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::K2Node_DynamicCast_AsFinish_Move_Actor' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, CallFunc_IsMissionActive_ReturnValue_1) == 0x000031, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::CallFunc_IsMissionActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, CallFunc_GetBrainCrashManager_Manager) == 0x000038, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::CallFunc_GetBrainCrashManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, CallFunc_IsValid_ReturnValue_3) == 0x000040, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, CallFunc_IsValid_ReturnValue_4) == 0x000041, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, CallFunc_IsPlayingAnyBrainCrash_NowPlaying) == 0x000042, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::CallFunc_IsPlayingAnyBrainCrash_NowPlaying' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, CallFunc_GetGameSystemManager_Manager) == 0x000048, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::CallFunc_GetGameSystemManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, CallFunc_IsValid_ReturnValue_5) == 0x000050, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, CallFunc_GetCurrentCustomTimeDilation_CustomTimeDilation) == 0x000054, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::CallFunc_GetCurrentCustomTimeDilation_CustomTimeDilation' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000058, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, CallFunc_IsValid_ReturnValue_6) == 0x00005C, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, K2Node_DynamicCast_AsBP_Finish_Move_Actor) == 0x000060, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::K2Node_DynamicCast_AsBP_Finish_Move_Actor' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000A0, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, CallFunc_GetSocketLocation_ReturnValue) == 0x0000A8, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_FinishmoveStart, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000B8, "Member 'BP_FinishMoveActorManager_C_FinishmoveStart::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_FinishMoveActorManager.BP_FinishMoveActorManager_C.ComputeEndCameraBlendTransform
// 0x00A8 (0x00A8 - 0x0000)
struct BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A5[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARsBattleHero_C*                        K2Node_DynamicCast_AsRs_Battle_Hero;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47A6[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARsBattleHero_C*                        K2Node_DynamicCast_AsRs_Battle_Hero_1;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47A7[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47A8[0x2];                                     // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A9[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_2;                 // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARsBattleHero_C*                        K2Node_DynamicCast_AsRs_Battle_Hero_2;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform) == 0x000008, "Wrong alignment on BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform");
static_assert(sizeof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform) == 0x0000A8, "Wrong size on BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, DeltaTime) == 0x000000, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, K2Node_DynamicCast_AsRs_Battle_Hero) == 0x000018, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::K2Node_DynamicCast_AsRs_Battle_Hero' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, Temp_bool_Has_Been_Initd_Variable) == 0x000021, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, CallFunc_GetPlayerController_ReturnValue_1) == 0x000028, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000030, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, K2Node_DynamicCast_AsRs_Battle_Hero_1) == 0x000038, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::K2Node_DynamicCast_AsRs_Battle_Hero_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, Temp_bool_IsClosed_Variable) == 0x000041, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000044, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000050, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00005C, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000068, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, CallFunc_Normal_ReturnValue) == 0x00006C, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, CallFunc_Lerp_ReturnValue) == 0x000078, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, Temp_bool_IsClosed_Variable_1) == 0x00007C, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, Temp_bool_Has_Been_Initd_Variable_1) == 0x00007D, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, CallFunc_GetPlayerController_ReturnValue_2) == 0x000080, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000088, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, CallFunc_K2_GetPawn_ReturnValue_2) == 0x000090, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::CallFunc_K2_GetPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, K2Node_DynamicCast_AsRs_Battle_Hero_2) == 0x000098, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::K2Node_DynamicCast_AsRs_Battle_Hero_2' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000A1, "Member 'BP_FinishMoveActorManager_C_ComputeEndCameraBlendTransform::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_FinishMoveActorManager.BP_FinishMoveActorManager_C.PauseFinishMove
// 0x0001 (0x0001 - 0x0000)
struct BP_FinishMoveActorManager_C_PauseFinishMove final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FinishMoveActorManager_C_PauseFinishMove) == 0x000001, "Wrong alignment on BP_FinishMoveActorManager_C_PauseFinishMove");
static_assert(sizeof(BP_FinishMoveActorManager_C_PauseFinishMove) == 0x000001, "Wrong size on BP_FinishMoveActorManager_C_PauseFinishMove");
static_assert(offsetof(BP_FinishMoveActorManager_C_PauseFinishMove, ReturnValue) == 0x000000, "Member 'BP_FinishMoveActorManager_C_PauseFinishMove::ReturnValue' has a wrong offset!");

// Function BP_FinishMoveActorManager.BP_FinishMoveActorManager_C.RestartFinishMove
// 0x0001 (0x0001 - 0x0000)
struct BP_FinishMoveActorManager_C_RestartFinishMove final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FinishMoveActorManager_C_RestartFinishMove) == 0x000001, "Wrong alignment on BP_FinishMoveActorManager_C_RestartFinishMove");
static_assert(sizeof(BP_FinishMoveActorManager_C_RestartFinishMove) == 0x000001, "Wrong size on BP_FinishMoveActorManager_C_RestartFinishMove");
static_assert(offsetof(BP_FinishMoveActorManager_C_RestartFinishMove, ReturnValue) == 0x000000, "Member 'BP_FinishMoveActorManager_C_RestartFinishMove::ReturnValue' has a wrong offset!");

}

