#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GhostTrailManager

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_GhostMaterialParam_structs.hpp"
#include "E_GhostInfo_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GhostTrailManager.BP_GhostTrailManager_C.GhostSpawned__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct BP_GhostTrailManager_C_GhostSpawned__DelegateSignature final
{
public:
	struct FE_GhostInfo                           GhostInfo;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_GhostTrailManager_C_GhostSpawned__DelegateSignature) == 0x000008, "Wrong alignment on BP_GhostTrailManager_C_GhostSpawned__DelegateSignature");
static_assert(sizeof(BP_GhostTrailManager_C_GhostSpawned__DelegateSignature) == 0x000038, "Wrong size on BP_GhostTrailManager_C_GhostSpawned__DelegateSignature");
static_assert(offsetof(BP_GhostTrailManager_C_GhostSpawned__DelegateSignature, GhostInfo) == 0x000000, "Member 'BP_GhostTrailManager_C_GhostSpawned__DelegateSignature::GhostInfo' has a wrong offset!");

// Function BP_GhostTrailManager.BP_GhostTrailManager_C.ExecuteUbergraph_BP_GhostTrailManager
// 0x000C (0x000C - 0x0000)
struct BP_GhostTrailManager_C_ExecuteUbergraph_BP_GhostTrailManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GhostTrailManager_C_ExecuteUbergraph_BP_GhostTrailManager) == 0x000004, "Wrong alignment on BP_GhostTrailManager_C_ExecuteUbergraph_BP_GhostTrailManager");
static_assert(sizeof(BP_GhostTrailManager_C_ExecuteUbergraph_BP_GhostTrailManager) == 0x00000C, "Wrong size on BP_GhostTrailManager_C_ExecuteUbergraph_BP_GhostTrailManager");
static_assert(offsetof(BP_GhostTrailManager_C_ExecuteUbergraph_BP_GhostTrailManager, EntryPoint) == 0x000000, "Member 'BP_GhostTrailManager_C_ExecuteUbergraph_BP_GhostTrailManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_ExecuteUbergraph_BP_GhostTrailManager, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_GhostTrailManager_C_ExecuteUbergraph_BP_GhostTrailManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_ExecuteUbergraph_BP_GhostTrailManager, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'BP_GhostTrailManager_C_ExecuteUbergraph_BP_GhostTrailManager::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_GhostTrailManager.BP_GhostTrailManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_GhostTrailManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GhostTrailManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_GhostTrailManager_C_ReceiveTick");
static_assert(sizeof(BP_GhostTrailManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_GhostTrailManager_C_ReceiveTick");
static_assert(offsetof(BP_GhostTrailManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_GhostTrailManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_GhostTrailManager.BP_GhostTrailManager_C.SpawnStaticGhost
// 0x02B0 (0x02B0 - 0x0000)
struct BP_GhostTrailManager_C_SpawnStaticGhost final
{
public:
	class UStaticMeshComponent*                   MasterStaticMeshComponent;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FE_GhostInfo                           GhostInfo;                                         // 0x0008(0x0038)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UStaticMesh*                            TargetMesh;                                        // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 TmpMatParamIndex;                                  // 0x0048(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FE_GhostInfo                           TmpInfo;                                           // 0x0058(0x0038)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         TmpMaterialNum;                                    // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DA9[0xC];                                     // 0x0094(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             L_NewTransform;                                    // 0x00A0(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               L_GhostDinamMaterial;                              // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   L_Master;                                          // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   L_Mesh;                                            // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_SearchOrAddStaticMeshCache_CachedMesh;    // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DAA[0x3];                                     // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DAB[0x3];                                     // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DAC[0x6];                                     // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FE_GhostInfo                           K2Node_MakeStruct_E_GhostInfo;                     // 0x0118(0x0038)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0150(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DAD[0x4];                                     // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_PrivateSearchMaterialParamIndex_Index;    // 0x01E0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DAE[0x3];                                     // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable;                              // 0x0200(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DAF[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0240(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_CalcRandomOffsetLocation_OffsetLocation;  // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DB0[0x4];                                     // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_ChangeMasterRelative_ReturnValue;         // 0x0280(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GhostTrailManager_C_SpawnStaticGhost) == 0x000010, "Wrong alignment on BP_GhostTrailManager_C_SpawnStaticGhost");
static_assert(sizeof(BP_GhostTrailManager_C_SpawnStaticGhost) == 0x0002B0, "Wrong size on BP_GhostTrailManager_C_SpawnStaticGhost");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, MasterStaticMeshComponent) == 0x000000, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::MasterStaticMeshComponent' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, GhostInfo) == 0x000008, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::GhostInfo' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, TargetMesh) == 0x000040, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::TargetMesh' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, TmpMatParamIndex) == 0x000048, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::TmpMatParamIndex' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, TmpInfo) == 0x000058, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::TmpInfo' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, TmpMaterialNum) == 0x000090, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::TmpMaterialNum' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, L_NewTransform) == 0x0000A0, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::L_NewTransform' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, L_GhostDinamMaterial) == 0x0000D0, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::L_GhostDinamMaterial' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, L_Master) == 0x0000D8, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::L_Master' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, L_Mesh) == 0x0000E0, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::L_Mesh' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, CallFunc_SearchOrAddStaticMeshCache_CachedMesh) == 0x0000E8, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::CallFunc_SearchOrAddStaticMeshCache_CachedMesh' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, CallFunc_Not_PreBool_ReturnValue) == 0x0000F0, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, Temp_int_Variable) == 0x0000F4, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000F8, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, CallFunc_Add_IntInt_ReturnValue) == 0x0000FC, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000104, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, CallFunc_BooleanAND_ReturnValue) == 0x000110, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000111, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, K2Node_MakeStruct_E_GhostInfo) == 0x000118, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::K2Node_MakeStruct_E_GhostInfo' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000150, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, CallFunc_Array_Add_ReturnValue) == 0x0001D8, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, CallFunc_PrivateSearchMaterialParamIndex_Index) == 0x0001E0, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::CallFunc_PrivateSearchMaterialParamIndex_Index' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0001F0, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, CallFunc_IsValid_ReturnValue_1) == 0x0001F8, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, CallFunc_GetNumMaterials_ReturnValue) == 0x0001FC, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, Temp_struct_Variable) == 0x000200, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, CallFunc_AddComponent_ReturnValue) == 0x000230, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, CallFunc_SetStaticMesh_ReturnValue) == 0x000238, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000240, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, CallFunc_CalcRandomOffsetLocation_OffsetLocation) == 0x000270, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::CallFunc_CalcRandomOffsetLocation_OffsetLocation' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnStaticGhost, CallFunc_ChangeMasterRelative_ReturnValue) == 0x000280, "Member 'BP_GhostTrailManager_C_SpawnStaticGhost::CallFunc_ChangeMasterRelative_ReturnValue' has a wrong offset!");

// Function BP_GhostTrailManager.BP_GhostTrailManager_C.SpawnTimer
// 0x0010 (0x0010 - 0x0000)
struct BP_GhostTrailManager_C_SpawnTimer final
{
public:
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DB1[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGhostDeltaSeconds_DeltaSeconds;        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DB2[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GhostTrailManager_C_SpawnTimer) == 0x000004, "Wrong alignment on BP_GhostTrailManager_C_SpawnTimer");
static_assert(sizeof(BP_GhostTrailManager_C_SpawnTimer) == 0x000010, "Wrong size on BP_GhostTrailManager_C_SpawnTimer");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnTimer, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000000, "Member 'BP_GhostTrailManager_C_SpawnTimer::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnTimer, CallFunc_GetGhostDeltaSeconds_DeltaSeconds) == 0x000004, "Member 'BP_GhostTrailManager_C_SpawnTimer::CallFunc_GetGhostDeltaSeconds_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnTimer, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_GhostTrailManager_C_SpawnTimer::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnTimer, CallFunc_Add_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_GhostTrailManager_C_SpawnTimer::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_GhostTrailManager.BP_GhostTrailManager_C.SpawnSkeletalGhost
// 0x02E0 (0x02E0 - 0x0000)
struct BP_GhostTrailManager_C_SpawnSkeletalGhost final
{
public:
	class USkeletalMeshComponent*                 MasterStaticMeshComponent;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FE_GhostInfo                           GhostInfo;                                         // 0x0008(0x0038)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	class USkeletalMesh*                          TargetMesh;                                        // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 TmpMatParamIndex;                                  // 0x0048(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FE_GhostInfo                           TmpInfo;                                           // 0x0058(0x0038)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         TmpMaterialNum;                                    // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DB3[0xC];                                     // 0x0094(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             L_NewTransform;                                    // 0x00A0(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               L_GhostDinamMaterial;                              // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 L_Master;                                          // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPoseableMeshComponent*                 L_Mesh;                                            // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisibleMaterial_ReturnValue;            // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DB4[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPoseableMeshComponent*                 CallFunc_SearchOrAddSkeletalMeshCache_CachedMesh;  // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DB5[0x3];                                     // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DB6[0x2];                                     // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DB7[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DB8[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_PrivateSearchMaterialParamIndex_Index;    // 0x0128(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DB9[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DBA[0x2];                                     // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DBB[0x8];                                     // 0x0158(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0160(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FE_GhostInfo                           K2Node_MakeStruct_E_GhostInfo;                     // 0x0190(0x0038)(ContainsInstancedReference, HasGetValueTypeHash)
	class UPoseableMeshComponent*                 CallFunc_AddComponent_ReturnValue;                 // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DBC[0x4];                                     // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DBD[0x3];                                     // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x01E8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0270(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_CalcRandomOffsetLocation_OffsetLocation;  // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DBE[0x4];                                     // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_ChangeMasterRelative_ReturnValue;         // 0x02B0(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GhostTrailManager_C_SpawnSkeletalGhost) == 0x000010, "Wrong alignment on BP_GhostTrailManager_C_SpawnSkeletalGhost");
static_assert(sizeof(BP_GhostTrailManager_C_SpawnSkeletalGhost) == 0x0002E0, "Wrong size on BP_GhostTrailManager_C_SpawnSkeletalGhost");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, MasterStaticMeshComponent) == 0x000000, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::MasterStaticMeshComponent' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, GhostInfo) == 0x000008, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::GhostInfo' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, TargetMesh) == 0x000040, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::TargetMesh' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, TmpMatParamIndex) == 0x000048, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::TmpMatParamIndex' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, TmpInfo) == 0x000058, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::TmpInfo' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, TmpMaterialNum) == 0x000090, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::TmpMaterialNum' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, L_NewTransform) == 0x0000A0, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::L_NewTransform' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, L_GhostDinamMaterial) == 0x0000D0, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::L_GhostDinamMaterial' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, L_Master) == 0x0000D8, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::L_Master' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, L_Mesh) == 0x0000E0, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::L_Mesh' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, Temp_int_Variable) == 0x0000E8, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, CallFunc_Add_IntInt_ReturnValue) == 0x0000EC, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, CallFunc_Array_Length_ReturnValue) == 0x0000F0, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, Temp_int_Loop_Num_Variable) == 0x0000F4, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, CallFunc_IsVisibleMaterial_ReturnValue) == 0x0000F8, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::CallFunc_IsVisibleMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, CallFunc_SearchOrAddSkeletalMeshCache_CachedMesh) == 0x000100, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::CallFunc_SearchOrAddSkeletalMeshCache_CachedMesh' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, Temp_int_Loop_Counter_Variable) == 0x000108, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, CallFunc_Less_IntInt_ReturnValue) == 0x00010C, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, CallFunc_Add_IntInt_ReturnValue_1) == 0x000110, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, CallFunc_Not_PreBool_ReturnValue) == 0x000114, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, CallFunc_BooleanAND_ReturnValue) == 0x000115, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, CallFunc_Subtract_IntInt_ReturnValue) == 0x000118, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00011C, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, Temp_int_Array_Index_Variable) == 0x000120, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, CallFunc_PrivateSearchMaterialParamIndex_Index) == 0x000128, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::CallFunc_PrivateSearchMaterialParamIndex_Index' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, CallFunc_IsValid_ReturnValue) == 0x000138, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x000140, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, K2Node_DynamicCast_bSuccess) == 0x000148, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, CallFunc_IsValid_ReturnValue_1) == 0x000149, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, CallFunc_K2_GetComponentScale_ReturnValue) == 0x00014C, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, Temp_struct_Variable) == 0x000160, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, K2Node_MakeStruct_E_GhostInfo) == 0x000190, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::K2Node_MakeStruct_E_GhostInfo' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, CallFunc_AddComponent_ReturnValue) == 0x0001C8, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, CallFunc_Array_Add_ReturnValue) == 0x0001D0, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0001D8, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, CallFunc_IsValid_ReturnValue_2) == 0x0001E0, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, CallFunc_GetNumMaterials_ReturnValue) == 0x0001E4, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x0001E8, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000270, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, CallFunc_CalcRandomOffsetLocation_OffsetLocation) == 0x0002A0, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::CallFunc_CalcRandomOffsetLocation_OffsetLocation' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnSkeletalGhost, CallFunc_ChangeMasterRelative_ReturnValue) == 0x0002B0, "Member 'BP_GhostTrailManager_C_SpawnSkeletalGhost::CallFunc_ChangeMasterRelative_ReturnValue' has a wrong offset!");

// Function BP_GhostTrailManager.BP_GhostTrailManager_C.UpdateGhostInfos
// 0x0098 (0x0098 - 0x0000)
struct BP_GhostTrailManager_C_UpdateGhostInfos final
{
public:
	struct FE_GhostInfo                           TmpGhost;                                          // 0x0000(0x0038)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	float                                         CallFunc_GetGhostDeltaSeconds_DeltaSeconds;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DBF[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC0[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FE_GhostInfo                           CallFunc_Array_Get_Item;                           // 0x0058(0x0038)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GhostTrailManager_C_UpdateGhostInfos) == 0x000008, "Wrong alignment on BP_GhostTrailManager_C_UpdateGhostInfos");
static_assert(sizeof(BP_GhostTrailManager_C_UpdateGhostInfos) == 0x000098, "Wrong size on BP_GhostTrailManager_C_UpdateGhostInfos");
static_assert(offsetof(BP_GhostTrailManager_C_UpdateGhostInfos, TmpGhost) == 0x000000, "Member 'BP_GhostTrailManager_C_UpdateGhostInfos::TmpGhost' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_UpdateGhostInfos, CallFunc_GetGhostDeltaSeconds_DeltaSeconds) == 0x000038, "Member 'BP_GhostTrailManager_C_UpdateGhostInfos::CallFunc_GetGhostDeltaSeconds_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_UpdateGhostInfos, CallFunc_Add_FloatFloat_ReturnValue) == 0x00003C, "Member 'BP_GhostTrailManager_C_UpdateGhostInfos::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_UpdateGhostInfos, Temp_int_Array_Index_Variable) == 0x000040, "Member 'BP_GhostTrailManager_C_UpdateGhostInfos::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_UpdateGhostInfos, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000044, "Member 'BP_GhostTrailManager_C_UpdateGhostInfos::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_UpdateGhostInfos, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BP_GhostTrailManager_C_UpdateGhostInfos::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_UpdateGhostInfos, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'BP_GhostTrailManager_C_UpdateGhostInfos::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_UpdateGhostInfos, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_GhostTrailManager_C_UpdateGhostInfos::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_UpdateGhostInfos, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_GhostTrailManager_C_UpdateGhostInfos::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_UpdateGhostInfos, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'BP_GhostTrailManager_C_UpdateGhostInfos::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_GhostTrailManager.BP_GhostTrailManager_C.SpawnGhosts
// 0x00E0 (0x00E0 - 0x0000)
struct BP_GhostTrailManager_C_SpawnGhosts final
{
public:
	float                                         L_VelocityLengthSq;                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DC1[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DC2[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DC3[0x1];                                     // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item_1;                         // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue_1;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DC4[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DC5[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DC6[0x1];                                     // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FE_GhostInfo                           CallFunc_SpawnSkeletalGhost_GhostInfo;             // 0x0068(0x0038)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC7[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FE_GhostInfo                           CallFunc_SpawnStaticGhost_GhostInfo;               // 0x00A8(0x0038)(ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_GhostTrailManager_C_SpawnGhosts) == 0x000008, "Wrong alignment on BP_GhostTrailManager_C_SpawnGhosts");
static_assert(sizeof(BP_GhostTrailManager_C_SpawnGhosts) == 0x0000E0, "Wrong size on BP_GhostTrailManager_C_SpawnGhosts");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, L_VelocityLengthSq) == 0x000000, "Member 'BP_GhostTrailManager_C_SpawnGhosts::L_VelocityLengthSq' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_GhostTrailManager_C_SpawnGhosts::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, Temp_int_Loop_Num_Variable) == 0x000008, "Member 'BP_GhostTrailManager_C_SpawnGhosts::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_GhostTrailManager_C_SpawnGhosts::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'BP_GhostTrailManager_C_SpawnGhosts::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_GhostTrailManager_C_SpawnGhosts::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'BP_GhostTrailManager_C_SpawnGhosts::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, CallFunc_Array_Get_Item) == 0x00001C, "Member 'BP_GhostTrailManager_C_SpawnGhosts::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, CallFunc_VSizeSquared_ReturnValue) == 0x000028, "Member 'BP_GhostTrailManager_C_SpawnGhosts::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_GhostTrailManager_C_SpawnGhosts::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'BP_GhostTrailManager_C_SpawnGhosts::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000034, "Member 'BP_GhostTrailManager_C_SpawnGhosts::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000038, "Member 'BP_GhostTrailManager_C_SpawnGhosts::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00003C, "Member 'BP_GhostTrailManager_C_SpawnGhosts::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, CallFunc_BooleanAND_ReturnValue) == 0x00003D, "Member 'BP_GhostTrailManager_C_SpawnGhosts::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, CallFunc_Not_PreBool_ReturnValue) == 0x00003E, "Member 'BP_GhostTrailManager_C_SpawnGhosts::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'BP_GhostTrailManager_C_SpawnGhosts::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, CallFunc_VSizeSquared_ReturnValue_1) == 0x00004C, "Member 'BP_GhostTrailManager_C_SpawnGhosts::CallFunc_VSizeSquared_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000050, "Member 'BP_GhostTrailManager_C_SpawnGhosts::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000054, "Member 'BP_GhostTrailManager_C_SpawnGhosts::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000058, "Member 'BP_GhostTrailManager_C_SpawnGhosts::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, Temp_int_Loop_Num_Variable_1) == 0x00005C, "Member 'BP_GhostTrailManager_C_SpawnGhosts::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, CallFunc_BooleanAND_ReturnValue_1) == 0x000060, "Member 'BP_GhostTrailManager_C_SpawnGhosts::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, CallFunc_Less_IntInt_ReturnValue_1) == 0x000061, "Member 'BP_GhostTrailManager_C_SpawnGhosts::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, CallFunc_Not_PreBool_ReturnValue_1) == 0x000062, "Member 'BP_GhostTrailManager_C_SpawnGhosts::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'BP_GhostTrailManager_C_SpawnGhosts::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, CallFunc_SpawnSkeletalGhost_GhostInfo) == 0x000068, "Member 'BP_GhostTrailManager_C_SpawnGhosts::CallFunc_SpawnSkeletalGhost_GhostInfo' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, CallFunc_Array_Length_ReturnValue_1) == 0x0000A0, "Member 'BP_GhostTrailManager_C_SpawnGhosts::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_SpawnGhosts, CallFunc_SpawnStaticGhost_GhostInfo) == 0x0000A8, "Member 'BP_GhostTrailManager_C_SpawnGhosts::CallFunc_SpawnStaticGhost_GhostInfo' has a wrong offset!");

// Function BP_GhostTrailManager.BP_GhostTrailManager_C.UpdateGhostVisual
// 0x0068 (0x0068 - 0x0000)
struct BP_GhostTrailManager_C_UpdateGhostVisual final
{
public:
	struct FE_GhostInfo                           GhostInfo;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	float                                         L_ExistTime;                                       // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GhostTrailManager_C_UpdateGhostVisual) == 0x000008, "Wrong alignment on BP_GhostTrailManager_C_UpdateGhostVisual");
static_assert(sizeof(BP_GhostTrailManager_C_UpdateGhostVisual) == 0x000068, "Wrong size on BP_GhostTrailManager_C_UpdateGhostVisual");
static_assert(offsetof(BP_GhostTrailManager_C_UpdateGhostVisual, GhostInfo) == 0x000000, "Member 'BP_GhostTrailManager_C_UpdateGhostVisual::GhostInfo' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_UpdateGhostVisual, L_ExistTime) == 0x000038, "Member 'BP_GhostTrailManager_C_UpdateGhostVisual::L_ExistTime' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_UpdateGhostVisual, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00003C, "Member 'BP_GhostTrailManager_C_UpdateGhostVisual::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_UpdateGhostVisual, CallFunc_GetFloatValue_ReturnValue) == 0x000040, "Member 'BP_GhostTrailManager_C_UpdateGhostVisual::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_UpdateGhostVisual, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000044, "Member 'BP_GhostTrailManager_C_UpdateGhostVisual::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GhostTrailManager_C_UpdateGhostVisual, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000048, "Member 'BP_GhostTrailManager_C_UpdateGhostVisual::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
