#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameOverSystemComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "Engine_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function BP_GameOverSystemComponent.BP_GameOverSystemComponent_C.ExecuteUbergraph_BP_GameOverSystemComponent
// 0x01A0 (0x01A0 - 0x0000)
struct BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E96[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SeamlessCameraRoot_C*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E97[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameOverCameraTopViewRoot_C*        CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E98[0x6];                                     // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x00B0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E99[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E9A[0x8];                                     // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventCameraRoot_C*                  CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E9B[0xF];                                     // 0x0111(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_3;              // 0x0120(0x0030)(IsPlainOldData, NoDestructor)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0160(0x0010)(ZeroConstructor, NoDestructor)
	class ARSLevelSequenceActor*                  CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E9C[0x3];                                     // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x017C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CancelSequencerMarkPause_Successsed;      // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E9D[0x3];                                     // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_1;          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_2;          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent) == 0x000010, "Wrong alignment on BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent");
static_assert(sizeof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent) == 0x0001A0, "Wrong size on BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, EntryPoint) == 0x000000, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000040, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000048, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, CallFunc_FinishSpawningActor_ReturnValue) == 0x000050, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, CallFunc_MakeLiteralByte_ReturnValue) == 0x000058, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, CallFunc_MakeTransform_ReturnValue_1) == 0x000060, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000090, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000098, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, Temp_bool_IsClosed_Variable) == 0x0000A0, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x0000A1, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, CallFunc_GetOwner_ReturnValue_1) == 0x0000A8, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, K2Node_MakeArray_Array) == 0x0000B0, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, K2Node_Event_EndPlayReason) == 0x0000C0, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, K2Node_Event_DeltaSeconds) == 0x0000C4, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, CallFunc_MakeTransform_ReturnValue_2) == 0x0000D0, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000100, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000108, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000110, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, CallFunc_MakeTransform_ReturnValue_3) == 0x000120, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::CallFunc_MakeTransform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, CallFunc_GetSequencePlayer_ReturnValue) == 0x000150, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3) == 0x000158, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000160, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, CallFunc_FinishSpawningActor_ReturnValue_3) == 0x000170, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::CallFunc_FinishSpawningActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, Temp_bool_Has_Been_Initd_Variable) == 0x000178, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x00017C, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, CallFunc_CancelSequencerMarkPause_Successsed) == 0x00018C, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::CallFunc_CancelSequencerMarkPause_Successsed' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, CallFunc_GetSequencePlayer_ReturnValue_1) == 0x000190, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::CallFunc_GetSequencePlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent, CallFunc_GetSequencePlayer_ReturnValue_2) == 0x000198, "Member 'BP_GameOverSystemComponent_C_ExecuteUbergraph_BP_GameOverSystemComponent::CallFunc_GetSequencePlayer_ReturnValue_2' has a wrong offset!");

// Function BP_GameOverSystemComponent.BP_GameOverSystemComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_GameOverSystemComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameOverSystemComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_GameOverSystemComponent_C_ReceiveTick");
static_assert(sizeof(BP_GameOverSystemComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_GameOverSystemComponent_C_ReceiveTick");
static_assert(offsetof(BP_GameOverSystemComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_GameOverSystemComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_GameOverSystemComponent.BP_GameOverSystemComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_GameOverSystemComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameOverSystemComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_GameOverSystemComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_GameOverSystemComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_GameOverSystemComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_GameOverSystemComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_GameOverSystemComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_GameOverSystemComponent.BP_GameOverSystemComponent_C.PrivateFinishGameOver
// 0x0240 (0x0240 - 0x0000)
struct BP_GameOverSystemComponent_C_PrivateFinishGameOver final
{
public:
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleSimulatorManager*                CallFunc_GetBattleSimulatorManager_BattleSimulatorManager; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PostProcessManager_C*               CallFunc_GetPostProcessManager_Manager;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E9E[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetVisionFogRate_Rate;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E9F[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EA0[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame_1;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EA1[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_PlayerCameraReset_self_CastInput;         // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayerCameraReset_Dummy;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EA2[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_PrivateCalcRecoverFinishTransform_FinishTransform; // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_PrivateCalcRecoverFinishTransform_FinishTransform_1; // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x00C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EA3[0x3];                                     // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult_1;    // 0x014C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue_1;       // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RevivePlayer_bSuccess;                    // 0x01D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EA4[0x1];                                     // 0x01D7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IEventInterface>       CallFunc_BattleSequencerEnd_self_CastInput;        // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BattleSequencerEnd_ReturnValue;           // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EA5[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ARSCharacterBase*>               CallFunc_GetPlayerList_ReturnValue;                // 0x01F8(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EA6[0x3];                                     // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInvalidDamage_Dummy;                   // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x021A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EA7[0x1];                                     // 0x021B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EA8[0x3];                                     // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IEventInterface>       CallFunc_BattleSequencerEnd_self_CastInput_1;      // 0x0228(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BattleSequencerEnd_ReturnValue_1;         // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GameOverSystemComponent_C_PrivateFinishGameOver) == 0x000010, "Wrong alignment on BP_GameOverSystemComponent_C_PrivateFinishGameOver");
static_assert(sizeof(BP_GameOverSystemComponent_C_PrivateFinishGameOver) == 0x000240, "Wrong size on BP_GameOverSystemComponent_C_PrivateFinishGameOver");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, Temp_int_Loop_Num_Variable) == 0x000000, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_GetBattleSimulatorManager_BattleSimulatorManager) == 0x000008, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_GetBattleSimulatorManager_BattleSimulatorManager' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_GetPostProcessManager_Manager) == 0x000010, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_GetPostProcessManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_GetVisionFogRate_Rate) == 0x00001C, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_GetVisionFogRate_Rate' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000028, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_GetHUDMainGame_HUDMainGame_1) == 0x000038, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_GetHUDMainGame_HUDMainGame_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_IsValid_ReturnValue_2) == 0x000040, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_PlayerCameraReset_self_CastInput) == 0x000048, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_PlayerCameraReset_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_PlayerCameraReset_Dummy) == 0x000058, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_PlayerCameraReset_Dummy' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_PrivateCalcRecoverFinishTransform_FinishTransform) == 0x000060, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_PrivateCalcRecoverFinishTransform_FinishTransform' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_PrivateCalcRecoverFinishTransform_FinishTransform_1) == 0x000090, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_PrivateCalcRecoverFinishTransform_FinishTransform_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x0000C0, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000148, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_K2_SetActorTransform_SweepHitResult_1) == 0x00014C, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_K2_SetActorTransform_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_K2_SetActorTransform_ReturnValue_1) == 0x0001D4, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_K2_SetActorTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_IsValid_ReturnValue_3) == 0x0001D5, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_RevivePlayer_bSuccess) == 0x0001D6, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_RevivePlayer_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_BattleSequencerEnd_self_CastInput) == 0x0001D8, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_BattleSequencerEnd_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_BattleSequencerEnd_ReturnValue) == 0x0001E8, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_BattleSequencerEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_GetPlayerManager_PlayerManager) == 0x0001F0, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_GetPlayerList_ReturnValue) == 0x0001F8, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_GetPlayerList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, Temp_int_Loop_Counter_Variable) == 0x000208, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_IsValid_ReturnValue_4) == 0x00020C, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, K2Node_DynamicCast_AsRSBattle_Player) == 0x000210, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, K2Node_DynamicCast_bSuccess) == 0x000218, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_SetInvalidDamage_Dummy) == 0x000219, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_SetInvalidDamage_Dummy' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_Less_IntInt_ReturnValue) == 0x00021A, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_Add_IntInt_ReturnValue) == 0x00021C, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_Array_Length_ReturnValue) == 0x000220, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_IsValid_ReturnValue_5) == 0x000224, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_BattleSequencerEnd_self_CastInput_1) == 0x000228, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_BattleSequencerEnd_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateFinishGameOver, CallFunc_BattleSequencerEnd_ReturnValue_1) == 0x000238, "Member 'BP_GameOverSystemComponent_C_PrivateFinishGameOver::CallFunc_BattleSequencerEnd_ReturnValue_1' has a wrong offset!");

// Function BP_GameOverSystemComponent.BP_GameOverSystemComponent_C.EventStartUIGameOver
// 0x0028 (0x0028 - 0x0000)
struct BP_GameOverSystemComponent_C_EventStartUIGameOver final
{
public:
	class AIntroTutorialManager*                  CallFunc_GetIntroTutorialManager_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CloseTutoTips_ReturnValue;                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CloseTutoOperation_ReturnValue;           // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EA9[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_IntroTutorialManager_C*             K2Node_DynamicCast_AsBP_Intro_Tutorial_Manager;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EndIntroTutorial_ReturnValue;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GameOverSystemComponent_C_EventStartUIGameOver) == 0x000008, "Wrong alignment on BP_GameOverSystemComponent_C_EventStartUIGameOver");
static_assert(sizeof(BP_GameOverSystemComponent_C_EventStartUIGameOver) == 0x000028, "Wrong size on BP_GameOverSystemComponent_C_EventStartUIGameOver");
static_assert(offsetof(BP_GameOverSystemComponent_C_EventStartUIGameOver, CallFunc_GetIntroTutorialManager_ReturnValue) == 0x000000, "Member 'BP_GameOverSystemComponent_C_EventStartUIGameOver::CallFunc_GetIntroTutorialManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_EventStartUIGameOver, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000008, "Member 'BP_GameOverSystemComponent_C_EventStartUIGameOver::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_EventStartUIGameOver, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_GameOverSystemComponent_C_EventStartUIGameOver::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_EventStartUIGameOver, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'BP_GameOverSystemComponent_C_EventStartUIGameOver::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_EventStartUIGameOver, CallFunc_CloseTutoTips_ReturnValue) == 0x000012, "Member 'BP_GameOverSystemComponent_C_EventStartUIGameOver::CallFunc_CloseTutoTips_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_EventStartUIGameOver, CallFunc_CloseTutoOperation_ReturnValue) == 0x000013, "Member 'BP_GameOverSystemComponent_C_EventStartUIGameOver::CallFunc_CloseTutoOperation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_EventStartUIGameOver, K2Node_DynamicCast_AsBP_Intro_Tutorial_Manager) == 0x000018, "Member 'BP_GameOverSystemComponent_C_EventStartUIGameOver::K2Node_DynamicCast_AsBP_Intro_Tutorial_Manager' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_EventStartUIGameOver, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_GameOverSystemComponent_C_EventStartUIGameOver::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_EventStartUIGameOver, CallFunc_EndIntroTutorial_ReturnValue) == 0x000021, "Member 'BP_GameOverSystemComponent_C_EventStartUIGameOver::CallFunc_EndIntroTutorial_ReturnValue' has a wrong offset!");

// Function BP_GameOverSystemComponent.BP_GameOverSystemComponent_C.EventBrainTalkDeadBlur
// 0x0018 (0x0018 - 0x0000)
struct BP_GameOverSystemComponent_C_EventBrainTalkDeadBlur final
{
public:
	class ABrainTalkManager*                      BrainTalkManager;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GameOverSystemComponent_C_EventBrainTalkDeadBlur) == 0x000008, "Wrong alignment on BP_GameOverSystemComponent_C_EventBrainTalkDeadBlur");
static_assert(sizeof(BP_GameOverSystemComponent_C_EventBrainTalkDeadBlur) == 0x000018, "Wrong size on BP_GameOverSystemComponent_C_EventBrainTalkDeadBlur");
static_assert(offsetof(BP_GameOverSystemComponent_C_EventBrainTalkDeadBlur, BrainTalkManager) == 0x000000, "Member 'BP_GameOverSystemComponent_C_EventBrainTalkDeadBlur::BrainTalkManager' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_EventBrainTalkDeadBlur, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000008, "Member 'BP_GameOverSystemComponent_C_EventBrainTalkDeadBlur::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_EventBrainTalkDeadBlur, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_GameOverSystemComponent_C_EventBrainTalkDeadBlur::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_GameOverSystemComponent.BP_GameOverSystemComponent_C.EventBrainTalkDead
// 0x0018 (0x0018 - 0x0000)
struct BP_GameOverSystemComponent_C_EventBrainTalkDead final
{
public:
	int32                                         Type;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EAA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABrainTalkManager*                      CallFunc_GetBrainTalkManager_BrainTalkManager;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BrainTalkBt_PLDead_ReturnValue;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GameOverSystemComponent_C_EventBrainTalkDead) == 0x000008, "Wrong alignment on BP_GameOverSystemComponent_C_EventBrainTalkDead");
static_assert(sizeof(BP_GameOverSystemComponent_C_EventBrainTalkDead) == 0x000018, "Wrong size on BP_GameOverSystemComponent_C_EventBrainTalkDead");
static_assert(offsetof(BP_GameOverSystemComponent_C_EventBrainTalkDead, Type) == 0x000000, "Member 'BP_GameOverSystemComponent_C_EventBrainTalkDead::Type' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_EventBrainTalkDead, CallFunc_GetBrainTalkManager_BrainTalkManager) == 0x000008, "Member 'BP_GameOverSystemComponent_C_EventBrainTalkDead::CallFunc_GetBrainTalkManager_BrainTalkManager' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_EventBrainTalkDead, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_GameOverSystemComponent_C_EventBrainTalkDead::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_EventBrainTalkDead, CallFunc_BrainTalkBt_PLDead_ReturnValue) == 0x000011, "Member 'BP_GameOverSystemComponent_C_EventBrainTalkDead::CallFunc_BrainTalkBt_PLDead_ReturnValue' has a wrong offset!");

// Function BP_GameOverSystemComponent.BP_GameOverSystemComponent_C.PrivateSetupPostProcess
// 0x0030 (0x0030 - 0x0000)
struct BP_GameOverSystemComponent_C_PrivateSetupPostProcess final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EAB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PostProcessManager_C*               CallFunc_GetPostProcessManager_Manager;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EAC[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPostProcessComponent*                  CallFunc_GetPerformPostProcess_PostProcess;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GameOverSystemComponent_C_PrivateSetupPostProcess) == 0x000008, "Wrong alignment on BP_GameOverSystemComponent_C_PrivateSetupPostProcess");
static_assert(sizeof(BP_GameOverSystemComponent_C_PrivateSetupPostProcess) == 0x000030, "Wrong size on BP_GameOverSystemComponent_C_PrivateSetupPostProcess");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateSetupPostProcess, Rate) == 0x000000, "Member 'BP_GameOverSystemComponent_C_PrivateSetupPostProcess::Rate' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateSetupPostProcess, CallFunc_GetPostProcessManager_Manager) == 0x000008, "Member 'BP_GameOverSystemComponent_C_PrivateSetupPostProcess::CallFunc_GetPostProcessManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateSetupPostProcess, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_GameOverSystemComponent_C_PrivateSetupPostProcess::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateSetupPostProcess, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'BP_GameOverSystemComponent_C_PrivateSetupPostProcess::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateSetupPostProcess, CallFunc_GetPerformPostProcess_PostProcess) == 0x000018, "Member 'BP_GameOverSystemComponent_C_PrivateSetupPostProcess::CallFunc_GetPerformPostProcess_PostProcess' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateSetupPostProcess, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000020, "Member 'BP_GameOverSystemComponent_C_PrivateSetupPostProcess::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");

// Function BP_GameOverSystemComponent.BP_GameOverSystemComponent_C.EventBrainFieldOut
// 0x0008 (0x0008 - 0x0000)
struct BP_GameOverSystemComponent_C_EventBrainFieldOut final
{
public:
	class ABP_BrainFieldManager_C*                BrainFieldManager;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameOverSystemComponent_C_EventBrainFieldOut) == 0x000008, "Wrong alignment on BP_GameOverSystemComponent_C_EventBrainFieldOut");
static_assert(sizeof(BP_GameOverSystemComponent_C_EventBrainFieldOut) == 0x000008, "Wrong size on BP_GameOverSystemComponent_C_EventBrainFieldOut");
static_assert(offsetof(BP_GameOverSystemComponent_C_EventBrainFieldOut, BrainFieldManager) == 0x000000, "Member 'BP_GameOverSystemComponent_C_EventBrainFieldOut::BrainFieldManager' has a wrong offset!");

// Function BP_GameOverSystemComponent.BP_GameOverSystemComponent_C.EventRecoverEffectPlayer
// 0x0010 (0x0010 - 0x0000)
struct BP_GameOverSystemComponent_C_EventRecoverEffectPlayer final
{
public:
	class ARSBattlePlayer_C*                      MainPlayer;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerManager_C*                    PlayerManager;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameOverSystemComponent_C_EventRecoverEffectPlayer) == 0x000008, "Wrong alignment on BP_GameOverSystemComponent_C_EventRecoverEffectPlayer");
static_assert(sizeof(BP_GameOverSystemComponent_C_EventRecoverEffectPlayer) == 0x000010, "Wrong size on BP_GameOverSystemComponent_C_EventRecoverEffectPlayer");
static_assert(offsetof(BP_GameOverSystemComponent_C_EventRecoverEffectPlayer, MainPlayer) == 0x000000, "Member 'BP_GameOverSystemComponent_C_EventRecoverEffectPlayer::MainPlayer' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_EventRecoverEffectPlayer, PlayerManager) == 0x000008, "Member 'BP_GameOverSystemComponent_C_EventRecoverEffectPlayer::PlayerManager' has a wrong offset!");

// Function BP_GameOverSystemComponent.BP_GameOverSystemComponent_C.IsPlayingDeadGameOver
// 0x0001 (0x0001 - 0x0000)
struct BP_GameOverSystemComponent_C_IsPlayingDeadGameOver final
{
public:
	bool                                          IsPlaying;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GameOverSystemComponent_C_IsPlayingDeadGameOver) == 0x000001, "Wrong alignment on BP_GameOverSystemComponent_C_IsPlayingDeadGameOver");
static_assert(sizeof(BP_GameOverSystemComponent_C_IsPlayingDeadGameOver) == 0x000001, "Wrong size on BP_GameOverSystemComponent_C_IsPlayingDeadGameOver");
static_assert(offsetof(BP_GameOverSystemComponent_C_IsPlayingDeadGameOver, IsPlaying) == 0x000000, "Member 'BP_GameOverSystemComponent_C_IsPlayingDeadGameOver::IsPlaying' has a wrong offset!");

// Function BP_GameOverSystemComponent.BP_GameOverSystemComponent_C.PrivateLoadAsset
// 0x0020 (0x0020 - 0x0000)
struct BP_GameOverSystemComponent_C_PrivateLoadAsset final
{
public:
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EAD[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GameOverSystemComponent_C_PrivateLoadAsset) == 0x000008, "Wrong alignment on BP_GameOverSystemComponent_C_PrivateLoadAsset");
static_assert(sizeof(BP_GameOverSystemComponent_C_PrivateLoadAsset) == 0x000020, "Wrong size on BP_GameOverSystemComponent_C_PrivateLoadAsset");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateLoadAsset, CallFunc_LoadSoftObject_ReturnValue) == 0x000000, "Member 'BP_GameOverSystemComponent_C_PrivateLoadAsset::CallFunc_LoadSoftObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateLoadAsset, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000008, "Member 'BP_GameOverSystemComponent_C_PrivateLoadAsset::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateLoadAsset, K2Node_DynamicCast_AsMaterial_Interface) == 0x000010, "Member 'BP_GameOverSystemComponent_C_PrivateLoadAsset::K2Node_DynamicCast_AsMaterial_Interface' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_PrivateLoadAsset, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_GameOverSystemComponent_C_PrivateLoadAsset::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_GameOverSystemComponent.BP_GameOverSystemComponent_C.StartDeadRecover
// 0x0050 (0x0050 - 0x0000)
struct BP_GameOverSystemComponent_C_StartDeadRecover final
{
public:
	class ARSBattleCharacter_C*                   RecoverCharacter;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EAE[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ARSCharacterBase*>               CallFunc_GetPlayerList_ReturnValue;                // 0x0028(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EAF[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInvalidDamage_Dummy;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GameOverSystemComponent_C_StartDeadRecover) == 0x000008, "Wrong alignment on BP_GameOverSystemComponent_C_StartDeadRecover");
static_assert(sizeof(BP_GameOverSystemComponent_C_StartDeadRecover) == 0x000050, "Wrong size on BP_GameOverSystemComponent_C_StartDeadRecover");
static_assert(offsetof(BP_GameOverSystemComponent_C_StartDeadRecover, RecoverCharacter) == 0x000000, "Member 'BP_GameOverSystemComponent_C_StartDeadRecover::RecoverCharacter' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_StartDeadRecover, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_GameOverSystemComponent_C_StartDeadRecover::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_StartDeadRecover, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_GameOverSystemComponent_C_StartDeadRecover::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_StartDeadRecover, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_GameOverSystemComponent_C_StartDeadRecover::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_StartDeadRecover, Temp_int_Loop_Num_Variable) == 0x000014, "Member 'BP_GameOverSystemComponent_C_StartDeadRecover::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_StartDeadRecover, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'BP_GameOverSystemComponent_C_StartDeadRecover::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_StartDeadRecover, CallFunc_GetPlayerManager_PlayerManager) == 0x000020, "Member 'BP_GameOverSystemComponent_C_StartDeadRecover::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_StartDeadRecover, CallFunc_GetPlayerList_ReturnValue) == 0x000028, "Member 'BP_GameOverSystemComponent_C_StartDeadRecover::CallFunc_GetPlayerList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_StartDeadRecover, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_GameOverSystemComponent_C_StartDeadRecover::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_StartDeadRecover, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'BP_GameOverSystemComponent_C_StartDeadRecover::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_StartDeadRecover, K2Node_DynamicCast_AsRSBattle_Player) == 0x000040, "Member 'BP_GameOverSystemComponent_C_StartDeadRecover::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_StartDeadRecover, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_GameOverSystemComponent_C_StartDeadRecover::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameOverSystemComponent_C_StartDeadRecover, CallFunc_SetInvalidDamage_Dummy) == 0x000049, "Member 'BP_GameOverSystemComponent_C_StartDeadRecover::CallFunc_SetInvalidDamage_Dummy' has a wrong offset!");

// Function BP_GameOverSystemComponent.BP_GameOverSystemComponent_C.PrivateStartSequence
// 0x02A0 (0x02A0 - 0x0000)
struct BP_GameOverSystemComponent_C_PrivateStartSequence final
{
public:
	class ULevelSequence*                         InSequencer;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      Player;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleSimulatorManager*                CallFunc_GetBattleSimulatorManager_BattleSimulatorManager; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
