#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameMainManager

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GameMainManager.BP_GameMainManager_C.ExecuteUbergraph_BP_GameMainManager
// 0x00C8 (0x00C8 - 0x0000)
struct BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C92[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IRSGameInstanceBPInterface_C> K2Node_DynamicCast_AsRSGame_Instance_BPInterface;  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C93[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSGameInstance*                        K2Node_DynamicCast_AsRSGame_Instance;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C94[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameMainManager_C*                  CallFunc_GetGameMainManager_GameMainManager;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadRetryBattleSimulatorDataExec_ReturnValue; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LoadRetryDataExec_ReturnValue;            // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C95[0x5];                                     // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SoundManager_C*                     CallFunc_GetSoundManager_SoundManager;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChangeSoundState_ReturnValue;             // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C96[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EGameOverResult                               K2Node_Event_resultType;                           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C97[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C98[0x2];                                     // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SoundManager_C*                     CallFunc_GetSoundManager_SoundManager_1;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChangeSoundState_ReturnValue_1;           // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C99[0x6];                                     // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserParamManager*                      CallFunc_GetUserParamManager_UserParamManager;     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleSimulatorManager*                CallFunc_GetBattleSimulatorManager_BattleSimulatorManager; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSelectedMapUsableItem_ReturnValue;     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMissionActive_ReturnValue;              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C9A[0x5];                                     // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleSimulatorManager*                CallFunc_GetBattleSimulatorManager_BattleSimulatorManager_1; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMissionActive_ReturnValue_1;            // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameOverResult                               CallFunc_GetGameOverResult_Result;                 // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEndGameOver_IsEnd;                      // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager) == 0x000008, "Wrong alignment on BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager");
static_assert(sizeof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager) == 0x0000C8, "Wrong size on BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, EntryPoint) == 0x000000, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000008, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, K2Node_DynamicCast_AsRSGame_Instance_BPInterface) == 0x000018, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::K2Node_DynamicCast_AsRSGame_Instance_BPInterface' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_GetGameInstance_ReturnValue_1) == 0x000030, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, K2Node_DynamicCast_AsRSGame_Instance) == 0x000038, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::K2Node_DynamicCast_AsRSGame_Instance' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_GetGameMainManager_GameMainManager) == 0x000048, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_GetGameMainManager_GameMainManager' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_LoadRetryBattleSimulatorDataExec_ReturnValue) == 0x000050, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_LoadRetryBattleSimulatorDataExec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_LoadRetryDataExec_ReturnValue) == 0x000051, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_LoadRetryDataExec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_IsValid_ReturnValue) == 0x000052, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_GetSoundManager_SoundManager) == 0x000058, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_GetSoundManager_SoundManager' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_ChangeSoundState_ReturnValue) == 0x000061, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_ChangeSoundState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000068, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, K2Node_Event_resultType) == 0x000078, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::K2Node_Event_resultType' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_Conv_StringToName_ReturnValue) == 0x00007C, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, K2Node_SwitchEnum_CmpSuccess) == 0x000084, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, K2Node_SwitchEnum_CmpSuccess_1) == 0x000085, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_GetSoundManager_SoundManager_1) == 0x000088, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_GetSoundManager_SoundManager_1' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_IsValid_ReturnValue_2) == 0x000090, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_ChangeSoundState_ReturnValue_1) == 0x000091, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_ChangeSoundState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_GetUserParamManager_UserParamManager) == 0x000098, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_GetUserParamManager_UserParamManager' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_GetBattleSimulatorManager_BattleSimulatorManager) == 0x0000A0, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_GetBattleSimulatorManager_BattleSimulatorManager' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_GetSelectedMapUsableItem_ReturnValue) == 0x0000A8, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_GetSelectedMapUsableItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_IsMissionActive_ReturnValue) == 0x0000B0, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_IsMissionActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_IsValid_ReturnValue_3) == 0x0000B1, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_IsValid_ReturnValue_4) == 0x0000B2, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_GetBattleSimulatorManager_BattleSimulatorManager_1) == 0x0000B8, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_GetBattleSimulatorManager_BattleSimulatorManager_1' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_IsValid_ReturnValue_5) == 0x0000C0, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_IsMissionActive_ReturnValue_1) == 0x0000C1, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_IsMissionActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_GetGameOverResult_Result) == 0x0000C2, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_GetGameOverResult_Result' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_IsEndGameOver_IsEnd) == 0x0000C3, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_IsEndGameOver_IsEnd' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager, CallFunc_Not_PreBool_ReturnValue) == 0x0000C4, "Member 'BP_GameMainManager_C_ExecuteUbergraph_BP_GameMainManager::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_GameMainManager.BP_GameMainManager_C.StartGameoverFlow
// 0x0001 (0x0001 - 0x0000)
struct BP_GameMainManager_C_StartGameoverFlow final
{
public:
	EGameOverResult                               ResultType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMainManager_C_StartGameoverFlow) == 0x000001, "Wrong alignment on BP_GameMainManager_C_StartGameoverFlow");
static_assert(sizeof(BP_GameMainManager_C_StartGameoverFlow) == 0x000001, "Wrong size on BP_GameMainManager_C_StartGameoverFlow");
static_assert(offsetof(BP_GameMainManager_C_StartGameoverFlow, ResultType) == 0x000000, "Member 'BP_GameMainManager_C_StartGameoverFlow::ResultType' has a wrong offset!");

// Function BP_GameMainManager.BP_GameMainManager_C.CaptureScreen
// 0x00D0 (0x00D0 - 0x0000)
struct BP_GameMainManager_C_CaptureScreen final
{
public:
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFOVAngle_ReturnValue;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C9B[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0040(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_GameMainManager_C_CaptureScreen) == 0x000010, "Wrong alignment on BP_GameMainManager_C_CaptureScreen");
static_assert(sizeof(BP_GameMainManager_C_CaptureScreen) == 0x0000D0, "Wrong size on BP_GameMainManager_C_CaptureScreen");
static_assert(offsetof(BP_GameMainManager_C_CaptureScreen, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000000, "Member 'BP_GameMainManager_C_CaptureScreen::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_CaptureScreen, CallFunc_GetFOVAngle_ReturnValue) == 0x000008, "Member 'BP_GameMainManager_C_CaptureScreen::CallFunc_GetFOVAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_CaptureScreen, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'BP_GameMainManager_C_CaptureScreen::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_CaptureScreen, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000040, "Member 'BP_GameMainManager_C_CaptureScreen::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");

// Function BP_GameMainManager.BP_GameMainManager_C.GetSaveDataCapture
// 0x0008 (0x0008 - 0x0000)
struct BP_GameMainManager_C_GetSaveDataCapture final
{
public:
	class UTextureRenderTarget2D*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMainManager_C_GetSaveDataCapture) == 0x000008, "Wrong alignment on BP_GameMainManager_C_GetSaveDataCapture");
static_assert(sizeof(BP_GameMainManager_C_GetSaveDataCapture) == 0x000008, "Wrong size on BP_GameMainManager_C_GetSaveDataCapture");
static_assert(offsetof(BP_GameMainManager_C_GetSaveDataCapture, ReturnValue) == 0x000000, "Member 'BP_GameMainManager_C_GetSaveDataCapture::ReturnValue' has a wrong offset!");

// Function BP_GameMainManager.BP_GameMainManager_C.DoSaveDataCapture
// 0x0030 (0x0030 - 0x0000)
struct BP_GameMainManager_C_DoSaveDataCapture final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C9C[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameMainManager_C*                  K2Node_DynamicCast_AsBP_Game_Main_Manager;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C9D[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_GetSaveDataCapture_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_ConvertTextureRenderTarget2DtoTexture2D_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GameMainManager_C_DoSaveDataCapture) == 0x000008, "Wrong alignment on BP_GameMainManager_C_DoSaveDataCapture");
static_assert(sizeof(BP_GameMainManager_C_DoSaveDataCapture) == 0x000030, "Wrong size on BP_GameMainManager_C_DoSaveDataCapture");
static_assert(offsetof(BP_GameMainManager_C_DoSaveDataCapture, ReturnValue) == 0x000000, "Member 'BP_GameMainManager_C_DoSaveDataCapture::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_DoSaveDataCapture, K2Node_DynamicCast_AsBP_Game_Main_Manager) == 0x000008, "Member 'BP_GameMainManager_C_DoSaveDataCapture::K2Node_DynamicCast_AsBP_Game_Main_Manager' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_DoSaveDataCapture, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_GameMainManager_C_DoSaveDataCapture::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_DoSaveDataCapture, CallFunc_GetSaveDataCapture_ReturnValue) == 0x000018, "Member 'BP_GameMainManager_C_DoSaveDataCapture::CallFunc_GetSaveDataCapture_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_DoSaveDataCapture, CallFunc_ConvertTextureRenderTarget2DtoTexture2D_ReturnValue) == 0x000020, "Member 'BP_GameMainManager_C_DoSaveDataCapture::CallFunc_ConvertTextureRenderTarget2DtoTexture2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMainManager_C_DoSaveDataCapture, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_GameMainManager_C_DoSaveDataCapture::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

