#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameOverCameraTopViewRoot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_GameOverCameraTopViewRoot.BP_GameOverCameraTopViewRoot_C.ExecuteUbergraph_BP_GameOverCameraTopViewRoot
// 0x008C (0x008C - 0x0000)
struct BP_GameOverCameraTopViewRoot_C_ExecuteUbergraph_BP_GameOverCameraTopViewRoot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorRelativeLocation_SweepHitResult; // 0x0004(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_GameOverCameraTopViewRoot_C_ExecuteUbergraph_BP_GameOverCameraTopViewRoot) == 0x000004, "Wrong alignment on BP_GameOverCameraTopViewRoot_C_ExecuteUbergraph_BP_GameOverCameraTopViewRoot");
static_assert(sizeof(BP_GameOverCameraTopViewRoot_C_ExecuteUbergraph_BP_GameOverCameraTopViewRoot) == 0x00008C, "Wrong size on BP_GameOverCameraTopViewRoot_C_ExecuteUbergraph_BP_GameOverCameraTopViewRoot");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_ExecuteUbergraph_BP_GameOverCameraTopViewRoot, EntryPoint) == 0x000000, "Member 'BP_GameOverCameraTopViewRoot_C_ExecuteUbergraph_BP_GameOverCameraTopViewRoot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_ExecuteUbergraph_BP_GameOverCameraTopViewRoot, CallFunc_K2_SetActorRelativeLocation_SweepHitResult) == 0x000004, "Member 'BP_GameOverCameraTopViewRoot_C_ExecuteUbergraph_BP_GameOverCameraTopViewRoot::CallFunc_K2_SetActorRelativeLocation_SweepHitResult' has a wrong offset!");

// Function BP_GameOverCameraTopViewRoot.BP_GameOverCameraTopViewRoot_C.SetupCollision
// 0x02F0 (0x02F0 - 0x0000)
struct BP_GameOverCameraTopViewRoot_C_SetupCollision final
{
public:
	class ARSBattlePlayer_C*                      Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HitCount;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitMinHeight;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitHeight;                                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TraceIndex;                                        // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BaseHeight;                                        // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EndOffset;                                         // 0x001C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartOffset;                                       // 0x0028(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E22[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        CheckLocations;                                    // 0x0038(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorRelativeLocation_SweepHitResult; // 0x0088(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E23[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E24[0x3];                                     // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_2;                          // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E25[0x3];                                     // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E26[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0168(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x0178(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E27[0x3];                                     // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x01CC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E28[0x3];                                     // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x025D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E29[0x2];                                     // 0x025E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0274(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E2A[0x3];                                     // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMin_ReturnValue;                         // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameOverCameraTopViewRoot_C_SetupCollision) == 0x000008, "Wrong alignment on BP_GameOverCameraTopViewRoot_C_SetupCollision");
static_assert(sizeof(BP_GameOverCameraTopViewRoot_C_SetupCollision) == 0x0002F0, "Wrong size on BP_GameOverCameraTopViewRoot_C_SetupCollision");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, Player) == 0x000000, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::Player' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, HitCount) == 0x000008, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::HitCount' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, HitMinHeight) == 0x00000C, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::HitMinHeight' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, HitHeight) == 0x000010, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::HitHeight' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, TraceIndex) == 0x000014, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::TraceIndex' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, BaseHeight) == 0x000018, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::BaseHeight' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, EndOffset) == 0x00001C, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::EndOffset' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, StartOffset) == 0x000028, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::StartOffset' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CheckLocations) == 0x000038, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CheckLocations' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00004C, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakVector_X) == 0x00005C, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakVector_Y) == 0x000060, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakVector_Z) == 0x000064, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, Temp_int_Array_Index_Variable) == 0x000068, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, Temp_int_Loop_Num_Variable) == 0x00006C, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, Temp_int_Array_Index_Variable_1) == 0x000070, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000074, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_MakeVector_ReturnValue) == 0x000078, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, Temp_int_Loop_Num_Variable_1) == 0x000084, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_K2_SetActorRelativeLocation_SweepHitResult) == 0x000088, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_K2_SetActorRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_Less_IntInt_ReturnValue) == 0x000110, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_Array_Length_ReturnValue) == 0x000114, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_Array_Length_ReturnValue_1) == 0x000118, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, Temp_int_Variable) == 0x00011C, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_Add_IntInt_ReturnValue_1) == 0x000120, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_Array_Length_ReturnValue_2) == 0x000124, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_GetSocketLocation_ReturnValue) == 0x000128, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakVector_X_1) == 0x000134, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakVector_Y_1) == 0x000138, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakVector_Z_1) == 0x00013C, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_MakeVector_ReturnValue_1) == 0x000140, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00014C, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakVector_X_2) == 0x000150, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakVector_Y_2) == 0x000154, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakVector_Z_2) == 0x000158, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00015C, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_Add_IntInt_ReturnValue_2) == 0x000160, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, K2Node_MakeArray_Array) == 0x000168, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, K2Node_MakeArray_Array_1) == 0x000178, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, Temp_int_Loop_Counter_Variable_1) == 0x000188, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_MakeVector_ReturnValue_2) == 0x00018C, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_Less_IntInt_ReturnValue_1) == 0x000198, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_Add_IntInt_ReturnValue_3) == 0x00019C, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0001A0, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001A4, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_Add_VectorVector_ReturnValue) == 0x0001A8, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_MakeVector_ReturnValue_3) == 0x0001B4, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0001C0, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0001CC, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000254, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_Array_Length_ReturnValue_3) == 0x000258, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakHitResult_bBlockingHit) == 0x00025C, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakHitResult_bInitialOverlap) == 0x00025D, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakHitResult_Time) == 0x000260, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakHitResult_Distance) == 0x000264, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakHitResult_Location) == 0x000268, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakHitResult_ImpactPoint) == 0x000274, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakHitResult_Normal) == 0x000280, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakHitResult_ImpactNormal) == 0x00028C, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakHitResult_PhysMat) == 0x000298, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakHitResult_HitActor) == 0x0002A0, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakHitResult_HitComponent) == 0x0002A8, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakHitResult_HitBoneName) == 0x0002B0, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakHitResult_HitItem) == 0x0002B8, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakHitResult_FaceIndex) == 0x0002BC, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakHitResult_TraceStart) == 0x0002C0, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakHitResult_TraceEnd) == 0x0002CC, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakVector_X_3) == 0x0002D8, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakVector_Y_3) == 0x0002DC, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_BreakVector_Z_3) == 0x0002E0, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x0002E4, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_IsValid_ReturnValue) == 0x0002E8, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_SetupCollision, CallFunc_FMin_ReturnValue) == 0x0002EC, "Member 'BP_GameOverCameraTopViewRoot_C_SetupCollision::CallFunc_FMin_ReturnValue' has a wrong offset!");

// Function BP_GameOverCameraTopViewRoot.BP_GameOverCameraTopViewRoot_C.Reset
// 0x0088 (0x0088 - 0x0000)
struct BP_GameOverCameraTopViewRoot_C_Reset final
{
public:
	struct FHitResult                             CallFunc_K2_SetActorRelativeLocation_SweepHitResult; // 0x0000(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_GameOverCameraTopViewRoot_C_Reset) == 0x000004, "Wrong alignment on BP_GameOverCameraTopViewRoot_C_Reset");
static_assert(sizeof(BP_GameOverCameraTopViewRoot_C_Reset) == 0x000088, "Wrong size on BP_GameOverCameraTopViewRoot_C_Reset");
static_assert(offsetof(BP_GameOverCameraTopViewRoot_C_Reset, CallFunc_K2_SetActorRelativeLocation_SweepHitResult) == 0x000000, "Member 'BP_GameOverCameraTopViewRoot_C_Reset::CallFunc_K2_SetActorRelativeLocation_SweepHitResult' has a wrong offset!");

}

