#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameOverCameraTopViewRoot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GameOverCameraTopViewRoot.BP_GameOverCameraTopViewRoot_C
// 0x0038 (0x0268 - 0x0230)
class ABP_GameOverCameraTopViewRoot_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         CameraMinLength;                                   // 0x0240(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         CameraLength;                                      // 0x0244(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         CameraAnimationLength;                             // 0x0248(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E21[0x4];                                     // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CollCheckSockets;                                  // 0x0250(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         AdjustHitNum;                                      // 0x0260(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_GameOverCameraTopViewRoot(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SetupCollision(class ARSBattlePlayer_C* Player);
	void Reset();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GameOverCameraTopViewRoot_C">();
	}
	static class ABP_GameOverCameraTopViewRoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GameOverCameraTopViewRoot_C>();
	}
};
static_assert(alignof(ABP_GameOverCameraTopViewRoot_C) == 0x000008, "Wrong alignment on ABP_GameOverCameraTopViewRoot_C");
static_assert(sizeof(ABP_GameOverCameraTopViewRoot_C) == 0x000268, "Wrong size on ABP_GameOverCameraTopViewRoot_C");
static_assert(offsetof(ABP_GameOverCameraTopViewRoot_C, UberGraphFrame) == 0x000230, "Member 'ABP_GameOverCameraTopViewRoot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GameOverCameraTopViewRoot_C, DefaultSceneRoot) == 0x000238, "Member 'ABP_GameOverCameraTopViewRoot_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_GameOverCameraTopViewRoot_C, CameraMinLength) == 0x000240, "Member 'ABP_GameOverCameraTopViewRoot_C::CameraMinLength' has a wrong offset!");
static_assert(offsetof(ABP_GameOverCameraTopViewRoot_C, CameraLength) == 0x000244, "Member 'ABP_GameOverCameraTopViewRoot_C::CameraLength' has a wrong offset!");
static_assert(offsetof(ABP_GameOverCameraTopViewRoot_C, CameraAnimationLength) == 0x000248, "Member 'ABP_GameOverCameraTopViewRoot_C::CameraAnimationLength' has a wrong offset!");
static_assert(offsetof(ABP_GameOverCameraTopViewRoot_C, CollCheckSockets) == 0x000250, "Member 'ABP_GameOverCameraTopViewRoot_C::CollCheckSockets' has a wrong offset!");
static_assert(offsetof(ABP_GameOverCameraTopViewRoot_C, AdjustHitNum) == 0x000260, "Member 'ABP_GameOverCameraTopViewRoot_C::AdjustHitNum' has a wrong offset!");

}

