#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LevelCommandComponent

#include "Basic.hpp"

#include "S_AreaInfo_structs.hpp"
#include "S_LevelManagerCommand_structs.hpp"
#include "E_LevelLoadStatus_structs.hpp"
#include "Engine_structs.hpp"
#include "S_LoadedLevelInfo_structs.hpp"


namespace SDK::Params
{

// Function BP_LevelCommandComponent.BP_LevelCommandComponent_C.ExecuteUbergraph_BP_LevelCommandComponent
// 0x0020 (0x0020 - 0x0000)
struct BP_LevelCommandComponent_C_ExecuteUbergraph_BP_LevelCommandComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_70D7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LevelManager_C*                     K2Node_DynamicCast_AsBP_Level_Manager;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LevelCommandComponent_C_ExecuteUbergraph_BP_LevelCommandComponent) == 0x000008, "Wrong alignment on BP_LevelCommandComponent_C_ExecuteUbergraph_BP_LevelCommandComponent");
static_assert(sizeof(BP_LevelCommandComponent_C_ExecuteUbergraph_BP_LevelCommandComponent) == 0x000020, "Wrong size on BP_LevelCommandComponent_C_ExecuteUbergraph_BP_LevelCommandComponent");
static_assert(offsetof(BP_LevelCommandComponent_C_ExecuteUbergraph_BP_LevelCommandComponent, EntryPoint) == 0x000000, "Member 'BP_LevelCommandComponent_C_ExecuteUbergraph_BP_LevelCommandComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_ExecuteUbergraph_BP_LevelCommandComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_LevelCommandComponent_C_ExecuteUbergraph_BP_LevelCommandComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_ExecuteUbergraph_BP_LevelCommandComponent, K2Node_DynamicCast_AsBP_Level_Manager) == 0x000010, "Member 'BP_LevelCommandComponent_C_ExecuteUbergraph_BP_LevelCommandComponent::K2Node_DynamicCast_AsBP_Level_Manager' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_ExecuteUbergraph_BP_LevelCommandComponent, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_LevelCommandComponent_C_ExecuteUbergraph_BP_LevelCommandComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_LevelCommandComponent.BP_LevelCommandComponent_C.CommandLoadAreaAsync
// 0x0178 (0x0178 - 0x0000)
struct BP_LevelCommandComponent_C_CommandLoadAreaAsync final
{
public:
	struct FS_LevelManagerCommand                 Command;                                           // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          SkipEventLevel;                                    // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          SkipEnemyLevel;                                    // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_70D8[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0060(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0088(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LDRequestLoadAreaAsync_IsError;           // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetCurrentArea_Result;                    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAreaLevelsLoadedByAreaName_IsLoaded;    // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAreaLevelsLoadedByAreaName_IsError;     // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_70D9[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_AreaInfo                            CallFunc_IsAreaLevelsLoadedByAreaName_Area_Info;   // 0x0108(0x0068)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LevelCommandComponent_C_CommandLoadAreaAsync) == 0x000008, "Wrong alignment on BP_LevelCommandComponent_C_CommandLoadAreaAsync");
static_assert(sizeof(BP_LevelCommandComponent_C_CommandLoadAreaAsync) == 0x000178, "Wrong size on BP_LevelCommandComponent_C_CommandLoadAreaAsync");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandLoadAreaAsync, Command) == 0x000000, "Member 'BP_LevelCommandComponent_C_CommandLoadAreaAsync::Command' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandLoadAreaAsync, SkipEventLevel) == 0x000048, "Member 'BP_LevelCommandComponent_C_CommandLoadAreaAsync::SkipEventLevel' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandLoadAreaAsync, SkipEnemyLevel) == 0x000049, "Member 'BP_LevelCommandComponent_C_CommandLoadAreaAsync::SkipEnemyLevel' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandLoadAreaAsync, CallFunc_Conv_NameToString_ReturnValue) == 0x000050, "Member 'BP_LevelCommandComponent_C_CommandLoadAreaAsync::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandLoadAreaAsync, CallFunc_Conv_NameToText_ReturnValue) == 0x000060, "Member 'BP_LevelCommandComponent_C_CommandLoadAreaAsync::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandLoadAreaAsync, CallFunc_Concat_StrStr_ReturnValue) == 0x000078, "Member 'BP_LevelCommandComponent_C_CommandLoadAreaAsync::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandLoadAreaAsync, K2Node_MakeStruct_FormatArgumentData) == 0x000088, "Member 'BP_LevelCommandComponent_C_CommandLoadAreaAsync::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandLoadAreaAsync, K2Node_MakeArray_Array) == 0x0000C8, "Member 'BP_LevelCommandComponent_C_CommandLoadAreaAsync::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandLoadAreaAsync, CallFunc_Format_ReturnValue) == 0x0000D8, "Member 'BP_LevelCommandComponent_C_CommandLoadAreaAsync::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandLoadAreaAsync, CallFunc_Conv_TextToString_ReturnValue) == 0x0000F0, "Member 'BP_LevelCommandComponent_C_CommandLoadAreaAsync::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandLoadAreaAsync, CallFunc_LDRequestLoadAreaAsync_IsError) == 0x000100, "Member 'BP_LevelCommandComponent_C_CommandLoadAreaAsync::CallFunc_LDRequestLoadAreaAsync_IsError' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandLoadAreaAsync, CallFunc_SetCurrentArea_Result) == 0x000101, "Member 'BP_LevelCommandComponent_C_CommandLoadAreaAsync::CallFunc_SetCurrentArea_Result' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandLoadAreaAsync, CallFunc_IsAreaLevelsLoadedByAreaName_IsLoaded) == 0x000102, "Member 'BP_LevelCommandComponent_C_CommandLoadAreaAsync::CallFunc_IsAreaLevelsLoadedByAreaName_IsLoaded' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandLoadAreaAsync, CallFunc_IsAreaLevelsLoadedByAreaName_IsError) == 0x000103, "Member 'BP_LevelCommandComponent_C_CommandLoadAreaAsync::CallFunc_IsAreaLevelsLoadedByAreaName_IsError' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandLoadAreaAsync, CallFunc_IsAreaLevelsLoadedByAreaName_Area_Info) == 0x000108, "Member 'BP_LevelCommandComponent_C_CommandLoadAreaAsync::CallFunc_IsAreaLevelsLoadedByAreaName_Area_Info' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandLoadAreaAsync, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000170, "Member 'BP_LevelCommandComponent_C_CommandLoadAreaAsync::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function BP_LevelCommandComponent.BP_LevelCommandComponent_C.CommandSetAreaVisible
// 0x00D0 (0x00D0 - 0x0000)
struct BP_LevelCommandComponent_C_CommandSetAreaVisible final
{
public:
	struct FS_LevelManagerCommand                 Command;                                           // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Async;                                             // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LDRequestSetAreaVisible_IsError;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_70DA[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UObject>>         CallFunc_GetAllLevelInArea_Levels;                 // 0x0050(0x0010)(ReferenceParm, HasGetValueTypeHash)
	struct FS_AreaInfo                            CallFunc_GetAllLevelInArea_AreaInfo;               // 0x0060(0x0068)(HasGetValueTypeHash)
	bool                                          CallFunc_GetAllLevelInArea_Error;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LevelCommandComponent_C_CommandSetAreaVisible) == 0x000008, "Wrong alignment on BP_LevelCommandComponent_C_CommandSetAreaVisible");
static_assert(sizeof(BP_LevelCommandComponent_C_CommandSetAreaVisible) == 0x0000D0, "Wrong size on BP_LevelCommandComponent_C_CommandSetAreaVisible");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandSetAreaVisible, Command) == 0x000000, "Member 'BP_LevelCommandComponent_C_CommandSetAreaVisible::Command' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandSetAreaVisible, Async) == 0x000048, "Member 'BP_LevelCommandComponent_C_CommandSetAreaVisible::Async' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandSetAreaVisible, CallFunc_LDRequestSetAreaVisible_IsError) == 0x000049, "Member 'BP_LevelCommandComponent_C_CommandSetAreaVisible::CallFunc_LDRequestSetAreaVisible_IsError' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandSetAreaVisible, CallFunc_GetAllLevelInArea_Levels) == 0x000050, "Member 'BP_LevelCommandComponent_C_CommandSetAreaVisible::CallFunc_GetAllLevelInArea_Levels' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandSetAreaVisible, CallFunc_GetAllLevelInArea_AreaInfo) == 0x000060, "Member 'BP_LevelCommandComponent_C_CommandSetAreaVisible::CallFunc_GetAllLevelInArea_AreaInfo' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandSetAreaVisible, CallFunc_GetAllLevelInArea_Error) == 0x0000C8, "Member 'BP_LevelCommandComponent_C_CommandSetAreaVisible::CallFunc_GetAllLevelInArea_Error' has a wrong offset!");

// Function BP_LevelCommandComponent.BP_LevelCommandComponent_C.FullPathToLevelName
// 0x0048 (0x0048 - 0x0000)
struct BP_LevelCommandComponent_C_FullPathToLevelName final
{
public:
	class FName                                   FullPath;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LevelName;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelCommandComponent_C_FullPathToLevelName) == 0x000008, "Wrong alignment on BP_LevelCommandComponent_C_FullPathToLevelName");
static_assert(sizeof(BP_LevelCommandComponent_C_FullPathToLevelName) == 0x000048, "Wrong size on BP_LevelCommandComponent_C_FullPathToLevelName");
static_assert(offsetof(BP_LevelCommandComponent_C_FullPathToLevelName, FullPath) == 0x000000, "Member 'BP_LevelCommandComponent_C_FullPathToLevelName::FullPath' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_FullPathToLevelName, LevelName) == 0x000008, "Member 'BP_LevelCommandComponent_C_FullPathToLevelName::LevelName' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_FullPathToLevelName, CallFunc_Conv_NameToString_ReturnValue) == 0x000010, "Member 'BP_LevelCommandComponent_C_FullPathToLevelName::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_FullPathToLevelName, CallFunc_Len_ReturnValue) == 0x000020, "Member 'BP_LevelCommandComponent_C_FullPathToLevelName::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_FullPathToLevelName, CallFunc_FindSubstring_ReturnValue) == 0x000024, "Member 'BP_LevelCommandComponent_C_FullPathToLevelName::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_FullPathToLevelName, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'BP_LevelCommandComponent_C_FullPathToLevelName::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_FullPathToLevelName, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BP_LevelCommandComponent_C_FullPathToLevelName::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_FullPathToLevelName, CallFunc_GetSubstring_ReturnValue) == 0x000030, "Member 'BP_LevelCommandComponent_C_FullPathToLevelName::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_FullPathToLevelName, CallFunc_Conv_StringToName_ReturnValue) == 0x000040, "Member 'BP_LevelCommandComponent_C_FullPathToLevelName::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

// Function BP_LevelCommandComponent.BP_LevelCommandComponent_C.__CommandSetAreaOnlyVisible
// 0x0050 (0x0050 - 0x0000)
struct BP_LevelCommandComponent_C___CommandSetAreaOnlyVisible final
{
public:
	struct FS_LevelManagerCommand                 Command;                                           // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Async;                                             // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LDRequestSetAreaOnlyVisible_IsError;      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LevelCommandComponent_C___CommandSetAreaOnlyVisible) == 0x000008, "Wrong alignment on BP_LevelCommandComponent_C___CommandSetAreaOnlyVisible");
static_assert(sizeof(BP_LevelCommandComponent_C___CommandSetAreaOnlyVisible) == 0x000050, "Wrong size on BP_LevelCommandComponent_C___CommandSetAreaOnlyVisible");
static_assert(offsetof(BP_LevelCommandComponent_C___CommandSetAreaOnlyVisible, Command) == 0x000000, "Member 'BP_LevelCommandComponent_C___CommandSetAreaOnlyVisible::Command' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C___CommandSetAreaOnlyVisible, Async) == 0x000048, "Member 'BP_LevelCommandComponent_C___CommandSetAreaOnlyVisible::Async' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C___CommandSetAreaOnlyVisible, CallFunc_LDRequestSetAreaOnlyVisible_IsError) == 0x000049, "Member 'BP_LevelCommandComponent_C___CommandSetAreaOnlyVisible::CallFunc_LDRequestSetAreaOnlyVisible_IsError' has a wrong offset!");

// Function BP_LevelCommandComponent.BP_LevelCommandComponent_C.CommandUnloadAreaAsync
// 0x00C0 (0x00C0 - 0x0000)
struct BP_LevelCommandComponent_C_CommandUnloadAreaAsync final
{
public:
	struct FS_LevelManagerCommand                 Command;                                           // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          CallFunc_LDRequestUnloadAreaAsync_IsError;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAreaInLoadedAreaInfos_IsLoaded;         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAreaInLoadedAreaInfos_IsExist;          // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_70DB[0x5];                                     // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_AreaInfo                            CallFunc_IsAreaInLoadedAreaInfos_AreaInfo;         // 0x0050(0x0068)(HasGetValueTypeHash)
	bool                                          CallFunc_SetAreaInfoStatus_Error;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_LevelLoadStatus                             CallFunc_SetAreaInfoStatus_OldStatus;              // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelCommandComponent_C_CommandUnloadAreaAsync) == 0x000008, "Wrong alignment on BP_LevelCommandComponent_C_CommandUnloadAreaAsync");
static_assert(sizeof(BP_LevelCommandComponent_C_CommandUnloadAreaAsync) == 0x0000C0, "Wrong size on BP_LevelCommandComponent_C_CommandUnloadAreaAsync");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandUnloadAreaAsync, Command) == 0x000000, "Member 'BP_LevelCommandComponent_C_CommandUnloadAreaAsync::Command' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandUnloadAreaAsync, CallFunc_LDRequestUnloadAreaAsync_IsError) == 0x000048, "Member 'BP_LevelCommandComponent_C_CommandUnloadAreaAsync::CallFunc_LDRequestUnloadAreaAsync_IsError' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandUnloadAreaAsync, CallFunc_IsAreaInLoadedAreaInfos_IsLoaded) == 0x000049, "Member 'BP_LevelCommandComponent_C_CommandUnloadAreaAsync::CallFunc_IsAreaInLoadedAreaInfos_IsLoaded' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandUnloadAreaAsync, CallFunc_IsAreaInLoadedAreaInfos_IsExist) == 0x00004A, "Member 'BP_LevelCommandComponent_C_CommandUnloadAreaAsync::CallFunc_IsAreaInLoadedAreaInfos_IsExist' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandUnloadAreaAsync, CallFunc_IsAreaInLoadedAreaInfos_AreaInfo) == 0x000050, "Member 'BP_LevelCommandComponent_C_CommandUnloadAreaAsync::CallFunc_IsAreaInLoadedAreaInfos_AreaInfo' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandUnloadAreaAsync, CallFunc_SetAreaInfoStatus_Error) == 0x0000B8, "Member 'BP_LevelCommandComponent_C_CommandUnloadAreaAsync::CallFunc_SetAreaInfoStatus_Error' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandUnloadAreaAsync, CallFunc_SetAreaInfoStatus_OldStatus) == 0x0000B9, "Member 'BP_LevelCommandComponent_C_CommandUnloadAreaAsync::CallFunc_SetAreaInfoStatus_OldStatus' has a wrong offset!");

// Function BP_LevelCommandComponent.BP_LevelCommandComponent_C.CommandWaitLoadAreaWait
// 0x00C0 (0x00C0 - 0x0000)
struct BP_LevelCommandComponent_C_CommandWaitLoadAreaWait final
{
public:
	struct FS_LevelManagerCommand                 Command;                                           // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          CallFunc_IsAreaLevelsLoadedByAreaName_IsLoaded;    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAreaLevelsLoadedByAreaName_IsError;     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_70DC[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_AreaInfo                            CallFunc_IsAreaLevelsLoadedByAreaName_Area_Info;   // 0x0050(0x0068)(HasGetValueTypeHash)
	bool                                          CallFunc_IsExistAreaInfo_Found;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LevelCommandComponent_C_CommandWaitLoadAreaWait) == 0x000008, "Wrong alignment on BP_LevelCommandComponent_C_CommandWaitLoadAreaWait");
static_assert(sizeof(BP_LevelCommandComponent_C_CommandWaitLoadAreaWait) == 0x0000C0, "Wrong size on BP_LevelCommandComponent_C_CommandWaitLoadAreaWait");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandWaitLoadAreaWait, Command) == 0x000000, "Member 'BP_LevelCommandComponent_C_CommandWaitLoadAreaWait::Command' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandWaitLoadAreaWait, CallFunc_IsAreaLevelsLoadedByAreaName_IsLoaded) == 0x000048, "Member 'BP_LevelCommandComponent_C_CommandWaitLoadAreaWait::CallFunc_IsAreaLevelsLoadedByAreaName_IsLoaded' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandWaitLoadAreaWait, CallFunc_IsAreaLevelsLoadedByAreaName_IsError) == 0x000049, "Member 'BP_LevelCommandComponent_C_CommandWaitLoadAreaWait::CallFunc_IsAreaLevelsLoadedByAreaName_IsError' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandWaitLoadAreaWait, CallFunc_IsAreaLevelsLoadedByAreaName_Area_Info) == 0x000050, "Member 'BP_LevelCommandComponent_C_CommandWaitLoadAreaWait::CallFunc_IsAreaLevelsLoadedByAreaName_Area_Info' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandWaitLoadAreaWait, CallFunc_IsExistAreaInfo_Found) == 0x0000B8, "Member 'BP_LevelCommandComponent_C_CommandWaitLoadAreaWait::CallFunc_IsExistAreaInfo_Found' has a wrong offset!");

// Function BP_LevelCommandComponent.BP_LevelCommandComponent_C._CommandWaitUnloadAreaWait
// 0x0150 (0x0150 - 0x0000)
struct BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait final
{
public:
	struct FS_LevelManagerCommand                 Command;                                           // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UObject>>         RequireLevels;                                     // 0x0048(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExistAreaInfo_Found;                    // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_70DD[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UObject>>         CallFunc_GetUnusedLevelWhenUnloadArea_ShouldUnloadLevels; // 0x0060(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_70DE[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 CallFunc_Array_Get_Item;                           // 0x0078(0x0028)(HasGetValueTypeHash)
	class FName                                   CallFunc_ObjectSoftRefToName_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_70DF[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x00B0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C8(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_70E0[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0120(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait) == 0x000008, "Wrong alignment on BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait");
static_assert(sizeof(BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait) == 0x000150, "Wrong size on BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait, Command) == 0x000000, "Member 'BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait::Command' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait, RequireLevels) == 0x000048, "Member 'BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait::RequireLevels' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait, Temp_int_Array_Index_Variable) == 0x000058, "Member 'BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait, CallFunc_IsExistAreaInfo_Found) == 0x00005C, "Member 'BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait::CallFunc_IsExistAreaInfo_Found' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait, CallFunc_GetUnusedLevelWhenUnloadArea_ShouldUnloadLevels) == 0x000060, "Member 'BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait::CallFunc_GetUnusedLevelWhenUnloadArea_ShouldUnloadLevels' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait, Temp_int_Loop_Counter_Variable) == 0x000070, "Member 'BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait, CallFunc_Array_Get_Item) == 0x000078, "Member 'BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait, CallFunc_ObjectSoftRefToName_ReturnValue) == 0x0000A0, "Member 'BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait::CallFunc_ObjectSoftRefToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait, CallFunc_Array_Contains_ReturnValue) == 0x0000A8, "Member 'BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait, CallFunc_Conv_NameToText_ReturnValue) == 0x0000B0, "Member 'BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait, K2Node_MakeStruct_FormatArgumentData) == 0x0000C8, "Member 'BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait, CallFunc_Add_IntInt_ReturnValue) == 0x000108, "Member 'BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait, K2Node_MakeArray_Array) == 0x000110, "Member 'BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait, CallFunc_Format_ReturnValue) == 0x000120, "Member 'BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait, CallFunc_Conv_TextToString_ReturnValue) == 0x000138, "Member 'BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait, CallFunc_Array_Length_ReturnValue) == 0x000148, "Member 'BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait, CallFunc_Less_IntInt_ReturnValue) == 0x00014C, "Member 'BP_LevelCommandComponent_C__CommandWaitUnloadAreaWait::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_LevelCommandComponent.BP_LevelCommandComponent_C.CommandChangeArea
// 0x0050 (0x0050 - 0x0000)
struct BP_LevelCommandComponent_C_CommandChangeArea final
{
public:
	struct FS_LevelManagerCommand                 Command;                                           // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          CallFunc_LDRequestChangeArea_IsError;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LevelCommandComponent_C_CommandChangeArea) == 0x000008, "Wrong alignment on BP_LevelCommandComponent_C_CommandChangeArea");
static_assert(sizeof(BP_LevelCommandComponent_C_CommandChangeArea) == 0x000050, "Wrong size on BP_LevelCommandComponent_C_CommandChangeArea");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandChangeArea, Command) == 0x000000, "Member 'BP_LevelCommandComponent_C_CommandChangeArea::Command' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandChangeArea, CallFunc_LDRequestChangeArea_IsError) == 0x000048, "Member 'BP_LevelCommandComponent_C_CommandChangeArea::CallFunc_LDRequestChangeArea_IsError' has a wrong offset!");

// Function BP_LevelCommandComponent.BP_LevelCommandComponent_C.IsAreaLevelLoaded
// 0x00D8 (0x00D8 - 0x0000)
struct BP_LevelCommandComponent_C_IsAreaLevelLoaded final
{
public:
	class FName                                   Area;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoaded;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsError;                                           // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_70E1[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_70E2[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UObject>>         CallFunc_GetAllLevelInArea_Levels;                 // 0x0018(0x0010)(ReferenceParm, HasGetValueTypeHash)
	struct FS_AreaInfo                            CallFunc_GetAllLevelInArea_AreaInfo;               // 0x0028(0x0068)(HasGetValueTypeHash)
	bool                                          CallFunc_GetAllLevelInArea_Error;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_70E3[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_Array_Get_Item;                           // 0x0098(0x0028)(HasGetValueTypeHash)
	class FName                                   CallFunc_ObjectSoftRefToName_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLevelLoaded_ReturnValue;                // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LevelCommandComponent_C_IsAreaLevelLoaded) == 0x000008, "Wrong alignment on BP_LevelCommandComponent_C_IsAreaLevelLoaded");
static_assert(sizeof(BP_LevelCommandComponent_C_IsAreaLevelLoaded) == 0x0000D8, "Wrong size on BP_LevelCommandComponent_C_IsAreaLevelLoaded");
static_assert(offsetof(BP_LevelCommandComponent_C_IsAreaLevelLoaded, Area) == 0x000000, "Member 'BP_LevelCommandComponent_C_IsAreaLevelLoaded::Area' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_IsAreaLevelLoaded, IsLoaded) == 0x000008, "Member 'BP_LevelCommandComponent_C_IsAreaLevelLoaded::IsLoaded' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_IsAreaLevelLoaded, IsError) == 0x000009, "Member 'BP_LevelCommandComponent_C_IsAreaLevelLoaded::IsError' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_IsAreaLevelLoaded, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_LevelCommandComponent_C_IsAreaLevelLoaded::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_IsAreaLevelLoaded, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_LevelCommandComponent_C_IsAreaLevelLoaded::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_IsAreaLevelLoaded, CallFunc_GetAllLevelInArea_Levels) == 0x000018, "Member 'BP_LevelCommandComponent_C_IsAreaLevelLoaded::CallFunc_GetAllLevelInArea_Levels' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_IsAreaLevelLoaded, CallFunc_GetAllLevelInArea_AreaInfo) == 0x000028, "Member 'BP_LevelCommandComponent_C_IsAreaLevelLoaded::CallFunc_GetAllLevelInArea_AreaInfo' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_IsAreaLevelLoaded, CallFunc_GetAllLevelInArea_Error) == 0x000090, "Member 'BP_LevelCommandComponent_C_IsAreaLevelLoaded::CallFunc_GetAllLevelInArea_Error' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_IsAreaLevelLoaded, Temp_int_Array_Index_Variable) == 0x000094, "Member 'BP_LevelCommandComponent_C_IsAreaLevelLoaded::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_IsAreaLevelLoaded, CallFunc_Array_Get_Item) == 0x000098, "Member 'BP_LevelCommandComponent_C_IsAreaLevelLoaded::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_IsAreaLevelLoaded, CallFunc_ObjectSoftRefToName_ReturnValue) == 0x0000C0, "Member 'BP_LevelCommandComponent_C_IsAreaLevelLoaded::CallFunc_ObjectSoftRefToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_IsAreaLevelLoaded, CallFunc_GetStreamingLevel_ReturnValue) == 0x0000C8, "Member 'BP_LevelCommandComponent_C_IsAreaLevelLoaded::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_IsAreaLevelLoaded, CallFunc_Array_Length_ReturnValue) == 0x0000D0, "Member 'BP_LevelCommandComponent_C_IsAreaLevelLoaded::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_IsAreaLevelLoaded, CallFunc_IsLevelLoaded_ReturnValue) == 0x0000D4, "Member 'BP_LevelCommandComponent_C_IsAreaLevelLoaded::CallFunc_IsLevelLoaded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_IsAreaLevelLoaded, CallFunc_Less_IntInt_ReturnValue) == 0x0000D5, "Member 'BP_LevelCommandComponent_C_IsAreaLevelLoaded::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_LevelCommandComponent.BP_LevelCommandComponent_C.LoadLevel
// 0x0008 (0x0008 - 0x0000)
struct BP_LevelCommandComponent_C_LoadLevel final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelCommandComponent_C_LoadLevel) == 0x000004, "Wrong alignment on BP_LevelCommandComponent_C_LoadLevel");
static_assert(sizeof(BP_LevelCommandComponent_C_LoadLevel) == 0x000008, "Wrong size on BP_LevelCommandComponent_C_LoadLevel");
static_assert(offsetof(BP_LevelCommandComponent_C_LoadLevel, Param_Name) == 0x000000, "Member 'BP_LevelCommandComponent_C_LoadLevel::Param_Name' has a wrong offset!");

// Function BP_LevelCommandComponent.BP_LevelCommandComponent_C._CommandWaitLoadAreaAsync
// 0x00B8 (0x00B8 - 0x0000)
struct BP_LevelCommandComponent_C__CommandWaitLoadAreaAsync final
{
public:
	struct FS_LevelManagerCommand                 Command;                                           // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          CallFunc_IsExistAreaInfo_Found;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAreaLevelsLoadedByAreaName_IsLoaded;    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAreaLevelsLoadedByAreaName_IsError;     // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_70E4[0x5];                                     // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_AreaInfo                            CallFunc_IsAreaLevelsLoadedByAreaName_Area_Info;   // 0x0050(0x0068)(HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelCommandComponent_C__CommandWaitLoadAreaAsync) == 0x000008, "Wrong alignment on BP_LevelCommandComponent_C__CommandWaitLoadAreaAsync");
static_assert(sizeof(BP_LevelCommandComponent_C__CommandWaitLoadAreaAsync) == 0x0000B8, "Wrong size on BP_LevelCommandComponent_C__CommandWaitLoadAreaAsync");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandWaitLoadAreaAsync, Command) == 0x000000, "Member 'BP_LevelCommandComponent_C__CommandWaitLoadAreaAsync::Command' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandWaitLoadAreaAsync, CallFunc_IsExistAreaInfo_Found) == 0x000048, "Member 'BP_LevelCommandComponent_C__CommandWaitLoadAreaAsync::CallFunc_IsExistAreaInfo_Found' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandWaitLoadAreaAsync, CallFunc_IsAreaLevelsLoadedByAreaName_IsLoaded) == 0x000049, "Member 'BP_LevelCommandComponent_C__CommandWaitLoadAreaAsync::CallFunc_IsAreaLevelsLoadedByAreaName_IsLoaded' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandWaitLoadAreaAsync, CallFunc_IsAreaLevelsLoadedByAreaName_IsError) == 0x00004A, "Member 'BP_LevelCommandComponent_C__CommandWaitLoadAreaAsync::CallFunc_IsAreaLevelsLoadedByAreaName_IsError' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandWaitLoadAreaAsync, CallFunc_IsAreaLevelsLoadedByAreaName_Area_Info) == 0x000050, "Member 'BP_LevelCommandComponent_C__CommandWaitLoadAreaAsync::CallFunc_IsAreaLevelsLoadedByAreaName_Area_Info' has a wrong offset!");

// Function BP_LevelCommandComponent.BP_LevelCommandComponent_C._CommandWaitUnloadAreaAsync
// 0x0050 (0x0050 - 0x0000)
struct BP_LevelCommandComponent_C__CommandWaitUnloadAreaAsync final
{
public:
	struct FS_LevelManagerCommand                 Command;                                           // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          CallFunc_IsExistAreaInfo_Found;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LevelCommandComponent_C__CommandWaitUnloadAreaAsync) == 0x000008, "Wrong alignment on BP_LevelCommandComponent_C__CommandWaitUnloadAreaAsync");
static_assert(sizeof(BP_LevelCommandComponent_C__CommandWaitUnloadAreaAsync) == 0x000050, "Wrong size on BP_LevelCommandComponent_C__CommandWaitUnloadAreaAsync");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandWaitUnloadAreaAsync, Command) == 0x000000, "Member 'BP_LevelCommandComponent_C__CommandWaitUnloadAreaAsync::Command' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandWaitUnloadAreaAsync, CallFunc_IsExistAreaInfo_Found) == 0x000048, "Member 'BP_LevelCommandComponent_C__CommandWaitUnloadAreaAsync::CallFunc_IsExistAreaInfo_Found' has a wrong offset!");

// Function BP_LevelCommandComponent.BP_LevelCommandComponent_C.CommandWaitAreaVisible
// 0x0050 (0x0050 - 0x0000)
struct BP_LevelCommandComponent_C_CommandWaitAreaVisible final
{
public:
	struct FS_LevelManagerCommand                 Command;                                           // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          CallFunc_IsAreaVisible_AllVisible;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LevelCommandComponent_C_CommandWaitAreaVisible) == 0x000008, "Wrong alignment on BP_LevelCommandComponent_C_CommandWaitAreaVisible");
static_assert(sizeof(BP_LevelCommandComponent_C_CommandWaitAreaVisible) == 0x000050, "Wrong size on BP_LevelCommandComponent_C_CommandWaitAreaVisible");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandWaitAreaVisible, Command) == 0x000000, "Member 'BP_LevelCommandComponent_C_CommandWaitAreaVisible::Command' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandWaitAreaVisible, CallFunc_IsAreaVisible_AllVisible) == 0x000048, "Member 'BP_LevelCommandComponent_C_CommandWaitAreaVisible::CallFunc_IsAreaVisible_AllVisible' has a wrong offset!");

// Function BP_LevelCommandComponent.BP_LevelCommandComponent_C.CommandWaitAreaUnvisible
// 0x0050 (0x0050 - 0x0000)
struct BP_LevelCommandComponent_C_CommandWaitAreaUnvisible final
{
public:
	struct FS_LevelManagerCommand                 Command;                                           // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          CallFunc_IsAreaUnvisible_AllUnvisible;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LevelCommandComponent_C_CommandWaitAreaUnvisible) == 0x000008, "Wrong alignment on BP_LevelCommandComponent_C_CommandWaitAreaUnvisible");
static_assert(sizeof(BP_LevelCommandComponent_C_CommandWaitAreaUnvisible) == 0x000050, "Wrong size on BP_LevelCommandComponent_C_CommandWaitAreaUnvisible");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandWaitAreaUnvisible, Command) == 0x000000, "Member 'BP_LevelCommandComponent_C_CommandWaitAreaUnvisible::Command' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandWaitAreaUnvisible, CallFunc_IsAreaUnvisible_AllUnvisible) == 0x000048, "Member 'BP_LevelCommandComponent_C_CommandWaitAreaUnvisible::CallFunc_IsAreaUnvisible_AllUnvisible' has a wrong offset!");

// Function BP_LevelCommandComponent.BP_LevelCommandComponent_C._CommandCancelLoadAreaAsync
// 0x0048 (0x0048 - 0x0000)
struct BP_LevelCommandComponent_C__CommandCancelLoadAreaAsync final
{
public:
	struct FS_LevelManagerCommand                 Command;                                           // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelCommandComponent_C__CommandCancelLoadAreaAsync) == 0x000008, "Wrong alignment on BP_LevelCommandComponent_C__CommandCancelLoadAreaAsync");
static_assert(sizeof(BP_LevelCommandComponent_C__CommandCancelLoadAreaAsync) == 0x000048, "Wrong size on BP_LevelCommandComponent_C__CommandCancelLoadAreaAsync");
static_assert(offsetof(BP_LevelCommandComponent_C__CommandCancelLoadAreaAsync, Command) == 0x000000, "Member 'BP_LevelCommandComponent_C__CommandCancelLoadAreaAsync::Command' has a wrong offset!");

// Function BP_LevelCommandComponent.BP_LevelCommandComponent_C.CommandLoadAssetPackAsync
// 0x0050 (0x0050 - 0x0000)
struct BP_LevelCommandComponent_C_CommandLoadAssetPackAsync final
{
public:
	struct FS_LevelManagerCommand                 Command;                                           // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          CallFunc_LDRequestLoadAssetListAsync_IsError;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LevelCommandComponent_C_CommandLoadAssetPackAsync) == 0x000008, "Wrong alignment on BP_LevelCommandComponent_C_CommandLoadAssetPackAsync");
static_assert(sizeof(BP_LevelCommandComponent_C_CommandLoadAssetPackAsync) == 0x000050, "Wrong size on BP_LevelCommandComponent_C_CommandLoadAssetPackAsync");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandLoadAssetPackAsync, Command) == 0x000000, "Member 'BP_LevelCommandComponent_C_CommandLoadAssetPackAsync::Command' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandLoadAssetPackAsync, CallFunc_LDRequestLoadAssetListAsync_IsError) == 0x000048, "Member 'BP_LevelCommandComponent_C_CommandLoadAssetPackAsync::CallFunc_LDRequestLoadAssetListAsync_IsError' has a wrong offset!");

// Function BP_LevelCommandComponent.BP_LevelCommandComponent_C.CommandLoadAssetAsync
// 0x0050 (0x0050 - 0x0000)
struct BP_LevelCommandComponent_C_CommandLoadAssetAsync final
{
public:
	struct FS_LevelManagerCommand                 Command;                                           // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          CallFunc_LDRequestLoadAssetAsync_IsError;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LevelCommandComponent_C_CommandLoadAssetAsync) == 0x000008, "Wrong alignment on BP_LevelCommandComponent_C_CommandLoadAssetAsync");
static_assert(sizeof(BP_LevelCommandComponent_C_CommandLoadAssetAsync) == 0x000050, "Wrong size on BP_LevelCommandComponent_C_CommandLoadAssetAsync");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandLoadAssetAsync, Command) == 0x000000, "Member 'BP_LevelCommandComponent_C_CommandLoadAssetAsync::Command' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandLoadAssetAsync, CallFunc_LDRequestLoadAssetAsync_IsError) == 0x000048, "Member 'BP_LevelCommandComponent_C_CommandLoadAssetAsync::CallFunc_LDRequestLoadAssetAsync_IsError' has a wrong offset!");

// Function BP_LevelCommandComponent.BP_LevelCommandComponent_C.CommandSetLevelVisible
// 0x0048 (0x0048 - 0x0000)
struct BP_LevelCommandComponent_C_CommandSetLevelVisible final
{
public:
	struct FS_LevelManagerCommand                 Command;                                           // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelCommandComponent_C_CommandSetLevelVisible) == 0x000008, "Wrong alignment on BP_LevelCommandComponent_C_CommandSetLevelVisible");
static_assert(sizeof(BP_LevelCommandComponent_C_CommandSetLevelVisible) == 0x000048, "Wrong size on BP_LevelCommandComponent_C_CommandSetLevelVisible");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandSetLevelVisible, Command) == 0x000000, "Member 'BP_LevelCommandComponent_C_CommandSetLevelVisible::Command' has a wrong offset!");

// Function BP_LevelCommandComponent.BP_LevelCommandComponent_C.CommandWaitLevelVisible
// 0x0050 (0x0050 - 0x0000)
struct BP_LevelCommandComponent_C_CommandWaitLevelVisible final
{
public:
	struct FS_LevelManagerCommand                 Command;                                           // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          CallFunc_IsLevelVisibleInLoadedLevelInfo_Visible;  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLevelVisibleInLoadedLevelInfo_Error;    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LevelCommandComponent_C_CommandWaitLevelVisible) == 0x000008, "Wrong alignment on BP_LevelCommandComponent_C_CommandWaitLevelVisible");
static_assert(sizeof(BP_LevelCommandComponent_C_CommandWaitLevelVisible) == 0x000050, "Wrong size on BP_LevelCommandComponent_C_CommandWaitLevelVisible");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandWaitLevelVisible, Command) == 0x000000, "Member 'BP_LevelCommandComponent_C_CommandWaitLevelVisible::Command' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandWaitLevelVisible, CallFunc_IsLevelVisibleInLoadedLevelInfo_Visible) == 0x000048, "Member 'BP_LevelCommandComponent_C_CommandWaitLevelVisible::CallFunc_IsLevelVisibleInLoadedLevelInfo_Visible' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandWaitLevelVisible, CallFunc_IsLevelVisibleInLoadedLevelInfo_Error) == 0x000049, "Member 'BP_LevelCommandComponent_C_CommandWaitLevelVisible::CallFunc_IsLevelVisibleInLoadedLevelInfo_Error' has a wrong offset!");

// Function BP_LevelCommandComponent.BP_LevelCommandComponent_C.CommandLoadLevelAsync
// 0x0050 (0x0050 - 0x0000)
struct BP_LevelCommandComponent_C_CommandLoadLevelAsync final
{
public:
	struct FS_LevelManagerCommand                 Command;                                           // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          CallFunc_LDRequestLoadLevelAsync_IsError;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LevelCommandComponent_C_CommandLoadLevelAsync) == 0x000008, "Wrong alignment on BP_LevelCommandComponent_C_CommandLoadLevelAsync");
static_assert(sizeof(BP_LevelCommandComponent_C_CommandLoadLevelAsync) == 0x000050, "Wrong size on BP_LevelCommandComponent_C_CommandLoadLevelAsync");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandLoadLevelAsync, Command) == 0x000000, "Member 'BP_LevelCommandComponent_C_CommandLoadLevelAsync::Command' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandLoadLevelAsync, CallFunc_LDRequestLoadLevelAsync_IsError) == 0x000048, "Member 'BP_LevelCommandComponent_C_CommandLoadLevelAsync::CallFunc_LDRequestLoadLevelAsync_IsError' has a wrong offset!");

// Function BP_LevelCommandComponent.BP_LevelCommandComponent_C.CommandUnloadLevelAsync
// 0x0050 (0x0050 - 0x0000)
struct BP_LevelCommandComponent_C_CommandUnloadLevelAsync final
{
public:
	struct FS_LevelManagerCommand                 Command;                                           // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          CallFunc_LDRequestUnloadLevelAsync_IsError;        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LevelCommandComponent_C_CommandUnloadLevelAsync) == 0x000008, "Wrong alignment on BP_LevelCommandComponent_C_CommandUnloadLevelAsync");
static_assert(sizeof(BP_LevelCommandComponent_C_CommandUnloadLevelAsync) == 0x000050, "Wrong size on BP_LevelCommandComponent_C_CommandUnloadLevelAsync");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandUnloadLevelAsync, Command) == 0x000000, "Member 'BP_LevelCommandComponent_C_CommandUnloadLevelAsync::Command' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandUnloadLevelAsync, CallFunc_LDRequestUnloadLevelAsync_IsError) == 0x000048, "Member 'BP_LevelCommandComponent_C_CommandUnloadLevelAsync::CallFunc_LDRequestUnloadLevelAsync_IsError' has a wrong offset!");

// Function BP_LevelCommandComponent.BP_LevelCommandComponent_C.CommandWaitLoadLevel
// 0x0098 (0x0098 - 0x0000)
struct BP_LevelCommandComponent_C_CommandWaitLoadLevel final
{
public:
	struct FS_LevelManagerCommand                 Command;                                           // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FS_LoadedLevelInfo                     CallFunc_IsLevelInLoadedLevelInfo_LevelInfoRef;    // 0x0048(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_IsLevelInLoadedLevelInfo_Exist;           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LevelCommandComponent_C_CommandWaitLoadLevel) == 0x000008, "Wrong alignment on BP_LevelCommandComponent_C_CommandWaitLoadLevel");
static_assert(sizeof(BP_LevelCommandComponent_C_CommandWaitLoadLevel) == 0x000098, "Wrong size on BP_LevelCommandComponent_C_CommandWaitLoadLevel");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandWaitLoadLevel, Command) == 0x000000, "Member 'BP_LevelCommandComponent_C_CommandWaitLoadLevel::Command' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandWaitLoadLevel, CallFunc_IsLevelInLoadedLevelInfo_LevelInfoRef) == 0x000048, "Member 'BP_LevelCommandComponent_C_CommandWaitLoadLevel::CallFunc_IsLevelInLoadedLevelInfo_LevelInfoRef' has a wrong offset!");
static_assert(offsetof(BP_LevelCommandComponent_C_CommandWaitLoadLevel, CallFunc_IsLevelInLoadedLevelInfo_Exist) == 0x000090, "Member 'BP_LevelCommandComponent_C_CommandWaitLoadLevel::CallFunc_IsLevelInLoadedLevelInfo_Exist' has a wrong offset!");

// Function BP_LevelCommandComponent.BP_LevelCommandComponent_C.CommandWaitUnloadLevel
// 0x0098 (0x0098 - 0x0000)
struct BP_LevelCommandComponent_C_CommandWaitUnloadLevel final
{
public:
	struct FS_LevelManagerCommand                 Command;                                           // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FS_LoadedLevelInfo                     CallFunc_IsLevelInLoadedLevelInfo_LevelInfoRef;    // 0x0048(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_IsLevelInLoadedLevelInfo_Exist;           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LevelCommandComponent_C_CommandWaitUnloadLevel) == 0x000008, "Wrong alignment on BP_LevelCommandComponent_C_CommandWaitUnloadLevel");
