#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LC21MapGimmickManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LC21MapGimmickManager.BP_LC21MapGimmickManager_C
// 0x0060 (0x02C8 - 0x0268)
class ABP_LC21MapGimmickManager_C final : public ALC21MapGimmickManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CameraShakeData;                                   // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlayEarthQuakeShake;                             // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3280[0x7];                                     // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABlockingVolume*                        FloorWallFarAfterLaser;                            // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABlockingVolume*                        FloorWallFarNormal;                                // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABlockingVolume*                        FloorWallNear;                                     // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  BossFloorActor;                                    // 0x02A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_LC21MapGimmickManager(int32 EntryPoint);
	void UpdateEarthQuakePlay();
	void StartLC21bossArea();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void EndLC21bossArea();
	void Debug_TestLaser();
	void OnEndAllBlockFall_Event();
	void OnStartAllBlockFall_Event(const class AActor*& Actor);
	bool FindAllObjectsAndInitialize();
	void StartEarthQuake();
	void EndEarthQuake();
	bool ChangePhase(int32 PhaseNo);
	void StartFallLeftAllFromActor(class AActor*& Actor);
	void GetFloorInfoFromActor(class AActor*& Actor, struct FBossFloorInfo* FloorInfo, int32* No);
	void DebugPrintFloorInfo();
	void SetIsFallToInfoFromActor(class AActor*& Actor);
	bool StartEventLaser();
	void InitializeWall();
	void SetWallCollision(bool IsAfterLaser);
	void StartFallLeftAllFromNo(int32 No);
	bool FallLeftFloor(float OffsetY);
	void SetLaserWallCollision(class ABlockingVolume* BlockActor, bool IsAfterLaser);
	bool StartEventLaserFar();
	bool StartEventLaserCenter();
	bool StartEventLaserSetWall();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LC21MapGimmickManager_C">();
	}
	static class ABP_LC21MapGimmickManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LC21MapGimmickManager_C>();
	}
};
static_assert(alignof(ABP_LC21MapGimmickManager_C) == 0x000008, "Wrong alignment on ABP_LC21MapGimmickManager_C");
static_assert(sizeof(ABP_LC21MapGimmickManager_C) == 0x0002C8, "Wrong size on ABP_LC21MapGimmickManager_C");
static_assert(offsetof(ABP_LC21MapGimmickManager_C, UberGraphFrame) == 0x000268, "Member 'ABP_LC21MapGimmickManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LC21MapGimmickManager_C, DefaultSceneRoot) == 0x000270, "Member 'ABP_LC21MapGimmickManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_LC21MapGimmickManager_C, CameraShakeData) == 0x000278, "Member 'ABP_LC21MapGimmickManager_C::CameraShakeData' has a wrong offset!");
static_assert(offsetof(ABP_LC21MapGimmickManager_C, IsPlayEarthQuakeShake) == 0x000280, "Member 'ABP_LC21MapGimmickManager_C::IsPlayEarthQuakeShake' has a wrong offset!");
static_assert(offsetof(ABP_LC21MapGimmickManager_C, FloorWallFarAfterLaser) == 0x000288, "Member 'ABP_LC21MapGimmickManager_C::FloorWallFarAfterLaser' has a wrong offset!");
static_assert(offsetof(ABP_LC21MapGimmickManager_C, FloorWallFarNormal) == 0x000290, "Member 'ABP_LC21MapGimmickManager_C::FloorWallFarNormal' has a wrong offset!");
static_assert(offsetof(ABP_LC21MapGimmickManager_C, FloorWallNear) == 0x000298, "Member 'ABP_LC21MapGimmickManager_C::FloorWallNear' has a wrong offset!");
static_assert(offsetof(ABP_LC21MapGimmickManager_C, BossFloorActor) == 0x0002A0, "Member 'ABP_LC21MapGimmickManager_C::BossFloorActor' has a wrong offset!");

}

