#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LevelManager

#include "Basic.hpp"

#include "S_BattleSimulatorLevelInfo_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_LoadedLevelInfo_structs.hpp"
#include "E_SceneType_structs.hpp"
#include "S_LevelManagerCommand_structs.hpp"
#include "S_AreaInfo_structs.hpp"
#include "S_BGAreaInfo_structs.hpp"
#include "S_AreaSettingsInfo_structs.hpp"
#include "Engine_structs.hpp"
#include "S_ArrangePointAreaInfo_structs.hpp"
#include "E_LevelCommandStatus_structs.hpp"
#include "S_AreaInfoTweakExec_structs.hpp"
#include "S_AreaInfoTweakCondition_structs.hpp"
#include "S_NPCAreaInfo_structs.hpp"
#include "S_NObjAreaInfo_structs.hpp"
#include "S_EventAreaInfo_structs.hpp"
#include "S_EnemyAreaInfo_structs.hpp"
#include "E_LevelLoadStatus_structs.hpp"
#include "S_SceneInfo_structs.hpp"
#include "E_LevelManagerCommand_structs.hpp"


namespace SDK::Params
{

// Function BP_LevelManager.BP_LevelManager_C.EventFinishWaitAreaVisibleDispatcher__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_LevelManager_C_EventFinishWaitAreaVisibleDispatcher__DelegateSignature final
{
public:
	class FName                                   AreaName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelManager_C_EventFinishWaitAreaVisibleDispatcher__DelegateSignature) == 0x000004, "Wrong alignment on BP_LevelManager_C_EventFinishWaitAreaVisibleDispatcher__DelegateSignature");
static_assert(sizeof(BP_LevelManager_C_EventFinishWaitAreaVisibleDispatcher__DelegateSignature) == 0x000008, "Wrong size on BP_LevelManager_C_EventFinishWaitAreaVisibleDispatcher__DelegateSignature");
static_assert(offsetof(BP_LevelManager_C_EventFinishWaitAreaVisibleDispatcher__DelegateSignature, AreaName) == 0x000000, "Member 'BP_LevelManager_C_EventFinishWaitAreaVisibleDispatcher__DelegateSignature::AreaName' has a wrong offset!");

// Function BP_LevelManager.BP_LevelManager_C.EventFinishWaitAreaUnvisibleDispatcher__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_LevelManager_C_EventFinishWaitAreaUnvisibleDispatcher__DelegateSignature final
{
public:
	class FName                                   AreaName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelManager_C_EventFinishWaitAreaUnvisibleDispatcher__DelegateSignature) == 0x000004, "Wrong alignment on BP_LevelManager_C_EventFinishWaitAreaUnvisibleDispatcher__DelegateSignature");
static_assert(sizeof(BP_LevelManager_C_EventFinishWaitAreaUnvisibleDispatcher__DelegateSignature) == 0x000008, "Wrong size on BP_LevelManager_C_EventFinishWaitAreaUnvisibleDispatcher__DelegateSignature");
static_assert(offsetof(BP_LevelManager_C_EventFinishWaitAreaUnvisibleDispatcher__DelegateSignature, AreaName) == 0x000000, "Member 'BP_LevelManager_C_EventFinishWaitAreaUnvisibleDispatcher__DelegateSignature::AreaName' has a wrong offset!");

// Function BP_LevelManager.BP_LevelManager_C.EventFinishLoadAssetAsync__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct BP_LevelManager_C_EventFinishLoadAssetAsync__DelegateSignature final
{
public:
	TSoftObjectPtr<class UObject>                 LoadedAsset;                                       // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelManager_C_EventFinishLoadAssetAsync__DelegateSignature) == 0x000008, "Wrong alignment on BP_LevelManager_C_EventFinishLoadAssetAsync__DelegateSignature");
static_assert(sizeof(BP_LevelManager_C_EventFinishLoadAssetAsync__DelegateSignature) == 0x000028, "Wrong size on BP_LevelManager_C_EventFinishLoadAssetAsync__DelegateSignature");
static_assert(offsetof(BP_LevelManager_C_EventFinishLoadAssetAsync__DelegateSignature, LoadedAsset) == 0x000000, "Member 'BP_LevelManager_C_EventFinishLoadAssetAsync__DelegateSignature::LoadedAsset' has a wrong offset!");

// Function BP_LevelManager.BP_LevelManager_C.OnStartCheckLevelVisible__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct BP_LevelManager_C_OnStartCheckLevelVisible__DelegateSignature final
{
public:
	TSoftObjectPtr<class UObject>                 Level;                                             // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelManager_C_OnStartCheckLevelVisible__DelegateSignature) == 0x000008, "Wrong alignment on BP_LevelManager_C_OnStartCheckLevelVisible__DelegateSignature");
static_assert(sizeof(BP_LevelManager_C_OnStartCheckLevelVisible__DelegateSignature) == 0x000028, "Wrong size on BP_LevelManager_C_OnStartCheckLevelVisible__DelegateSignature");
static_assert(offsetof(BP_LevelManager_C_OnStartCheckLevelVisible__DelegateSignature, Level) == 0x000000, "Member 'BP_LevelManager_C_OnStartCheckLevelVisible__DelegateSignature::Level' has a wrong offset!");

// Function BP_LevelManager.BP_LevelManager_C.OnEndCheckLevelVisible__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct BP_LevelManager_C_OnEndCheckLevelVisible__DelegateSignature final
{
public:
	TSoftObjectPtr<class UObject>                 Level;                                             // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelManager_C_OnEndCheckLevelVisible__DelegateSignature) == 0x000008, "Wrong alignment on BP_LevelManager_C_OnEndCheckLevelVisible__DelegateSignature");
static_assert(sizeof(BP_LevelManager_C_OnEndCheckLevelVisible__DelegateSignature) == 0x000028, "Wrong size on BP_LevelManager_C_OnEndCheckLevelVisible__DelegateSignature");
static_assert(offsetof(BP_LevelManager_C_OnEndCheckLevelVisible__DelegateSignature, Level) == 0x000000, "Member 'BP_LevelManager_C_OnEndCheckLevelVisible__DelegateSignature::Level' has a wrong offset!");

// Function BP_LevelManager.BP_LevelManager_C.ExecuteUbergraph_BP_LevelManager
// 0x0418 (0x0418 - 0x0000)
struct BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CFA[0x4];                                      // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CFB[0x3];                                      // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_AreaName_4;                     // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetAreaInfoStatus_Error;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_LevelLoadStatus                             CallFunc_SetAreaInfoStatus_OldStatus;              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CFC[0x2];                                      // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrimaryAssetType                      K2Node_CustomEvent_Pack_1;                         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RegisterPackToLoaded_IsAlreadyExists;     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CFD[0x3];                                      // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrimaryAssetType                      K2Node_CustomEvent_Pack;                           // 0x002C(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterPackToLoaded_IsError;           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CFE[0x3];                                      // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPrimaryAssetType& Pack)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 K2Node_CustomEvent_PortalName;                     // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_AreaName_3;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerStart*>                   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0060(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 K2Node_CustomEvent_Level_1;                        // 0x0070(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 K2Node_CustomEvent_Level;                          // 0x0098(0x0028)(HasGetValueTypeHash)
	TDelegate<void(const struct FPrimaryAssetType& Pack)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	TSoftObjectPtr<class UObject>                 K2Node_CustomEvent_LevelName_1;                    // 0x00D0(0x0028)(HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_AreaName_2;                     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UnregisterLevelToLoaded_IsError;          // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CFF[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_AreaName_1;                     // 0x0104(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D00[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 K2Node_CustomEvent_LevelName;                      // 0x0110(0x0028)(HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_AreaName;                       // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattlefieldManager*                    CallFunc_GetBattleFieldManager_BattleFieldManager; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RegisterLevelToLoaded_IsAlreadyExists;    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D01[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BattlefieldManager_C*               K2Node_DynamicCast_AsBP_Battlefield_Manager;       // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D02[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APsychicObjectManager_C*                CallFunc_GetPsychicObjectManager_PsyObjManager;    // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetEnablePsychicObjectRegister_ReturnValue; // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D03[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APsychicObjectManager_C*                CallFunc_GetPsychicObjectManager_PsyObjManager_1;  // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetEnablePsychicObjectRegister_ReturnValue_1; // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D04[0x2];                                      // 0x017A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D05[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_LevelManagerCommand                 CallFunc_GetCurrentLevelCommand_Command;           // 0x0188(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GetCurrentLevelCommand_IsFound;           // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D06[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_LevelManagerCommand                 K2Node_CustomEvent_Command;                        // 0x01D8(0x0048)(HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D07[0x6];                                      // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_LevelManagerCommand                 CallFunc_GetCurrentLevelCommand_Command_1;         // 0x0228(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GetCurrentLevelCommand_IsFound_1;         // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D08[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSoftObjectPtr<class UObject> LevelName, class FName AreaName)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0274(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName AreaName)>         K2Node_CreateDelegate_OutputDelegate_3;            // 0x0284(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSoftObjectPtr<class UObject> LevelName, class FName AreaName)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0298(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TSoftObjectPtr<class UObject> Level)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x02A8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSoftObjectPtr<class UObject> Level)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x02BC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName AreaName)>         K2Node_CreateDelegate_OutputDelegate_7;            // 0x02CC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D09[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 CallFunc_Array_Get_Item;                           // 0x02E0(0x0028)(HasGetValueTypeHash)
	class FName                                   CallFunc_ObjectSoftRefToName_ReturnValue;          // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D0A[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0318(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0330(0x0040)(HasGetValueTypeHash)
	TDelegate<void(class FName AreaName)>         K2Node_CreateDelegate_OutputDelegate_8;            // 0x0370(0x0010)(ZeroConstructor, NoDestructor)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0380(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x03C0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x03D0(0x0018)()
	class URSGameInstanceBP_C*                    CallFunc_GetRSGameInstance_AsRSGame_Instance_BP;   // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D0B[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstanceBP_C*                    CallFunc_GetRSGameInstance_AsRSGame_Instance_BP_1; // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0400(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager) == 0x000008, "Wrong alignment on BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager");
static_assert(sizeof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager) == 0x000418, "Wrong size on BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, EntryPoint) == 0x000000, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_GetSceneManager_SceneManager) == 0x000008, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_GetSceneManager_SceneManager' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_CustomEvent_AreaName_4) == 0x000014, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_CustomEvent_AreaName_4' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_SetAreaInfoStatus_Error) == 0x00001C, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_SetAreaInfoStatus_Error' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_SetAreaInfoStatus_OldStatus) == 0x00001D, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_SetAreaInfoStatus_OldStatus' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_CustomEvent_Pack_1) == 0x000020, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_CustomEvent_Pack_1' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_RegisterPackToLoaded_IsAlreadyExists) == 0x000028, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_RegisterPackToLoaded_IsAlreadyExists' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_CustomEvent_Pack) == 0x00002C, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_CustomEvent_Pack' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_UnregisterPackToLoaded_IsError) == 0x000034, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_UnregisterPackToLoaded_IsError' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_CustomEvent_PortalName) == 0x000048, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_CustomEvent_PortalName' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_CustomEvent_AreaName_3) == 0x000058, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_CustomEvent_AreaName_3' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_GetAllActorsOfClass_OutActors) == 0x000060, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_CustomEvent_Level_1) == 0x000070, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_CustomEvent_Level_1' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_CustomEvent_Level) == 0x000098, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_CustomEvent_Level' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C0, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_CustomEvent_LevelName_1) == 0x0000D0, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_CustomEvent_LevelName_1' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_CustomEvent_AreaName_2) == 0x0000F8, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_CustomEvent_AreaName_2' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_NotEqual_NameName_ReturnValue) == 0x000100, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_UnregisterLevelToLoaded_IsError) == 0x000101, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_UnregisterLevelToLoaded_IsError' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_CustomEvent_AreaName_1) == 0x000104, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_CustomEvent_AreaName_1' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_BooleanAND_ReturnValue) == 0x00010C, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_CustomEvent_LevelName) == 0x000110, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_CustomEvent_LevelName' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_CustomEvent_AreaName) == 0x000138, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_CustomEvent_AreaName' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_GetBattleFieldManager_BattleFieldManager) == 0x000140, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_GetBattleFieldManager_BattleFieldManager' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_RegisterLevelToLoaded_IsAlreadyExists) == 0x000148, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_RegisterLevelToLoaded_IsAlreadyExists' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_DynamicCast_AsBP_Battlefield_Manager) == 0x000150, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_DynamicCast_AsBP_Battlefield_Manager' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_GetPsychicObjectManager_PsyObjManager) == 0x000160, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_GetPsychicObjectManager_PsyObjManager' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_SetEnablePsychicObjectRegister_ReturnValue) == 0x000168, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_SetEnablePsychicObjectRegister_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_IsValid_ReturnValue_1) == 0x000169, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_GetPsychicObjectManager_PsyObjManager_1) == 0x000170, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_GetPsychicObjectManager_PsyObjManager_1' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_SetEnablePsychicObjectRegister_ReturnValue_1) == 0x000178, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_SetEnablePsychicObjectRegister_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_IsValid_ReturnValue_2) == 0x000179, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_Event_DeltaSeconds) == 0x00017C, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_SwitchEnum_CmpSuccess) == 0x000180, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_GetCurrentLevelCommand_Command) == 0x000188, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_GetCurrentLevelCommand_Command' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_GetCurrentLevelCommand_IsFound) == 0x0001D0, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_GetCurrentLevelCommand_IsFound' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_CustomEvent_Command) == 0x0001D8, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_CustomEvent_Command' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_SwitchEnum_CmpSuccess_1) == 0x000220, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_SwitchEnum_CmpSuccess_2) == 0x000221, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_GetCurrentLevelCommand_Command_1) == 0x000228, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_GetCurrentLevelCommand_Command_1' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_GetCurrentLevelCommand_IsFound_1) == 0x000270, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_GetCurrentLevelCommand_IsFound_1' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_CreateDelegate_OutputDelegate_2) == 0x000274, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_CreateDelegate_OutputDelegate_3) == 0x000284, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, Temp_int_Variable) == 0x000294, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_CreateDelegate_OutputDelegate_4) == 0x000298, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_CreateDelegate_OutputDelegate_5) == 0x0002A8, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_Array_Length_ReturnValue) == 0x0002B8, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_CreateDelegate_OutputDelegate_6) == 0x0002BC, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_CreateDelegate_OutputDelegate_7) == 0x0002CC, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_Less_IntInt_ReturnValue) == 0x0002DC, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_Array_Get_Item) == 0x0002E0, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_ObjectSoftRefToName_ReturnValue) == 0x000308, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_ObjectSoftRefToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_Add_IntInt_ReturnValue) == 0x000310, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_Conv_NameToText_ReturnValue) == 0x000318, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_MakeStruct_FormatArgumentData) == 0x000330, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_CreateDelegate_OutputDelegate_8) == 0x000370, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_MakeStruct_FormatArgumentData_1) == 0x000380, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, K2Node_MakeArray_Array) == 0x0003C0, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_Format_ReturnValue) == 0x0003D0, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_GetRSGameInstance_AsRSGame_Instance_BP) == 0x0003E8, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_GetRSGameInstance_AsRSGame_Instance_BP' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_IsValid_ReturnValue_3) == 0x0003F0, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_GetRSGameInstance_AsRSGame_Instance_BP_1) == 0x0003F8, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_GetRSGameInstance_AsRSGame_Instance_BP_1' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_Conv_NameToString_ReturnValue) == 0x000400, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager, CallFunc_Conv_StringToName_ReturnValue) == 0x000410, "Member 'BP_LevelManager_C_ExecuteUbergraph_BP_LevelManager::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

// Function BP_LevelManager.BP_LevelManager_C.ExecLevelCommand
// 0x0048 (0x0048 - 0x0000)
struct BP_LevelManager_C_ExecLevelCommand final
{
public:
	struct FS_LevelManagerCommand                 Command;                                           // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelManager_C_ExecLevelCommand) == 0x000008, "Wrong alignment on BP_LevelManager_C_ExecLevelCommand");
static_assert(sizeof(BP_LevelManager_C_ExecLevelCommand) == 0x000048, "Wrong size on BP_LevelManager_C_ExecLevelCommand");
static_assert(offsetof(BP_LevelManager_C_ExecLevelCommand, Command) == 0x000000, "Member 'BP_LevelManager_C_ExecLevelCommand::Command' has a wrong offset!");

// Function BP_LevelManager.BP_LevelManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_LevelManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_LevelManager_C_ReceiveTick");
static_assert(sizeof(BP_LevelManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_LevelManager_C_ReceiveTick");
static_assert(offsetof(BP_LevelManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_LevelManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_LevelManager.BP_LevelManager_C.EventFinishLoadLevelDispatcher_Event_0
// 0x0030 (0x0030 - 0x0000)
struct BP_LevelManager_C_EventFinishLoadLevelDispatcher_Event_0 final
{
public:
	TSoftObjectPtr<class UObject>                 LevelName;                                         // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FName                                   AreaName;                                          // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelManager_C_EventFinishLoadLevelDispatcher_Event_0) == 0x000008, "Wrong alignment on BP_LevelManager_C_EventFinishLoadLevelDispatcher_Event_0");
static_assert(sizeof(BP_LevelManager_C_EventFinishLoadLevelDispatcher_Event_0) == 0x000030, "Wrong size on BP_LevelManager_C_EventFinishLoadLevelDispatcher_Event_0");
static_assert(offsetof(BP_LevelManager_C_EventFinishLoadLevelDispatcher_Event_0, LevelName) == 0x000000, "Member 'BP_LevelManager_C_EventFinishLoadLevelDispatcher_Event_0::LevelName' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_EventFinishLoadLevelDispatcher_Event_0, AreaName) == 0x000028, "Member 'BP_LevelManager_C_EventFinishLoadLevelDispatcher_Event_0::AreaName' has a wrong offset!");

// Function BP_LevelManager.BP_LevelManager_C.EventFinishUnloadAreaDispatcher_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BP_LevelManager_C_EventFinishUnloadAreaDispatcher_Event_0 final
{
public:
	class FName                                   AreaName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelManager_C_EventFinishUnloadAreaDispatcher_Event_0) == 0x000004, "Wrong alignment on BP_LevelManager_C_EventFinishUnloadAreaDispatcher_Event_0");
static_assert(sizeof(BP_LevelManager_C_EventFinishUnloadAreaDispatcher_Event_0) == 0x000008, "Wrong size on BP_LevelManager_C_EventFinishUnloadAreaDispatcher_Event_0");
static_assert(offsetof(BP_LevelManager_C_EventFinishUnloadAreaDispatcher_Event_0, AreaName) == 0x000000, "Member 'BP_LevelManager_C_EventFinishUnloadAreaDispatcher_Event_0::AreaName' has a wrong offset!");

// Function BP_LevelManager.BP_LevelManager_C.EventFinishUnloadLevelDispatcher_Event_0
// 0x0030 (0x0030 - 0x0000)
struct BP_LevelManager_C_EventFinishUnloadLevelDispatcher_Event_0 final
{
public:
	TSoftObjectPtr<class UObject>                 LevelName;                                         // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FName                                   AreaName;                                          // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelManager_C_EventFinishUnloadLevelDispatcher_Event_0) == 0x000008, "Wrong alignment on BP_LevelManager_C_EventFinishUnloadLevelDispatcher_Event_0");
static_assert(sizeof(BP_LevelManager_C_EventFinishUnloadLevelDispatcher_Event_0) == 0x000030, "Wrong size on BP_LevelManager_C_EventFinishUnloadLevelDispatcher_Event_0");
static_assert(offsetof(BP_LevelManager_C_EventFinishUnloadLevelDispatcher_Event_0, LevelName) == 0x000000, "Member 'BP_LevelManager_C_EventFinishUnloadLevelDispatcher_Event_0::LevelName' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_EventFinishUnloadLevelDispatcher_Event_0, AreaName) == 0x000028, "Member 'BP_LevelManager_C_EventFinishUnloadLevelDispatcher_Event_0::AreaName' has a wrong offset!");

// Function BP_LevelManager.BP_LevelManager_C.OnEndCheckLevelVisible_Event
// 0x0028 (0x0028 - 0x0000)
struct BP_LevelManager_C_OnEndCheckLevelVisible_Event final
{
public:
	TSoftObjectPtr<class UObject>                 Level;                                             // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelManager_C_OnEndCheckLevelVisible_Event) == 0x000008, "Wrong alignment on BP_LevelManager_C_OnEndCheckLevelVisible_Event");
static_assert(sizeof(BP_LevelManager_C_OnEndCheckLevelVisible_Event) == 0x000028, "Wrong size on BP_LevelManager_C_OnEndCheckLevelVisible_Event");
static_assert(offsetof(BP_LevelManager_C_OnEndCheckLevelVisible_Event, Level) == 0x000000, "Member 'BP_LevelManager_C_OnEndCheckLevelVisible_Event::Level' has a wrong offset!");

// Function BP_LevelManager.BP_LevelManager_C.OnStartCheckLevelVisible_Event
// 0x0028 (0x0028 - 0x0000)
struct BP_LevelManager_C_OnStartCheckLevelVisible_Event final
{
public:
	TSoftObjectPtr<class UObject>                 Level;                                             // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelManager_C_OnStartCheckLevelVisible_Event) == 0x000008, "Wrong alignment on BP_LevelManager_C_OnStartCheckLevelVisible_Event");
static_assert(sizeof(BP_LevelManager_C_OnStartCheckLevelVisible_Event) == 0x000028, "Wrong size on BP_LevelManager_C_OnStartCheckLevelVisible_Event");
static_assert(offsetof(BP_LevelManager_C_OnStartCheckLevelVisible_Event, Level) == 0x000000, "Member 'BP_LevelManager_C_OnStartCheckLevelVisible_Event::Level' has a wrong offset!");

// Function BP_LevelManager.BP_LevelManager_C.CallbackSetAreaVisibleFinishedAndSetPlayer
// 0x0008 (0x0008 - 0x0000)
struct BP_LevelManager_C_CallbackSetAreaVisibleFinishedAndSetPlayer final
{
public:
	class FName                                   AreaName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelManager_C_CallbackSetAreaVisibleFinishedAndSetPlayer) == 0x000004, "Wrong alignment on BP_LevelManager_C_CallbackSetAreaVisibleFinishedAndSetPlayer");
static_assert(sizeof(BP_LevelManager_C_CallbackSetAreaVisibleFinishedAndSetPlayer) == 0x000008, "Wrong size on BP_LevelManager_C_CallbackSetAreaVisibleFinishedAndSetPlayer");
static_assert(offsetof(BP_LevelManager_C_CallbackSetAreaVisibleFinishedAndSetPlayer, AreaName) == 0x000000, "Member 'BP_LevelManager_C_CallbackSetAreaVisibleFinishedAndSetPlayer::AreaName' has a wrong offset!");

// Function BP_LevelManager.BP_LevelManager_C.BindSetPlayerStartAfterFinishAreaVisible
// 0x0010 (0x0010 - 0x0000)
struct BP_LevelManager_C_BindSetPlayerStartAfterFinishAreaVisible final
{
public:
	class FString                                 PortalName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelManager_C_BindSetPlayerStartAfterFinishAreaVisible) == 0x000008, "Wrong alignment on BP_LevelManager_C_BindSetPlayerStartAfterFinishAreaVisible");
static_assert(sizeof(BP_LevelManager_C_BindSetPlayerStartAfterFinishAreaVisible) == 0x000010, "Wrong size on BP_LevelManager_C_BindSetPlayerStartAfterFinishAreaVisible");
static_assert(offsetof(BP_LevelManager_C_BindSetPlayerStartAfterFinishAreaVisible, PortalName) == 0x000000, "Member 'BP_LevelManager_C_BindSetPlayerStartAfterFinishAreaVisible::PortalName' has a wrong offset!");

// Function BP_LevelManager.BP_LevelManager_C.EventFinishUnloadPackDispatcher_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BP_LevelManager_C_EventFinishUnloadPackDispatcher_Event_0 final
{
public:
	struct FPrimaryAssetType                      Pack;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelManager_C_EventFinishUnloadPackDispatcher_Event_0) == 0x000004, "Wrong alignment on BP_LevelManager_C_EventFinishUnloadPackDispatcher_Event_0");
static_assert(sizeof(BP_LevelManager_C_EventFinishUnloadPackDispatcher_Event_0) == 0x000008, "Wrong size on BP_LevelManager_C_EventFinishUnloadPackDispatcher_Event_0");
static_assert(offsetof(BP_LevelManager_C_EventFinishUnloadPackDispatcher_Event_0, Pack) == 0x000000, "Member 'BP_LevelManager_C_EventFinishUnloadPackDispatcher_Event_0::Pack' has a wrong offset!");

// Function BP_LevelManager.BP_LevelManager_C.EventFinishLoadPackDispatcher_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BP_LevelManager_C_EventFinishLoadPackDispatcher_Event_0 final
{
public:
	struct FPrimaryAssetType                      Pack;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelManager_C_EventFinishLoadPackDispatcher_Event_0) == 0x000004, "Wrong alignment on BP_LevelManager_C_EventFinishLoadPackDispatcher_Event_0");
static_assert(sizeof(BP_LevelManager_C_EventFinishLoadPackDispatcher_Event_0) == 0x000008, "Wrong size on BP_LevelManager_C_EventFinishLoadPackDispatcher_Event_0");
static_assert(offsetof(BP_LevelManager_C_EventFinishLoadPackDispatcher_Event_0, Pack) == 0x000000, "Member 'BP_LevelManager_C_EventFinishLoadPackDispatcher_Event_0::Pack' has a wrong offset!");

// Function BP_LevelManager.BP_LevelManager_C.EventFinishLoadAreaDispatcher_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BP_LevelManager_C_EventFinishLoadAreaDispatcher_Event_0 final
{
public:
	class FName                                   AreaName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelManager_C_EventFinishLoadAreaDispatcher_Event_0) == 0x000004, "Wrong alignment on BP_LevelManager_C_EventFinishLoadAreaDispatcher_Event_0");
static_assert(sizeof(BP_LevelManager_C_EventFinishLoadAreaDispatcher_Event_0) == 0x000008, "Wrong size on BP_LevelManager_C_EventFinishLoadAreaDispatcher_Event_0");
static_assert(offsetof(BP_LevelManager_C_EventFinishLoadAreaDispatcher_Event_0, AreaName) == 0x000000, "Member 'BP_LevelManager_C_EventFinishLoadAreaDispatcher_Event_0::AreaName' has a wrong offset!");

// Function BP_LevelManager.BP_LevelManager_C.RequestLoadAreaImmediateByAreaName
// 0x001C (0x001C - 0x0000)
struct BP_LevelManager_C_RequestLoadAreaImmediateByAreaName final
{
public:
	class FName                                   AreaName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SetVisbleAfterLoad;                                // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          SkipEnemyLevels;                                   // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          SkipEventLevels;                                   // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          _needUpdateLevels;                                 // 0x000B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_AddLevelCommand_CommandNum;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddLevelCommand_CommandNum_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddLevelCommand_CommandNum_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddLevelCommand_CommandNum_3;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelManager_C_RequestLoadAreaImmediateByAreaName) == 0x000004, "Wrong alignment on BP_LevelManager_C_RequestLoadAreaImmediateByAreaName");
static_assert(sizeof(BP_LevelManager_C_RequestLoadAreaImmediateByAreaName) == 0x00001C, "Wrong size on BP_LevelManager_C_RequestLoadAreaImmediateByAreaName");
static_assert(offsetof(BP_LevelManager_C_RequestLoadAreaImmediateByAreaName, AreaName) == 0x000000, "Member 'BP_LevelManager_C_RequestLoadAreaImmediateByAreaName::AreaName' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_RequestLoadAreaImmediateByAreaName, SetVisbleAfterLoad) == 0x000008, "Member 'BP_LevelManager_C_RequestLoadAreaImmediateByAreaName::SetVisbleAfterLoad' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_RequestLoadAreaImmediateByAreaName, SkipEnemyLevels) == 0x000009, "Member 'BP_LevelManager_C_RequestLoadAreaImmediateByAreaName::SkipEnemyLevels' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_RequestLoadAreaImmediateByAreaName, SkipEventLevels) == 0x00000A, "Member 'BP_LevelManager_C_RequestLoadAreaImmediateByAreaName::SkipEventLevels' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_RequestLoadAreaImmediateByAreaName, _needUpdateLevels) == 0x00000B, "Member 'BP_LevelManager_C_RequestLoadAreaImmediateByAreaName::_needUpdateLevels' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_RequestLoadAreaImmediateByAreaName, CallFunc_AddLevelCommand_CommandNum) == 0x00000C, "Member 'BP_LevelManager_C_RequestLoadAreaImmediateByAreaName::CallFunc_AddLevelCommand_CommandNum' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_RequestLoadAreaImmediateByAreaName, CallFunc_AddLevelCommand_CommandNum_1) == 0x000010, "Member 'BP_LevelManager_C_RequestLoadAreaImmediateByAreaName::CallFunc_AddLevelCommand_CommandNum_1' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_RequestLoadAreaImmediateByAreaName, CallFunc_AddLevelCommand_CommandNum_2) == 0x000014, "Member 'BP_LevelManager_C_RequestLoadAreaImmediateByAreaName::CallFunc_AddLevelCommand_CommandNum_2' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_RequestLoadAreaImmediateByAreaName, CallFunc_AddLevelCommand_CommandNum_3) == 0x000018, "Member 'BP_LevelManager_C_RequestLoadAreaImmediateByAreaName::CallFunc_AddLevelCommand_CommandNum_3' has a wrong offset!");

// Function BP_LevelManager.BP_LevelManager_C.SetCurrentArea
// 0x0188 (0x0188 - 0x0000)
struct BP_LevelManager_C_SetCurrentArea final
{
public:
	class FName                                   AreaName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAreaInLoadedAreaInfosWithCondition_IsLoaded; // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAreaInLoadedAreaInfosWithCondition_IsExist; // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D0C[0x5];                                      // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_AreaInfo                            CallFunc_IsAreaInLoadedAreaInfosWithCondition_AreaInfo; // 0x0010(0x0068)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	E_SceneType                                   CallFunc_SetCurrentSceneType_OldSceneType;         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D0D[0x7];                                      // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x00A0(0x0018)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x00B8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00D0(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0110(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0150(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0160(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelManager_C_SetCurrentArea) == 0x000008, "Wrong alignment on BP_LevelManager_C_SetCurrentArea");
static_assert(sizeof(BP_LevelManager_C_SetCurrentArea) == 0x000188, "Wrong size on BP_LevelManager_C_SetCurrentArea");
static_assert(offsetof(BP_LevelManager_C_SetCurrentArea, AreaName) == 0x000000, "Member 'BP_LevelManager_C_SetCurrentArea::AreaName' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_SetCurrentArea, Result) == 0x000008, "Member 'BP_LevelManager_C_SetCurrentArea::Result' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_SetCurrentArea, CallFunc_IsAreaInLoadedAreaInfosWithCondition_IsLoaded) == 0x000009, "Member 'BP_LevelManager_C_SetCurrentArea::CallFunc_IsAreaInLoadedAreaInfosWithCondition_IsLoaded' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_SetCurrentArea, CallFunc_IsAreaInLoadedAreaInfosWithCondition_IsExist) == 0x00000A, "Member 'BP_LevelManager_C_SetCurrentArea::CallFunc_IsAreaInLoadedAreaInfosWithCondition_IsExist' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_SetCurrentArea, CallFunc_IsAreaInLoadedAreaInfosWithCondition_AreaInfo) == 0x000010, "Member 'BP_LevelManager_C_SetCurrentArea::CallFunc_IsAreaInLoadedAreaInfosWithCondition_AreaInfo' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_SetCurrentArea, CallFunc_Conv_NameToString_ReturnValue) == 0x000078, "Member 'BP_LevelManager_C_SetCurrentArea::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_SetCurrentArea, CallFunc_Concat_StrStr_ReturnValue) == 0x000088, "Member 'BP_LevelManager_C_SetCurrentArea::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_SetCurrentArea, CallFunc_SetCurrentSceneType_OldSceneType) == 0x000098, "Member 'BP_LevelManager_C_SetCurrentArea::CallFunc_SetCurrentSceneType_OldSceneType' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_SetCurrentArea, CallFunc_Conv_NameToText_ReturnValue) == 0x0000A0, "Member 'BP_LevelManager_C_SetCurrentArea::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_SetCurrentArea, CallFunc_Conv_NameToText_ReturnValue_1) == 0x0000B8, "Member 'BP_LevelManager_C_SetCurrentArea::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_SetCurrentArea, K2Node_MakeStruct_FormatArgumentData) == 0x0000D0, "Member 'BP_LevelManager_C_SetCurrentArea::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_SetCurrentArea, K2Node_MakeStruct_FormatArgumentData_1) == 0x000110, "Member 'BP_LevelManager_C_SetCurrentArea::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_SetCurrentArea, K2Node_MakeArray_Array) == 0x000150, "Member 'BP_LevelManager_C_SetCurrentArea::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_SetCurrentArea, CallFunc_Format_ReturnValue) == 0x000160, "Member 'BP_LevelManager_C_SetCurrentArea::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelManager_C_SetCurrentArea, CallFunc_Conv_TextToString_ReturnValue) == 0x000178, "Member 'BP_LevelManager_C_SetCurrentArea::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function BP_LevelManager.BP_LevelManager_C.CleanLoadedAreaInfos
// 0x0098 (0x0098 - 0x0000)
struct BP_LevelManager_C_CleanLoadedAreaInfos final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0008(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
