#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MakeRushEventActor

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_MakeRushEventActor.BP_MakeRushEventActor_C.ExecuteUbergraph_BP_MakeRushEventActor
// 0x0098 (0x0098 - 0x0000)
struct BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73E2[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RushEventTriggerBox_C*              K2Node_DynamicCast_AsBP_Rush_Event_Trigger_Box;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73E3[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73E4[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73E5[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckScenarioFlag_FlagValue;              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartBattlefield_ReturnValue;             // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73E6[0x6];                                     // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattlefieldManager*                    CallFunc_GetBattleFieldManager_BattleFieldManager; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OverwriteTmpBfInfo_ReturnValue;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73E7[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BattlefieldManager_C*               K2Node_DynamicCast_AsBP_Battlefield_Manager;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73E8[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor) == 0x000008, "Wrong alignment on BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor");
static_assert(sizeof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor) == 0x000098, "Wrong size on BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor");
static_assert(offsetof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor, EntryPoint) == 0x000000, "Member 'BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor, Temp_int_Loop_Num_Variable) == 0x000008, "Member 'BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor, K2Node_DynamicCast_AsBP_Rush_Event_Trigger_Box) == 0x000018, "Member 'BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor::K2Node_DynamicCast_AsBP_Rush_Event_Trigger_Box' has a wrong offset!");
static_assert(offsetof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor, CallFunc_Conv_NameToString_ReturnValue) == 0x000028, "Member 'BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000038, "Member 'BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor, CallFunc_GetDisplayName_ReturnValue) == 0x000040, "Member 'BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000050, "Member 'BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor, CallFunc_SelectString_ReturnValue) == 0x000058, "Member 'BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor, CallFunc_CheckScenarioFlag_FlagValue) == 0x000068, "Member 'BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor::CallFunc_CheckScenarioFlag_FlagValue' has a wrong offset!");
static_assert(offsetof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor, CallFunc_StartBattlefield_ReturnValue) == 0x000069, "Member 'BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor::CallFunc_StartBattlefield_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor, CallFunc_GetBattleFieldManager_BattleFieldManager) == 0x000070, "Member 'BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor::CallFunc_GetBattleFieldManager_BattleFieldManager' has a wrong offset!");
static_assert(offsetof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor, CallFunc_OverwriteTmpBfInfo_ReturnValue) == 0x000078, "Member 'BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor::CallFunc_OverwriteTmpBfInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor, K2Node_DynamicCast_AsBP_Battlefield_Manager) == 0x000080, "Member 'BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor::K2Node_DynamicCast_AsBP_Battlefield_Manager' has a wrong offset!");
static_assert(offsetof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor, Temp_int_Array_Index_Variable) == 0x00008C, "Member 'BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000090, "Member 'BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000091, "Member 'BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor, CallFunc_BooleanAND_ReturnValue) == 0x000092, "Member 'BP_MakeRushEventActor_C_ExecuteUbergraph_BP_MakeRushEventActor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

