#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MenuPlayerBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_MenuPlayerBase.BP_MenuPlayerBase_C.ExecuteUbergraph_BP_MenuPlayerBase
// 0x0020 (0x0020 - 0x0000)
struct BP_MenuPlayerBase_C_ExecuteUbergraph_BP_MenuPlayerBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetCharacterInfiniteBoundsSockets_Sockets; // 0x0008(0x0010)(ReferenceParm, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuPlayerBase_C_ExecuteUbergraph_BP_MenuPlayerBase) == 0x000008, "Wrong alignment on BP_MenuPlayerBase_C_ExecuteUbergraph_BP_MenuPlayerBase");
static_assert(sizeof(BP_MenuPlayerBase_C_ExecuteUbergraph_BP_MenuPlayerBase) == 0x000020, "Wrong size on BP_MenuPlayerBase_C_ExecuteUbergraph_BP_MenuPlayerBase");
static_assert(offsetof(BP_MenuPlayerBase_C_ExecuteUbergraph_BP_MenuPlayerBase, EntryPoint) == 0x000000, "Member 'BP_MenuPlayerBase_C_ExecuteUbergraph_BP_MenuPlayerBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_ExecuteUbergraph_BP_MenuPlayerBase, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_MenuPlayerBase_C_ExecuteUbergraph_BP_MenuPlayerBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_ExecuteUbergraph_BP_MenuPlayerBase, CallFunc_GetCharacterInfiniteBoundsSockets_Sockets) == 0x000008, "Member 'BP_MenuPlayerBase_C_ExecuteUbergraph_BP_MenuPlayerBase::CallFunc_GetCharacterInfiniteBoundsSockets_Sockets' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_ExecuteUbergraph_BP_MenuPlayerBase, K2Node_Event_EndPlayReason) == 0x000018, "Member 'BP_MenuPlayerBase_C_ExecuteUbergraph_BP_MenuPlayerBase::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BP_MenuPlayerBase.BP_MenuPlayerBase_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_MenuPlayerBase_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuPlayerBase_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_MenuPlayerBase_C_ReceiveEndPlay");
static_assert(sizeof(BP_MenuPlayerBase_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_MenuPlayerBase_C_ReceiveEndPlay");
static_assert(offsetof(BP_MenuPlayerBase_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_MenuPlayerBase_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_MenuPlayerBase.BP_MenuPlayerBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_MenuPlayerBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuPlayerBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_MenuPlayerBase_C_ReceiveTick");
static_assert(sizeof(BP_MenuPlayerBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_MenuPlayerBase_C_ReceiveTick");
static_assert(offsetof(BP_MenuPlayerBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_MenuPlayerBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_MenuPlayerBase.BP_MenuPlayerBase_C.StartUIMainAnimation
// 0x0028 (0x0028 - 0x0000)
struct BP_MenuPlayerBase_C_StartUIMainAnimation final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CallFunc_GetWeaponMeshes_Meshes;                   // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MenuPlayerBase_C_StartUIMainAnimation) == 0x000008, "Wrong alignment on BP_MenuPlayerBase_C_StartUIMainAnimation");
static_assert(sizeof(BP_MenuPlayerBase_C_StartUIMainAnimation) == 0x000028, "Wrong size on BP_MenuPlayerBase_C_StartUIMainAnimation");
static_assert(offsetof(BP_MenuPlayerBase_C_StartUIMainAnimation, Temp_int_Variable) == 0x000000, "Member 'BP_MenuPlayerBase_C_StartUIMainAnimation::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_StartUIMainAnimation, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_MenuPlayerBase_C_StartUIMainAnimation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_StartUIMainAnimation, CallFunc_GetWeaponMeshes_Meshes) == 0x000008, "Member 'BP_MenuPlayerBase_C_StartUIMainAnimation::CallFunc_GetWeaponMeshes_Meshes' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_StartUIMainAnimation, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_MenuPlayerBase_C_StartUIMainAnimation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_StartUIMainAnimation, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_MenuPlayerBase_C_StartUIMainAnimation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_StartUIMainAnimation, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'BP_MenuPlayerBase_C_StartUIMainAnimation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_MenuPlayerBase.BP_MenuPlayerBase_C.LoadAsset
// 0x0060 (0x0060 - 0x0000)
struct BP_MenuPlayerBase_C_LoadAsset final
{
public:
	TArray<class UAnimMontage*>                   CallFunc_PrivateLoadMontage_MontageObject;         // 0x0000(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   CallFunc_PrivateLoadMontage_MontageObject_1;       // 0x0010(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   CallFunc_PrivateLoadMontage_MontageObject_2;       // 0x0020(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   CallFunc_PrivateLoadMontage_MontageObject_3;       // 0x0030(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   CallFunc_PrivateLoadMontage_MontageObject_4;       // 0x0040(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   CallFunc_PrivateLoadMontage_MontageObject_5;       // 0x0050(0x0010)(ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuPlayerBase_C_LoadAsset) == 0x000008, "Wrong alignment on BP_MenuPlayerBase_C_LoadAsset");
static_assert(sizeof(BP_MenuPlayerBase_C_LoadAsset) == 0x000060, "Wrong size on BP_MenuPlayerBase_C_LoadAsset");
static_assert(offsetof(BP_MenuPlayerBase_C_LoadAsset, CallFunc_PrivateLoadMontage_MontageObject) == 0x000000, "Member 'BP_MenuPlayerBase_C_LoadAsset::CallFunc_PrivateLoadMontage_MontageObject' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_LoadAsset, CallFunc_PrivateLoadMontage_MontageObject_1) == 0x000010, "Member 'BP_MenuPlayerBase_C_LoadAsset::CallFunc_PrivateLoadMontage_MontageObject_1' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_LoadAsset, CallFunc_PrivateLoadMontage_MontageObject_2) == 0x000020, "Member 'BP_MenuPlayerBase_C_LoadAsset::CallFunc_PrivateLoadMontage_MontageObject_2' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_LoadAsset, CallFunc_PrivateLoadMontage_MontageObject_3) == 0x000030, "Member 'BP_MenuPlayerBase_C_LoadAsset::CallFunc_PrivateLoadMontage_MontageObject_3' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_LoadAsset, CallFunc_PrivateLoadMontage_MontageObject_4) == 0x000040, "Member 'BP_MenuPlayerBase_C_LoadAsset::CallFunc_PrivateLoadMontage_MontageObject_4' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_LoadAsset, CallFunc_PrivateLoadMontage_MontageObject_5) == 0x000050, "Member 'BP_MenuPlayerBase_C_LoadAsset::CallFunc_PrivateLoadMontage_MontageObject_5' has a wrong offset!");

// Function BP_MenuPlayerBase.BP_MenuPlayerBase_C.PrivateSetupVisibility
// 0x0060 (0x0060 - 0x0000)
struct BP_MenuPlayerBase_C_PrivateSetupVisibility final
{
public:
	TArray<class FName>                           MaterialSlotName;                                  // 0x0000(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWireVisibleOffEvent_IsOffWireEvent;     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BA8[0x1];                                     // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BA9[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue;         // 0x0030(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8BAA[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MenuPlayerBase_C_PrivateSetupVisibility) == 0x000008, "Wrong alignment on BP_MenuPlayerBase_C_PrivateSetupVisibility");
static_assert(sizeof(BP_MenuPlayerBase_C_PrivateSetupVisibility) == 0x000060, "Wrong size on BP_MenuPlayerBase_C_PrivateSetupVisibility");
static_assert(offsetof(BP_MenuPlayerBase_C_PrivateSetupVisibility, MaterialSlotName) == 0x000000, "Member 'BP_MenuPlayerBase_C_PrivateSetupVisibility::MaterialSlotName' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_PrivateSetupVisibility, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_MenuPlayerBase_C_PrivateSetupVisibility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_PrivateSetupVisibility, Temp_int_Loop_Num_Variable) == 0x000014, "Member 'BP_MenuPlayerBase_C_PrivateSetupVisibility::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_PrivateSetupVisibility, CallFunc_GetEventManager_EventManager) == 0x000018, "Member 'BP_MenuPlayerBase_C_PrivateSetupVisibility::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_PrivateSetupVisibility, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_MenuPlayerBase_C_PrivateSetupVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_PrivateSetupVisibility, CallFunc_IsWireVisibleOffEvent_IsOffWireEvent) == 0x000021, "Member 'BP_MenuPlayerBase_C_PrivateSetupVisibility::CallFunc_IsWireVisibleOffEvent_IsOffWireEvent' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_PrivateSetupVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'BP_MenuPlayerBase_C_PrivateSetupVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_PrivateSetupVisibility, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_MenuPlayerBase_C_PrivateSetupVisibility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_PrivateSetupVisibility, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'BP_MenuPlayerBase_C_PrivateSetupVisibility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_PrivateSetupVisibility, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BP_MenuPlayerBase_C_PrivateSetupVisibility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_PrivateSetupVisibility, CallFunc_GetMaterialSlotNames_ReturnValue) == 0x000030, "Member 'BP_MenuPlayerBase_C_PrivateSetupVisibility::CallFunc_GetMaterialSlotNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_PrivateSetupVisibility, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_MenuPlayerBase_C_PrivateSetupVisibility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_PrivateSetupVisibility, CallFunc_Conv_NameToString_ReturnValue) == 0x000048, "Member 'BP_MenuPlayerBase_C_PrivateSetupVisibility::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_PrivateSetupVisibility, CallFunc_FindSubstring_ReturnValue) == 0x000058, "Member 'BP_MenuPlayerBase_C_PrivateSetupVisibility::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_PrivateSetupVisibility, CallFunc_Greater_IntInt_ReturnValue) == 0x00005C, "Member 'BP_MenuPlayerBase_C_PrivateSetupVisibility::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_PrivateSetupVisibility, CallFunc_IsValid_ReturnValue_1) == 0x00005D, "Member 'BP_MenuPlayerBase_C_PrivateSetupVisibility::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_MenuPlayerBase.BP_MenuPlayerBase_C.StartUIMainEquipAnimation
// 0x0048 (0x0048 - 0x0000)
struct BP_MenuPlayerBase_C_StartUIMainEquipAnimation final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BAB[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8BAC[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetWeaponMeshes_Meshes;                   // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8BAD[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MenuPlayerBase_C_StartUIMainEquipAnimation) == 0x000008, "Wrong alignment on BP_MenuPlayerBase_C_StartUIMainEquipAnimation");
static_assert(sizeof(BP_MenuPlayerBase_C_StartUIMainEquipAnimation) == 0x000048, "Wrong size on BP_MenuPlayerBase_C_StartUIMainEquipAnimation");
static_assert(offsetof(BP_MenuPlayerBase_C_StartUIMainEquipAnimation, Temp_int_Variable) == 0x000000, "Member 'BP_MenuPlayerBase_C_StartUIMainEquipAnimation::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_StartUIMainEquipAnimation, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_MenuPlayerBase_C_StartUIMainEquipAnimation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_StartUIMainEquipAnimation, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_MenuPlayerBase_C_StartUIMainEquipAnimation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_StartUIMainEquipAnimation, Temp_int_Loop_Num_Variable) == 0x00000C, "Member 'BP_MenuPlayerBase_C_StartUIMainEquipAnimation::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_StartUIMainEquipAnimation, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_MenuPlayerBase_C_StartUIMainEquipAnimation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_StartUIMainEquipAnimation, CallFunc_Less_IntInt_ReturnValue) == 0x000014, "Member 'BP_MenuPlayerBase_C_StartUIMainEquipAnimation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_StartUIMainEquipAnimation, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'BP_MenuPlayerBase_C_StartUIMainEquipAnimation::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_StartUIMainEquipAnimation, CallFunc_GetWeaponMeshes_Meshes) == 0x000020, "Member 'BP_MenuPlayerBase_C_StartUIMainEquipAnimation::CallFunc_GetWeaponMeshes_Meshes' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_StartUIMainEquipAnimation, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_MenuPlayerBase_C_StartUIMainEquipAnimation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_StartUIMainEquipAnimation, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_MenuPlayerBase_C_StartUIMainEquipAnimation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_StartUIMainEquipAnimation, CallFunc_Array_Length_ReturnValue_1) == 0x000040, "Member 'BP_MenuPlayerBase_C_StartUIMainEquipAnimation::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_StartUIMainEquipAnimation, CallFunc_Less_IntInt_ReturnValue_1) == 0x000044, "Member 'BP_MenuPlayerBase_C_StartUIMainEquipAnimation::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_MenuPlayerBase.BP_MenuPlayerBase_C.StartUIMainCostumeAnimation
// 0x0028 (0x0028 - 0x0000)
struct BP_MenuPlayerBase_C_StartUIMainCostumeAnimation final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CallFunc_GetWeaponMeshes_Meshes;                   // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MenuPlayerBase_C_StartUIMainCostumeAnimation) == 0x000008, "Wrong alignment on BP_MenuPlayerBase_C_StartUIMainCostumeAnimation");
static_assert(sizeof(BP_MenuPlayerBase_C_StartUIMainCostumeAnimation) == 0x000028, "Wrong size on BP_MenuPlayerBase_C_StartUIMainCostumeAnimation");
static_assert(offsetof(BP_MenuPlayerBase_C_StartUIMainCostumeAnimation, Temp_int_Variable) == 0x000000, "Member 'BP_MenuPlayerBase_C_StartUIMainCostumeAnimation::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_StartUIMainCostumeAnimation, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_MenuPlayerBase_C_StartUIMainCostumeAnimation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_StartUIMainCostumeAnimation, CallFunc_GetWeaponMeshes_Meshes) == 0x000008, "Member 'BP_MenuPlayerBase_C_StartUIMainCostumeAnimation::CallFunc_GetWeaponMeshes_Meshes' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_StartUIMainCostumeAnimation, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_MenuPlayerBase_C_StartUIMainCostumeAnimation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_StartUIMainCostumeAnimation, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_MenuPlayerBase_C_StartUIMainCostumeAnimation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_StartUIMainCostumeAnimation, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'BP_MenuPlayerBase_C_StartUIMainCostumeAnimation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_MenuPlayerBase.BP_MenuPlayerBase_C.SetRenderLayer
// 0x0058 (0x0058 - 0x0000)
struct BP_MenuPlayerBase_C_SetRenderLayer final
{
public:
	uint8                                         Layer;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8BAE[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        Component;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                Components;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BAF[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BB0[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuPlayerBase_C_SetRenderLayer) == 0x000008, "Wrong alignment on BP_MenuPlayerBase_C_SetRenderLayer");
static_assert(sizeof(BP_MenuPlayerBase_C_SetRenderLayer) == 0x000058, "Wrong size on BP_MenuPlayerBase_C_SetRenderLayer");
static_assert(offsetof(BP_MenuPlayerBase_C_SetRenderLayer, Layer) == 0x000000, "Member 'BP_MenuPlayerBase_C_SetRenderLayer::Layer' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetRenderLayer, Component) == 0x000008, "Member 'BP_MenuPlayerBase_C_SetRenderLayer::Component' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetRenderLayer, Components) == 0x000010, "Member 'BP_MenuPlayerBase_C_SetRenderLayer::Components' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetRenderLayer, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_MenuPlayerBase_C_SetRenderLayer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetRenderLayer, Temp_int_Array_Index_Variable) == 0x000024, "Member 'BP_MenuPlayerBase_C_SetRenderLayer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetRenderLayer, Temp_int_Loop_Num_Variable) == 0x000028, "Member 'BP_MenuPlayerBase_C_SetRenderLayer::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetRenderLayer, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BP_MenuPlayerBase_C_SetRenderLayer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetRenderLayer, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_MenuPlayerBase_C_SetRenderLayer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetRenderLayer, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'BP_MenuPlayerBase_C_SetRenderLayer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetRenderLayer, K2Node_DynamicCast_AsPrimitive_Component) == 0x000038, "Member 'BP_MenuPlayerBase_C_SetRenderLayer::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetRenderLayer, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_MenuPlayerBase_C_SetRenderLayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetRenderLayer, CallFunc_GetChildrenComponents_Children) == 0x000048, "Member 'BP_MenuPlayerBase_C_SetRenderLayer::CallFunc_GetChildrenComponents_Children' has a wrong offset!");

// Function BP_MenuPlayerBase.BP_MenuPlayerBase_C.SetLightChannel
// 0x0058 (0x0058 - 0x0000)
struct BP_MenuPlayerBase_C_SetLightChannel final
{
public:
	bool                                          Channel0;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Channel1;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Channel2;                                          // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BB1[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        Component;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                Components;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BB2[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BB3[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuPlayerBase_C_SetLightChannel) == 0x000008, "Wrong alignment on BP_MenuPlayerBase_C_SetLightChannel");
static_assert(sizeof(BP_MenuPlayerBase_C_SetLightChannel) == 0x000058, "Wrong size on BP_MenuPlayerBase_C_SetLightChannel");
static_assert(offsetof(BP_MenuPlayerBase_C_SetLightChannel, Channel0) == 0x000000, "Member 'BP_MenuPlayerBase_C_SetLightChannel::Channel0' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetLightChannel, Channel1) == 0x000001, "Member 'BP_MenuPlayerBase_C_SetLightChannel::Channel1' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetLightChannel, Channel2) == 0x000002, "Member 'BP_MenuPlayerBase_C_SetLightChannel::Channel2' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetLightChannel, Component) == 0x000008, "Member 'BP_MenuPlayerBase_C_SetLightChannel::Component' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetLightChannel, Components) == 0x000010, "Member 'BP_MenuPlayerBase_C_SetLightChannel::Components' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetLightChannel, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_MenuPlayerBase_C_SetLightChannel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetLightChannel, Temp_int_Array_Index_Variable) == 0x000024, "Member 'BP_MenuPlayerBase_C_SetLightChannel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetLightChannel, Temp_int_Loop_Num_Variable) == 0x000028, "Member 'BP_MenuPlayerBase_C_SetLightChannel::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetLightChannel, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BP_MenuPlayerBase_C_SetLightChannel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetLightChannel, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_MenuPlayerBase_C_SetLightChannel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetLightChannel, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'BP_MenuPlayerBase_C_SetLightChannel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetLightChannel, K2Node_DynamicCast_AsPrimitive_Component) == 0x000038, "Member 'BP_MenuPlayerBase_C_SetLightChannel::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetLightChannel, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_MenuPlayerBase_C_SetLightChannel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetLightChannel, CallFunc_GetChildrenComponents_Children) == 0x000048, "Member 'BP_MenuPlayerBase_C_SetLightChannel::CallFunc_GetChildrenComponents_Children' has a wrong offset!");

// Function BP_MenuPlayerBase.BP_MenuPlayerBase_C.SetPauseFlag
// 0x0048 (0x0048 - 0x0000)
struct BP_MenuPlayerBase_C_SetPauseFlag final
{
public:
	int32                                         PauseFlag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8BB4[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        Component;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                Components;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BB5[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuPlayerBase_C_SetPauseFlag) == 0x000008, "Wrong alignment on BP_MenuPlayerBase_C_SetPauseFlag");
static_assert(sizeof(BP_MenuPlayerBase_C_SetPauseFlag) == 0x000048, "Wrong size on BP_MenuPlayerBase_C_SetPauseFlag");
static_assert(offsetof(BP_MenuPlayerBase_C_SetPauseFlag, PauseFlag) == 0x000000, "Member 'BP_MenuPlayerBase_C_SetPauseFlag::PauseFlag' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetPauseFlag, Component) == 0x000008, "Member 'BP_MenuPlayerBase_C_SetPauseFlag::Component' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetPauseFlag, Components) == 0x000010, "Member 'BP_MenuPlayerBase_C_SetPauseFlag::Components' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetPauseFlag, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_MenuPlayerBase_C_SetPauseFlag::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetPauseFlag, Temp_int_Array_Index_Variable) == 0x000024, "Member 'BP_MenuPlayerBase_C_SetPauseFlag::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetPauseFlag, Temp_int_Loop_Num_Variable) == 0x000028, "Member 'BP_MenuPlayerBase_C_SetPauseFlag::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetPauseFlag, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BP_MenuPlayerBase_C_SetPauseFlag::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetPauseFlag, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_MenuPlayerBase_C_SetPauseFlag::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetPauseFlag, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'BP_MenuPlayerBase_C_SetPauseFlag::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetPauseFlag, CallFunc_GetChildrenComponents_Children) == 0x000038, "Member 'BP_MenuPlayerBase_C_SetPauseFlag::CallFunc_GetChildrenComponents_Children' has a wrong offset!");

// Function BP_MenuPlayerBase.BP_MenuPlayerBase_C.SwitchWeaponBattle
// 0x001C (0x001C - 0x0000)
struct BP_MenuPlayerBase_C_SwitchWeaponBattle final
{
public:
	bool                                          Battle;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BB6[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SocketName;                                        // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BB7[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MenuPlayerBase_C_SwitchWeaponBattle) == 0x000004, "Wrong alignment on BP_MenuPlayerBase_C_SwitchWeaponBattle");
static_assert(sizeof(BP_MenuPlayerBase_C_SwitchWeaponBattle) == 0x00001C, "Wrong size on BP_MenuPlayerBase_C_SwitchWeaponBattle");
static_assert(offsetof(BP_MenuPlayerBase_C_SwitchWeaponBattle, Battle) == 0x000000, "Member 'BP_MenuPlayerBase_C_SwitchWeaponBattle::Battle' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SwitchWeaponBattle, SocketName) == 0x000004, "Member 'BP_MenuPlayerBase_C_SwitchWeaponBattle::SocketName' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SwitchWeaponBattle, Temp_bool_Variable) == 0x00000C, "Member 'BP_MenuPlayerBase_C_SwitchWeaponBattle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SwitchWeaponBattle, K2Node_Select_Default) == 0x000010, "Member 'BP_MenuPlayerBase_C_SwitchWeaponBattle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SwitchWeaponBattle, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000018, "Member 'BP_MenuPlayerBase_C_SwitchWeaponBattle::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function BP_MenuPlayerBase.BP_MenuPlayerBase_C.BeginSASTelepo
// 0x0004 (0x0004 - 0x0000)
struct BP_MenuPlayerBase_C_BeginSASTelepo final
{
public:
	float                                         DisappearTime;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuPlayerBase_C_BeginSASTelepo) == 0x000004, "Wrong alignment on BP_MenuPlayerBase_C_BeginSASTelepo");
static_assert(sizeof(BP_MenuPlayerBase_C_BeginSASTelepo) == 0x000004, "Wrong size on BP_MenuPlayerBase_C_BeginSASTelepo");
static_assert(offsetof(BP_MenuPlayerBase_C_BeginSASTelepo, DisappearTime) == 0x000000, "Member 'BP_MenuPlayerBase_C_BeginSASTelepo::DisappearTime' has a wrong offset!");

// Function BP_MenuPlayerBase.BP_MenuPlayerBase_C.EndSASTelepo
// 0x0004 (0x0004 - 0x0000)
struct BP_MenuPlayerBase_C_EndSASTelepo final
{
public:
	float                                         AppearTime;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuPlayerBase_C_EndSASTelepo) == 0x000004, "Wrong alignment on BP_MenuPlayerBase_C_EndSASTelepo");
static_assert(sizeof(BP_MenuPlayerBase_C_EndSASTelepo) == 0x000004, "Wrong size on BP_MenuPlayerBase_C_EndSASTelepo");
static_assert(offsetof(BP_MenuPlayerBase_C_EndSASTelepo, AppearTime) == 0x000000, "Member 'BP_MenuPlayerBase_C_EndSASTelepo::AppearTime' has a wrong offset!");

// Function BP_MenuPlayerBase.BP_MenuPlayerBase_C.UpdateTelepo
// 0x0040 (0x0040 - 0x0000)
struct BP_MenuPlayerBase_C_UpdateTelepo final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BB8[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8BB9[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetWeaponMeshes_Meshes;                   // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOver_ReturnValue;                       // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BBA[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRate_ReturnValue;                      // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnable_ReturnValue;                     // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MenuPlayerBase_C_UpdateTelepo) == 0x000008, "Wrong alignment on BP_MenuPlayerBase_C_UpdateTelepo");
static_assert(sizeof(BP_MenuPlayerBase_C_UpdateTelepo) == 0x000040, "Wrong size on BP_MenuPlayerBase_C_UpdateTelepo");
static_assert(offsetof(BP_MenuPlayerBase_C_UpdateTelepo, Temp_int_Variable) == 0x000000, "Member 'BP_MenuPlayerBase_C_UpdateTelepo::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_UpdateTelepo, Temp_bool_Variable) == 0x000004, "Member 'BP_MenuPlayerBase_C_UpdateTelepo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_UpdateTelepo, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_MenuPlayerBase_C_UpdateTelepo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_UpdateTelepo, CallFunc_GetWeaponMeshes_Meshes) == 0x000010, "Member 'BP_MenuPlayerBase_C_UpdateTelepo::CallFunc_GetWeaponMeshes_Meshes' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_UpdateTelepo, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_MenuPlayerBase_C_UpdateTelepo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_UpdateTelepo, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_MenuPlayerBase_C_UpdateTelepo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_UpdateTelepo, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_MenuPlayerBase_C_UpdateTelepo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_UpdateTelepo, CallFunc_IsOver_ReturnValue) == 0x00002D, "Member 'BP_MenuPlayerBase_C_UpdateTelepo::CallFunc_IsOver_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_UpdateTelepo, CallFunc_GetRate_ReturnValue) == 0x000030, "Member 'BP_MenuPlayerBase_C_UpdateTelepo::CallFunc_GetRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_UpdateTelepo, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000034, "Member 'BP_MenuPlayerBase_C_UpdateTelepo::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_UpdateTelepo, K2Node_Select_Default) == 0x000038, "Member 'BP_MenuPlayerBase_C_UpdateTelepo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_UpdateTelepo, CallFunc_IsEnable_ReturnValue) == 0x00003C, "Member 'BP_MenuPlayerBase_C_UpdateTelepo::CallFunc_IsEnable_ReturnValue' has a wrong offset!");

// Function BP_MenuPlayerBase.BP_MenuPlayerBase_C.SetTransAnim
// 0x0001 (0x0001 - 0x0000)
struct BP_MenuPlayerBase_C_SetTransAnim final
{
public:
	bool                                          Battle;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MenuPlayerBase_C_SetTransAnim) == 0x000001, "Wrong alignment on BP_MenuPlayerBase_C_SetTransAnim");
static_assert(sizeof(BP_MenuPlayerBase_C_SetTransAnim) == 0x000001, "Wrong size on BP_MenuPlayerBase_C_SetTransAnim");
static_assert(offsetof(BP_MenuPlayerBase_C_SetTransAnim, Battle) == 0x000000, "Member 'BP_MenuPlayerBase_C_SetTransAnim::Battle' has a wrong offset!");

// Function BP_MenuPlayerBase.BP_MenuPlayerBase_C.GetOptionalMeshes
// 0x0010 (0x0010 - 0x0000)
struct BP_MenuPlayerBase_C_GetOptionalMeshes final
{
public:
	TArray<class USkeletalMeshComponent*>         Meshes;                                            // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuPlayerBase_C_GetOptionalMeshes) == 0x000008, "Wrong alignment on BP_MenuPlayerBase_C_GetOptionalMeshes");
static_assert(sizeof(BP_MenuPlayerBase_C_GetOptionalMeshes) == 0x000010, "Wrong size on BP_MenuPlayerBase_C_GetOptionalMeshes");
static_assert(offsetof(BP_MenuPlayerBase_C_GetOptionalMeshes, Meshes) == 0x000000, "Member 'BP_MenuPlayerBase_C_GetOptionalMeshes::Meshes' has a wrong offset!");

// Function BP_MenuPlayerBase.BP_MenuPlayerBase_C.GetWeaponMeshes
// 0x0020 (0x0020 - 0x0000)
struct BP_MenuPlayerBase_C_GetWeaponMeshes final
{
public:
	TArray<class USkeletalMeshComponent*>         Meshes;                                            // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuPlayerBase_C_GetWeaponMeshes) == 0x000008, "Wrong alignment on BP_MenuPlayerBase_C_GetWeaponMeshes");
static_assert(sizeof(BP_MenuPlayerBase_C_GetWeaponMeshes) == 0x000020, "Wrong size on BP_MenuPlayerBase_C_GetWeaponMeshes");
static_assert(offsetof(BP_MenuPlayerBase_C_GetWeaponMeshes, Meshes) == 0x000000, "Member 'BP_MenuPlayerBase_C_GetWeaponMeshes::Meshes' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_GetWeaponMeshes, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_MenuPlayerBase_C_GetWeaponMeshes::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_MenuPlayerBase.BP_MenuPlayerBase_C.SetMaterialScalarParameter
// 0x0070 (0x0070 - 0x0000)
struct BP_MenuPlayerBase_C_SetMaterialScalarParameter final
{
public:
	class FName                                   ParamName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Player;                                            // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Weapon;                                            // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BBB[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BBC[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8BBD[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetWeaponMeshes_Meshes;                   // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BBE[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetOptionalMeshes_Meshes;                 // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BBF[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BC0[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MenuPlayerBase_C_SetMaterialScalarParameter) == 0x000008, "Wrong alignment on BP_MenuPlayerBase_C_SetMaterialScalarParameter");
static_assert(sizeof(BP_MenuPlayerBase_C_SetMaterialScalarParameter) == 0x000070, "Wrong size on BP_MenuPlayerBase_C_SetMaterialScalarParameter");
static_assert(offsetof(BP_MenuPlayerBase_C_SetMaterialScalarParameter, ParamName) == 0x000000, "Member 'BP_MenuPlayerBase_C_SetMaterialScalarParameter::ParamName' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetMaterialScalarParameter, Value) == 0x000008, "Member 'BP_MenuPlayerBase_C_SetMaterialScalarParameter::Value' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetMaterialScalarParameter, Player) == 0x00000C, "Member 'BP_MenuPlayerBase_C_SetMaterialScalarParameter::Player' has a wrong offset!");
static_assert(offsetof(BP_MenuPlayerBase_C_SetMaterialScalarParameter, Weapon) == 0x00000D, "Member 'BP_MenuPlayerBase_C_SetMaterialScalarParameter::Weapon' has a wrong offset!");
