#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MakeEventActorChild

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BP_MakeEventActorChild.BP_MakeEventActorChild_C.ExecuteUbergraph_BP_MakeEventActorChild
// 0x0028 (0x0028 - 0x0000)
struct BP_MakeEventActorChild_C_ExecuteUbergraph_BP_MakeEventActorChild final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E8C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainEventLatentActor*                  K2Node_Event_latenter;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     CallFunc_GetPlayerCharaID_ReturnPlayerID;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E8D[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamBondsLevel_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E8E[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDispTipsOrMiniTips_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MakeEventActorChild_C_ExecuteUbergraph_BP_MakeEventActorChild) == 0x000008, "Wrong alignment on BP_MakeEventActorChild_C_ExecuteUbergraph_BP_MakeEventActorChild");
static_assert(sizeof(BP_MakeEventActorChild_C_ExecuteUbergraph_BP_MakeEventActorChild) == 0x000028, "Wrong size on BP_MakeEventActorChild_C_ExecuteUbergraph_BP_MakeEventActorChild");
static_assert(offsetof(BP_MakeEventActorChild_C_ExecuteUbergraph_BP_MakeEventActorChild, EntryPoint) == 0x000000, "Member 'BP_MakeEventActorChild_C_ExecuteUbergraph_BP_MakeEventActorChild::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MakeEventActorChild_C_ExecuteUbergraph_BP_MakeEventActorChild, K2Node_Event_latenter) == 0x000008, "Member 'BP_MakeEventActorChild_C_ExecuteUbergraph_BP_MakeEventActorChild::K2Node_Event_latenter' has a wrong offset!");
static_assert(offsetof(BP_MakeEventActorChild_C_ExecuteUbergraph_BP_MakeEventActorChild, CallFunc_GetPlayerCharaID_ReturnPlayerID) == 0x000010, "Member 'BP_MakeEventActorChild_C_ExecuteUbergraph_BP_MakeEventActorChild::CallFunc_GetPlayerCharaID_ReturnPlayerID' has a wrong offset!");
static_assert(offsetof(BP_MakeEventActorChild_C_ExecuteUbergraph_BP_MakeEventActorChild, CallFunc_GetTeamBondsLevel_ReturnValue) == 0x000014, "Member 'BP_MakeEventActorChild_C_ExecuteUbergraph_BP_MakeEventActorChild::CallFunc_GetTeamBondsLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MakeEventActorChild_C_ExecuteUbergraph_BP_MakeEventActorChild, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000018, "Member 'BP_MakeEventActorChild_C_ExecuteUbergraph_BP_MakeEventActorChild::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MakeEventActorChild_C_ExecuteUbergraph_BP_MakeEventActorChild, CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue) == 0x00001C, "Member 'BP_MakeEventActorChild_C_ExecuteUbergraph_BP_MakeEventActorChild::CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MakeEventActorChild_C_ExecuteUbergraph_BP_MakeEventActorChild, CallFunc_IsDispTipsOrMiniTips_ReturnValue) == 0x000020, "Member 'BP_MakeEventActorChild_C_ExecuteUbergraph_BP_MakeEventActorChild::CallFunc_IsDispTipsOrMiniTips_ReturnValue' has a wrong offset!");

// Function BP_MakeEventActorChild.BP_MakeEventActorChild_C.SubEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_MakeEventActorChild_C_SubEvent final
{
public:
	class AMainEventLatentActor*                  Latenter;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MakeEventActorChild_C_SubEvent) == 0x000008, "Wrong alignment on BP_MakeEventActorChild_C_SubEvent");
static_assert(sizeof(BP_MakeEventActorChild_C_SubEvent) == 0x000008, "Wrong size on BP_MakeEventActorChild_C_SubEvent");
static_assert(offsetof(BP_MakeEventActorChild_C_SubEvent, Latenter) == 0x000000, "Member 'BP_MakeEventActorChild_C_SubEvent::Latenter' has a wrong offset!");

// Function BP_MakeEventActorChild.BP_MakeEventActorChild_C.FrameToSecond
// 0x0014 (0x0014 - 0x0000)
struct BP_MakeEventActorChild_C_FrameToSecond final
{
public:
	int32                                         Frame;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Second;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MakeEventActorChild_C_FrameToSecond) == 0x000004, "Wrong alignment on BP_MakeEventActorChild_C_FrameToSecond");
static_assert(sizeof(BP_MakeEventActorChild_C_FrameToSecond) == 0x000014, "Wrong size on BP_MakeEventActorChild_C_FrameToSecond");
static_assert(offsetof(BP_MakeEventActorChild_C_FrameToSecond, Frame) == 0x000000, "Member 'BP_MakeEventActorChild_C_FrameToSecond::Frame' has a wrong offset!");
static_assert(offsetof(BP_MakeEventActorChild_C_FrameToSecond, Second) == 0x000004, "Member 'BP_MakeEventActorChild_C_FrameToSecond::Second' has a wrong offset!");
static_assert(offsetof(BP_MakeEventActorChild_C_FrameToSecond, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_MakeEventActorChild_C_FrameToSecond::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MakeEventActorChild_C_FrameToSecond, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00000C, "Member 'BP_MakeEventActorChild_C_FrameToSecond::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MakeEventActorChild_C_FrameToSecond, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_MakeEventActorChild_C_FrameToSecond::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_MakeEventActorChild.BP_MakeEventActorChild_C.SetActionIconAjito
// 0x0050 (0x0050 - 0x0000)
struct BP_MakeEventActorChild_C_SetActionIconAjito final
{
public:
	class FString                                 CharaID;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	EPlayerID                                     Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetOwnerActorToAjitoMember_Return;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E8F[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AjitoMember_C*                      K2Node_DynamicCast_AsBP_Ajito_Member;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNeedKizunaIcon_NeedKizunaIcon;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E90[0x5];                                     // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IPlayerInterface>      K2Node_DynamicCast_AsPlayer_Interface;             // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MakeEventActorChild_C_SetActionIconAjito) == 0x000008, "Wrong alignment on BP_MakeEventActorChild_C_SetActionIconAjito");
static_assert(sizeof(BP_MakeEventActorChild_C_SetActionIconAjito) == 0x000050, "Wrong size on BP_MakeEventActorChild_C_SetActionIconAjito");
static_assert(offsetof(BP_MakeEventActorChild_C_SetActionIconAjito, CharaID) == 0x000000, "Member 'BP_MakeEventActorChild_C_SetActionIconAjito::CharaID' has a wrong offset!");
static_assert(offsetof(BP_MakeEventActorChild_C_SetActionIconAjito, Temp_byte_Variable) == 0x000010, "Member 'BP_MakeEventActorChild_C_SetActionIconAjito::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_MakeEventActorChild_C_SetActionIconAjito, CallFunc_SetOwnerActorToAjitoMember_Return) == 0x000011, "Member 'BP_MakeEventActorChild_C_SetActionIconAjito::CallFunc_SetOwnerActorToAjitoMember_Return' has a wrong offset!");
static_assert(offsetof(BP_MakeEventActorChild_C_SetActionIconAjito, CallFunc_GetPlayerManager_PlayerManager) == 0x000018, "Member 'BP_MakeEventActorChild_C_SetActionIconAjito::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_MakeEventActorChild_C_SetActionIconAjito, K2Node_DynamicCast_AsBP_Ajito_Member) == 0x000020, "Member 'BP_MakeEventActorChild_C_SetActionIconAjito::K2Node_DynamicCast_AsBP_Ajito_Member' has a wrong offset!");
static_assert(offsetof(BP_MakeEventActorChild_C_SetActionIconAjito, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_MakeEventActorChild_C_SetActionIconAjito::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MakeEventActorChild_C_SetActionIconAjito, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BP_MakeEventActorChild_C_SetActionIconAjito::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MakeEventActorChild_C_SetActionIconAjito, CallFunc_IsNeedKizunaIcon_NeedKizunaIcon) == 0x00002A, "Member 'BP_MakeEventActorChild_C_SetActionIconAjito::CallFunc_IsNeedKizunaIcon_NeedKizunaIcon' has a wrong offset!");
static_assert(offsetof(BP_MakeEventActorChild_C_SetActionIconAjito, CallFunc_GetPlayer_ReturnValue) == 0x000030, "Member 'BP_MakeEventActorChild_C_SetActionIconAjito::CallFunc_GetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MakeEventActorChild_C_SetActionIconAjito, K2Node_DynamicCast_AsPlayer_Interface) == 0x000038, "Member 'BP_MakeEventActorChild_C_SetActionIconAjito::K2Node_DynamicCast_AsPlayer_Interface' has a wrong offset!");
static_assert(offsetof(BP_MakeEventActorChild_C_SetActionIconAjito, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_MakeEventActorChild_C_SetActionIconAjito::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MakeEventActorChild_C_SetActionIconAjito, CallFunc_GetPlayerID_ReturnValue) == 0x000049, "Member 'BP_MakeEventActorChild_C_SetActionIconAjito::CallFunc_GetPlayerID_ReturnValue' has a wrong offset!");

}

