#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MatchIDWidgetActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MatchIDWidgetActor.BP_MatchIDWidgetActor_C
// 0x0020 (0x0250 - 0x0230)
class ABP_MatchIDWidgetActor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       Widget;                                            // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUsedWidget;                                      // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_MatchIDWidgetActor(int32 EntryPoint);
	void ReceiveBeginPlay();
	void StartMatchIDWidget(class FName CharaID, class FName ArmyCodeMessageID, const struct FVector& Scale);
	void EndMatchIDWidget();
	void SetHiddenInGameMatchIDWidget(bool NewHidden);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MatchIDWidgetActor_C">();
	}
	static class ABP_MatchIDWidgetActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MatchIDWidgetActor_C>();
	}
};
static_assert(alignof(ABP_MatchIDWidgetActor_C) == 0x000008, "Wrong alignment on ABP_MatchIDWidgetActor_C");
static_assert(sizeof(ABP_MatchIDWidgetActor_C) == 0x000250, "Wrong size on ABP_MatchIDWidgetActor_C");
static_assert(offsetof(ABP_MatchIDWidgetActor_C, UberGraphFrame) == 0x000230, "Member 'ABP_MatchIDWidgetActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MatchIDWidgetActor_C, Widget) == 0x000238, "Member 'ABP_MatchIDWidgetActor_C::Widget' has a wrong offset!");
static_assert(offsetof(ABP_MatchIDWidgetActor_C, DefaultSceneRoot) == 0x000240, "Member 'ABP_MatchIDWidgetActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_MatchIDWidgetActor_C, IsUsedWidget) == 0x000248, "Member 'ABP_MatchIDWidgetActor_C::IsUsedWidget' has a wrong offset!");

}

