#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapGimmickManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MapGimmickManager.BP_MapGimmickManager_C
// 0x0020 (0x0358 - 0x0338)
class ABP_MapGimmickManager_C final : public AMapGimmickManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           GimmickUseScenarioFlags;                           // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MapGimmickManager(int32 EntryPoint);
	void ReceiveBeginPlay();
	bool AddMapGimmickUseTime(class AMapGimmickObject* Gimmick);
	void AddMapGimmickUseTimeByType(EMapGimmickType Type);
	void CheckUsedGimmickType(EMapGimmickType Type, bool* Used);
	void CheckUsedGimmickAnyTypes(TArray<EMapGimmickType>& Type, bool* Used);
	void CheckInYuitoScenario(bool* IsYuitoScenario);
	void ResetMapGimmickUseTimesAll();
	void InitializeMapGimmickUse();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MapGimmickManager_C">();
	}
	static class ABP_MapGimmickManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MapGimmickManager_C>();
	}
};
static_assert(alignof(ABP_MapGimmickManager_C) == 0x000008, "Wrong alignment on ABP_MapGimmickManager_C");
static_assert(sizeof(ABP_MapGimmickManager_C) == 0x000358, "Wrong size on ABP_MapGimmickManager_C");
static_assert(offsetof(ABP_MapGimmickManager_C, UberGraphFrame) == 0x000338, "Member 'ABP_MapGimmickManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MapGimmickManager_C, DefaultSceneRoot) == 0x000340, "Member 'ABP_MapGimmickManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_MapGimmickManager_C, GimmickUseScenarioFlags) == 0x000348, "Member 'ABP_MapGimmickManager_C::GimmickUseScenarioFlags' has a wrong offset!");

}

