#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapGimmickObjectBase

#include "Basic.hpp"

#include "PsyObjType_structs.hpp"
#include "CascadeExtensionPlugin_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function BP_MapGimmickObjectBase.BP_MapGimmickObjectBase_C.ExecuteUbergraph_BP_MapGimmickObjectBase
// 0x02D0 (0x02D0 - 0x0000)
struct BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_ParamName;                            // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ParamValue;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_flag;                                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_isActive;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_flag_in;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_is_mesh_only;                         // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_DelaySec_2;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NextStateName;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DelaySec_1;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_704F[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ChangeState_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DelaySec;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetNextStateName_ReturnValue;             // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetNextCancelStateName_ReturnValue;       // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Delay;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable_1;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7050[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_GetAttackCollisionPrimitive_ReturnValue;  // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_GetPrimitive_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7051[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerManager_C*                    K2Node_DynamicCast_AsBP_Player_Manager;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7052[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICameraInterface>      K2Node_DynamicCast_AsCamera_Interface;             // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7053[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue;                    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICameraInterface>      K2Node_DynamicCast_AsCamera_Interface_1;           // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7054[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPlayerCameraViewTarget_ReturnValue;    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetPlayerCameraLocation_ReturnValue;      // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7055[0x2];                                     // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ChangeState_ReturnValue_1;                // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_StateName_1;                          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_StateName;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMapGimmickManager*                     CallFunc_GetMapGimmickManager_MapGimmickManager;   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APsychicObjectManager_C*                CallFunc_GetPsychicObjectManager_PsyObjManager;    // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSetSearchComponent_ReturnValue;         // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7056[0x6];                                     // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_GetPrimitive_ReturnValue_1;               // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetIconVisible_ReturnValue;               // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_Icon_Gauge_Enable_ReturnValue;        // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7057[0x5];                                     // 0x0143(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FCameraUniqueObjectParameter           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0158(0x0058)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7058[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ChangeState_ReturnValue_2;                // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager_1;         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_2;          // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue_1;                  // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IPlayerInterface>      K2Node_DynamicCast_AsPlayer_Interface;             // 0x0200(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue;                  // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7059[0x2];                                     // 0x0212(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ChangeState_ReturnValue_3;                // 0x0214(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_705A[0x4];                                     // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraUniqueObjectParameter           CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0220(0x0058)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_705B[0x7];                                     // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserParamManager*                      CallFunc_GetUserParamManager_UserParamManager;     // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     Temp_byte_Variable;                                // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x028A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x028B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_Duration;                       // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_705C[0x6];                                     // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARSLevelSequenceActor*>          CallFunc_Map_Values_Values;                        // 0x0298(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class ARSLevelSequenceActor*                  CallFunc_Array_Get_Item;                           // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_705D[0x3];                                     // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_705E[0x5];                                     // 0x02BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AMapGimmickManager*                     CallFunc_GetMapGimmickManager_MapGimmickManager_1; // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase) == 0x000008, "Wrong alignment on BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase");
static_assert(sizeof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase) == 0x0002D0, "Wrong size on BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, EntryPoint) == 0x000000, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_Event_ParamName) == 0x00000C, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_Event_ParamName' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_Event_ParamValue) == 0x000014, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_Event_ParamValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_Event_flag) == 0x000018, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_Event_flag' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_Event_isActive) == 0x000019, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_Event_isActive' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_Event_flag_in) == 0x00001A, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_Event_flag_in' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_Event_is_mesh_only) == 0x00001B, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_Event_is_mesh_only' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_CustomEvent_DelaySec_2) == 0x00001C, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_CustomEvent_DelaySec_2' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_CustomEvent_NextStateName) == 0x000020, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_CustomEvent_NextStateName' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_CustomEvent_DelaySec_1) == 0x000028, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_CustomEvent_DelaySec_1' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_Conv_NameToString_ReturnValue) == 0x000030, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_ChangeState_ReturnValue) == 0x000050, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_ChangeState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_CustomEvent_DelaySec) == 0x000058, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_CustomEvent_DelaySec' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_GetNextStateName_ReturnValue) == 0x00005C, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_GetNextStateName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_GetNextCancelStateName_ReturnValue) == 0x000064, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_GetNextCancelStateName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_CustomEvent_Delay) == 0x00006C, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_CustomEvent_Delay' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_CustomEvent_Enable_1) == 0x000070, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_CustomEvent_Enable_1' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_CustomEvent_Enable) == 0x000071, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_GetAttackCollisionPrimitive_ReturnValue) == 0x000078, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_GetAttackCollisionPrimitive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_GetPrimitive_ReturnValue) == 0x000080, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_GetPrimitive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, Temp_int_Array_Index_Variable) == 0x00008C, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_GetPlayerManager_PlayerManager) == 0x000090, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_DynamicCast_AsBP_Player_Manager) == 0x000098, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_DynamicCast_AsBP_Player_Manager' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_DynamicCast_AsCamera_Interface) == 0x0000A8, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_DynamicCast_AsCamera_Interface' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_GetPlayer_ReturnValue) == 0x0000C0, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_GetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_DynamicCast_AsCamera_Interface_1) == 0x0000C8, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_DynamicCast_AsCamera_Interface_1' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_DynamicCast_bSuccess_2) == 0x0000D8, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_BreakTransform_Location) == 0x0000DC, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_BreakTransform_Rotation) == 0x0000E8, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_BreakTransform_Scale) == 0x0000F4, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_SetPlayerCameraViewTarget_ReturnValue) == 0x000100, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_SetPlayerCameraViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_SetPlayerCameraLocation_ReturnValue) == 0x000101, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_SetPlayerCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_Event_DeltaSeconds) == 0x000104, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_ChangeState_ReturnValue_1) == 0x000108, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_ChangeState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_Event_StateName_1) == 0x000110, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_Event_StateName_1' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_Event_StateName) == 0x000118, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_Event_StateName' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_GetMapGimmickManager_MapGimmickManager) == 0x000120, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_GetMapGimmickManager_MapGimmickManager' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_GetPsychicObjectManager_PsyObjManager) == 0x000128, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_GetPsychicObjectManager_PsyObjManager' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_IsValid_ReturnValue_1) == 0x000130, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_IsSetSearchComponent_ReturnValue) == 0x000131, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_IsSetSearchComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_GetPrimitive_ReturnValue_1) == 0x000138, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_GetPrimitive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_IsValid_ReturnValue_2) == 0x000140, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_SetIconVisible_ReturnValue) == 0x000141, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_SetIconVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_Set_Icon_Gauge_Enable_ReturnValue) == 0x000142, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_Set_Icon_Gauge_Enable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000148, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_GetDataTableRowFromName_OutRow) == 0x000158, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0001B0, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0001B8, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_ChangeState_ReturnValue_2) == 0x0001C8, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_ChangeState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_GetPlayerManager_PlayerManager_1) == 0x0001D0, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_GetPlayerManager_PlayerManager_1' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_Conv_NameToString_ReturnValue_2) == 0x0001D8, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_Conv_NameToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_GetPlayer_ReturnValue_1) == 0x0001E8, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_GetPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0001F0, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_DynamicCast_AsPlayer_Interface) == 0x000200, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_DynamicCast_AsPlayer_Interface' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_DynamicCast_bSuccess_3) == 0x000210, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_GetPlayerID_ReturnValue) == 0x000211, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_GetPlayerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_ChangeState_ReturnValue_3) == 0x000214, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_ChangeState_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000220, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000278, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_GetUserParamManager_UserParamManager) == 0x000280, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_GetUserParamManager_UserParamManager' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_IsValid_ReturnValue_3) == 0x000288, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, Temp_byte_Variable) == 0x000289, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00028A, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00028B, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_CustomEvent_Duration) == 0x00028C, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_CustomEvent_Duration' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, K2Node_Event_EndPlayReason) == 0x000290, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_IsValid_ReturnValue_4) == 0x000291, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_Map_Values_Values) == 0x000298, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_Array_Get_Item) == 0x0002A8, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_IsValid_ReturnValue_5) == 0x0002B0, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_Array_Length_ReturnValue) == 0x0002B4, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_Less_IntInt_ReturnValue) == 0x0002B8, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_IsValid_ReturnValue_6) == 0x0002B9, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_IsValid_ReturnValue_7) == 0x0002BA, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_GetMapGimmickManager_MapGimmickManager_1) == 0x0002C0, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_GetMapGimmickManager_MapGimmickManager_1' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase, CallFunc_IsValid_ReturnValue_8) == 0x0002C8, "Member 'BP_MapGimmickObjectBase_C_ExecuteUbergraph_BP_MapGimmickObjectBase::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");

// Function BP_MapGimmickObjectBase.BP_MapGimmickObjectBase_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_MapGimmickObjectBase_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapGimmickObjectBase_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_MapGimmickObjectBase_C_ReceiveEndPlay");
static_assert(sizeof(BP_MapGimmickObjectBase_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_MapGimmickObjectBase_C_ReceiveEndPlay");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_MapGimmickObjectBase_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_MapGimmickObjectBase.BP_MapGimmickObjectBase_C.DelayFadeOutAndDestloy
// 0x0004 (0x0004 - 0x0000)
struct BP_MapGimmickObjectBase_C_DelayFadeOutAndDestloy final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapGimmickObjectBase_C_DelayFadeOutAndDestloy) == 0x000004, "Wrong alignment on BP_MapGimmickObjectBase_C_DelayFadeOutAndDestloy");
static_assert(sizeof(BP_MapGimmickObjectBase_C_DelayFadeOutAndDestloy) == 0x000004, "Wrong size on BP_MapGimmickObjectBase_C_DelayFadeOutAndDestloy");
static_assert(offsetof(BP_MapGimmickObjectBase_C_DelayFadeOutAndDestloy, Duration) == 0x000000, "Member 'BP_MapGimmickObjectBase_C_DelayFadeOutAndDestloy::Duration' has a wrong offset!");

// Function BP_MapGimmickObjectBase.BP_MapGimmickObjectBase_C.OnStateEndFunction
// 0x0008 (0x0008 - 0x0000)
struct BP_MapGimmickObjectBase_C_OnStateEndFunction final
{
public:
	class FName                                   StateName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapGimmickObjectBase_C_OnStateEndFunction) == 0x000004, "Wrong alignment on BP_MapGimmickObjectBase_C_OnStateEndFunction");
static_assert(sizeof(BP_MapGimmickObjectBase_C_OnStateEndFunction) == 0x000008, "Wrong size on BP_MapGimmickObjectBase_C_OnStateEndFunction");
static_assert(offsetof(BP_MapGimmickObjectBase_C_OnStateEndFunction, StateName) == 0x000000, "Member 'BP_MapGimmickObjectBase_C_OnStateEndFunction::StateName' has a wrong offset!");

// Function BP_MapGimmickObjectBase.BP_MapGimmickObjectBase_C.OnStateBeginFunction
// 0x0008 (0x0008 - 0x0000)
struct BP_MapGimmickObjectBase_C_OnStateBeginFunction final
{
public:
	class FName                                   StateName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapGimmickObjectBase_C_OnStateBeginFunction) == 0x000004, "Wrong alignment on BP_MapGimmickObjectBase_C_OnStateBeginFunction");
static_assert(sizeof(BP_MapGimmickObjectBase_C_OnStateBeginFunction) == 0x000008, "Wrong size on BP_MapGimmickObjectBase_C_OnStateBeginFunction");
static_assert(offsetof(BP_MapGimmickObjectBase_C_OnStateBeginFunction, StateName) == 0x000000, "Member 'BP_MapGimmickObjectBase_C_OnStateBeginFunction::StateName' has a wrong offset!");

// Function BP_MapGimmickObjectBase.BP_MapGimmickObjectBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_MapGimmickObjectBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapGimmickObjectBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_MapGimmickObjectBase_C_ReceiveTick");
static_assert(sizeof(BP_MapGimmickObjectBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_MapGimmickObjectBase_C_ReceiveTick");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_MapGimmickObjectBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_MapGimmickObjectBase.BP_MapGimmickObjectBase_C.EnableAttackCollision
// 0x0001 (0x0001 - 0x0000)
struct BP_MapGimmickObjectBase_C_EnableAttackCollision final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MapGimmickObjectBase_C_EnableAttackCollision) == 0x000001, "Wrong alignment on BP_MapGimmickObjectBase_C_EnableAttackCollision");
static_assert(sizeof(BP_MapGimmickObjectBase_C_EnableAttackCollision) == 0x000001, "Wrong size on BP_MapGimmickObjectBase_C_EnableAttackCollision");
static_assert(offsetof(BP_MapGimmickObjectBase_C_EnableAttackCollision, Enable) == 0x000000, "Member 'BP_MapGimmickObjectBase_C_EnableAttackCollision::Enable' has a wrong offset!");

// Function BP_MapGimmickObjectBase.BP_MapGimmickObjectBase_C.EnablePhysics
// 0x0001 (0x0001 - 0x0000)
struct BP_MapGimmickObjectBase_C_EnablePhysics final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MapGimmickObjectBase_C_EnablePhysics) == 0x000001, "Wrong alignment on BP_MapGimmickObjectBase_C_EnablePhysics");
static_assert(sizeof(BP_MapGimmickObjectBase_C_EnablePhysics) == 0x000001, "Wrong size on BP_MapGimmickObjectBase_C_EnablePhysics");
static_assert(offsetof(BP_MapGimmickObjectBase_C_EnablePhysics, Enable) == 0x000000, "Member 'BP_MapGimmickObjectBase_C_EnablePhysics::Enable' has a wrong offset!");

// Function BP_MapGimmickObjectBase.BP_MapGimmickObjectBase_C.DelayAttackEffectOff
// 0x0004 (0x0004 - 0x0000)
struct BP_MapGimmickObjectBase_C_DelayAttackEffectOff final
{
public:
	float                                         Delay;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapGimmickObjectBase_C_DelayAttackEffectOff) == 0x000004, "Wrong alignment on BP_MapGimmickObjectBase_C_DelayAttackEffectOff");
static_assert(sizeof(BP_MapGimmickObjectBase_C_DelayAttackEffectOff) == 0x000004, "Wrong size on BP_MapGimmickObjectBase_C_DelayAttackEffectOff");
static_assert(offsetof(BP_MapGimmickObjectBase_C_DelayAttackEffectOff, Delay) == 0x000000, "Member 'BP_MapGimmickObjectBase_C_DelayAttackEffectOff::Delay' has a wrong offset!");

// Function BP_MapGimmickObjectBase.BP_MapGimmickObjectBase_C.ChangeStateInCancelWithDelay
// 0x0004 (0x0004 - 0x0000)
struct BP_MapGimmickObjectBase_C_ChangeStateInCancelWithDelay final
{
public:
	float                                         DelaySec;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapGimmickObjectBase_C_ChangeStateInCancelWithDelay) == 0x000004, "Wrong alignment on BP_MapGimmickObjectBase_C_ChangeStateInCancelWithDelay");
static_assert(sizeof(BP_MapGimmickObjectBase_C_ChangeStateInCancelWithDelay) == 0x000004, "Wrong size on BP_MapGimmickObjectBase_C_ChangeStateInCancelWithDelay");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ChangeStateInCancelWithDelay, DelaySec) == 0x000000, "Member 'BP_MapGimmickObjectBase_C_ChangeStateInCancelWithDelay::DelaySec' has a wrong offset!");

// Function BP_MapGimmickObjectBase.BP_MapGimmickObjectBase_C.ChangeToNextStateWithDelay
// 0x0004 (0x0004 - 0x0000)
struct BP_MapGimmickObjectBase_C_ChangeToNextStateWithDelay final
{
public:
	float                                         DelaySec;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapGimmickObjectBase_C_ChangeToNextStateWithDelay) == 0x000004, "Wrong alignment on BP_MapGimmickObjectBase_C_ChangeToNextStateWithDelay");
static_assert(sizeof(BP_MapGimmickObjectBase_C_ChangeToNextStateWithDelay) == 0x000004, "Wrong size on BP_MapGimmickObjectBase_C_ChangeToNextStateWithDelay");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ChangeToNextStateWithDelay, DelaySec) == 0x000000, "Member 'BP_MapGimmickObjectBase_C_ChangeToNextStateWithDelay::DelaySec' has a wrong offset!");

// Function BP_MapGimmickObjectBase.BP_MapGimmickObjectBase_C.ChangeStateWithDelay
// 0x000C (0x000C - 0x0000)
struct BP_MapGimmickObjectBase_C_ChangeStateWithDelay final
{
public:
	float                                         DelaySec;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NextStateName;                                     // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapGimmickObjectBase_C_ChangeStateWithDelay) == 0x000004, "Wrong alignment on BP_MapGimmickObjectBase_C_ChangeStateWithDelay");
static_assert(sizeof(BP_MapGimmickObjectBase_C_ChangeStateWithDelay) == 0x00000C, "Wrong size on BP_MapGimmickObjectBase_C_ChangeStateWithDelay");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ChangeStateWithDelay, DelaySec) == 0x000000, "Member 'BP_MapGimmickObjectBase_C_ChangeStateWithDelay::DelaySec' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_ChangeStateWithDelay, NextStateName) == 0x000004, "Member 'BP_MapGimmickObjectBase_C_ChangeStateWithDelay::NextStateName' has a wrong offset!");

// Function BP_MapGimmickObjectBase.BP_MapGimmickObjectBase_C.SetPsychicObjectVisibility
// 0x0002 (0x0002 - 0x0000)
struct BP_MapGimmickObjectBase_C_SetPsychicObjectVisibility final
{
public:
	bool                                          Flag_in;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Is_mesh_only;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MapGimmickObjectBase_C_SetPsychicObjectVisibility) == 0x000001, "Wrong alignment on BP_MapGimmickObjectBase_C_SetPsychicObjectVisibility");
static_assert(sizeof(BP_MapGimmickObjectBase_C_SetPsychicObjectVisibility) == 0x000002, "Wrong size on BP_MapGimmickObjectBase_C_SetPsychicObjectVisibility");
static_assert(offsetof(BP_MapGimmickObjectBase_C_SetPsychicObjectVisibility, Flag_in) == 0x000000, "Member 'BP_MapGimmickObjectBase_C_SetPsychicObjectVisibility::Flag_in' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_SetPsychicObjectVisibility, Is_mesh_only) == 0x000001, "Member 'BP_MapGimmickObjectBase_C_SetPsychicObjectVisibility::Is_mesh_only' has a wrong offset!");

// Function BP_MapGimmickObjectBase.BP_MapGimmickObjectBase_C.SetPsychicObjectActive
// 0x0001 (0x0001 - 0x0000)
struct BP_MapGimmickObjectBase_C_SetPsychicObjectActive final
{
public:
	bool                                          Param_IsActive;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MapGimmickObjectBase_C_SetPsychicObjectActive) == 0x000001, "Wrong alignment on BP_MapGimmickObjectBase_C_SetPsychicObjectActive");
static_assert(sizeof(BP_MapGimmickObjectBase_C_SetPsychicObjectActive) == 0x000001, "Wrong size on BP_MapGimmickObjectBase_C_SetPsychicObjectActive");
static_assert(offsetof(BP_MapGimmickObjectBase_C_SetPsychicObjectActive, Param_IsActive) == 0x000000, "Member 'BP_MapGimmickObjectBase_C_SetPsychicObjectActive::Param_IsActive' has a wrong offset!");

// Function BP_MapGimmickObjectBase.BP_MapGimmickObjectBase_C.SetTownSetting
// 0x0001 (0x0001 - 0x0000)
struct BP_MapGimmickObjectBase_C_SetTownSetting final
{
public:
	bool                                          Flag;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MapGimmickObjectBase_C_SetTownSetting) == 0x000001, "Wrong alignment on BP_MapGimmickObjectBase_C_SetTownSetting");
static_assert(sizeof(BP_MapGimmickObjectBase_C_SetTownSetting) == 0x000001, "Wrong size on BP_MapGimmickObjectBase_C_SetTownSetting");
static_assert(offsetof(BP_MapGimmickObjectBase_C_SetTownSetting, Flag) == 0x000000, "Member 'BP_MapGimmickObjectBase_C_SetTownSetting::Flag' has a wrong offset!");

// Function BP_MapGimmickObjectBase.BP_MapGimmickObjectBase_C.SetMaterialParameter
// 0x000C (0x000C - 0x0000)
struct BP_MapGimmickObjectBase_C_SetMaterialParameter final
{
public:
	class FName                                   ParamName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ParamValue;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapGimmickObjectBase_C_SetMaterialParameter) == 0x000004, "Wrong alignment on BP_MapGimmickObjectBase_C_SetMaterialParameter");
static_assert(sizeof(BP_MapGimmickObjectBase_C_SetMaterialParameter) == 0x00000C, "Wrong size on BP_MapGimmickObjectBase_C_SetMaterialParameter");
static_assert(offsetof(BP_MapGimmickObjectBase_C_SetMaterialParameter, ParamName) == 0x000000, "Member 'BP_MapGimmickObjectBase_C_SetMaterialParameter::ParamName' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_SetMaterialParameter, ParamValue) == 0x000008, "Member 'BP_MapGimmickObjectBase_C_SetMaterialParameter::ParamValue' has a wrong offset!");

// Function BP_MapGimmickObjectBase.BP_MapGimmickObjectBase_C.MakeStateFromDataTable
// 0x0080 (0x0080 - 0x0000)
struct BP_MapGimmickObjectBase_C_MakeStateFromDataTable final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0008(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_705F[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMapGimmickState                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x0048)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7060[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7061[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapGimmickObjectBase_C_MakeStateFromDataTable) == 0x000008, "Wrong alignment on BP_MapGimmickObjectBase_C_MakeStateFromDataTable");
static_assert(sizeof(BP_MapGimmickObjectBase_C_MakeStateFromDataTable) == 0x000080, "Wrong size on BP_MapGimmickObjectBase_C_MakeStateFromDataTable");
static_assert(offsetof(BP_MapGimmickObjectBase_C_MakeStateFromDataTable, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_MapGimmickObjectBase_C_MakeStateFromDataTable::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_MakeStateFromDataTable, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_MapGimmickObjectBase_C_MakeStateFromDataTable::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_MakeStateFromDataTable, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000008, "Member 'BP_MapGimmickObjectBase_C_MakeStateFromDataTable::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_MakeStateFromDataTable, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_MapGimmickObjectBase_C_MakeStateFromDataTable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_MakeStateFromDataTable, CallFunc_GetDataTableRowFromName_OutRow) == 0x000020, "Member 'BP_MapGimmickObjectBase_C_MakeStateFromDataTable::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_MakeStateFromDataTable, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000068, "Member 'BP_MapGimmickObjectBase_C_MakeStateFromDataTable::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_MakeStateFromDataTable, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'BP_MapGimmickObjectBase_C_MakeStateFromDataTable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_MakeStateFromDataTable, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'BP_MapGimmickObjectBase_C_MakeStateFromDataTable::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_MakeStateFromDataTable, CallFunc_Array_Add_ReturnValue) == 0x000074, "Member 'BP_MapGimmickObjectBase_C_MakeStateFromDataTable::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapGimmickObjectBase_C_MakeStateFromDataTable, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'BP_MapGimmickObjectBase_C_MakeStateFromDataTable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_MapGimmickObjectBase.BP_MapGimmickObjectBase_C.InitializeIcon
// 0x0008 (0x0008 - 0x0000)
struct BP_MapGimmickObjectBase_C_InitializeIcon final
{
public:
