#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MatchIDWidgetActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_MatchIDWidgetActor.BP_MatchIDWidgetActor_C.ExecuteUbergraph_BP_MatchIDWidgetActor
// 0x0004 (0x0004 - 0x0000)
struct BP_MatchIDWidgetActor_C_ExecuteUbergraph_BP_MatchIDWidgetActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MatchIDWidgetActor_C_ExecuteUbergraph_BP_MatchIDWidgetActor) == 0x000004, "Wrong alignment on BP_MatchIDWidgetActor_C_ExecuteUbergraph_BP_MatchIDWidgetActor");
static_assert(sizeof(BP_MatchIDWidgetActor_C_ExecuteUbergraph_BP_MatchIDWidgetActor) == 0x000004, "Wrong size on BP_MatchIDWidgetActor_C_ExecuteUbergraph_BP_MatchIDWidgetActor");
static_assert(offsetof(BP_MatchIDWidgetActor_C_ExecuteUbergraph_BP_MatchIDWidgetActor, EntryPoint) == 0x000000, "Member 'BP_MatchIDWidgetActor_C_ExecuteUbergraph_BP_MatchIDWidgetActor::EntryPoint' has a wrong offset!");

// Function BP_MatchIDWidgetActor.BP_MatchIDWidgetActor_C.StartMatchIDWidget
// 0x0040 (0x0040 - 0x0000)
struct BP_MatchIDWidgetActor_C_StartMatchIDWidget final
{
public:
	class FName                                   CharaID;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ArmyCodeMessageID;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Scale;                                             // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59C7[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_MatchID_C*                       K2Node_DynamicCast_AsWB_Ui_Match_ID;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59C8[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MatchIDWidgetActor_C_StartMatchIDWidget) == 0x000008, "Wrong alignment on BP_MatchIDWidgetActor_C_StartMatchIDWidget");
static_assert(sizeof(BP_MatchIDWidgetActor_C_StartMatchIDWidget) == 0x000040, "Wrong size on BP_MatchIDWidgetActor_C_StartMatchIDWidget");
static_assert(offsetof(BP_MatchIDWidgetActor_C_StartMatchIDWidget, CharaID) == 0x000000, "Member 'BP_MatchIDWidgetActor_C_StartMatchIDWidget::CharaID' has a wrong offset!");
static_assert(offsetof(BP_MatchIDWidgetActor_C_StartMatchIDWidget, ArmyCodeMessageID) == 0x000008, "Member 'BP_MatchIDWidgetActor_C_StartMatchIDWidget::ArmyCodeMessageID' has a wrong offset!");
static_assert(offsetof(BP_MatchIDWidgetActor_C_StartMatchIDWidget, Scale) == 0x000010, "Member 'BP_MatchIDWidgetActor_C_StartMatchIDWidget::Scale' has a wrong offset!");
static_assert(offsetof(BP_MatchIDWidgetActor_C_StartMatchIDWidget, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000020, "Member 'BP_MatchIDWidgetActor_C_StartMatchIDWidget::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIDWidgetActor_C_StartMatchIDWidget, K2Node_DynamicCast_AsWB_Ui_Match_ID) == 0x000028, "Member 'BP_MatchIDWidgetActor_C_StartMatchIDWidget::K2Node_DynamicCast_AsWB_Ui_Match_ID' has a wrong offset!");
static_assert(offsetof(BP_MatchIDWidgetActor_C_StartMatchIDWidget, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_MatchIDWidgetActor_C_StartMatchIDWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MatchIDWidgetActor_C_StartMatchIDWidget, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000034, "Member 'BP_MatchIDWidgetActor_C_StartMatchIDWidget::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");

// Function BP_MatchIDWidgetActor.BP_MatchIDWidgetActor_C.EndMatchIDWidget
// 0x0018 (0x0018 - 0x0000)
struct BP_MatchIDWidgetActor_C_EndMatchIDWidget final
{
public:
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_MatchID_C*                       K2Node_DynamicCast_AsWB_Ui_Match_ID;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MatchIDWidgetActor_C_EndMatchIDWidget) == 0x000008, "Wrong alignment on BP_MatchIDWidgetActor_C_EndMatchIDWidget");
static_assert(sizeof(BP_MatchIDWidgetActor_C_EndMatchIDWidget) == 0x000018, "Wrong size on BP_MatchIDWidgetActor_C_EndMatchIDWidget");
static_assert(offsetof(BP_MatchIDWidgetActor_C_EndMatchIDWidget, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000000, "Member 'BP_MatchIDWidgetActor_C_EndMatchIDWidget::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIDWidgetActor_C_EndMatchIDWidget, K2Node_DynamicCast_AsWB_Ui_Match_ID) == 0x000008, "Member 'BP_MatchIDWidgetActor_C_EndMatchIDWidget::K2Node_DynamicCast_AsWB_Ui_Match_ID' has a wrong offset!");
static_assert(offsetof(BP_MatchIDWidgetActor_C_EndMatchIDWidget, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_MatchIDWidgetActor_C_EndMatchIDWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_MatchIDWidgetActor.BP_MatchIDWidgetActor_C.SetHiddenInGameMatchIDWidget
// 0x0001 (0x0001 - 0x0000)
struct BP_MatchIDWidgetActor_C_SetHiddenInGameMatchIDWidget final
{
public:
	bool                                          NewHidden;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MatchIDWidgetActor_C_SetHiddenInGameMatchIDWidget) == 0x000001, "Wrong alignment on BP_MatchIDWidgetActor_C_SetHiddenInGameMatchIDWidget");
static_assert(sizeof(BP_MatchIDWidgetActor_C_SetHiddenInGameMatchIDWidget) == 0x000001, "Wrong size on BP_MatchIDWidgetActor_C_SetHiddenInGameMatchIDWidget");
static_assert(offsetof(BP_MatchIDWidgetActor_C_SetHiddenInGameMatchIDWidget, NewHidden) == 0x000000, "Member 'BP_MatchIDWidgetActor_C_SetHiddenInGameMatchIDWidget::NewHidden' has a wrong offset!");

}

