#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPCMetamorphosisComponent

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "EEnpcMetamorphosisiFinishType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPCMetamorphosisComponent.BP_NPCMetamorphosisComponent_C
// 0x0028 (0x00E8 - 0x00C0)
class UBP_NPCMetamorphosisComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 CallActor;                                         // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnTimer;                                       // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         State;                                             // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnpcMetamorphosisiFinishType                 FinishType;                                        // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     ReturnPlayer;                                      // 0x00D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNotFinishCancelAction;                            // 0x00DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCancelFromForward;                                // 0x00DB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCancelReactionChance;                             // 0x00DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EEnpcMetamorphosisiFinishType                 ReserveFinishType;                                 // 0x00DD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReserveCancelFromForward;                         // 0x00DE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bReserveCancelReactionChance;                      // 0x00DF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ReserveTime;                                       // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_NPCMetamorphosisComponent(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void StartMetamorphosis(class AActor* Parent, float ReturnSeconds);
	void FinishMetamorphosis(bool* bDummy);
	void UpdateMetamorphosis(float DeltaSeconds);
	void SetMetamorphosisParam(class AActor* Parent, float ReturnSeconds);
	void FinishLastAttack(bool* bResult);
	void FinishCancelAction(EEnpcMetamorphosisiFinishType Param_FinishType, bool FromForward, bool ReactionChance, bool* bDummy);
	void AlreadyStartedSetting(EPlayerID ReturnPlayerID, float ReturnSeconds, bool Param_bNotFinishCancelAction, bool* bDummy);
	void ReserveFinishCancelAction(EEnpcMetamorphosisiFinishType Param_FinishType, bool bFromForward, bool bReactionChance, float ReserveSeconds, bool* bDummy);
	void UpdateReserve(float DeltaSeconds, bool* bDummy);
	void SetFinishType(EEnpcMetamorphosisiFinishType Type, bool* bDummy);

	void IsExecMetamorphosis(bool* bExec) const;
	void GetFinishType(EEnpcMetamorphosisiFinishType* Param_FinishType) const;
	void IsCancelFromForward(bool* FromForward) const;
	void IsCancelReactionChance(bool* FromForward) const;
	void IsWaitLastAttack(bool* bWait) const;
	void GetCallActor(class AActor** Actor) const;
	void IsReservedFinishCancelAction(bool* bReserved) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NPCMetamorphosisComponent_C">();
	}
	static class UBP_NPCMetamorphosisComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_NPCMetamorphosisComponent_C>();
	}
};
static_assert(alignof(UBP_NPCMetamorphosisComponent_C) == 0x000008, "Wrong alignment on UBP_NPCMetamorphosisComponent_C");
static_assert(sizeof(UBP_NPCMetamorphosisComponent_C) == 0x0000E8, "Wrong size on UBP_NPCMetamorphosisComponent_C");
static_assert(offsetof(UBP_NPCMetamorphosisComponent_C, UberGraphFrame) == 0x0000C0, "Member 'UBP_NPCMetamorphosisComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_NPCMetamorphosisComponent_C, CallActor) == 0x0000C8, "Member 'UBP_NPCMetamorphosisComponent_C::CallActor' has a wrong offset!");
static_assert(offsetof(UBP_NPCMetamorphosisComponent_C, ReturnTimer) == 0x0000D0, "Member 'UBP_NPCMetamorphosisComponent_C::ReturnTimer' has a wrong offset!");
static_assert(offsetof(UBP_NPCMetamorphosisComponent_C, State) == 0x0000D4, "Member 'UBP_NPCMetamorphosisComponent_C::State' has a wrong offset!");
static_assert(offsetof(UBP_NPCMetamorphosisComponent_C, FinishType) == 0x0000D8, "Member 'UBP_NPCMetamorphosisComponent_C::FinishType' has a wrong offset!");
static_assert(offsetof(UBP_NPCMetamorphosisComponent_C, ReturnPlayer) == 0x0000D9, "Member 'UBP_NPCMetamorphosisComponent_C::ReturnPlayer' has a wrong offset!");
static_assert(offsetof(UBP_NPCMetamorphosisComponent_C, bNotFinishCancelAction) == 0x0000DA, "Member 'UBP_NPCMetamorphosisComponent_C::bNotFinishCancelAction' has a wrong offset!");
static_assert(offsetof(UBP_NPCMetamorphosisComponent_C, bCancelFromForward) == 0x0000DB, "Member 'UBP_NPCMetamorphosisComponent_C::bCancelFromForward' has a wrong offset!");
static_assert(offsetof(UBP_NPCMetamorphosisComponent_C, bCancelReactionChance) == 0x0000DC, "Member 'UBP_NPCMetamorphosisComponent_C::bCancelReactionChance' has a wrong offset!");
static_assert(offsetof(UBP_NPCMetamorphosisComponent_C, ReserveFinishType) == 0x0000DD, "Member 'UBP_NPCMetamorphosisComponent_C::ReserveFinishType' has a wrong offset!");
static_assert(offsetof(UBP_NPCMetamorphosisComponent_C, bReserveCancelFromForward) == 0x0000DE, "Member 'UBP_NPCMetamorphosisComponent_C::bReserveCancelFromForward' has a wrong offset!");
static_assert(offsetof(UBP_NPCMetamorphosisComponent_C, bReserveCancelReactionChance) == 0x0000DF, "Member 'UBP_NPCMetamorphosisComponent_C::bReserveCancelReactionChance' has a wrong offset!");
static_assert(offsetof(UBP_NPCMetamorphosisComponent_C, ReserveTime) == 0x0000E0, "Member 'UBP_NPCMetamorphosisComponent_C::ReserveTime' has a wrong offset!");

}

