#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NpcShop_Common

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_MakeEventActorBase_classes.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NpcShop_Common.BP_NpcShop_Common_C
// 0x0018 (0x0490 - 0x0478)
class ABP_NpcShop_Common_C final : public ABP_MakeEventActorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_NpcShop_Common_C;                // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         ShopVar;                                           // 0x0480(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewVar_0;                                          // 0x0484(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TradeVar;                                          // 0x0488(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_NpcShop_Common(int32 EntryPoint);
	void StartEvent();
	void CustomEvent_0(class AMainEventLatentActor* Latenter);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NpcShop_Common_C">();
	}
	static class ABP_NpcShop_Common_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NpcShop_Common_C>();
	}
};
static_assert(alignof(ABP_NpcShop_Common_C) == 0x000008, "Wrong alignment on ABP_NpcShop_Common_C");
static_assert(sizeof(ABP_NpcShop_Common_C) == 0x000490, "Wrong size on ABP_NpcShop_Common_C");
static_assert(offsetof(ABP_NpcShop_Common_C, UberGraphFrame_BP_NpcShop_Common_C) == 0x000478, "Member 'ABP_NpcShop_Common_C::UberGraphFrame_BP_NpcShop_Common_C' has a wrong offset!");
static_assert(offsetof(ABP_NpcShop_Common_C, ShopVar) == 0x000480, "Member 'ABP_NpcShop_Common_C::ShopVar' has a wrong offset!");
static_assert(offsetof(ABP_NpcShop_Common_C, NewVar_0) == 0x000484, "Member 'ABP_NpcShop_Common_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(ABP_NpcShop_Common_C, TradeVar) == 0x000488, "Member 'ABP_NpcShop_Common_C::TradeVar' has a wrong offset!");

}

