#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPCMetamorphosisComponent

#include "Basic.hpp"

#include "EEnpcMetamorphosisiFinishType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_NPCMetamorphosisComponent.BP_NPCMetamorphosisComponent_C.ExecuteUbergraph_BP_NPCMetamorphosisComponent
// 0x000C (0x000C - 0x0000)
struct BP_NPCMetamorphosisComponent_C_ExecuteUbergraph_BP_NPCMetamorphosisComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateReserve_bDummy;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPCMetamorphosisComponent_C_ExecuteUbergraph_BP_NPCMetamorphosisComponent) == 0x000004, "Wrong alignment on BP_NPCMetamorphosisComponent_C_ExecuteUbergraph_BP_NPCMetamorphosisComponent");
static_assert(sizeof(BP_NPCMetamorphosisComponent_C_ExecuteUbergraph_BP_NPCMetamorphosisComponent) == 0x00000C, "Wrong size on BP_NPCMetamorphosisComponent_C_ExecuteUbergraph_BP_NPCMetamorphosisComponent");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_ExecuteUbergraph_BP_NPCMetamorphosisComponent, EntryPoint) == 0x000000, "Member 'BP_NPCMetamorphosisComponent_C_ExecuteUbergraph_BP_NPCMetamorphosisComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_ExecuteUbergraph_BP_NPCMetamorphosisComponent, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_NPCMetamorphosisComponent_C_ExecuteUbergraph_BP_NPCMetamorphosisComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_ExecuteUbergraph_BP_NPCMetamorphosisComponent, CallFunc_UpdateReserve_bDummy) == 0x000008, "Member 'BP_NPCMetamorphosisComponent_C_ExecuteUbergraph_BP_NPCMetamorphosisComponent::CallFunc_UpdateReserve_bDummy' has a wrong offset!");

// Function BP_NPCMetamorphosisComponent.BP_NPCMetamorphosisComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_NPCMetamorphosisComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPCMetamorphosisComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_NPCMetamorphosisComponent_C_ReceiveTick");
static_assert(sizeof(BP_NPCMetamorphosisComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_NPCMetamorphosisComponent_C_ReceiveTick");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_NPCMetamorphosisComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_NPCMetamorphosisComponent.BP_NPCMetamorphosisComponent_C.StartMetamorphosis
// 0x0030 (0x0030 - 0x0000)
struct BP_NPCMetamorphosisComponent_C_StartMetamorphosis final
{
public:
	class AActor*                                 Parent;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnSeconds;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8AC0[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AC1[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_EnemyTransformationComponent_C*     CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPCMetamorphosisComponent_C_StartMetamorphosis) == 0x000008, "Wrong alignment on BP_NPCMetamorphosisComponent_C_StartMetamorphosis");
static_assert(sizeof(BP_NPCMetamorphosisComponent_C_StartMetamorphosis) == 0x000030, "Wrong size on BP_NPCMetamorphosisComponent_C_StartMetamorphosis");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_StartMetamorphosis, Parent) == 0x000000, "Member 'BP_NPCMetamorphosisComponent_C_StartMetamorphosis::Parent' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_StartMetamorphosis, ReturnSeconds) == 0x000008, "Member 'BP_NPCMetamorphosisComponent_C_StartMetamorphosis::ReturnSeconds' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_StartMetamorphosis, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_NPCMetamorphosisComponent_C_StartMetamorphosis::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_StartMetamorphosis, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_NPCMetamorphosisComponent_C_StartMetamorphosis::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_StartMetamorphosis, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BP_NPCMetamorphosisComponent_C_StartMetamorphosis::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_StartMetamorphosis, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'BP_NPCMetamorphosisComponent_C_StartMetamorphosis::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_NPCMetamorphosisComponent.BP_NPCMetamorphosisComponent_C.FinishMetamorphosis
// 0x0240 (0x0240 - 0x0000)
struct BP_NPCMetamorphosisComponent_C_FinishMetamorphosis final
{
public:
	bool                                          bDummy;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AC2[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LOwner;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 LCreateOwner;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8AC3[0x8];                                     // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             L_LastTransform;                                   // 0x0020(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class APsychicObjectManager_C*                CallFunc_GetPsychicObjectManager_PsyObjManager;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AC4[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Discover_Component_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APsychicObjectManager_C*                CallFunc_GetPsychicObjectManager_PsyObjManager_1;  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AC5[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AC6[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ENpcInterface_C>  K2Node_DynamicCast_AsBPI_ENpc_Interface;           // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AC7[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Em8000_GetPartner_PartnerActor;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00B0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AC8[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager_1;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AC9[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APsychicObjectManager_C*                CallFunc_GetPsychicObjectManager_PsyObjManager_2;  // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8ACA[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8ACB[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0158(0x0018)()
	class ARSBattlePlayer_C*                      CallFunc_SpawnNotPartyPlayer_Player;               // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0178(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01B8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_ReturnMetamorphosis_self_CastInput;       // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReturnMetamorphosis_Dummy;                // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8ACC[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01E0(0x0018)()
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8ACD[0x3];                                     // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface;         // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReturnMetamorphosis_Dummy_1;              // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis) == 0x000010, "Wrong alignment on BP_NPCMetamorphosisComponent_C_FinishMetamorphosis");
static_assert(sizeof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis) == 0x000240, "Wrong size on BP_NPCMetamorphosisComponent_C_FinishMetamorphosis");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, bDummy) == 0x000000, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::bDummy' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, LOwner) == 0x000008, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::LOwner' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, LCreateOwner) == 0x000010, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::LCreateOwner' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, L_LastTransform) == 0x000020, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::L_LastTransform' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_GetPsychicObjectManager_PsyObjManager) == 0x000050, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_GetPsychicObjectManager_PsyObjManager' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_GetComponentByClass_ReturnValue) == 0x000060, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_GetPsychicObjectManager_PsyObjManager_1) == 0x000068, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_GetPsychicObjectManager_PsyObjManager_1' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000070, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_GetBrainFieldManager_Manager) == 0x000078, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_GetBrainFieldManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, K2Node_DynamicCast_AsRSBattle_Player) == 0x000080, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, K2Node_DynamicCast_AsBPI_ENpc_Interface) == 0x000090, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::K2Node_DynamicCast_AsBPI_ENpc_Interface' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_Em8000_GetPartner_PartnerActor) == 0x0000A8, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_Em8000_GetPartner_PartnerActor' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_GetTransform_ReturnValue) == 0x0000B0, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_IsValid_ReturnValue_1) == 0x0000E0, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_GetOwner_ReturnValue) == 0x0000E8, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_GetBrainFieldManager_Manager_1) == 0x0000F0, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_GetBrainFieldManager_Manager_1' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_IsValid_ReturnValue_2) == 0x0000F8, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_GetPsychicObjectManager_PsyObjManager_2) == 0x000100, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_GetPsychicObjectManager_PsyObjManager_2' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_IsValid_ReturnValue_3) == 0x000108, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_BreakTransform_Location) == 0x00010C, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_BreakTransform_Rotation) == 0x000118, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_BreakTransform_Scale) == 0x000124, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_GetPlayerManager_PlayerManager) == 0x000130, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_GetOwner_ReturnValue_1) == 0x000138, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_IsValid_ReturnValue_4) == 0x000140, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_GetDisplayName_ReturnValue) == 0x000148, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_Conv_StringToText_ReturnValue) == 0x000158, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_SpawnNotPartyPlayer_Player) == 0x000170, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_SpawnNotPartyPlayer_Player' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, K2Node_MakeStruct_FormatArgumentData) == 0x000178, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, K2Node_MakeArray_Array) == 0x0001B8, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_ReturnMetamorphosis_self_CastInput) == 0x0001C8, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_ReturnMetamorphosis_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_ReturnMetamorphosis_Dummy) == 0x0001D8, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_ReturnMetamorphosis_Dummy' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_Format_ReturnValue) == 0x0001E0, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_BreakTransform_Location_1) == 0x0001F8, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_BreakTransform_Rotation_1) == 0x000204, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_BreakTransform_Scale_1) == 0x000210, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00021C, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, K2Node_DynamicCast_AsBPI_Player_Interface) == 0x000220, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::K2Node_DynamicCast_AsBPI_Player_Interface' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, K2Node_DynamicCast_bSuccess_2) == 0x000230, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_IsValid_ReturnValue_5) == 0x000231, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishMetamorphosis, CallFunc_ReturnMetamorphosis_Dummy_1) == 0x000232, "Member 'BP_NPCMetamorphosisComponent_C_FinishMetamorphosis::CallFunc_ReturnMetamorphosis_Dummy_1' has a wrong offset!");

// Function BP_NPCMetamorphosisComponent.BP_NPCMetamorphosisComponent_C.UpdateMetamorphosis
// 0x0028 (0x0028 - 0x0000)
struct BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          L_bReturn;                                         // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8ACE[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8ACF[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PlayerAIComponent_C*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetFinishMetamorphosis_Dummy;             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AD0[0x1];                                     // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_UpdateTimer_ReturnValue;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis) == 0x000008, "Wrong alignment on BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis");
static_assert(sizeof(BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis) == 0x000028, "Wrong size on BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis, DeltaSeconds) == 0x000000, "Member 'BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis, L_bReturn) == 0x000004, "Member 'BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis::L_bReturn' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis, K2Node_SwitchInteger_CmpSuccess) == 0x000021, "Member 'BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis, CallFunc_SetFinishMetamorphosis_Dummy) == 0x000022, "Member 'BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis::CallFunc_SetFinishMetamorphosis_Dummy' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis, CallFunc_UpdateTimer_ReturnValue) == 0x000024, "Member 'BP_NPCMetamorphosisComponent_C_UpdateMetamorphosis::CallFunc_UpdateTimer_ReturnValue' has a wrong offset!");

// Function BP_NPCMetamorphosisComponent.BP_NPCMetamorphosisComponent_C.SetMetamorphosisParam
// 0x0010 (0x0010 - 0x0000)
struct BP_NPCMetamorphosisComponent_C_SetMetamorphosisParam final
{
public:
	class AActor*                                 Parent;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnSeconds;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPCMetamorphosisComponent_C_SetMetamorphosisParam) == 0x000008, "Wrong alignment on BP_NPCMetamorphosisComponent_C_SetMetamorphosisParam");
static_assert(sizeof(BP_NPCMetamorphosisComponent_C_SetMetamorphosisParam) == 0x000010, "Wrong size on BP_NPCMetamorphosisComponent_C_SetMetamorphosisParam");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_SetMetamorphosisParam, Parent) == 0x000000, "Member 'BP_NPCMetamorphosisComponent_C_SetMetamorphosisParam::Parent' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_SetMetamorphosisParam, ReturnSeconds) == 0x000008, "Member 'BP_NPCMetamorphosisComponent_C_SetMetamorphosisParam::ReturnSeconds' has a wrong offset!");

// Function BP_NPCMetamorphosisComponent.BP_NPCMetamorphosisComponent_C.FinishLastAttack
// 0x0040 (0x0040 - 0x0000)
struct BP_NPCMetamorphosisComponent_C_FinishLastAttack final
{
public:
	bool                                          bResult;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          L_result;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AD1[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_ENpcInterface_C>  K2Node_DynamicCast_AsBPI_ENpc_Interface;           // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Em8010_StartFinishMetamorphosis_bDummy;   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_EnemyTransformationComponent_C*     CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPCMetamorphosisComponent_C_FinishLastAttack) == 0x000008, "Wrong alignment on BP_NPCMetamorphosisComponent_C_FinishLastAttack");
static_assert(sizeof(BP_NPCMetamorphosisComponent_C_FinishLastAttack) == 0x000040, "Wrong size on BP_NPCMetamorphosisComponent_C_FinishLastAttack");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishLastAttack, bResult) == 0x000000, "Member 'BP_NPCMetamorphosisComponent_C_FinishLastAttack::bResult' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishLastAttack, L_result) == 0x000001, "Member 'BP_NPCMetamorphosisComponent_C_FinishLastAttack::L_result' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishLastAttack, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_NPCMetamorphosisComponent_C_FinishLastAttack::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishLastAttack, K2Node_DynamicCast_AsBPI_ENpc_Interface) == 0x000010, "Member 'BP_NPCMetamorphosisComponent_C_FinishLastAttack::K2Node_DynamicCast_AsBPI_ENpc_Interface' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishLastAttack, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_NPCMetamorphosisComponent_C_FinishLastAttack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishLastAttack, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000021, "Member 'BP_NPCMetamorphosisComponent_C_FinishLastAttack::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishLastAttack, CallFunc_Em8010_StartFinishMetamorphosis_bDummy) == 0x000022, "Member 'BP_NPCMetamorphosisComponent_C_FinishLastAttack::CallFunc_Em8010_StartFinishMetamorphosis_bDummy' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishLastAttack, CallFunc_IsValid_ReturnValue) == 0x000023, "Member 'BP_NPCMetamorphosisComponent_C_FinishLastAttack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishLastAttack, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000024, "Member 'BP_NPCMetamorphosisComponent_C_FinishLastAttack::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishLastAttack, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'BP_NPCMetamorphosisComponent_C_FinishLastAttack::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishLastAttack, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BP_NPCMetamorphosisComponent_C_FinishLastAttack::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_NPCMetamorphosisComponent.BP_NPCMetamorphosisComponent_C.FinishCancelAction
// 0x0040 (0x0040 - 0x0000)
struct BP_NPCMetamorphosisComponent_C_FinishCancelAction final
{
public:
	EEnpcMetamorphosisiFinishType                 Param_FinishType;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FromForward;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReactionChance;                                    // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDummy;                                            // 0x0003(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsExecMetamorphosis_bExec;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AD2[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_ENpcInterface_C>  K2Node_DynamicCast_AsBPI_ENpc_Interface;           // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Em8010_StartFinishMetamorphosis_bDummy;   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AD3[0x1];                                     // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_EnemyTransformationComponent_C*     CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPCMetamorphosisComponent_C_FinishCancelAction) == 0x000008, "Wrong alignment on BP_NPCMetamorphosisComponent_C_FinishCancelAction");
static_assert(sizeof(BP_NPCMetamorphosisComponent_C_FinishCancelAction) == 0x000040, "Wrong size on BP_NPCMetamorphosisComponent_C_FinishCancelAction");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishCancelAction, Param_FinishType) == 0x000000, "Member 'BP_NPCMetamorphosisComponent_C_FinishCancelAction::Param_FinishType' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishCancelAction, FromForward) == 0x000001, "Member 'BP_NPCMetamorphosisComponent_C_FinishCancelAction::FromForward' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishCancelAction, ReactionChance) == 0x000002, "Member 'BP_NPCMetamorphosisComponent_C_FinishCancelAction::ReactionChance' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishCancelAction, bDummy) == 0x000003, "Member 'BP_NPCMetamorphosisComponent_C_FinishCancelAction::bDummy' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishCancelAction, CallFunc_IsExecMetamorphosis_bExec) == 0x000004, "Member 'BP_NPCMetamorphosisComponent_C_FinishCancelAction::CallFunc_IsExecMetamorphosis_bExec' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishCancelAction, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_NPCMetamorphosisComponent_C_FinishCancelAction::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishCancelAction, K2Node_DynamicCast_AsBPI_ENpc_Interface) == 0x000010, "Member 'BP_NPCMetamorphosisComponent_C_FinishCancelAction::K2Node_DynamicCast_AsBPI_ENpc_Interface' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishCancelAction, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_NPCMetamorphosisComponent_C_FinishCancelAction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishCancelAction, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BP_NPCMetamorphosisComponent_C_FinishCancelAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishCancelAction, CallFunc_Em8010_StartFinishMetamorphosis_bDummy) == 0x000022, "Member 'BP_NPCMetamorphosisComponent_C_FinishCancelAction::CallFunc_Em8010_StartFinishMetamorphosis_bDummy' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishCancelAction, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000024, "Member 'BP_NPCMetamorphosisComponent_C_FinishCancelAction::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishCancelAction, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'BP_NPCMetamorphosisComponent_C_FinishCancelAction::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_FinishCancelAction, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BP_NPCMetamorphosisComponent_C_FinishCancelAction::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_NPCMetamorphosisComponent.BP_NPCMetamorphosisComponent_C.AlreadyStartedSetting
// 0x000C (0x000C - 0x0000)
struct BP_NPCMetamorphosisComponent_C_AlreadyStartedSetting final
{
public:
	EPlayerID                                     ReturnPlayerID;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8AD4[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnSeconds;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_bNotFinishCancelAction;                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDummy;                                            // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPCMetamorphosisComponent_C_AlreadyStartedSetting) == 0x000004, "Wrong alignment on BP_NPCMetamorphosisComponent_C_AlreadyStartedSetting");
static_assert(sizeof(BP_NPCMetamorphosisComponent_C_AlreadyStartedSetting) == 0x00000C, "Wrong size on BP_NPCMetamorphosisComponent_C_AlreadyStartedSetting");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_AlreadyStartedSetting, ReturnPlayerID) == 0x000000, "Member 'BP_NPCMetamorphosisComponent_C_AlreadyStartedSetting::ReturnPlayerID' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_AlreadyStartedSetting, ReturnSeconds) == 0x000004, "Member 'BP_NPCMetamorphosisComponent_C_AlreadyStartedSetting::ReturnSeconds' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_AlreadyStartedSetting, Param_bNotFinishCancelAction) == 0x000008, "Member 'BP_NPCMetamorphosisComponent_C_AlreadyStartedSetting::Param_bNotFinishCancelAction' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_AlreadyStartedSetting, bDummy) == 0x000009, "Member 'BP_NPCMetamorphosisComponent_C_AlreadyStartedSetting::bDummy' has a wrong offset!");

// Function BP_NPCMetamorphosisComponent.BP_NPCMetamorphosisComponent_C.ReserveFinishCancelAction
// 0x000C (0x000C - 0x0000)
struct BP_NPCMetamorphosisComponent_C_ReserveFinishCancelAction final
{
public:
	EEnpcMetamorphosisiFinishType                 Param_FinishType;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromForward;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bReactionChance;                                   // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AD5[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReserveSeconds;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDummy;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReservedFinishCancelAction_bReserved;   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPCMetamorphosisComponent_C_ReserveFinishCancelAction) == 0x000004, "Wrong alignment on BP_NPCMetamorphosisComponent_C_ReserveFinishCancelAction");
static_assert(sizeof(BP_NPCMetamorphosisComponent_C_ReserveFinishCancelAction) == 0x00000C, "Wrong size on BP_NPCMetamorphosisComponent_C_ReserveFinishCancelAction");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_ReserveFinishCancelAction, Param_FinishType) == 0x000000, "Member 'BP_NPCMetamorphosisComponent_C_ReserveFinishCancelAction::Param_FinishType' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_ReserveFinishCancelAction, bFromForward) == 0x000001, "Member 'BP_NPCMetamorphosisComponent_C_ReserveFinishCancelAction::bFromForward' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_ReserveFinishCancelAction, bReactionChance) == 0x000002, "Member 'BP_NPCMetamorphosisComponent_C_ReserveFinishCancelAction::bReactionChance' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_ReserveFinishCancelAction, ReserveSeconds) == 0x000004, "Member 'BP_NPCMetamorphosisComponent_C_ReserveFinishCancelAction::ReserveSeconds' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_ReserveFinishCancelAction, bDummy) == 0x000008, "Member 'BP_NPCMetamorphosisComponent_C_ReserveFinishCancelAction::bDummy' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_ReserveFinishCancelAction, CallFunc_IsReservedFinishCancelAction_bReserved) == 0x000009, "Member 'BP_NPCMetamorphosisComponent_C_ReserveFinishCancelAction::CallFunc_IsReservedFinishCancelAction_bReserved' has a wrong offset!");

// Function BP_NPCMetamorphosisComponent.BP_NPCMetamorphosisComponent_C.UpdateReserve
// 0x0010 (0x0010 - 0x0000)
struct BP_NPCMetamorphosisComponent_C_UpdateReserve final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDummy;                                            // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FinishCancelAction_bDummy;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AD6[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPCMetamorphosisComponent_C_UpdateReserve) == 0x000004, "Wrong alignment on BP_NPCMetamorphosisComponent_C_UpdateReserve");
static_assert(sizeof(BP_NPCMetamorphosisComponent_C_UpdateReserve) == 0x000010, "Wrong size on BP_NPCMetamorphosisComponent_C_UpdateReserve");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_UpdateReserve, DeltaSeconds) == 0x000000, "Member 'BP_NPCMetamorphosisComponent_C_UpdateReserve::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_UpdateReserve, bDummy) == 0x000004, "Member 'BP_NPCMetamorphosisComponent_C_UpdateReserve::bDummy' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_UpdateReserve, CallFunc_FinishCancelAction_bDummy) == 0x000005, "Member 'BP_NPCMetamorphosisComponent_C_UpdateReserve::CallFunc_FinishCancelAction_bDummy' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_UpdateReserve, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_NPCMetamorphosisComponent_C_UpdateReserve::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_UpdateReserve, CallFunc_Less_IntInt_ReturnValue) == 0x00000C, "Member 'BP_NPCMetamorphosisComponent_C_UpdateReserve::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_UpdateReserve, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00000D, "Member 'BP_NPCMetamorphosisComponent_C_UpdateReserve::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_UpdateReserve, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000E, "Member 'BP_NPCMetamorphosisComponent_C_UpdateReserve::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_NPCMetamorphosisComponent.BP_NPCMetamorphosisComponent_C.SetFinishType
// 0x0002 (0x0002 - 0x0000)
struct BP_NPCMetamorphosisComponent_C_SetFinishType final
{
public:
	EEnpcMetamorphosisiFinishType                 Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDummy;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPCMetamorphosisComponent_C_SetFinishType) == 0x000001, "Wrong alignment on BP_NPCMetamorphosisComponent_C_SetFinishType");
static_assert(sizeof(BP_NPCMetamorphosisComponent_C_SetFinishType) == 0x000002, "Wrong size on BP_NPCMetamorphosisComponent_C_SetFinishType");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_SetFinishType, Type) == 0x000000, "Member 'BP_NPCMetamorphosisComponent_C_SetFinishType::Type' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_SetFinishType, bDummy) == 0x000001, "Member 'BP_NPCMetamorphosisComponent_C_SetFinishType::bDummy' has a wrong offset!");

// Function BP_NPCMetamorphosisComponent.BP_NPCMetamorphosisComponent_C.IsExecMetamorphosis
// 0x0003 (0x0003 - 0x0000)
struct BP_NPCMetamorphosisComponent_C_IsExecMetamorphosis final
{
public:
	bool                                          bExec;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          L_result;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPCMetamorphosisComponent_C_IsExecMetamorphosis) == 0x000001, "Wrong alignment on BP_NPCMetamorphosisComponent_C_IsExecMetamorphosis");
static_assert(sizeof(BP_NPCMetamorphosisComponent_C_IsExecMetamorphosis) == 0x000003, "Wrong size on BP_NPCMetamorphosisComponent_C_IsExecMetamorphosis");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_IsExecMetamorphosis, bExec) == 0x000000, "Member 'BP_NPCMetamorphosisComponent_C_IsExecMetamorphosis::bExec' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_IsExecMetamorphosis, L_result) == 0x000001, "Member 'BP_NPCMetamorphosisComponent_C_IsExecMetamorphosis::L_result' has a wrong offset!");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_IsExecMetamorphosis, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000002, "Member 'BP_NPCMetamorphosisComponent_C_IsExecMetamorphosis::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_NPCMetamorphosisComponent.BP_NPCMetamorphosisComponent_C.GetFinishType
// 0x0001 (0x0001 - 0x0000)
struct BP_NPCMetamorphosisComponent_C_GetFinishType final
{
public:
	EEnpcMetamorphosisiFinishType                 Param_FinishType;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPCMetamorphosisComponent_C_GetFinishType) == 0x000001, "Wrong alignment on BP_NPCMetamorphosisComponent_C_GetFinishType");
static_assert(sizeof(BP_NPCMetamorphosisComponent_C_GetFinishType) == 0x000001, "Wrong size on BP_NPCMetamorphosisComponent_C_GetFinishType");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_GetFinishType, Param_FinishType) == 0x000000, "Member 'BP_NPCMetamorphosisComponent_C_GetFinishType::Param_FinishType' has a wrong offset!");

// Function BP_NPCMetamorphosisComponent.BP_NPCMetamorphosisComponent_C.IsCancelFromForward
// 0x0001 (0x0001 - 0x0000)
struct BP_NPCMetamorphosisComponent_C_IsCancelFromForward final
{
public:
	bool                                          FromForward;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPCMetamorphosisComponent_C_IsCancelFromForward) == 0x000001, "Wrong alignment on BP_NPCMetamorphosisComponent_C_IsCancelFromForward");
static_assert(sizeof(BP_NPCMetamorphosisComponent_C_IsCancelFromForward) == 0x000001, "Wrong size on BP_NPCMetamorphosisComponent_C_IsCancelFromForward");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_IsCancelFromForward, FromForward) == 0x000000, "Member 'BP_NPCMetamorphosisComponent_C_IsCancelFromForward::FromForward' has a wrong offset!");

// Function BP_NPCMetamorphosisComponent.BP_NPCMetamorphosisComponent_C.IsCancelReactionChance
// 0x0001 (0x0001 - 0x0000)
struct BP_NPCMetamorphosisComponent_C_IsCancelReactionChance final
{
public:
	bool                                          FromForward;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPCMetamorphosisComponent_C_IsCancelReactionChance) == 0x000001, "Wrong alignment on BP_NPCMetamorphosisComponent_C_IsCancelReactionChance");
static_assert(sizeof(BP_NPCMetamorphosisComponent_C_IsCancelReactionChance) == 0x000001, "Wrong size on BP_NPCMetamorphosisComponent_C_IsCancelReactionChance");
static_assert(offsetof(BP_NPCMetamorphosisComponent_C_IsCancelReactionChance, FromForward) == 0x000000, "Member 'BP_NPCMetamorphosisComponent_C_IsCancelReactionChance::FromForward' has a wrong offset!");

// Function BP_NPCMetamorphosisComponent.BP_NPCMetamorphosisComponent_C.IsWaitLastAttack
// 0x0002 (0x0002 - 0x0000)
struct BP_NPCMetamorphosisComponent_C_IsWaitLastAttack final
{
public:
