#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NpcShopBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NpcShopBase.BP_NpcShopBase_C
// 0x0018 (0x02E0 - 0x02C8)
class ABP_NpcShopBase_C final : public ANpcShopBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        IconPosition;                                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_NpcShopBase(int32 EntryPoint);
	void ReceiveBeginPlay();
	class AActor* ActionManagerGetPairActor();

	float ActionManagerGetEditableAngle() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NpcShopBase_C">();
	}
	static class ABP_NpcShopBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NpcShopBase_C>();
	}
};
static_assert(alignof(ABP_NpcShopBase_C) == 0x000008, "Wrong alignment on ABP_NpcShopBase_C");
static_assert(sizeof(ABP_NpcShopBase_C) == 0x0002E0, "Wrong size on ABP_NpcShopBase_C");
static_assert(offsetof(ABP_NpcShopBase_C, UberGraphFrame) == 0x0002C8, "Member 'ABP_NpcShopBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_NpcShopBase_C, IconPosition) == 0x0002D0, "Member 'ABP_NpcShopBase_C::IconPosition' has a wrong offset!");
static_assert(offsetof(ABP_NpcShopBase_C, StaticMesh1) == 0x0002D8, "Member 'ABP_NpcShopBase_C::StaticMesh1' has a wrong offset!");

}

