#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerUpperActionStateAttack

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerUpperActionStateAttack.BP_PlayerUpperActionStateAttack_C.Enter
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerUpperActionStateAttack_C_Enter final
{
public:
	int32                                         Param;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Enter_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetBattleReady_bDummy;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ERSAttackInputKind                            CallFunc_GetAttackInputKind_AttackKind;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerUpperActionStateAttack_C_Enter) == 0x000004, "Wrong alignment on BP_PlayerUpperActionStateAttack_C_Enter");
static_assert(sizeof(BP_PlayerUpperActionStateAttack_C_Enter) == 0x000010, "Wrong size on BP_PlayerUpperActionStateAttack_C_Enter");
static_assert(offsetof(BP_PlayerUpperActionStateAttack_C_Enter, Param) == 0x000000, "Member 'BP_PlayerUpperActionStateAttack_C_Enter::Param' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateAttack_C_Enter, ReturnValue) == 0x000004, "Member 'BP_PlayerUpperActionStateAttack_C_Enter::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateAttack_C_Enter, CallFunc_Enter_ReturnValue) == 0x000008, "Member 'BP_PlayerUpperActionStateAttack_C_Enter::CallFunc_Enter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateAttack_C_Enter, CallFunc_SetBattleReady_bDummy) == 0x00000C, "Member 'BP_PlayerUpperActionStateAttack_C_Enter::CallFunc_SetBattleReady_bDummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateAttack_C_Enter, CallFunc_GetAttackInputKind_AttackKind) == 0x00000D, "Member 'BP_PlayerUpperActionStateAttack_C_Enter::CallFunc_GetAttackInputKind_AttackKind' has a wrong offset!");

// Function BP_PlayerUpperActionStateAttack.BP_PlayerUpperActionStateAttack_C.Update
// 0x000C (0x000C - 0x0000)
struct BP_PlayerUpperActionStateAttack_C_Update final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAttacking_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11F8[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Update_ReturnValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerUpperActionStateAttack_C_Update) == 0x000004, "Wrong alignment on BP_PlayerUpperActionStateAttack_C_Update");
static_assert(sizeof(BP_PlayerUpperActionStateAttack_C_Update) == 0x00000C, "Wrong size on BP_PlayerUpperActionStateAttack_C_Update");
static_assert(offsetof(BP_PlayerUpperActionStateAttack_C_Update, ReturnValue) == 0x000000, "Member 'BP_PlayerUpperActionStateAttack_C_Update::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateAttack_C_Update, CallFunc_IsAttacking_ReturnValue) == 0x000004, "Member 'BP_PlayerUpperActionStateAttack_C_Update::CallFunc_IsAttacking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateAttack_C_Update, CallFunc_Update_ReturnValue) == 0x000008, "Member 'BP_PlayerUpperActionStateAttack_C_Update::CallFunc_Update_ReturnValue' has a wrong offset!");

// Function BP_PlayerUpperActionStateAttack.BP_PlayerUpperActionStateAttack_C.Exit
// 0x0028 (0x0028 - 0x0000)
struct BP_PlayerUpperActionStateAttack_C_Exit final
{
public:
	int32                                         NextStateIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Exit_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11F9[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_LookAtInterface_C> CallFunc_SetLookAtEnable_self_CastInput;           // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetLookAtEnable_bResult;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerUpperActionStateAttack_C_Exit) == 0x000008, "Wrong alignment on BP_PlayerUpperActionStateAttack_C_Exit");
static_assert(sizeof(BP_PlayerUpperActionStateAttack_C_Exit) == 0x000028, "Wrong size on BP_PlayerUpperActionStateAttack_C_Exit");
static_assert(offsetof(BP_PlayerUpperActionStateAttack_C_Exit, NextStateIndex) == 0x000000, "Member 'BP_PlayerUpperActionStateAttack_C_Exit::NextStateIndex' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateAttack_C_Exit, ReturnValue) == 0x000004, "Member 'BP_PlayerUpperActionStateAttack_C_Exit::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateAttack_C_Exit, CallFunc_Exit_ReturnValue) == 0x000008, "Member 'BP_PlayerUpperActionStateAttack_C_Exit::CallFunc_Exit_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateAttack_C_Exit, CallFunc_SetLookAtEnable_self_CastInput) == 0x000010, "Member 'BP_PlayerUpperActionStateAttack_C_Exit::CallFunc_SetLookAtEnable_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateAttack_C_Exit, CallFunc_SetLookAtEnable_bResult) == 0x000020, "Member 'BP_PlayerUpperActionStateAttack_C_Exit::CallFunc_SetLookAtEnable_bResult' has a wrong offset!");

// Function BP_PlayerUpperActionStateAttack.BP_PlayerUpperActionStateAttack_C.SetSuperArmor
// 0x0020 (0x0020 - 0x0000)
struct BP_PlayerUpperActionStateAttack_C_SetSuperArmor final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetPlayerAccessoryEffect_bEquip;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11FA[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayerAccessoryEffect_Param;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_IsEnemyPlayer_self_CastInput;             // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemyPlayer_bEnemyPlayer;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerUpperActionStateAttack_C_SetSuperArmor) == 0x000008, "Wrong alignment on BP_PlayerUpperActionStateAttack_C_SetSuperArmor");
static_assert(sizeof(BP_PlayerUpperActionStateAttack_C_SetSuperArmor) == 0x000020, "Wrong size on BP_PlayerUpperActionStateAttack_C_SetSuperArmor");
static_assert(offsetof(BP_PlayerUpperActionStateAttack_C_SetSuperArmor, bEnable) == 0x000000, "Member 'BP_PlayerUpperActionStateAttack_C_SetSuperArmor::bEnable' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateAttack_C_SetSuperArmor, CallFunc_GetPlayerAccessoryEffect_bEquip) == 0x000001, "Member 'BP_PlayerUpperActionStateAttack_C_SetSuperArmor::CallFunc_GetPlayerAccessoryEffect_bEquip' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateAttack_C_SetSuperArmor, CallFunc_GetPlayerAccessoryEffect_Param) == 0x000004, "Member 'BP_PlayerUpperActionStateAttack_C_SetSuperArmor::CallFunc_GetPlayerAccessoryEffect_Param' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateAttack_C_SetSuperArmor, CallFunc_IsEnemyPlayer_self_CastInput) == 0x000008, "Member 'BP_PlayerUpperActionStateAttack_C_SetSuperArmor::CallFunc_IsEnemyPlayer_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateAttack_C_SetSuperArmor, CallFunc_IsEnemyPlayer_bEnemyPlayer) == 0x000018, "Member 'BP_PlayerUpperActionStateAttack_C_SetSuperArmor::CallFunc_IsEnemyPlayer_bEnemyPlayer' has a wrong offset!");

}

