#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerActionStateDamage

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "BP_PlayerActionStateCommonBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerActionStateDamage.BP_PlayerActionStateDamage_C
// 0x0018 (0x0100 - 0x00E8)
class UBP_PlayerActionStateDamage_C : public UBP_PlayerActionStateCommonBase_C
{
public:
	EPlayerDamageKind                             DamageType;                                        // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bResetHologram;                                    // 0x00E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9865[0x2];                                     // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ClaimantName_CoverDamage;                          // 0x00EC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterHitPriority                         StoreCharacterHitPriority;                         // 0x00F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     CoverDamagePlayer;                                 // 0x00F5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCopyFlag;                                         // 0x00F6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9866[0x1];                                     // 0x00F7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ClaimantName_ElectricDownStart;                    // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int32 Enter(int32 Param);
	int32 Update();
	bool Transition();
	int32 Exit(int32 NextStateIndex);
	void RequestHologramAnim(bool* bHologram);
	void IsDeadReaction(bool* bDead);
	void CheckHologramAttack(EPlayerDamageKind Kind);
	void VibrationUI(EPlayerDamageKind Kind);
	void GetDownType(EPlayerDownType* DownType);

	void IsTransitionDown(EPlayerDamageKind Kind, bool* bTransition) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerActionStateDamage_C">();
	}
	static class UBP_PlayerActionStateDamage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PlayerActionStateDamage_C>();
	}
};
static_assert(alignof(UBP_PlayerActionStateDamage_C) == 0x000008, "Wrong alignment on UBP_PlayerActionStateDamage_C");
static_assert(sizeof(UBP_PlayerActionStateDamage_C) == 0x000100, "Wrong size on UBP_PlayerActionStateDamage_C");
static_assert(offsetof(UBP_PlayerActionStateDamage_C, DamageType) == 0x0000E8, "Member 'UBP_PlayerActionStateDamage_C::DamageType' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateDamage_C, bResetHologram) == 0x0000E9, "Member 'UBP_PlayerActionStateDamage_C::bResetHologram' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateDamage_C, ClaimantName_CoverDamage) == 0x0000EC, "Member 'UBP_PlayerActionStateDamage_C::ClaimantName_CoverDamage' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateDamage_C, StoreCharacterHitPriority) == 0x0000F4, "Member 'UBP_PlayerActionStateDamage_C::StoreCharacterHitPriority' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateDamage_C, CoverDamagePlayer) == 0x0000F5, "Member 'UBP_PlayerActionStateDamage_C::CoverDamagePlayer' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateDamage_C, bCopyFlag) == 0x0000F6, "Member 'UBP_PlayerActionStateDamage_C::bCopyFlag' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateDamage_C, ClaimantName_ElectricDownStart) == 0x0000F8, "Member 'UBP_PlayerActionStateDamage_C::ClaimantName_ElectricDownStart' has a wrong offset!");

}

