#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerCameraComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerCameraComponent.BP_PlayerCameraComponent_C.ExecuteUbergraph_BP_PlayerCameraComponent
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerCameraComponent_C_ExecuteUbergraph_BP_PlayerCameraComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40D6[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerCameraComponent_C_ExecuteUbergraph_BP_PlayerCameraComponent) == 0x000004, "Wrong alignment on BP_PlayerCameraComponent_C_ExecuteUbergraph_BP_PlayerCameraComponent");
static_assert(sizeof(BP_PlayerCameraComponent_C_ExecuteUbergraph_BP_PlayerCameraComponent) == 0x000010, "Wrong size on BP_PlayerCameraComponent_C_ExecuteUbergraph_BP_PlayerCameraComponent");
static_assert(offsetof(BP_PlayerCameraComponent_C_ExecuteUbergraph_BP_PlayerCameraComponent, EntryPoint) == 0x000000, "Member 'BP_PlayerCameraComponent_C_ExecuteUbergraph_BP_PlayerCameraComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_ExecuteUbergraph_BP_PlayerCameraComponent, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_PlayerCameraComponent_C_ExecuteUbergraph_BP_PlayerCameraComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_ExecuteUbergraph_BP_PlayerCameraComponent, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_PlayerCameraComponent_C_ExecuteUbergraph_BP_PlayerCameraComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_ExecuteUbergraph_BP_PlayerCameraComponent, K2Node_Event_EndPlayReason) == 0x00000C, "Member 'BP_PlayerCameraComponent_C_ExecuteUbergraph_BP_PlayerCameraComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_ExecuteUbergraph_BP_PlayerCameraComponent, CallFunc_IsValid_ReturnValue_1) == 0x00000D, "Member 'BP_PlayerCameraComponent_C_ExecuteUbergraph_BP_PlayerCameraComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_PlayerCameraComponent.BP_PlayerCameraComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerCameraComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerCameraComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_PlayerCameraComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_PlayerCameraComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_PlayerCameraComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_PlayerCameraComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_PlayerCameraComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_PlayerCameraComponent.BP_PlayerCameraComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PlayerCameraComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerCameraComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PlayerCameraComponent_C_ReceiveTick");
static_assert(sizeof(BP_PlayerCameraComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_PlayerCameraComponent_C_ReceiveTick");
static_assert(offsetof(BP_PlayerCameraComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PlayerCameraComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PlayerCameraComponent.BP_PlayerCameraComponent_C.InitializeComponent
// 0x00C0 (0x00C0 - 0x0000)
struct BP_PlayerCameraComponent_C_InitializeComponent final
{
public:
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_IsCameraControl_self_CastInput;           // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCameraControl_bControl;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40D7[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraActor*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IPlayerInterface>      CallFunc_GetPlayerID_self_CastInput;               // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40D8[0x5];                                     // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40D9[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40DA[0x6];                                     // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerCameraComponent_C_InitializeComponent) == 0x000010, "Wrong alignment on BP_PlayerCameraComponent_C_InitializeComponent");
static_assert(sizeof(BP_PlayerCameraComponent_C_InitializeComponent) == 0x0000C0, "Wrong size on BP_PlayerCameraComponent_C_InitializeComponent");
static_assert(offsetof(BP_PlayerCameraComponent_C_InitializeComponent, CallFunc_MakeTransform_ReturnValue) == 0x000000, "Member 'BP_PlayerCameraComponent_C_InitializeComponent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_InitializeComponent, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000030, "Member 'BP_PlayerCameraComponent_C_InitializeComponent::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_InitializeComponent, CallFunc_IsCameraControl_self_CastInput) == 0x000038, "Member 'BP_PlayerCameraComponent_C_InitializeComponent::CallFunc_IsCameraControl_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_InitializeComponent, CallFunc_IsCameraControl_bControl) == 0x000048, "Member 'BP_PlayerCameraComponent_C_InitializeComponent::CallFunc_IsCameraControl_bControl' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_InitializeComponent, CallFunc_FinishSpawningActor_ReturnValue) == 0x000050, "Member 'BP_PlayerCameraComponent_C_InitializeComponent::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_InitializeComponent, CallFunc_GetPlayerID_self_CastInput) == 0x000058, "Member 'BP_PlayerCameraComponent_C_InitializeComponent::CallFunc_GetPlayerID_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_InitializeComponent, CallFunc_GetPlayerID_ReturnValue) == 0x000068, "Member 'BP_PlayerCameraComponent_C_InitializeComponent::CallFunc_GetPlayerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_InitializeComponent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000069, "Member 'BP_PlayerCameraComponent_C_InitializeComponent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_InitializeComponent, CallFunc_IsValid_ReturnValue) == 0x00006A, "Member 'BP_PlayerCameraComponent_C_InitializeComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_InitializeComponent, CallFunc_GetPlayerController_ReturnValue) == 0x000070, "Member 'BP_PlayerCameraComponent_C_InitializeComponent::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_InitializeComponent, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'BP_PlayerCameraComponent_C_InitializeComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_InitializeComponent, CallFunc_K2_GetPawn_ReturnValue) == 0x000080, "Member 'BP_PlayerCameraComponent_C_InitializeComponent::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_InitializeComponent, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000088, "Member 'BP_PlayerCameraComponent_C_InitializeComponent::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_InitializeComponent, CallFunc_MakeLiteralByte_ReturnValue) == 0x000089, "Member 'BP_PlayerCameraComponent_C_InitializeComponent::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_InitializeComponent, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000090, "Member 'BP_PlayerCameraComponent_C_InitializeComponent::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_InitializeComponent, CallFunc_GetPlayerController_ReturnValue_1) == 0x000098, "Member 'BP_PlayerCameraComponent_C_InitializeComponent::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_InitializeComponent, CallFunc_GetOwner_ReturnValue) == 0x0000A0, "Member 'BP_PlayerCameraComponent_C_InitializeComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_InitializeComponent, K2Node_DynamicCast_AsRSBattle_Player) == 0x0000A8, "Member 'BP_PlayerCameraComponent_C_InitializeComponent::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_InitializeComponent, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'BP_PlayerCameraComponent_C_InitializeComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_PlayerCameraComponent.BP_PlayerCameraComponent_C.Update
// 0x0018 (0x0018 - 0x0000)
struct BP_PlayerCameraComponent_C_Update final
{
public:
	class FString                                 L_str;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	float                                         L_rate;                                            // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerCameraComponent_C_Update) == 0x000008, "Wrong alignment on BP_PlayerCameraComponent_C_Update");
static_assert(sizeof(BP_PlayerCameraComponent_C_Update) == 0x000018, "Wrong size on BP_PlayerCameraComponent_C_Update");
static_assert(offsetof(BP_PlayerCameraComponent_C_Update, L_str) == 0x000000, "Member 'BP_PlayerCameraComponent_C_Update::L_str' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_Update, L_rate) == 0x000010, "Member 'BP_PlayerCameraComponent_C_Update::L_rate' has a wrong offset!");

// Function BP_PlayerCameraComponent.BP_PlayerCameraComponent_C.GetCameraPreset
// 0x06E8 (0x06E8 - 0x0000)
struct BP_PlayerCameraComponent_C_GetCameraPreset final
{
public:
	EPlayerCameraPreset                           PresetName;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40DB[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerCameraPreset                    DstPreset;                                         // 0x0008(0x00E0)(Parm, OutParm)
	bool                                          bOffset;                                           // 0x00E8(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x00E9(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40DC[0x2];                                     // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   L_presetRowName;                                   // 0x00EC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40DD[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             L_dataTable;                                       // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayerCameraPreset                    L_preset;                                          // 0x0100(0x00E0)(Edit, BlueprintVisible)
	int32                                         L_index;                                           // 0x01E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40DE[0x4];                                     // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerCameraPreset                    K2Node_MakeStruct_PlayerCameraPreset;              // 0x01E8(0x00E0)()
	class FString                                 CallFunc_ConvCameraPresetToRowName_row_name;       // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40DF[0x7];                                     // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FPlayerCameraPreset                    CallFunc_GetDataTableRowFromName_OutRow;           // 0x0318(0x00E0)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40E0[0x7];                                     // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerCameraPreset                    CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0400(0x00E0)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40E1[0x7];                                     // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerCameraPreset                    CallFunc_Map_Find_Value;                           // 0x04E8(0x00E0)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40E2[0x7];                                     // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x05D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x05E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x05F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FPlayerCameraPreset                    CallFunc_Map_Find_Value_1;                         // 0x0600(0x00E0)()
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerCameraComponent_C_GetCameraPreset) == 0x000008, "Wrong alignment on BP_PlayerCameraComponent_C_GetCameraPreset");
static_assert(sizeof(BP_PlayerCameraComponent_C_GetCameraPreset) == 0x0006E8, "Wrong size on BP_PlayerCameraComponent_C_GetCameraPreset");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, PresetName) == 0x000000, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::PresetName' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, DstPreset) == 0x000008, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::DstPreset' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, bOffset) == 0x0000E8, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::bOffset' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, ReturnValue) == 0x0000E9, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, L_presetRowName) == 0x0000EC, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::L_presetRowName' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, L_dataTable) == 0x0000F8, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::L_dataTable' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, L_preset) == 0x000100, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::L_preset' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, L_index) == 0x0001E0, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::L_index' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, K2Node_MakeStruct_PlayerCameraPreset) == 0x0001E8, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::K2Node_MakeStruct_PlayerCameraPreset' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, CallFunc_ConvCameraPresetToRowName_row_name) == 0x0002C8, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::CallFunc_ConvCameraPresetToRowName_row_name' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, CallFunc_Conv_StringToName_ReturnValue) == 0x0002D8, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0002E0, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, CallFunc_Conv_NameToString_ReturnValue) == 0x0002E8, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, CallFunc_Concat_StrStr_ReturnValue) == 0x0002F8, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000308, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, CallFunc_GetDataTableRowFromName_OutRow) == 0x000318, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0003F8, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000400, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0004E0, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, CallFunc_Map_Find_Value) == 0x0004E8, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, CallFunc_Map_Find_ReturnValue) == 0x0005C8, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, CallFunc_GetDisplayName_ReturnValue) == 0x0005D0, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0005E0, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0005F0, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, CallFunc_Map_Find_Value_1) == 0x000600, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetCameraPreset, CallFunc_Map_Find_ReturnValue_1) == 0x0006E0, "Member 'BP_PlayerCameraComponent_C_GetCameraPreset::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");

// Function BP_PlayerCameraComponent.BP_PlayerCameraComponent_C.SetPlayerCameraViewTarget
// 0x0040 (0x0040 - 0x0000)
struct BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget final
{
public:
	float                                         blend_time_in;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EViewTargetBlendFunction                      blend_func_in;                                     // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40E3[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         blend_exp_in;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40E4[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 L_viewTgt;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetDebuggingManager_Manager;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40E5[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget) == 0x000008, "Wrong alignment on BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget");
static_assert(sizeof(BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget) == 0x000040, "Wrong size on BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget, blend_time_in) == 0x000000, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget::blend_time_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget, blend_func_in) == 0x000004, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget::blend_func_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget, blend_exp_in) == 0x000008, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget::blend_exp_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget, Return) == 0x00000C, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget::Return' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget, L_viewTgt) == 0x000010, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget::L_viewTgt' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000018, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget, CallFunc_GetDebuggingManager_Manager) == 0x000020, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget::CallFunc_GetDebuggingManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraViewTarget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_PlayerCameraComponent.BP_PlayerCameraComponent_C.SetPlayerCameraLocation
// 0x0020 (0x0020 - 0x0000)
struct BP_PlayerCameraComponent_C_SetPlayerCameraLocation final
{
public:
	struct FVector                                Pos_in;                                            // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40E6[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetDebuggingManager_Manager;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerCameraComponent_C_SetPlayerCameraLocation) == 0x000008, "Wrong alignment on BP_PlayerCameraComponent_C_SetPlayerCameraLocation");
static_assert(sizeof(BP_PlayerCameraComponent_C_SetPlayerCameraLocation) == 0x000020, "Wrong size on BP_PlayerCameraComponent_C_SetPlayerCameraLocation");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraLocation, Pos_in) == 0x000000, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraLocation::Pos_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraLocation, Return) == 0x00000C, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraLocation::Return' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraLocation, CallFunc_GetDebuggingManager_Manager) == 0x000010, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraLocation::CallFunc_GetDebuggingManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraLocation, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PlayerCameraComponent.BP_PlayerCameraComponent_C.SetPlayerCameraRotation
// 0x0038 (0x0038 - 0x0000)
struct BP_PlayerCameraComponent_C_SetPlayerCameraRotation final
{
public:
	struct FRotator                               Rot_in;                                            // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Return;                                            // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40E7[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40E8[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetDebuggingManager_Manager;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerCameraComponent_C_SetPlayerCameraRotation) == 0x000008, "Wrong alignment on BP_PlayerCameraComponent_C_SetPlayerCameraRotation");
static_assert(sizeof(BP_PlayerCameraComponent_C_SetPlayerCameraRotation) == 0x000038, "Wrong size on BP_PlayerCameraComponent_C_SetPlayerCameraRotation");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraRotation, Rot_in) == 0x000000, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraRotation::Rot_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraRotation, Return) == 0x00000C, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraRotation::Return' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraRotation, CallFunc_GetController_ReturnValue) == 0x000010, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraRotation::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraRotation, K2Node_DynamicCast_AsPlayer_Controller) == 0x000018, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraRotation::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraRotation, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraRotation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraRotation, CallFunc_GetDebuggingManager_Manager) == 0x000028, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraRotation::CallFunc_GetDebuggingManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraRotation, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraRotation::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PlayerCameraComponent.BP_PlayerCameraComponent_C.SetPlayerCameraDirection
// 0x0050 (0x0050 - 0x0000)
struct BP_PlayerCameraComponent_C_SetPlayerCameraDirection final
{
public:
	struct FVector                                Dir_in;                                            // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40E9[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               L_rot;                                             // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40EA[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40EB[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                CallFunc_GetDebuggingManager_Manager;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerCameraComponent_C_SetPlayerCameraDirection) == 0x000008, "Wrong alignment on BP_PlayerCameraComponent_C_SetPlayerCameraDirection");
static_assert(sizeof(BP_PlayerCameraComponent_C_SetPlayerCameraDirection) == 0x000050, "Wrong size on BP_PlayerCameraComponent_C_SetPlayerCameraDirection");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraDirection, Dir_in) == 0x000000, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraDirection::Dir_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraDirection, Return) == 0x00000C, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraDirection::Return' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraDirection, L_rot) == 0x000010, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraDirection::L_rot' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraDirection, CallFunc_GetController_ReturnValue) == 0x000020, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraDirection::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraDirection, K2Node_DynamicCast_AsPlayer_Controller) == 0x000028, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraDirection::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraDirection, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraDirection::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraDirection, CallFunc_MakeRotFromX_ReturnValue) == 0x000034, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraDirection::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraDirection, CallFunc_GetDebuggingManager_Manager) == 0x000040, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraDirection::CallFunc_GetDebuggingManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraDirection, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraDirection::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PlayerCameraComponent.BP_PlayerCameraComponent_C.SetPlayerCameraFieldOfView
// 0x0018 (0x0018 - 0x0000)
struct BP_PlayerCameraComponent_C_SetPlayerCameraFieldOfView final
{
public:
	float                                         FOV;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40EC[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetDebuggingManager_Manager;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerCameraComponent_C_SetPlayerCameraFieldOfView) == 0x000008, "Wrong alignment on BP_PlayerCameraComponent_C_SetPlayerCameraFieldOfView");
static_assert(sizeof(BP_PlayerCameraComponent_C_SetPlayerCameraFieldOfView) == 0x000018, "Wrong size on BP_PlayerCameraComponent_C_SetPlayerCameraFieldOfView");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraFieldOfView, FOV) == 0x000000, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraFieldOfView::FOV' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraFieldOfView, Return) == 0x000004, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraFieldOfView::Return' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraFieldOfView, CallFunc_GetDebuggingManager_Manager) == 0x000008, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraFieldOfView::CallFunc_GetDebuggingManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_SetPlayerCameraFieldOfView, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_PlayerCameraComponent_C_SetPlayerCameraFieldOfView::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PlayerCameraComponent.BP_PlayerCameraComponent_C.GetPlayerCameraLocation
// 0x0040 (0x0040 - 0x0000)
struct BP_PlayerCameraComponent_C_GetPlayerCameraLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40ED[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue_1;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetDebuggingManager_Manager;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerCameraComponent_C_GetPlayerCameraLocation) == 0x000008, "Wrong alignment on BP_PlayerCameraComponent_C_GetPlayerCameraLocation");
static_assert(sizeof(BP_PlayerCameraComponent_C_GetPlayerCameraLocation) == 0x000040, "Wrong size on BP_PlayerCameraComponent_C_GetPlayerCameraLocation");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraLocation, Location) == 0x000000, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraLocation::Location' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraLocation, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000010, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraLocation::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraLocation, CallFunc_GetCameraLocation_ReturnValue) == 0x000018, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraLocation::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraLocation, CallFunc_GetCameraLocation_ReturnValue_1) == 0x000024, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraLocation::CallFunc_GetCameraLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraLocation, CallFunc_GetDebuggingManager_Manager) == 0x000030, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraLocation::CallFunc_GetDebuggingManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraLocation, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PlayerCameraComponent.BP_PlayerCameraComponent_C.GetPlayerCameraRotation
// 0x0048 (0x0048 - 0x0000)
struct BP_PlayerCameraComponent_C_GetPlayerCameraRotation final
{
public:
	struct FRotator                               Rotation;                                          // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40EE[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                CallFunc_GetDebuggingManager_Manager;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerCameraComponent_C_GetPlayerCameraRotation) == 0x000008, "Wrong alignment on BP_PlayerCameraComponent_C_GetPlayerCameraRotation");
static_assert(sizeof(BP_PlayerCameraComponent_C_GetPlayerCameraRotation) == 0x000048, "Wrong size on BP_PlayerCameraComponent_C_GetPlayerCameraRotation");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraRotation, Rotation) == 0x000000, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraRotation::Rotation' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraRotation, CallFunc_GetCameraRotation_ReturnValue) == 0x00000C, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraRotation::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraRotation, CallFunc_GetController_ReturnValue) == 0x000018, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraRotation::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraRotation, K2Node_DynamicCast_AsPlayer_Controller) == 0x000020, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraRotation::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraRotation, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraRotation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraRotation, CallFunc_GetControlRotation_ReturnValue) == 0x00002C, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraRotation::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraRotation, CallFunc_GetDebuggingManager_Manager) == 0x000038, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraRotation::CallFunc_GetDebuggingManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraRotation, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraRotation::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PlayerCameraComponent.BP_PlayerCameraComponent_C.GetPlayerCameraDirection
// 0x0068 (0x0068 - 0x0000)
struct BP_PlayerCameraComponent_C_GetPlayerCameraDirection final
{
public:
	struct FVector                                Direction;                                         // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40EF[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40F0[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40F1[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetDebuggingManager_Manager;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerCameraComponent_C_GetPlayerCameraDirection) == 0x000008, "Wrong alignment on BP_PlayerCameraComponent_C_GetPlayerCameraDirection");
static_assert(sizeof(BP_PlayerCameraComponent_C_GetPlayerCameraDirection) == 0x000068, "Wrong size on BP_PlayerCameraComponent_C_GetPlayerCameraDirection");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraDirection, Direction) == 0x000000, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraDirection::Direction' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraDirection, CallFunc_GetCameraRotation_ReturnValue) == 0x00000C, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraDirection::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraDirection, CallFunc_GetController_ReturnValue) == 0x000018, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraDirection::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraDirection, CallFunc_GetForwardVector_ReturnValue) == 0x000020, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraDirection::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraDirection, K2Node_DynamicCast_AsPlayer_Controller) == 0x000030, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraDirection::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraDirection, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraDirection::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraDirection, CallFunc_GetControlRotation_ReturnValue) == 0x00003C, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraDirection::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraDirection, CallFunc_GetForwardVector_ReturnValue_1) == 0x000048, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraDirection::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraDirection, CallFunc_GetDebuggingManager_Manager) == 0x000058, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraDirection::CallFunc_GetDebuggingManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraDirection, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraDirection::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PlayerCameraComponent.BP_PlayerCameraComponent_C.GetPlayerCameraFieldOfView
// 0x0018 (0x0018 - 0x0000)
struct BP_PlayerCameraComponent_C_GetPlayerCameraFieldOfView final
{
public:
	float                                         FOV;                                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCameraFieldOfView_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetDebuggingManager_Manager;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerCameraComponent_C_GetPlayerCameraFieldOfView) == 0x000008, "Wrong alignment on BP_PlayerCameraComponent_C_GetPlayerCameraFieldOfView");
static_assert(sizeof(BP_PlayerCameraComponent_C_GetPlayerCameraFieldOfView) == 0x000018, "Wrong size on BP_PlayerCameraComponent_C_GetPlayerCameraFieldOfView");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraFieldOfView, FOV) == 0x000000, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraFieldOfView::FOV' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraFieldOfView, CallFunc_GetCameraFieldOfView_ReturnValue) == 0x000004, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraFieldOfView::CallFunc_GetCameraFieldOfView_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraFieldOfView, CallFunc_GetDebuggingManager_Manager) == 0x000008, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraFieldOfView::CallFunc_GetDebuggingManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraComponent_C_GetPlayerCameraFieldOfView, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_PlayerCameraComponent_C_GetPlayerCameraFieldOfView::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PlayerCameraComponent.BP_PlayerCameraComponent_C.UpdateControlRotation
// 0x0038 (0x0038 - 0x0000)
struct BP_PlayerCameraComponent_C_UpdateControlRotation final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
