#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerMaterialAccessorComponent

#include "Basic.hpp"

#include "FPlayerCableMaterialParameter_structs.hpp"
#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_LightHandSpiralMaterialParam_structs.hpp"
#include "S_HandLightMaterialParam_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerMaterialAccessorComponent.BP_PlayerMaterialAccessorComponent_C.ExecuteUbergraph_BP_PlayerMaterialAccessorComponent
// 0x0048 (0x0048 - 0x0000)
struct BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_627B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Player_1;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_Event_Player;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_Event_PlayerMesh;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_627C[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_No;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_627D[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TriggerEffectManager_C*             CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_TriggerEffectManager_C*             CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager_1; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_TriggerEffectManager_C*             CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager_2; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent) == 0x000008, "Wrong alignment on BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent");
static_assert(sizeof(BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent) == 0x000048, "Wrong size on BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent, EntryPoint) == 0x000000, "Member 'BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent, K2Node_Event_Player_1) == 0x000008, "Member 'BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent::K2Node_Event_Player_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent, K2Node_Event_Player) == 0x000010, "Member 'BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent, K2Node_Event_PlayerMesh) == 0x000018, "Member 'BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent::K2Node_Event_PlayerMesh' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent, K2Node_Event_EndPlayReason) == 0x000020, "Member 'BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent, K2Node_CustomEvent_No) == 0x000024, "Member 'BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent::K2Node_CustomEvent_No' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent, K2Node_SwitchInteger_CmpSuccess) == 0x000028, "Member 'BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent, CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager) == 0x000030, "Member 'BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent::CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent, CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager_1) == 0x000038, "Member 'BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent::CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent, CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager_2) == 0x000040, "Member 'BP_PlayerMaterialAccessorComponent_C_ExecuteUbergraph_BP_PlayerMaterialAccessorComponent::CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager_2' has a wrong offset!");

// Function BP_PlayerMaterialAccessorComponent.BP_PlayerMaterialAccessorComponent_C.OnCutinVibration
// 0x0004 (0x0004 - 0x0000)
struct BP_PlayerMaterialAccessorComponent_C_OnCutinVibration final
{
public:
	int32                                         No;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerMaterialAccessorComponent_C_OnCutinVibration) == 0x000004, "Wrong alignment on BP_PlayerMaterialAccessorComponent_C_OnCutinVibration");
static_assert(sizeof(BP_PlayerMaterialAccessorComponent_C_OnCutinVibration) == 0x000004, "Wrong size on BP_PlayerMaterialAccessorComponent_C_OnCutinVibration");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_OnCutinVibration, No) == 0x000000, "Member 'BP_PlayerMaterialAccessorComponent_C_OnCutinVibration::No' has a wrong offset!");

// Function BP_PlayerMaterialAccessorComponent.BP_PlayerMaterialAccessorComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerMaterialAccessorComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerMaterialAccessorComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_PlayerMaterialAccessorComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_PlayerMaterialAccessorComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_PlayerMaterialAccessorComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_PlayerMaterialAccessorComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_PlayerMaterialAccessorComponent.BP_PlayerMaterialAccessorComponent_C.SetPlayerMesh
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerMaterialAccessorComponent_C_SetPlayerMesh final
{
public:
	class USkeletalMeshComponent*                 PlayerMesh;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerMaterialAccessorComponent_C_SetPlayerMesh) == 0x000008, "Wrong alignment on BP_PlayerMaterialAccessorComponent_C_SetPlayerMesh");
static_assert(sizeof(BP_PlayerMaterialAccessorComponent_C_SetPlayerMesh) == 0x000008, "Wrong size on BP_PlayerMaterialAccessorComponent_C_SetPlayerMesh");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_SetPlayerMesh, PlayerMesh) == 0x000000, "Member 'BP_PlayerMaterialAccessorComponent_C_SetPlayerMesh::PlayerMesh' has a wrong offset!");

// Function BP_PlayerMaterialAccessorComponent.BP_PlayerMaterialAccessorComponent_C.SetupDefaultParameter
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerMaterialAccessorComponent_C_SetupDefaultParameter final
{
public:
	class ACharacter*                             Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerMaterialAccessorComponent_C_SetupDefaultParameter) == 0x000008, "Wrong alignment on BP_PlayerMaterialAccessorComponent_C_SetupDefaultParameter");
static_assert(sizeof(BP_PlayerMaterialAccessorComponent_C_SetupDefaultParameter) == 0x000008, "Wrong size on BP_PlayerMaterialAccessorComponent_C_SetupDefaultParameter");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_SetupDefaultParameter, Param_Player) == 0x000000, "Member 'BP_PlayerMaterialAccessorComponent_C_SetupDefaultParameter::Param_Player' has a wrong offset!");

// Function BP_PlayerMaterialAccessorComponent.BP_PlayerMaterialAccessorComponent_C.SetCable
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerMaterialAccessorComponent_C_SetCable final
{
public:
	class AActor*                                 Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerMaterialAccessorComponent_C_SetCable) == 0x000008, "Wrong alignment on BP_PlayerMaterialAccessorComponent_C_SetCable");
static_assert(sizeof(BP_PlayerMaterialAccessorComponent_C_SetCable) == 0x000008, "Wrong size on BP_PlayerMaterialAccessorComponent_C_SetCable");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_SetCable, Param_Player) == 0x000000, "Member 'BP_PlayerMaterialAccessorComponent_C_SetCable::Param_Player' has a wrong offset!");

// Function BP_PlayerMaterialAccessorComponent.BP_PlayerMaterialAccessorComponent_C.SearchPsychicFieldMaterial
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerMaterialAccessorComponent_C_SearchPsychicFieldMaterial final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerMaterialAccessorComponent_C_SearchPsychicFieldMaterial) == 0x000008, "Wrong alignment on BP_PlayerMaterialAccessorComponent_C_SearchPsychicFieldMaterial");
static_assert(sizeof(BP_PlayerMaterialAccessorComponent_C_SearchPsychicFieldMaterial) == 0x000010, "Wrong size on BP_PlayerMaterialAccessorComponent_C_SearchPsychicFieldMaterial");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_SearchPsychicFieldMaterial, Target) == 0x000000, "Member 'BP_PlayerMaterialAccessorComponent_C_SearchPsychicFieldMaterial::Target' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_SearchPsychicFieldMaterial, Mid) == 0x000008, "Member 'BP_PlayerMaterialAccessorComponent_C_SearchPsychicFieldMaterial::Mid' has a wrong offset!");

// Function BP_PlayerMaterialAccessorComponent.BP_PlayerMaterialAccessorComponent_C.UpdateLeftHandTable
// 0x0078 (0x0078 - 0x0000)
struct BP_PlayerMaterialAccessorComponent_C_UpdateLeftHandTable final
{
public:
	class FName                                   RowName;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_LightHandSpiralMaterialParam        CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_627E[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_HandLightMaterialParam              CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0040(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_627F[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_HandLightMaterialParam              CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x005C(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHandTable) == 0x000008, "Wrong alignment on BP_PlayerMaterialAccessorComponent_C_UpdateLeftHandTable");
static_assert(sizeof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHandTable) == 0x000078, "Wrong size on BP_PlayerMaterialAccessorComponent_C_UpdateLeftHandTable");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHandTable, RowName) == 0x000000, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateLeftHandTable::RowName' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHandTable, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateLeftHandTable::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHandTable, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000020, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateLeftHandTable::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHandTable, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000028, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateLeftHandTable::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHandTable, CallFunc_Conv_StringToName_ReturnValue) == 0x000038, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateLeftHandTable::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHandTable, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000040, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateLeftHandTable::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHandTable, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000058, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateLeftHandTable::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHandTable, CallFunc_GetDataTableRowFromName_OutRow_2) == 0x00005C, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateLeftHandTable::CallFunc_GetDataTableRowFromName_OutRow_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHandTable, CallFunc_GetDataTableRowFromName_ReturnValue_2) == 0x000074, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateLeftHandTable::CallFunc_GetDataTableRowFromName_ReturnValue_2' has a wrong offset!");

// Function BP_PlayerMaterialAccessorComponent.BP_PlayerMaterialAccessorComponent_C.PrivateSetupPlayerMesh
// 0x0030 (0x0030 - 0x0000)
struct BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh final
{
public:
	int32                                         CallFunc_SetupMaterialBySlotName_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6280[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetupMaterialBySlotName_ReturnValue_1;    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6281[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SetupMaterialBySlotName_ReturnValue_2;    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetupMaterialBySlotName_ReturnValue_3;    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetupMaterialBySlotName_ReturnValue_4;    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetupMaterialBySlotName_ReturnValue_5;    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetupMaterialBySlotName_ReturnValue_6;    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetupMaterialBySlotName_ReturnValue_7;    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh) == 0x000008, "Wrong alignment on BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh");
static_assert(sizeof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh) == 0x000030, "Wrong size on BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh, CallFunc_SetupMaterialBySlotName_ReturnValue) == 0x000000, "Member 'BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh::CallFunc_SetupMaterialBySlotName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh, CallFunc_SetupMaterialBySlotName_ReturnValue_1) == 0x000010, "Member 'BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh::CallFunc_SetupMaterialBySlotName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh, CallFunc_IsValid_ReturnValue_1) == 0x000014, "Member 'BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh, CallFunc_SetupMaterialBySlotName_ReturnValue_2) == 0x000018, "Member 'BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh::CallFunc_SetupMaterialBySlotName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh, CallFunc_SetupMaterialBySlotName_ReturnValue_3) == 0x00001C, "Member 'BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh::CallFunc_SetupMaterialBySlotName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh, CallFunc_SetupMaterialBySlotName_ReturnValue_4) == 0x000020, "Member 'BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh::CallFunc_SetupMaterialBySlotName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh, CallFunc_SetupMaterialBySlotName_ReturnValue_5) == 0x000024, "Member 'BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh::CallFunc_SetupMaterialBySlotName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh, CallFunc_SetupMaterialBySlotName_ReturnValue_6) == 0x000028, "Member 'BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh::CallFunc_SetupMaterialBySlotName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh, CallFunc_SetupMaterialBySlotName_ReturnValue_7) == 0x00002C, "Member 'BP_PlayerMaterialAccessorComponent_C_PrivateSetupPlayerMesh::CallFunc_SetupMaterialBySlotName_ReturnValue_7' has a wrong offset!");

// Function BP_PlayerMaterialAccessorComponent.BP_PlayerMaterialAccessorComponent_C.PrivateSetupDefaultParameter
// 0x0060 (0x0060 - 0x0000)
struct BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter final
{
public:
	class AActor*                                 Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetDefaultVectorParameterALL_OutParameters; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6282[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetDefaultVectorParameterALL_OutParameters_1; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter) == 0x000008, "Wrong alignment on BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter");
static_assert(sizeof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter) == 0x000060, "Wrong size on BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter, Param_Player) == 0x000000, "Member 'BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter::Param_Player' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter, CallFunc_GetDefaultVectorParameterALL_OutParameters) == 0x000008, "Member 'BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter::CallFunc_GetDefaultVectorParameterALL_OutParameters' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000018, "Member 'BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter, CallFunc_VSizeSquared_ReturnValue) == 0x000024, "Member 'BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000028, "Member 'BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00002C, "Member 'BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter, CallFunc_GetDefaultVectorParameterALL_OutParameters_1) == 0x000030, "Member 'BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter::CallFunc_GetDefaultVectorParameterALL_OutParameters_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter, CallFunc_BreakColor_R) == 0x000040, "Member 'BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter, CallFunc_BreakColor_G) == 0x000044, "Member 'BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter, CallFunc_BreakColor_B) == 0x000048, "Member 'BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter, CallFunc_BreakColor_A) == 0x00004C, "Member 'BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter, CallFunc_MakeVector_ReturnValue) == 0x000050, "Member 'BP_PlayerMaterialAccessorComponent_C_PrivateSetupDefaultParameter::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function BP_PlayerMaterialAccessorComponent.BP_PlayerMaterialAccessorComponent_C.UpdateLeftHand
// 0x0070 (0x0070 - 0x0000)
struct BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rate;                                              // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6283[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6284[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMax_ReturnValue;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue;    // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue_1;  // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6285[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface;         // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCanAnimOverrideSASColor_Enabled;       // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand) == 0x000008, "Wrong alignment on BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand");
static_assert(sizeof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand) == 0x000070, "Wrong size on BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand, Color) == 0x000000, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand::Color' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand, Rate) == 0x000010, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand::Rate' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000014, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000018, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000028, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000029, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand, CallFunc_FMax_ReturnValue) == 0x00002C, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand, CallFunc_SelectFloat_ReturnValue) == 0x000030, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand, CallFunc_Multiply_LinearColorFloat_ReturnValue) == 0x000034, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand::CallFunc_Multiply_LinearColorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand, CallFunc_Multiply_LinearColorFloat_ReturnValue_1) == 0x000044, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand::CallFunc_Multiply_LinearColorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000054, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand, K2Node_DynamicCast_AsBPI_Player_Interface) == 0x000058, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand::K2Node_DynamicCast_AsBPI_Player_Interface' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand, CallFunc_GetCanAnimOverrideSASColor_Enabled) == 0x000069, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand::CallFunc_GetCanAnimOverrideSASColor_Enabled' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand, CallFunc_IsValid_ReturnValue) == 0x00006A, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateLeftHand::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PlayerMaterialAccessorComponent.BP_PlayerMaterialAccessorComponent_C.UpdateHood
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerMaterialAccessorComponent_C_UpdateHood final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerMaterialAccessorComponent_C_UpdateHood) == 0x000004, "Wrong alignment on BP_PlayerMaterialAccessorComponent_C_UpdateHood");
static_assert(sizeof(BP_PlayerMaterialAccessorComponent_C_UpdateHood) == 0x000008, "Wrong size on BP_PlayerMaterialAccessorComponent_C_UpdateHood");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateHood, Rate) == 0x000000, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateHood::Rate' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateHood, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000004, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateHood::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateHood, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000005, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateHood::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateHood, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000006, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateHood::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_PlayerMaterialAccessorComponent.BP_PlayerMaterialAccessorComponent_C.UpdateMask
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerMaterialAccessorComponent_C_UpdateMask final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerMaterialAccessorComponent_C_UpdateMask) == 0x000004, "Wrong alignment on BP_PlayerMaterialAccessorComponent_C_UpdateMask");
static_assert(sizeof(BP_PlayerMaterialAccessorComponent_C_UpdateMask) == 0x000008, "Wrong size on BP_PlayerMaterialAccessorComponent_C_UpdateMask");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateMask, Rate) == 0x000000, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateMask::Rate' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateMask, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000004, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateMask::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateMask, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000005, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateMask::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateMask, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000006, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateMask::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_PlayerMaterialAccessorComponent.BP_PlayerMaterialAccessorComponent_C.UpdateOutlineEmission
// 0x01B8 (0x01B8 - 0x0000)
struct BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission final
{
public:
	struct FLinearColor                           NowColor;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FinalColor;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SumColor;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SumEmission;                                       // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rate;                                              // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue;      // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6286[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventPlayerMaterial_C*              K2Node_DynamicCast_AsBP_Event_Player_Material;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6287[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue_1;    // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_AddColorByRate_OutColor;                  // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue_2;    // 0x0084(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R;                             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R_1;                           // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G_1;                           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B_1;                           // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A_1;                           // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_CInterpTo_ReturnValue;                    // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R_2;                           // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G_2;                           // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B_2;                           // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A_2;                           // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x00DC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6288[0x3];                                     // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue_3;    // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_AddColorByRate_OutColor_1;                // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_2;                       // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_3;                       // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_4;                       // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R_3;                           // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G_3;                           // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B_3;                           // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A_3;                           // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_1;                  // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue_4;    // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_AddColorByRate_OutColor_2;                // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue_5;    // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_AddColorByRate_OutColor_3;                // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue_6;    // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_AddColorByRate_OutColor_4;                // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission) == 0x000008, "Wrong alignment on BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission");
static_assert(sizeof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission) == 0x0001B8, "Wrong size on BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, NowColor) == 0x000000, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::NowColor' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, FinalColor) == 0x000010, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::FinalColor' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, SumColor) == 0x000020, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::SumColor' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, SumEmission) == 0x000030, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::SumEmission' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, Rate) == 0x000034, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::Rate' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, CallFunc_GetVectorParameterValue_ReturnValue) == 0x000038, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::CallFunc_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000048, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, CallFunc_GetOwner_ReturnValue) == 0x000050, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, K2Node_DynamicCast_AsBP_Event_Player_Material) == 0x000058, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::K2Node_DynamicCast_AsBP_Event_Player_Material' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, CallFunc_GetVectorParameterValue_ReturnValue_1) == 0x000064, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::CallFunc_GetVectorParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, CallFunc_AddColorByRate_OutColor) == 0x000074, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::CallFunc_AddColorByRate_OutColor' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, CallFunc_GetVectorParameterValue_ReturnValue_2) == 0x000084, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::CallFunc_GetVectorParameterValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, CallFunc_BreakColor_R) == 0x000094, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, CallFunc_BreakColor_G) == 0x000098, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, CallFunc_BreakColor_B) == 0x00009C, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, CallFunc_BreakColor_A) == 0x0000A0, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, CallFunc_BreakColor_R_1) == 0x0000A4, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::CallFunc_BreakColor_R_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, CallFunc_BreakColor_G_1) == 0x0000A8, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::CallFunc_BreakColor_G_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, CallFunc_BreakColor_B_1) == 0x0000AC, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::CallFunc_BreakColor_B_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, CallFunc_BreakColor_A_1) == 0x0000B0, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::CallFunc_BreakColor_A_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, K2Node_MathExpression_ReturnValue) == 0x0000B4, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, CallFunc_CInterpTo_ReturnValue) == 0x0000B8, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::CallFunc_CInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, CallFunc_FMax_ReturnValue) == 0x0000C8, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, CallFunc_BreakColor_R_2) == 0x0000CC, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::CallFunc_BreakColor_R_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, CallFunc_BreakColor_G_2) == 0x0000D0, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::CallFunc_BreakColor_G_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, CallFunc_BreakColor_B_2) == 0x0000D4, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::CallFunc_BreakColor_B_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, CallFunc_BreakColor_A_2) == 0x0000D8, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::CallFunc_BreakColor_A_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, CallFunc_MakeColor_ReturnValue) == 0x0000DC, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000EC, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission, CallFunc_GetVectorParameterValue_ReturnValue_3) == 0x0000F0, "Member 'BP_PlayerMaterialAccessorComponent_C_UpdateOutlineEmission::CallFunc_GetVectorParameterValue_ReturnValue_3' has a wrong offset!");
