#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerActionStateDead

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerActionStateDead.BP_PlayerActionStateDead_C.Enter
// 0x0098 (0x0098 - 0x0000)
struct BP_PlayerActionStateDead_C_Enter final
{
public:
	int32                                         Param;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Enter_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AC6[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ch0200_C>         K2Node_DynamicCast_AsBPI_Ch_0200;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DamageInterruptWeaponAnim_bDummy;         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AC7[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AC8[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      CallFunc_GetMainPlayer_Player;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AC9[0x5];                                     // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BattleManager_C*                    CallFunc_GetBattleManager_BattleManager;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5ACA[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface;         // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemyPlayer_bEnemyPlayer;               // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetFootIKEnable_Dummy;                    // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CopyPlayerOff_bDummy;                     // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5ACB[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_LookAtInterface_C> CallFunc_SetLookAtEnable_self_CastInput;           // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetLookAtEnable_bResult;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5ACC[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARsBattleHero_C*                        K2Node_DynamicCast_AsRs_Battle_Hero;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateDead_C_Enter) == 0x000008, "Wrong alignment on BP_PlayerActionStateDead_C_Enter");
static_assert(sizeof(BP_PlayerActionStateDead_C_Enter) == 0x000098, "Wrong size on BP_PlayerActionStateDead_C_Enter");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, Param) == 0x000000, "Member 'BP_PlayerActionStateDead_C_Enter::Param' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateDead_C_Enter::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, CallFunc_Enter_ReturnValue) == 0x000008, "Member 'BP_PlayerActionStateDead_C_Enter::CallFunc_Enter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, K2Node_DynamicCast_AsBPI_Ch_0200) == 0x000010, "Member 'BP_PlayerActionStateDead_C_Enter::K2Node_DynamicCast_AsBPI_Ch_0200' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_PlayerActionStateDead_C_Enter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, CallFunc_DamageInterruptWeaponAnim_bDummy) == 0x000021, "Member 'BP_PlayerActionStateDead_C_Enter::CallFunc_DamageInterruptWeaponAnim_bDummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, CallFunc_GetPlayerManager_PlayerManager) == 0x000028, "Member 'BP_PlayerActionStateDead_C_Enter::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_PlayerActionStateDead_C_Enter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000031, "Member 'BP_PlayerActionStateDead_C_Enter::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000032, "Member 'BP_PlayerActionStateDead_C_Enter::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000033, "Member 'BP_PlayerActionStateDead_C_Enter::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, CallFunc_GetMainPlayer_Player) == 0x000038, "Member 'BP_PlayerActionStateDead_C_Enter::CallFunc_GetMainPlayer_Player' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, CallFunc_BooleanOR_ReturnValue) == 0x000040, "Member 'BP_PlayerActionStateDead_C_Enter::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'BP_PlayerActionStateDead_C_Enter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, CallFunc_BooleanOR_ReturnValue_1) == 0x000042, "Member 'BP_PlayerActionStateDead_C_Enter::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, CallFunc_GetBattleManager_BattleManager) == 0x000048, "Member 'BP_PlayerActionStateDead_C_Enter::CallFunc_GetBattleManager_BattleManager' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, CallFunc_IsValid_ReturnValue_2) == 0x000050, "Member 'BP_PlayerActionStateDead_C_Enter::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, K2Node_DynamicCast_AsBPI_Player_Interface) == 0x000058, "Member 'BP_PlayerActionStateDead_C_Enter::K2Node_DynamicCast_AsBPI_Player_Interface' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_PlayerActionStateDead_C_Enter::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, CallFunc_IsEnemyPlayer_bEnemyPlayer) == 0x000069, "Member 'BP_PlayerActionStateDead_C_Enter::CallFunc_IsEnemyPlayer_bEnemyPlayer' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, CallFunc_IsValid_ReturnValue_3) == 0x00006A, "Member 'BP_PlayerActionStateDead_C_Enter::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, CallFunc_SetFootIKEnable_Dummy) == 0x00006B, "Member 'BP_PlayerActionStateDead_C_Enter::CallFunc_SetFootIKEnable_Dummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, CallFunc_CopyPlayerOff_bDummy) == 0x00006C, "Member 'BP_PlayerActionStateDead_C_Enter::CallFunc_CopyPlayerOff_bDummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, CallFunc_SetLookAtEnable_self_CastInput) == 0x000070, "Member 'BP_PlayerActionStateDead_C_Enter::CallFunc_SetLookAtEnable_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, CallFunc_SetLookAtEnable_bResult) == 0x000080, "Member 'BP_PlayerActionStateDead_C_Enter::CallFunc_SetLookAtEnable_bResult' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, K2Node_DynamicCast_AsRs_Battle_Hero) == 0x000088, "Member 'BP_PlayerActionStateDead_C_Enter::K2Node_DynamicCast_AsRs_Battle_Hero' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Enter, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'BP_PlayerActionStateDead_C_Enter::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BP_PlayerActionStateDead.BP_PlayerActionStateDead_C.Update
// 0x0028 (0x0028 - 0x0000)
struct BP_PlayerActionStateDead_C_Update final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5ACD[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetDebuggingManager_Manager;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_IsEnemyPlayer_self_CastInput;             // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemyPlayer_bEnemyPlayer;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RevivePlayer_bSuccess;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsASAnimPlayEnd_ReturnValue;              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Update_ReturnValue;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerActionStateDead_C_Update) == 0x000008, "Wrong alignment on BP_PlayerActionStateDead_C_Update");
static_assert(sizeof(BP_PlayerActionStateDead_C_Update) == 0x000028, "Wrong size on BP_PlayerActionStateDead_C_Update");
static_assert(offsetof(BP_PlayerActionStateDead_C_Update, ReturnValue) == 0x000000, "Member 'BP_PlayerActionStateDead_C_Update::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Update, CallFunc_GetDebuggingManager_Manager) == 0x000008, "Member 'BP_PlayerActionStateDead_C_Update::CallFunc_GetDebuggingManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Update, CallFunc_IsEnemyPlayer_self_CastInput) == 0x000010, "Member 'BP_PlayerActionStateDead_C_Update::CallFunc_IsEnemyPlayer_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Update, CallFunc_IsEnemyPlayer_bEnemyPlayer) == 0x000020, "Member 'BP_PlayerActionStateDead_C_Update::CallFunc_IsEnemyPlayer_bEnemyPlayer' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Update, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BP_PlayerActionStateDead_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Update, CallFunc_RevivePlayer_bSuccess) == 0x000022, "Member 'BP_PlayerActionStateDead_C_Update::CallFunc_RevivePlayer_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Update, CallFunc_IsASAnimPlayEnd_ReturnValue) == 0x000023, "Member 'BP_PlayerActionStateDead_C_Update::CallFunc_IsASAnimPlayEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Update, CallFunc_Update_ReturnValue) == 0x000024, "Member 'BP_PlayerActionStateDead_C_Update::CallFunc_Update_ReturnValue' has a wrong offset!");

// Function BP_PlayerActionStateDead.BP_PlayerActionStateDead_C.Transition
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerActionStateDead_C_Transition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	EPlayerDownType                               LDownParam;                                        // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5ACE[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionStatus_Result;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateDead_C_Transition) == 0x000004, "Wrong alignment on BP_PlayerActionStateDead_C_Transition");
static_assert(sizeof(BP_PlayerActionStateDead_C_Transition) == 0x000010, "Wrong size on BP_PlayerActionStateDead_C_Transition");
static_assert(offsetof(BP_PlayerActionStateDead_C_Transition, ReturnValue) == 0x000000, "Member 'BP_PlayerActionStateDead_C_Transition::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Transition, LDownParam) == 0x000001, "Member 'BP_PlayerActionStateDead_C_Transition::LDownParam' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Transition, CallFunc_MakeLiteralByte_ReturnValue) == 0x000002, "Member 'BP_PlayerActionStateDead_C_Transition::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Transition, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateDead_C_Transition::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Transition, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000008, "Member 'BP_PlayerActionStateDead_C_Transition::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Transition, CallFunc_IsActionStatus_Result) == 0x00000C, "Member 'BP_PlayerActionStateDead_C_Transition::CallFunc_IsActionStatus_Result' has a wrong offset!");

// Function BP_PlayerActionStateDead.BP_PlayerActionStateDead_C.Exit
// 0x0028 (0x0028 - 0x0000)
struct BP_PlayerActionStateDead_C_Exit final
{
public:
	int32                                         NextStateIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Exit_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetFootIKEnable_Dummy;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5ACF[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_LookAtInterface_C> CallFunc_SetLookAtEnable_self_CastInput;           // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetLookAtEnable_bResult;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateDead_C_Exit) == 0x000008, "Wrong alignment on BP_PlayerActionStateDead_C_Exit");
static_assert(sizeof(BP_PlayerActionStateDead_C_Exit) == 0x000028, "Wrong size on BP_PlayerActionStateDead_C_Exit");
static_assert(offsetof(BP_PlayerActionStateDead_C_Exit, NextStateIndex) == 0x000000, "Member 'BP_PlayerActionStateDead_C_Exit::NextStateIndex' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Exit, ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateDead_C_Exit::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Exit, CallFunc_Exit_ReturnValue) == 0x000008, "Member 'BP_PlayerActionStateDead_C_Exit::CallFunc_Exit_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Exit, CallFunc_SetFootIKEnable_Dummy) == 0x00000C, "Member 'BP_PlayerActionStateDead_C_Exit::CallFunc_SetFootIKEnable_Dummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Exit, CallFunc_SetLookAtEnable_self_CastInput) == 0x000010, "Member 'BP_PlayerActionStateDead_C_Exit::CallFunc_SetLookAtEnable_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDead_C_Exit, CallFunc_SetLookAtEnable_bResult) == 0x000020, "Member 'BP_PlayerActionStateDead_C_Exit::CallFunc_SetLookAtEnable_bResult' has a wrong offset!");

}

