#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerActionStateSprintBrake

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PlayerActionStateSprintBrake.BP_PlayerActionStateSprintBrake_C.Enter
// 0x000C (0x000C - 0x0000)
struct BP_PlayerActionStateSprintBrake_C_Enter final
{
public:
	int32                                         Param;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Enter_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerActionStateSprintBrake_C_Enter) == 0x000004, "Wrong alignment on BP_PlayerActionStateSprintBrake_C_Enter");
static_assert(sizeof(BP_PlayerActionStateSprintBrake_C_Enter) == 0x00000C, "Wrong size on BP_PlayerActionStateSprintBrake_C_Enter");
static_assert(offsetof(BP_PlayerActionStateSprintBrake_C_Enter, Param) == 0x000000, "Member 'BP_PlayerActionStateSprintBrake_C_Enter::Param' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprintBrake_C_Enter, ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateSprintBrake_C_Enter::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprintBrake_C_Enter, CallFunc_Enter_ReturnValue) == 0x000008, "Member 'BP_PlayerActionStateSprintBrake_C_Enter::CallFunc_Enter_ReturnValue' has a wrong offset!");

// Function BP_PlayerActionStateSprintBrake.BP_PlayerActionStateSprintBrake_C.Update
// 0x000C (0x000C - 0x0000)
struct BP_PlayerActionStateSprintBrake_C_Update final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsASAnimPlayEnd_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6672[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Update_ReturnValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerActionStateSprintBrake_C_Update) == 0x000004, "Wrong alignment on BP_PlayerActionStateSprintBrake_C_Update");
static_assert(sizeof(BP_PlayerActionStateSprintBrake_C_Update) == 0x00000C, "Wrong size on BP_PlayerActionStateSprintBrake_C_Update");
static_assert(offsetof(BP_PlayerActionStateSprintBrake_C_Update, ReturnValue) == 0x000000, "Member 'BP_PlayerActionStateSprintBrake_C_Update::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprintBrake_C_Update, CallFunc_IsASAnimPlayEnd_ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateSprintBrake_C_Update::CallFunc_IsASAnimPlayEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprintBrake_C_Update, CallFunc_Update_ReturnValue) == 0x000008, "Member 'BP_PlayerActionStateSprintBrake_C_Update::CallFunc_Update_ReturnValue' has a wrong offset!");

}

