#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerDamageReactionInfo

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EEnpcMetamorphosisiFinishType_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerDamageReactionInfo.BP_PlayerDamageReactionInfo_C.ExecuteUbergraph_BP_PlayerDamageReactionInfo
// 0x0320 (0x0320 - 0x0000)
struct BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8522[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHCHitResult                           K2Node_CustomEvent_HitResult;                      // 0x0018(0x01C0)(ContainsInstancedReference)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8523[0x7];                                     // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EnemyManager_C*                     CallFunc_GetEnemyManager_Manager;                  // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface;         // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8524[0x6];                                     // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ENpcComponent_C*                    CallFunc_GetEnpcComp_ReturnComp;                   // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8525[0x2];                                     // 0x0212(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCrashResistanceMax_ReturnValue;        // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EntryBrainCrashAccess_Dummy;              // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8526[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharactersParameterBasic              CallFunc_GetParameterBasic_ReturnValue;            // 0x0220(0x0068)()
	TScriptInterface<class IBPI_BattleCharacterInterface_C> CallFunc_IsBrainCrashAccessInterface_self_CastInput; // 0x0288(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBrainCrashAccessInterface_bAccess;      // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8527[0x5];                                     // 0x029B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      CallFunc_GetPlayerID_self_CastInput;               // 0x02A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue;                  // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8528[0x6];                                     // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ENpcInterface_C>  CallFunc_Ch0900_ForceCopyDead_self_CastInput;      // 0x02B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Ch0900_ForceCopyDead_Dummy;               // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8529[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_852A[0x7];                                     // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ENpcInterface_C>  K2Node_DynamicCast_AsBPI_ENpc_Interface;           // 0x02E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EntryBrainCrashAccessEnpc_Return;         // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_852B[0x2];                                     // 0x02F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DeltaSeconds;                   // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BattleManager_C*                    CallFunc_GetBattleManager_BattleManager;           // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHitStopPlaying_isPlaying;               // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_852C[0x2];                                     // 0x0302(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldNormalDeltaSeconds_ReturnValue;   // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float DeltaSeconds)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0308(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo) == 0x000008, "Wrong alignment on BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo");
static_assert(sizeof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo) == 0x000320, "Wrong size on BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, EntryPoint) == 0x000000, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000005, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, Temp_bool_Has_Been_Initd_Variable) == 0x000006, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, Temp_bool_Has_Been_Initd_Variable_1) == 0x000007, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, K2Node_CustomEvent_HitResult) == 0x000018, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::K2Node_CustomEvent_HitResult' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, K2Node_DynamicCast_AsRSBattle_Player) == 0x0001D8, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, K2Node_DynamicCast_bSuccess) == 0x0001E0, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_GetEnemyManager_Manager) == 0x0001E8, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_GetEnemyManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, K2Node_DynamicCast_AsBPI_Player_Interface) == 0x0001F0, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::K2Node_DynamicCast_AsBPI_Player_Interface' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, K2Node_DynamicCast_bSuccess_1) == 0x000200, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_IsValid_ReturnValue) == 0x000201, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_GetEnpcComp_ReturnComp) == 0x000208, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_GetEnpcComp_ReturnComp' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_IsValid_ReturnValue_1) == 0x000210, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_IsValid_ReturnValue_2) == 0x000211, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_GetCrashResistanceMax_ReturnValue) == 0x000214, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_GetCrashResistanceMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_EntryBrainCrashAccess_Dummy) == 0x000218, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_EntryBrainCrashAccess_Dummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_GetParameterBasic_ReturnValue) == 0x000220, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_GetParameterBasic_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_IsBrainCrashAccessInterface_self_CastInput) == 0x000288, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_IsBrainCrashAccessInterface_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_IsBrainCrashAccessInterface_bAccess) == 0x000298, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_IsBrainCrashAccessInterface_bAccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000299, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_IsValid_ReturnValue_3) == 0x00029A, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_GetPlayerID_self_CastInput) == 0x0002A0, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_GetPlayerID_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_GetPlayerID_ReturnValue) == 0x0002B0, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_GetPlayerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0002B1, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_Ch0900_ForceCopyDead_self_CastInput) == 0x0002B8, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_Ch0900_ForceCopyDead_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_Ch0900_ForceCopyDead_Dummy) == 0x0002C8, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_Ch0900_ForceCopyDead_Dummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_GetPlayerManager_PlayerManager) == 0x0002D0, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, Temp_bool_IsClosed_Variable_1) == 0x0002D8, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, K2Node_DynamicCast_AsBPI_ENpc_Interface) == 0x0002E0, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::K2Node_DynamicCast_AsBPI_ENpc_Interface' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, K2Node_DynamicCast_bSuccess_2) == 0x0002F0, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_EntryBrainCrashAccessEnpc_Return) == 0x0002F1, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_EntryBrainCrashAccessEnpc_Return' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, K2Node_CustomEvent_DeltaSeconds) == 0x0002F4, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::K2Node_CustomEvent_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_GetBattleManager_BattleManager) == 0x0002F8, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_GetBattleManager_BattleManager' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_IsValid_ReturnValue_4) == 0x000300, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_IsHitStopPlaying_isPlaying) == 0x000301, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_IsHitStopPlaying_isPlaying' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_GetWorldNormalDeltaSeconds_ReturnValue) == 0x000304, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_GetWorldNormalDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000308, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000318, "Member 'BP_PlayerDamageReactionInfo_C_ExecuteUbergraph_BP_PlayerDamageReactionInfo::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_PlayerDamageReactionInfo.BP_PlayerDamageReactionInfo_C.EnpcBrainCrashWaitTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PlayerDamageReactionInfo_C_EnpcBrainCrashWaitTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerDamageReactionInfo_C_EnpcBrainCrashWaitTick) == 0x000004, "Wrong alignment on BP_PlayerDamageReactionInfo_C_EnpcBrainCrashWaitTick");
static_assert(sizeof(BP_PlayerDamageReactionInfo_C_EnpcBrainCrashWaitTick) == 0x000004, "Wrong size on BP_PlayerDamageReactionInfo_C_EnpcBrainCrashWaitTick");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_EnpcBrainCrashWaitTick, DeltaSeconds) == 0x000000, "Member 'BP_PlayerDamageReactionInfo_C_EnpcBrainCrashWaitTick::DeltaSeconds' has a wrong offset!");

// Function BP_PlayerDamageReactionInfo.BP_PlayerDamageReactionInfo_C.BrainCrashAccess
// 0x01C0 (0x01C0 - 0x0000)
struct BP_PlayerDamageReactionInfo_C_BrainCrashAccess final
{
public:
	struct FHCHitResult                           HitResult;                                         // 0x0000(0x01C0)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_PlayerDamageReactionInfo_C_BrainCrashAccess) == 0x000008, "Wrong alignment on BP_PlayerDamageReactionInfo_C_BrainCrashAccess");
static_assert(sizeof(BP_PlayerDamageReactionInfo_C_BrainCrashAccess) == 0x0001C0, "Wrong size on BP_PlayerDamageReactionInfo_C_BrainCrashAccess");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_BrainCrashAccess, HitResult) == 0x000000, "Member 'BP_PlayerDamageReactionInfo_C_BrainCrashAccess::HitResult' has a wrong offset!");

// Function BP_PlayerDamageReactionInfo.BP_PlayerDamageReactionInfo_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PlayerDamageReactionInfo_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerDamageReactionInfo_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PlayerDamageReactionInfo_C_ReceiveTick");
static_assert(sizeof(BP_PlayerDamageReactionInfo_C_ReceiveTick) == 0x000004, "Wrong size on BP_PlayerDamageReactionInfo_C_ReceiveTick");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PlayerDamageReactionInfo_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PlayerDamageReactionInfo.BP_PlayerDamageReactionInfo_C.UpdateDamageReaction
// 0x0468 (0x0468 - 0x0000)
struct BP_PlayerDamageReactionInfo_C_UpdateDamageReaction final
{
public:
	struct FHCHitResult                           HitResult;                                         // 0x0000(0x01C0)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	EEnpcMetamorphosisiFinishType                 LFinishType;                                       // 0x01C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LbIgnoreSuperArmor;                                // 0x01C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LbJustDodgeDown;                                   // 0x01C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LbTrigger;                                         // 0x01C3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LbCheckWince;                                      // 0x01C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LbForceLaunch;                                     // 0x01C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LbNoAddDamage;                                     // 0x01C6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LbLaunchTrigger;                                   // 0x01C7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LbForceReactionL;                                  // 0x01C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LbBlowTrigger;                                     // 0x01C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LbForceBlow;                                       // 0x01CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LbNoReaction;                                      // 0x01CB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         LBadStateFlag;                                     // 0x01CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LbReactionChance;                                  // 0x01D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_852D[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ENpcComponent_C*                    LEnpcComp;                                         // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LbBlow;                                            // 0x01E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LbBadStatusElectric;                               // 0x01E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LbFixReaction;                                     // 0x01E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_852E[0x1];                                     // 0x01E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LRightDot;                                         // 0x01E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LbRight;                                           // 0x01E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LbLeft;                                            // 0x01E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_852F[0x6];                                     // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EHCSkillExtraType>                     LExtraTypeArray;                                   // 0x01F0(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          LbFront;                                           // 0x0200(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8530[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharactersParameterBasic              LBasic;                                            // 0x0208(0x0068)(Edit, BlueprintVisible)
	struct FCharactersParameterTable              LTable;                                            // 0x0270(0x01F8)(Edit, BlueprintVisible)
};
static_assert(alignof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction) == 0x000008, "Wrong alignment on BP_PlayerDamageReactionInfo_C_UpdateDamageReaction");
static_assert(sizeof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction) == 0x000468, "Wrong size on BP_PlayerDamageReactionInfo_C_UpdateDamageReaction");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, HitResult) == 0x000000, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::HitResult' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LFinishType) == 0x0001C0, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LFinishType' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LbIgnoreSuperArmor) == 0x0001C1, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LbIgnoreSuperArmor' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LbJustDodgeDown) == 0x0001C2, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LbJustDodgeDown' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LbTrigger) == 0x0001C3, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LbTrigger' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LbCheckWince) == 0x0001C4, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LbCheckWince' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LbForceLaunch) == 0x0001C5, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LbForceLaunch' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LbNoAddDamage) == 0x0001C6, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LbNoAddDamage' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LbLaunchTrigger) == 0x0001C7, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LbLaunchTrigger' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LbForceReactionL) == 0x0001C8, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LbForceReactionL' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LbBlowTrigger) == 0x0001C9, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LbBlowTrigger' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LbForceBlow) == 0x0001CA, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LbForceBlow' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LbNoReaction) == 0x0001CB, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LbNoReaction' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LBadStateFlag) == 0x0001CC, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LBadStateFlag' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LbReactionChance) == 0x0001D0, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LbReactionChance' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LEnpcComp) == 0x0001D8, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LEnpcComp' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LbBlow) == 0x0001E0, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LbBlow' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LbBadStatusElectric) == 0x0001E1, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LbBadStatusElectric' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LbFixReaction) == 0x0001E2, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LbFixReaction' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LRightDot) == 0x0001E4, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LRightDot' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LbRight) == 0x0001E8, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LbRight' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LbLeft) == 0x0001E9, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LbLeft' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LExtraTypeArray) == 0x0001F0, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LExtraTypeArray' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LbFront) == 0x000200, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LbFront' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LBasic) == 0x000208, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LBasic' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_UpdateDamageReaction, LTable) == 0x000270, "Member 'BP_PlayerDamageReactionInfo_C_UpdateDamageReaction::LTable' has a wrong offset!");

// Function BP_PlayerDamageReactionInfo.BP_PlayerDamageReactionInfo_C.SetBrainFieldWarning
// 0x0005 (0x0005 - 0x0000)
struct BP_PlayerDamageReactionInfo_C_SetBrainFieldWarning final
{
public:
	bool                                          bTimeUp;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerDamageKind                             Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerDamageKind                             Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerDamageKind                             K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerDamageReactionInfo_C_SetBrainFieldWarning) == 0x000001, "Wrong alignment on BP_PlayerDamageReactionInfo_C_SetBrainFieldWarning");
static_assert(sizeof(BP_PlayerDamageReactionInfo_C_SetBrainFieldWarning) == 0x000005, "Wrong size on BP_PlayerDamageReactionInfo_C_SetBrainFieldWarning");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_SetBrainFieldWarning, bTimeUp) == 0x000000, "Member 'BP_PlayerDamageReactionInfo_C_SetBrainFieldWarning::bTimeUp' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_SetBrainFieldWarning, Temp_bool_Variable) == 0x000001, "Member 'BP_PlayerDamageReactionInfo_C_SetBrainFieldWarning::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_SetBrainFieldWarning, Temp_byte_Variable) == 0x000002, "Member 'BP_PlayerDamageReactionInfo_C_SetBrainFieldWarning::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_SetBrainFieldWarning, Temp_byte_Variable_1) == 0x000003, "Member 'BP_PlayerDamageReactionInfo_C_SetBrainFieldWarning::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_SetBrainFieldWarning, K2Node_Select_Default) == 0x000004, "Member 'BP_PlayerDamageReactionInfo_C_SetBrainFieldWarning::K2Node_Select_Default' has a wrong offset!");

// Function BP_PlayerDamageReactionInfo.BP_PlayerDamageReactionInfo_C.SetDeadDamage
// 0x0005 (0x0005 - 0x0000)
struct BP_PlayerDamageReactionInfo_C_SetDeadDamage final
{
public:
	bool                                          bBrainFieldTimeUp;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerDamageKind                             Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerDamageKind                             Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerDamageKind                             K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerDamageReactionInfo_C_SetDeadDamage) == 0x000001, "Wrong alignment on BP_PlayerDamageReactionInfo_C_SetDeadDamage");
static_assert(sizeof(BP_PlayerDamageReactionInfo_C_SetDeadDamage) == 0x000005, "Wrong size on BP_PlayerDamageReactionInfo_C_SetDeadDamage");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_SetDeadDamage, bBrainFieldTimeUp) == 0x000000, "Member 'BP_PlayerDamageReactionInfo_C_SetDeadDamage::bBrainFieldTimeUp' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_SetDeadDamage, Temp_bool_Variable) == 0x000001, "Member 'BP_PlayerDamageReactionInfo_C_SetDeadDamage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_SetDeadDamage, Temp_byte_Variable) == 0x000002, "Member 'BP_PlayerDamageReactionInfo_C_SetDeadDamage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_SetDeadDamage, Temp_byte_Variable_1) == 0x000003, "Member 'BP_PlayerDamageReactionInfo_C_SetDeadDamage::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_SetDeadDamage, K2Node_Select_Default) == 0x000004, "Member 'BP_PlayerDamageReactionInfo_C_SetDeadDamage::K2Node_Select_Default' has a wrong offset!");

// Function BP_PlayerDamageReactionInfo.BP_PlayerDamageReactionInfo_C.SetDamageReaction
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerDamageReactionInfo_C_SetDamageReaction final
{
public:
	EPlayerDamageKind                             Param_DamageKind;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerDamageReactionInfo_C_SetDamageReaction) == 0x000001, "Wrong alignment on BP_PlayerDamageReactionInfo_C_SetDamageReaction");
static_assert(sizeof(BP_PlayerDamageReactionInfo_C_SetDamageReaction) == 0x000001, "Wrong size on BP_PlayerDamageReactionInfo_C_SetDamageReaction");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_SetDamageReaction, Param_DamageKind) == 0x000000, "Member 'BP_PlayerDamageReactionInfo_C_SetDamageReaction::Param_DamageKind' has a wrong offset!");

// Function BP_PlayerDamageReactionInfo.BP_PlayerDamageReactionInfo_C.CheckFinishMetamorphosis_BPImplement
// 0x0018 (0x0018 - 0x0000)
struct BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement final
{
public:
	class UPlayerENpcBaseComponent*               ENpcComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerDamageKind                             InDamageKind;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFront;                                            // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	EEnpcMetamorphosisiFinishType                 LFinishType;                                       // 0x000B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReactionChanceCPP_ReturnValue;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsExecMetamorphosis_bExec;                // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FinishCancelAction_bDummy;                // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement) == 0x000008, "Wrong alignment on BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement");
static_assert(sizeof(BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement) == 0x000018, "Wrong size on BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement, ENpcComp) == 0x000000, "Member 'BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement::ENpcComp' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement, InDamageKind) == 0x000008, "Member 'BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement::InDamageKind' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement, bFront) == 0x000009, "Member 'BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement::bFront' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement, ReturnValue) == 0x00000A, "Member 'BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement, LFinishType) == 0x00000B, "Member 'BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement::LFinishType' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement, K2Node_SwitchEnum_CmpSuccess) == 0x00000C, "Member 'BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement, CallFunc_IsReactionChanceCPP_ReturnValue) == 0x00000D, "Member 'BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement::CallFunc_IsReactionChanceCPP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement, CallFunc_IsExecMetamorphosis_bExec) == 0x00000E, "Member 'BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement::CallFunc_IsExecMetamorphosis_bExec' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement, CallFunc_FinishCancelAction_bDummy) == 0x00000F, "Member 'BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement::CallFunc_FinishCancelAction_bDummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_PlayerDamageReactionInfo_C_CheckFinishMetamorphosis_BPImplement::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PlayerDamageReactionInfo.BP_PlayerDamageReactionInfo_C.StartEnemyAddDamageShake_BPImplement
// 0x0003 (0x0003 - 0x0000)
struct BP_PlayerDamageReactionInfo_C_StartEnemyAddDamageShake_BPImplement final
{
public:
	bool                                          bTriggerAttack;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerDamageReactionInfo_C_StartEnemyAddDamageShake_BPImplement) == 0x000001, "Wrong alignment on BP_PlayerDamageReactionInfo_C_StartEnemyAddDamageShake_BPImplement");
static_assert(sizeof(BP_PlayerDamageReactionInfo_C_StartEnemyAddDamageShake_BPImplement) == 0x000003, "Wrong size on BP_PlayerDamageReactionInfo_C_StartEnemyAddDamageShake_BPImplement");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_StartEnemyAddDamageShake_BPImplement, bTriggerAttack) == 0x000000, "Member 'BP_PlayerDamageReactionInfo_C_StartEnemyAddDamageShake_BPImplement::bTriggerAttack' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_StartEnemyAddDamageShake_BPImplement, ReturnValue) == 0x000001, "Member 'BP_PlayerDamageReactionInfo_C_StartEnemyAddDamageShake_BPImplement::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_StartEnemyAddDamageShake_BPImplement, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'BP_PlayerDamageReactionInfo_C_StartEnemyAddDamageShake_BPImplement::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PlayerDamageReactionInfo.BP_PlayerDamageReactionInfo_C.BrainCrashAccess_CallFromCPP
// 0x01C8 (0x01C8 - 0x0000)
struct BP_PlayerDamageReactionInfo_C_BrainCrashAccess_CallFromCPP final
{
public:
	struct FHCHitResult                           HitResult;                                         // 0x0000(0x01C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x01C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerDamageReactionInfo_C_BrainCrashAccess_CallFromCPP) == 0x000008, "Wrong alignment on BP_PlayerDamageReactionInfo_C_BrainCrashAccess_CallFromCPP");
static_assert(sizeof(BP_PlayerDamageReactionInfo_C_BrainCrashAccess_CallFromCPP) == 0x0001C8, "Wrong size on BP_PlayerDamageReactionInfo_C_BrainCrashAccess_CallFromCPP");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_BrainCrashAccess_CallFromCPP, HitResult) == 0x000000, "Member 'BP_PlayerDamageReactionInfo_C_BrainCrashAccess_CallFromCPP::HitResult' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_BrainCrashAccess_CallFromCPP, ReturnValue) == 0x0001C0, "Member 'BP_PlayerDamageReactionInfo_C_BrainCrashAccess_CallFromCPP::ReturnValue' has a wrong offset!");

// Function BP_PlayerDamageReactionInfo.BP_PlayerDamageReactionInfo_C.StartEnpcDamageMove_BPImplement
// 0x0030 (0x0030 - 0x0000)
struct BP_PlayerDamageReactionInfo_C_StartEnpcDamageMove_BPImplement final
{
public:
	struct FVector                                Param_DamageDir;                                   // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Power;                                             // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DeadMove;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8531[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ENpcInterface_C>  CallFunc_StartDamageMove_self_CastInput;           // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartDamageMove_Duumy;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerDamageReactionInfo_C_StartEnpcDamageMove_BPImplement) == 0x000008, "Wrong alignment on BP_PlayerDamageReactionInfo_C_StartEnpcDamageMove_BPImplement");
static_assert(sizeof(BP_PlayerDamageReactionInfo_C_StartEnpcDamageMove_BPImplement) == 0x000030, "Wrong size on BP_PlayerDamageReactionInfo_C_StartEnpcDamageMove_BPImplement");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_StartEnpcDamageMove_BPImplement, Param_DamageDir) == 0x000000, "Member 'BP_PlayerDamageReactionInfo_C_StartEnpcDamageMove_BPImplement::Param_DamageDir' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_StartEnpcDamageMove_BPImplement, Power) == 0x00000C, "Member 'BP_PlayerDamageReactionInfo_C_StartEnpcDamageMove_BPImplement::Power' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_StartEnpcDamageMove_BPImplement, DeadMove) == 0x000010, "Member 'BP_PlayerDamageReactionInfo_C_StartEnpcDamageMove_BPImplement::DeadMove' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_StartEnpcDamageMove_BPImplement, ReturnValue) == 0x000011, "Member 'BP_PlayerDamageReactionInfo_C_StartEnpcDamageMove_BPImplement::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_StartEnpcDamageMove_BPImplement, CallFunc_StartDamageMove_self_CastInput) == 0x000018, "Member 'BP_PlayerDamageReactionInfo_C_StartEnpcDamageMove_BPImplement::CallFunc_StartDamageMove_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_StartEnpcDamageMove_BPImplement, CallFunc_StartDamageMove_Duumy) == 0x000028, "Member 'BP_PlayerDamageReactionInfo_C_StartEnpcDamageMove_BPImplement::CallFunc_StartDamageMove_Duumy' has a wrong offset!");

// Function BP_PlayerDamageReactionInfo.BP_PlayerDamageReactionInfo_C.GetDamageReaction
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerDamageReactionInfo_C_GetDamageReaction final
{
public:
	EPlayerDamageKind                             ReactionType;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerDamageReactionInfo_C_GetDamageReaction) == 0x000001, "Wrong alignment on BP_PlayerDamageReactionInfo_C_GetDamageReaction");
static_assert(sizeof(BP_PlayerDamageReactionInfo_C_GetDamageReaction) == 0x000001, "Wrong size on BP_PlayerDamageReactionInfo_C_GetDamageReaction");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_GetDamageReaction, ReactionType) == 0x000000, "Member 'BP_PlayerDamageReactionInfo_C_GetDamageReaction::ReactionType' has a wrong offset!");

// Function BP_PlayerDamageReactionInfo.BP_PlayerDamageReactionInfo_C.IsExistDamage
// 0x0002 (0x0002 - 0x0000)
struct BP_PlayerDamageReactionInfo_C_IsExistDamage final
{
public:
	bool                                          bExist;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerDamageReactionInfo_C_IsExistDamage) == 0x000001, "Wrong alignment on BP_PlayerDamageReactionInfo_C_IsExistDamage");
static_assert(sizeof(BP_PlayerDamageReactionInfo_C_IsExistDamage) == 0x000002, "Wrong size on BP_PlayerDamageReactionInfo_C_IsExistDamage");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_IsExistDamage, bExist) == 0x000000, "Member 'BP_PlayerDamageReactionInfo_C_IsExistDamage::bExist' has a wrong offset!");
static_assert(offsetof(BP_PlayerDamageReactionInfo_C_IsExistDamage, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BP_PlayerDamageReactionInfo_C_IsExistDamage::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_PlayerDamageReactionInfo.BP_PlayerDamageReactionInfo_C.IsBlow
// 0x001F (0x001F - 0x0000)
struct BP_PlayerDamageReactionInfo_C_IsBlow final
{
public:
	bool                                          bBlow;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerDamageKind                             Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_7;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_8;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_9;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_10;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_11;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_12;                             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_13;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_14;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_15;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_16;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_17;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_18;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_19;                             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_20;                             // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_21;                             // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_22;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_23;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_24;                             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_25;                             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
