#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PsychicObjectComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "PsychicObjectSizeParameter_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "E_SASKind_structs.hpp"
#include "PsychicObjectCommonParameter_structs.hpp"
#include "Engine_structs.hpp"
#include "SPsychicCaptureMaterial_structs.hpp"
#include "Enum_ui_pk_weight_gauge_button_structs.hpp"
#include "Enum_ui_pk_weight_gauge_size_structs.hpp"


namespace SDK::Params
{

// Function BP_PsychicObjectComponent.BP_PsychicObjectComponent_C.OnSetEffectFocus__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_PsychicObjectComponent_C_OnSetEffectFocus__DelegateSignature final
{
public:
	bool                                          FlagIn;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicObjectComponent_C_OnSetEffectFocus__DelegateSignature) == 0x000001, "Wrong alignment on BP_PsychicObjectComponent_C_OnSetEffectFocus__DelegateSignature");
static_assert(sizeof(BP_PsychicObjectComponent_C_OnSetEffectFocus__DelegateSignature) == 0x000001, "Wrong size on BP_PsychicObjectComponent_C_OnSetEffectFocus__DelegateSignature");
static_assert(offsetof(BP_PsychicObjectComponent_C_OnSetEffectFocus__DelegateSignature, FlagIn) == 0x000000, "Member 'BP_PsychicObjectComponent_C_OnSetEffectFocus__DelegateSignature::FlagIn' has a wrong offset!");

// Function BP_PsychicObjectComponent.BP_PsychicObjectComponent_C.ExecuteUbergraph_BP_PsychicObjectComponent
// 0x0010 (0x0010 - 0x0000)
struct BP_PsychicObjectComponent_C_ExecuteUbergraph_BP_PsychicObjectComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7168[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicObjectComponent_C_ExecuteUbergraph_BP_PsychicObjectComponent) == 0x000004, "Wrong alignment on BP_PsychicObjectComponent_C_ExecuteUbergraph_BP_PsychicObjectComponent");
static_assert(sizeof(BP_PsychicObjectComponent_C_ExecuteUbergraph_BP_PsychicObjectComponent) == 0x000010, "Wrong size on BP_PsychicObjectComponent_C_ExecuteUbergraph_BP_PsychicObjectComponent");
static_assert(offsetof(BP_PsychicObjectComponent_C_ExecuteUbergraph_BP_PsychicObjectComponent, EntryPoint) == 0x000000, "Member 'BP_PsychicObjectComponent_C_ExecuteUbergraph_BP_PsychicObjectComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_ExecuteUbergraph_BP_PsychicObjectComponent, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_PsychicObjectComponent_C_ExecuteUbergraph_BP_PsychicObjectComponent::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_ExecuteUbergraph_BP_PsychicObjectComponent, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'BP_PsychicObjectComponent_C_ExecuteUbergraph_BP_PsychicObjectComponent::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_ExecuteUbergraph_BP_PsychicObjectComponent, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_PsychicObjectComponent_C_ExecuteUbergraph_BP_PsychicObjectComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_ExecuteUbergraph_BP_PsychicObjectComponent, K2Node_Event_EndPlayReason) == 0x00000C, "Member 'BP_PsychicObjectComponent_C_ExecuteUbergraph_BP_PsychicObjectComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_ExecuteUbergraph_BP_PsychicObjectComponent, K2Node_SwitchEnum_CmpSuccess) == 0x00000D, "Member 'BP_PsychicObjectComponent_C_ExecuteUbergraph_BP_PsychicObjectComponent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_PsychicObjectComponent.BP_PsychicObjectComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_PsychicObjectComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicObjectComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_PsychicObjectComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_PsychicObjectComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_PsychicObjectComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_PsychicObjectComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_PsychicObjectComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_PsychicObjectComponent.BP_PsychicObjectComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PsychicObjectComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicObjectComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PsychicObjectComponent_C_ReceiveTick");
static_assert(sizeof(BP_PsychicObjectComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_PsychicObjectComponent_C_ReceiveTick");
static_assert(offsetof(BP_PsychicObjectComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PsychicObjectComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PsychicObjectComponent.BP_PsychicObjectComponent_C.Initialize
// 0x0038 (0x0038 - 0x0000)
struct BP_PsychicObjectComponent_C_Initialize final
{
public:
	class ABP_TriggerEffectManager_C*             CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IPsychicObjectInterface> K2Node_DynamicCast_AsPsychic_Object_Interface;     // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetPsychicObjectActiveC_ReturnValue;      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetProcedurePhase_return;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7169[0x5];                                     // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PsychicObjectBasic_C*               K2Node_DynamicCast_AsBP_Psychic_Object_Basic;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicObjectComponent_C_Initialize) == 0x000008, "Wrong alignment on BP_PsychicObjectComponent_C_Initialize");
static_assert(sizeof(BP_PsychicObjectComponent_C_Initialize) == 0x000038, "Wrong size on BP_PsychicObjectComponent_C_Initialize");
static_assert(offsetof(BP_PsychicObjectComponent_C_Initialize, CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager) == 0x000000, "Member 'BP_PsychicObjectComponent_C_Initialize::CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_Initialize, K2Node_DynamicCast_AsPsychic_Object_Interface) == 0x000008, "Member 'BP_PsychicObjectComponent_C_Initialize::K2Node_DynamicCast_AsPsychic_Object_Interface' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_Initialize, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_PsychicObjectComponent_C_Initialize::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_Initialize, CallFunc_SetPsychicObjectActiveC_ReturnValue) == 0x000019, "Member 'BP_PsychicObjectComponent_C_Initialize::CallFunc_SetPsychicObjectActiveC_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_Initialize, CallFunc_SetProcedurePhase_return) == 0x00001A, "Member 'BP_PsychicObjectComponent_C_Initialize::CallFunc_SetProcedurePhase_return' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_Initialize, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BP_PsychicObjectComponent_C_Initialize::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_Initialize, K2Node_DynamicCast_AsBP_Psychic_Object_Basic) == 0x000028, "Member 'BP_PsychicObjectComponent_C_Initialize::K2Node_DynamicCast_AsBP_Psychic_Object_Basic' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_Initialize, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_PsychicObjectComponent_C_Initialize::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_PsychicObjectComponent.BP_PsychicObjectComponent_C.Update
// 0x0001 (0x0001 - 0x0000)
struct BP_PsychicObjectComponent_C_Update final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicObjectComponent_C_Update) == 0x000001, "Wrong alignment on BP_PsychicObjectComponent_C_Update");
static_assert(sizeof(BP_PsychicObjectComponent_C_Update) == 0x000001, "Wrong size on BP_PsychicObjectComponent_C_Update");
static_assert(offsetof(BP_PsychicObjectComponent_C_Update, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'BP_PsychicObjectComponent_C_Update::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_PsychicObjectComponent.BP_PsychicObjectComponent_C.Finalize
// 0x0010 (0x0010 - 0x0000)
struct BP_PsychicObjectComponent_C_Finalize final
{
public:
	class APsychicAnimObject_C*                   CallFunc_SetAnimOwner_anim_owner;                  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FinalizeUniqueObject_dummy;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicObjectComponent_C_Finalize) == 0x000008, "Wrong alignment on BP_PsychicObjectComponent_C_Finalize");
static_assert(sizeof(BP_PsychicObjectComponent_C_Finalize) == 0x000010, "Wrong size on BP_PsychicObjectComponent_C_Finalize");
static_assert(offsetof(BP_PsychicObjectComponent_C_Finalize, CallFunc_SetAnimOwner_anim_owner) == 0x000000, "Member 'BP_PsychicObjectComponent_C_Finalize::CallFunc_SetAnimOwner_anim_owner' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_Finalize, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_PsychicObjectComponent_C_Finalize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_Finalize, CallFunc_FinalizeUniqueObject_dummy) == 0x000009, "Member 'BP_PsychicObjectComponent_C_Finalize::CallFunc_FinalizeUniqueObject_dummy' has a wrong offset!");

// Function BP_PsychicObjectComponent.BP_PsychicObjectComponent_C.IsPsychicObjectActive
// 0x0001 (0x0001 - 0x0000)
struct BP_PsychicObjectComponent_C_IsPsychicObjectActive final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicObjectComponent_C_IsPsychicObjectActive) == 0x000001, "Wrong alignment on BP_PsychicObjectComponent_C_IsPsychicObjectActive");
static_assert(sizeof(BP_PsychicObjectComponent_C_IsPsychicObjectActive) == 0x000001, "Wrong size on BP_PsychicObjectComponent_C_IsPsychicObjectActive");
static_assert(offsetof(BP_PsychicObjectComponent_C_IsPsychicObjectActive, Return) == 0x000000, "Member 'BP_PsychicObjectComponent_C_IsPsychicObjectActive::Return' has a wrong offset!");

// Function BP_PsychicObjectComponent.BP_PsychicObjectComponent_C.SetPsychicObjectActive
// 0x0004 (0x0004 - 0x0000)
struct BP_PsychicObjectComponent_C_SetPsychicObjectActive final
{
public:
	bool                                          Flag_in;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Flag_only;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicObjectComponent_C_SetPsychicObjectActive) == 0x000001, "Wrong alignment on BP_PsychicObjectComponent_C_SetPsychicObjectActive");
static_assert(sizeof(BP_PsychicObjectComponent_C_SetPsychicObjectActive) == 0x000004, "Wrong size on BP_PsychicObjectComponent_C_SetPsychicObjectActive");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectActive, Flag_in) == 0x000000, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectActive::Flag_in' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectActive, Flag_only) == 0x000001, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectActive::Flag_only' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectActive, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectActive::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectActive, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000003, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectActive::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function BP_PsychicObjectComponent.BP_PsychicObjectComponent_C.InitializeParameter
// 0x0048 (0x0048 - 0x0000)
struct BP_PsychicObjectComponent_C_InitializeParameter final
{
public:
	class URSParticleSystemComponentBase*         L_particle;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_716A[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPsychicObjectInterface> K2Node_DynamicCast_AsPsychic_Object_Interface;     // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetPsychicObjectInUseC_ReturnValue;       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_716B[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_716C[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetHitDamageMesh_dummy;                   // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_716D[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InitialParameter_dummy;                   // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetProcedurePhase_return;                 // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicObjectComponent_C_InitializeParameter) == 0x000008, "Wrong alignment on BP_PsychicObjectComponent_C_InitializeParameter");
static_assert(sizeof(BP_PsychicObjectComponent_C_InitializeParameter) == 0x000048, "Wrong size on BP_PsychicObjectComponent_C_InitializeParameter");
static_assert(offsetof(BP_PsychicObjectComponent_C_InitializeParameter, L_particle) == 0x000000, "Member 'BP_PsychicObjectComponent_C_InitializeParameter::L_particle' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_InitializeParameter, Temp_int_Loop_Num_Variable) == 0x000008, "Member 'BP_PsychicObjectComponent_C_InitializeParameter::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_InitializeParameter, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'BP_PsychicObjectComponent_C_InitializeParameter::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_InitializeParameter, CallFunc_IsValid_ReturnValue) == 0x00000D, "Member 'BP_PsychicObjectComponent_C_InitializeParameter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_InitializeParameter, K2Node_DynamicCast_AsPsychic_Object_Interface) == 0x000010, "Member 'BP_PsychicObjectComponent_C_InitializeParameter::K2Node_DynamicCast_AsPsychic_Object_Interface' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_InitializeParameter, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_PsychicObjectComponent_C_InitializeParameter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_InitializeParameter, CallFunc_SetPsychicObjectInUseC_ReturnValue) == 0x000021, "Member 'BP_PsychicObjectComponent_C_InitializeParameter::CallFunc_SetPsychicObjectInUseC_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_InitializeParameter, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_PsychicObjectComponent_C_InitializeParameter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_InitializeParameter, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'BP_PsychicObjectComponent_C_InitializeParameter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_InitializeParameter, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'BP_PsychicObjectComponent_C_InitializeParameter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_InitializeParameter, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BP_PsychicObjectComponent_C_InitializeParameter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_InitializeParameter, Temp_int_Array_Index_Variable) == 0x000030, "Member 'BP_PsychicObjectComponent_C_InitializeParameter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_InitializeParameter, CallFunc_IsValid_ReturnValue_2) == 0x000034, "Member 'BP_PsychicObjectComponent_C_InitializeParameter::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_InitializeParameter, CallFunc_SetHitDamageMesh_dummy) == 0x000035, "Member 'BP_PsychicObjectComponent_C_InitializeParameter::CallFunc_SetHitDamageMesh_dummy' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_InitializeParameter, Temp_int_Variable) == 0x000038, "Member 'BP_PsychicObjectComponent_C_InitializeParameter::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_InitializeParameter, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BP_PsychicObjectComponent_C_InitializeParameter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_InitializeParameter, CallFunc_Array_Add_ReturnValue) == 0x000040, "Member 'BP_PsychicObjectComponent_C_InitializeParameter::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_InitializeParameter, CallFunc_IsValid_ReturnValue_3) == 0x000044, "Member 'BP_PsychicObjectComponent_C_InitializeParameter::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_InitializeParameter, CallFunc_InitialParameter_dummy) == 0x000045, "Member 'BP_PsychicObjectComponent_C_InitializeParameter::CallFunc_InitialParameter_dummy' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_InitializeParameter, CallFunc_SetProcedurePhase_return) == 0x000046, "Member 'BP_PsychicObjectComponent_C_InitializeParameter::CallFunc_SetProcedurePhase_return' has a wrong offset!");

// Function BP_PsychicObjectComponent.BP_PsychicObjectComponent_C.IsFocusable
// 0x000B (0x000B - 0x0000)
struct BP_PsychicObjectComponent_C_IsFocusable final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckPsychicObjectState_return;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicObjectComponent_C_IsFocusable) == 0x000001, "Wrong alignment on BP_PsychicObjectComponent_C_IsFocusable");
static_assert(sizeof(BP_PsychicObjectComponent_C_IsFocusable) == 0x00000B, "Wrong size on BP_PsychicObjectComponent_C_IsFocusable");
static_assert(offsetof(BP_PsychicObjectComponent_C_IsFocusable, Return) == 0x000000, "Member 'BP_PsychicObjectComponent_C_IsFocusable::Return' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_IsFocusable, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'BP_PsychicObjectComponent_C_IsFocusable::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_IsFocusable, CallFunc_Not_PreBool_ReturnValue_1) == 0x000002, "Member 'BP_PsychicObjectComponent_C_IsFocusable::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_IsFocusable, CallFunc_Not_PreBool_ReturnValue_2) == 0x000003, "Member 'BP_PsychicObjectComponent_C_IsFocusable::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_IsFocusable, CallFunc_Not_PreBool_ReturnValue_3) == 0x000004, "Member 'BP_PsychicObjectComponent_C_IsFocusable::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_IsFocusable, CallFunc_CheckPsychicObjectState_return) == 0x000005, "Member 'BP_PsychicObjectComponent_C_IsFocusable::CallFunc_CheckPsychicObjectState_return' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_IsFocusable, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'BP_PsychicObjectComponent_C_IsFocusable::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_IsFocusable, CallFunc_BooleanAND_ReturnValue_1) == 0x000007, "Member 'BP_PsychicObjectComponent_C_IsFocusable::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_IsFocusable, CallFunc_BooleanAND_ReturnValue_2) == 0x000008, "Member 'BP_PsychicObjectComponent_C_IsFocusable::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_IsFocusable, CallFunc_BooleanAND_ReturnValue_3) == 0x000009, "Member 'BP_PsychicObjectComponent_C_IsFocusable::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_IsFocusable, CallFunc_BooleanAND_ReturnValue_4) == 0x00000A, "Member 'BP_PsychicObjectComponent_C_IsFocusable::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");

// Function BP_PsychicObjectComponent.BP_PsychicObjectComponent_C.CanCapture
// 0x0003 (0x0003 - 0x0000)
struct BP_PsychicObjectComponent_C_CanCapture final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckPsychicObjectState_return;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicObjectComponent_C_CanCapture) == 0x000001, "Wrong alignment on BP_PsychicObjectComponent_C_CanCapture");
static_assert(sizeof(BP_PsychicObjectComponent_C_CanCapture) == 0x000003, "Wrong size on BP_PsychicObjectComponent_C_CanCapture");
static_assert(offsetof(BP_PsychicObjectComponent_C_CanCapture, Return) == 0x000000, "Member 'BP_PsychicObjectComponent_C_CanCapture::Return' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_CanCapture, CallFunc_CheckPsychicObjectState_return) == 0x000001, "Member 'BP_PsychicObjectComponent_C_CanCapture::CallFunc_CheckPsychicObjectState_return' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_CanCapture, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'BP_PsychicObjectComponent_C_CanCapture::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_PsychicObjectComponent.BP_PsychicObjectComponent_C.SetPhaseCapture
// 0x00C0 (0x00C0 - 0x0000)
struct BP_PsychicObjectComponent_C_SetPhaseCapture final
{
public:
	bool                                          Flag_in;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Capture_success_in;                                // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Combo_in;                                          // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Air_in;                                            // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Psychic_field_in;                                  // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_716E[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_716F[0x5];                                     // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      K2Node_DynamicCast_AsPlayer_Interface;             // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAIPlayer_ReturnValue;                   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanNOR_ReturnValue;                   // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7170[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPsychicObjectInterface> K2Node_DynamicCast_AsPsychic_Object_Interface;     // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7171[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPsychicObjectInUseC_ReturnValue;       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7172[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APsychicObjectManager_C*                CallFunc_GetPsychicObjectManager_PsyObjManager;    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetProcedurePhase_return;                 // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7173[0x5];                                     // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetDebuggingManager_Manager;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetProcedurePhase_return_1;               // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetProcedurePhase_return_2;               // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicObjectComponent_C_SetPhaseCapture) == 0x000008, "Wrong alignment on BP_PsychicObjectComponent_C_SetPhaseCapture");
static_assert(sizeof(BP_PsychicObjectComponent_C_SetPhaseCapture) == 0x0000C0, "Wrong size on BP_PsychicObjectComponent_C_SetPhaseCapture");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, Flag_in) == 0x000000, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::Flag_in' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, Capture_success_in) == 0x000001, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::Capture_success_in' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, Combo_in) == 0x000002, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::Combo_in' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, Air_in) == 0x000003, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::Air_in' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, Psychic_field_in) == 0x000004, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::Psychic_field_in' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, Temp_int_Variable) == 0x000008, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, CallFunc_BreakTransform_Location) == 0x00000C, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, CallFunc_BreakTransform_Rotation) == 0x000018, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, CallFunc_BreakTransform_Scale) == 0x000024, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000030, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000040, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, CallFunc_VSize_ReturnValue) == 0x00004C, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000051, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000052, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, K2Node_DynamicCast_AsPlayer_Interface) == 0x000058, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::K2Node_DynamicCast_AsPlayer_Interface' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, CallFunc_Not_PreBool_ReturnValue) == 0x000069, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, CallFunc_IsAIPlayer_ReturnValue) == 0x00006A, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::CallFunc_IsAIPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, CallFunc_BooleanNOR_ReturnValue) == 0x00006B, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::CallFunc_BooleanNOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, K2Node_DynamicCast_AsPsychic_Object_Interface) == 0x000070, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::K2Node_DynamicCast_AsPsychic_Object_Interface' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, CallFunc_GetDisplayName_ReturnValue) == 0x000088, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, CallFunc_SetPsychicObjectInUseC_ReturnValue) == 0x000098, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::CallFunc_SetPsychicObjectInUseC_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, CallFunc_GetPsychicObjectManager_PsyObjManager) == 0x0000A0, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::CallFunc_GetPsychicObjectManager_PsyObjManager' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000A8, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, CallFunc_IsValid_ReturnValue) == 0x0000A9, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, CallFunc_SetProcedurePhase_return) == 0x0000AA, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::CallFunc_SetProcedurePhase_return' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, CallFunc_GetDebuggingManager_Manager) == 0x0000B0, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::CallFunc_GetDebuggingManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, CallFunc_IsValid_ReturnValue_1) == 0x0000B8, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, CallFunc_SetProcedurePhase_return_1) == 0x0000B9, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::CallFunc_SetProcedurePhase_return_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPhaseCapture, CallFunc_SetProcedurePhase_return_2) == 0x0000BA, "Member 'BP_PsychicObjectComponent_C_SetPhaseCapture::CallFunc_SetProcedurePhase_return_2' has a wrong offset!");

// Function BP_PsychicObjectComponent.BP_PsychicObjectComponent_C.SetPsychicObjectCapture
// 0x0050 (0x0050 - 0x0000)
struct BP_PsychicObjectComponent_C_SetPsychicObjectCapture final
{
public:
	bool                                          Flag_in;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7174[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARsBattleHero_C*                        Capture_owner_in;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Capture_success_in;                                // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Combo_in;                                          // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Air_in;                                            // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Psychic_field_in;                                  // 0x0013(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Return;                                            // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EVibSndMode                                   Temp_byte_Variable;                                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7175[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EVibSndMode                                   Temp_byte_Variable_1;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVibSndMode                                   Temp_byte_Variable_2;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7176[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TriggerEffectManager_C*             CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckProcedurePhase_return;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EVibSndMode                                   K2Node_Select_Default;                             // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVibSndMode                                   K2Node_Select_Default_1;                           // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanCapture_return;                        // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture) == 0x000008, "Wrong alignment on BP_PsychicObjectComponent_C_SetPsychicObjectCapture");
static_assert(sizeof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture) == 0x000050, "Wrong size on BP_PsychicObjectComponent_C_SetPsychicObjectCapture");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture, Flag_in) == 0x000000, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectCapture::Flag_in' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture, Capture_owner_in) == 0x000008, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectCapture::Capture_owner_in' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture, Capture_success_in) == 0x000010, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectCapture::Capture_success_in' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture, Combo_in) == 0x000011, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectCapture::Combo_in' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture, Air_in) == 0x000012, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectCapture::Air_in' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture, Psychic_field_in) == 0x000013, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectCapture::Psychic_field_in' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture, Return) == 0x000014, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectCapture::Return' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture, Temp_byte_Variable) == 0x000015, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectCapture::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture, CallFunc_SelectString_ReturnValue) == 0x000018, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectCapture::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture, Temp_bool_Variable) == 0x000028, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectCapture::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectCapture::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture, Temp_byte_Variable_1) == 0x00002A, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectCapture::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture, Temp_byte_Variable_2) == 0x00002B, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectCapture::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture, CallFunc_BooleanOR_ReturnValue) == 0x00002C, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectCapture::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture, CallFunc_BooleanOR_ReturnValue_1) == 0x00002D, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectCapture::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture, CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager) == 0x000030, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectCapture::CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture, CallFunc_SelectString_ReturnValue_1) == 0x000038, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectCapture::CallFunc_SelectString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture, CallFunc_CheckProcedurePhase_return) == 0x000048, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectCapture::CallFunc_CheckProcedurePhase_return' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture, Temp_bool_Variable_1) == 0x000049, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectCapture::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture, K2Node_Select_Default) == 0x00004A, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectCapture::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture, K2Node_Select_Default_1) == 0x00004B, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectCapture::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture, CallFunc_IsValid_ReturnValue_1) == 0x00004C, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectCapture::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectComponent_C_SetPsychicObjectCapture, CallFunc_CanCapture_return) == 0x00004D, "Member 'BP_PsychicObjectComponent_C_SetPsychicObjectCapture::CallFunc_CanCapture_return' has a wrong offset!");

// Function BP_PsychicObjectComponent.BP_PsychicObjectComponent_C.DebugDisplay
// 0x0050 (0x0050 - 0x0000)
struct BP_PsychicObjectComponent_C_DebugDisplay final
{
public:
	class FString                                 L_str;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IPsychicObjectInterface> K2Node_DynamicCast_AsPsychic_Object_Interface;     // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPsychicObjectInUseC_ReturnValue;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetPsychicObjectTick_return;              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7177[0x1];                                     // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetMeshBoundCentrePos_pos;                // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IPsychicObjectInterface> K2Node_DynamicCast_AsPsychic_Object_Interface_1;   // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPsychicObjectTickC_ReturnValue;         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicObjectComponent_C_DebugDisplay) == 0x000008, "Wrong alignment on BP_PsychicObjectComponent_C_DebugDisplay");
static_assert(sizeof(BP_PsychicObjectComponent_C_DebugDisplay) == 0x000050, "Wrong size on BP_PsychicObjectComponent_C_DebugDisplay");
static_assert(offsetof(BP_PsychicObjectComponent_C_DebugDisplay, L_str) == 0x000000, "Member 'BP_PsychicObjectComponent_C_DebugDisplay::L_str' has a wrong offset!");
