#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerDriveComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "FAttackEmitterInfo_structs.hpp"
#include "Engine_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerDriveComponent.BP_PlayerDriveComponent_C.ED_PlayStart__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerDriveComponent_C_ED_PlayStart__DelegateSignature final
{
public:
	class AActor*                                 User;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayStart;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerDriveComponent_C_ED_PlayStart__DelegateSignature) == 0x000008, "Wrong alignment on BP_PlayerDriveComponent_C_ED_PlayStart__DelegateSignature");
static_assert(sizeof(BP_PlayerDriveComponent_C_ED_PlayStart__DelegateSignature) == 0x000010, "Wrong size on BP_PlayerDriveComponent_C_ED_PlayStart__DelegateSignature");
static_assert(offsetof(BP_PlayerDriveComponent_C_ED_PlayStart__DelegateSignature, User) == 0x000000, "Member 'BP_PlayerDriveComponent_C_ED_PlayStart__DelegateSignature::User' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ED_PlayStart__DelegateSignature, bPlayStart) == 0x000008, "Member 'BP_PlayerDriveComponent_C_ED_PlayStart__DelegateSignature::bPlayStart' has a wrong offset!");

// Function BP_PlayerDriveComponent.BP_PlayerDriveComponent_C.ED_PlayFinish__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerDriveComponent_C_ED_PlayFinish__DelegateSignature final
{
public:
	class AActor*                                 User;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayStart;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerDriveComponent_C_ED_PlayFinish__DelegateSignature) == 0x000008, "Wrong alignment on BP_PlayerDriveComponent_C_ED_PlayFinish__DelegateSignature");
static_assert(sizeof(BP_PlayerDriveComponent_C_ED_PlayFinish__DelegateSignature) == 0x000010, "Wrong size on BP_PlayerDriveComponent_C_ED_PlayFinish__DelegateSignature");
static_assert(offsetof(BP_PlayerDriveComponent_C_ED_PlayFinish__DelegateSignature, User) == 0x000000, "Member 'BP_PlayerDriveComponent_C_ED_PlayFinish__DelegateSignature::User' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ED_PlayFinish__DelegateSignature, bPlayStart) == 0x000008, "Member 'BP_PlayerDriveComponent_C_ED_PlayFinish__DelegateSignature::bPlayStart' has a wrong offset!");

// Function BP_PlayerDriveComponent.BP_PlayerDriveComponent_C.ExecuteUbergraph_BP_PlayerDriveComponent
// 0x0048 (0x0048 - 0x0000)
struct BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsControlAI_bAI;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3156[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float DeltaSeconds)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bInterruption, bool bLocationChange)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3157[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float DeltaSeconds)>           K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent) == 0x000004, "Wrong alignment on BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent");
static_assert(sizeof(BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent) == 0x000048, "Wrong size on BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent");
static_assert(offsetof(BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent, EntryPoint) == 0x000000, "Member 'BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent, CallFunc_IsControlAI_bAI) == 0x000004, "Member 'BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent::CallFunc_IsControlAI_bAI' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent, Temp_bool_Has_Been_Initd_Variable) == 0x000006, "Member 'BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent, Temp_bool_Has_Been_Initd_Variable_1) == 0x000007, "Member 'BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent, Temp_bool_IsClosed_Variable_1) == 0x000008, "Member 'BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent, Temp_bool_Has_Been_Initd_Variable_2) == 0x000009, "Member 'BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent, Temp_bool_IsClosed_Variable_2) == 0x00000A, "Member 'BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent, Temp_bool_Has_Been_Initd_Variable_3) == 0x00000B, "Member 'BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent::Temp_bool_Has_Been_Initd_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent, K2Node_Event_EndPlayReason) == 0x000010, "Member 'BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent, Temp_bool_IsClosed_Variable_3) == 0x000034, "Member 'BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent::Temp_bool_IsClosed_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'BP_PlayerDriveComponent_C_ExecuteUbergraph_BP_PlayerDriveComponent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function BP_PlayerDriveComponent.BP_PlayerDriveComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerDriveComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerDriveComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_PlayerDriveComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_PlayerDriveComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_PlayerDriveComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_PlayerDriveComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_PlayerDriveComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_PlayerDriveComponent.BP_PlayerDriveComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PlayerDriveComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerDriveComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PlayerDriveComponent_C_ReceiveTick");
static_assert(sizeof(BP_PlayerDriveComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_PlayerDriveComponent_C_ReceiveTick");
static_assert(offsetof(BP_PlayerDriveComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PlayerDriveComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PlayerDriveComponent.BP_PlayerDriveComponent_C.PlayStartSequence
// 0x0240 (0x0240 - 0x0000)
struct BP_PlayerDriveComponent_C_PlayStartSequence final
{
public:
	bool                                          HighDamage;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3158[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0020(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3159[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleSimulatorManager*                CallFunc_GetBattleSimulatorManager_BattleSimulatorManager; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Attachment_C>     CallFunc_AttachmentVisibilityOffOnHead_self_CastInput; // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AttachmentVisibilityOffOnHead_bDummy;     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_315A[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICameraInterface>      CallFunc_GetPlayerCameraFieldOfView_self_CastInput; // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetPlayerCameraFieldOfView_ReturnValue;   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_315B[0xC];                                     // 0x0084(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x00C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_315C[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0158(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0168(0x0018)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_315D[0x4];                                     // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_StoreLockTargetInterface_self_CastInput;  // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StoreLockTargetInterface_bDummy;          // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_315E[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICameraInterface>      K2Node_DynamicCast_AsCamera_Interface;             // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_315F[0x3];                                     // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetPlayerCameraRotation_ReturnValue;      // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3160[0x3];                                     // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICameraInterface>      K2Node_DynamicCast_AsCamera_Interface_1;           // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3161[0x3];                                     // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPlayerCameraLocation_ReturnValue;      // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3162[0x2];                                     // 0x0206(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0208(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0218(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerDriveComponent_C_PlayStartSequence) == 0x000010, "Wrong alignment on BP_PlayerDriveComponent_C_PlayStartSequence");
static_assert(sizeof(BP_PlayerDriveComponent_C_PlayStartSequence) == 0x000240, "Wrong size on BP_PlayerDriveComponent_C_PlayStartSequence");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, HighDamage) == 0x000000, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::HighDamage' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, K2Node_MakeArray_Array) == 0x000008, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000018, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_Format_ReturnValue) == 0x000020, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_Conv_TextToString_ReturnValue) == 0x000038, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_GetBattleSimulatorManager_BattleSimulatorManager) == 0x000050, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_GetBattleSimulatorManager_BattleSimulatorManager' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_AttachmentVisibilityOffOnHead_self_CastInput) == 0x000058, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_AttachmentVisibilityOffOnHead_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_AttachmentVisibilityOffOnHead_bDummy) == 0x000068, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_AttachmentVisibilityOffOnHead_bDummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_GetPlayerCameraFieldOfView_self_CastInput) == 0x000070, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_GetPlayerCameraFieldOfView_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_GetPlayerCameraFieldOfView_ReturnValue) == 0x000080, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_GetPlayerCameraFieldOfView_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_GetPlayerController_ReturnValue) == 0x0000C0, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x0000C8, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000150, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, K2Node_MakeArray_Array_1) == 0x000158, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_Format_ReturnValue_1) == 0x000168, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000180, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000190, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_StoreLockTargetInterface_self_CastInput) == 0x0001A0, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_StoreLockTargetInterface_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_StoreLockTargetInterface_bDummy) == 0x0001B0, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_StoreLockTargetInterface_bDummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, K2Node_DynamicCast_AsCamera_Interface) == 0x0001B8, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::K2Node_DynamicCast_AsCamera_Interface' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, K2Node_DynamicCast_bSuccess) == 0x0001C8, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_Array_Length_ReturnValue) == 0x0001CC, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_GetPlayerCameraRotation_ReturnValue) == 0x0001D0, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_GetPlayerCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_Greater_IntInt_ReturnValue) == 0x0001DC, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, K2Node_DynamicCast_AsCamera_Interface_1) == 0x0001E0, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::K2Node_DynamicCast_AsCamera_Interface_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, K2Node_DynamicCast_bSuccess_1) == 0x0001F0, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_GetPlayerCameraLocation_ReturnValue) == 0x0001F4, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_GetPlayerCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_Array_Length_ReturnValue_1) == 0x000200, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_IsValid_ReturnValue_1) == 0x000204, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000205, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, K2Node_MakeArray_Array_2) == 0x000208, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_Format_ReturnValue_2) == 0x000218, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_PlayStartSequence, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000230, "Member 'BP_PlayerDriveComponent_C_PlayStartSequence::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");

// Function BP_PlayerDriveComponent.BP_PlayerDriveComponent_C.ProtectedInitialize
// 0x00C0 (0x00C0 - 0x0000)
struct BP_PlayerDriveComponent_C_ProtectedInitialize final
{
public:
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSLevelSequenceActor*                  CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3163[0x6];                                     // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerDriveComponent_C_ProtectedInitialize) == 0x000010, "Wrong alignment on BP_PlayerDriveComponent_C_ProtectedInitialize");
static_assert(sizeof(BP_PlayerDriveComponent_C_ProtectedInitialize) == 0x0000C0, "Wrong size on BP_PlayerDriveComponent_C_ProtectedInitialize");
static_assert(offsetof(BP_PlayerDriveComponent_C_ProtectedInitialize, CallFunc_MakeTransform_ReturnValue) == 0x000000, "Member 'BP_PlayerDriveComponent_C_ProtectedInitialize::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ProtectedInitialize, CallFunc_MakeTransform_ReturnValue_1) == 0x000030, "Member 'BP_PlayerDriveComponent_C_ProtectedInitialize::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ProtectedInitialize, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000060, "Member 'BP_PlayerDriveComponent_C_ProtectedInitialize::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ProtectedInitialize, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000068, "Member 'BP_PlayerDriveComponent_C_ProtectedInitialize::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ProtectedInitialize, CallFunc_FinishSpawningActor_ReturnValue) == 0x000070, "Member 'BP_PlayerDriveComponent_C_ProtectedInitialize::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ProtectedInitialize, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000078, "Member 'BP_PlayerDriveComponent_C_ProtectedInitialize::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ProtectedInitialize, CallFunc_GetOwner_ReturnValue) == 0x000080, "Member 'BP_PlayerDriveComponent_C_ProtectedInitialize::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ProtectedInitialize, K2Node_MakeArray_Array) == 0x000088, "Member 'BP_PlayerDriveComponent_C_ProtectedInitialize::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ProtectedInitialize, K2Node_DynamicCast_AsRSBattle_Player) == 0x000098, "Member 'BP_PlayerDriveComponent_C_ProtectedInitialize::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ProtectedInitialize, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'BP_PlayerDriveComponent_C_ProtectedInitialize::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ProtectedInitialize, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000A1, "Member 'BP_PlayerDriveComponent_C_ProtectedInitialize::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ProtectedInitialize, CallFunc_GetOwner_ReturnValue_1) == 0x0000A8, "Member 'BP_PlayerDriveComponent_C_ProtectedInitialize::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ProtectedInitialize, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'BP_PlayerDriveComponent_C_ProtectedInitialize::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PlayerDriveComponent.BP_PlayerDriveComponent_C.ProtectedFinalize
// 0x0038 (0x0038 - 0x0000)
struct BP_PlayerDriveComponent_C_ProtectedFinalize final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3164[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3165[0x5];                                     // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_1; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerDriveComponent_C_ProtectedFinalize) == 0x000008, "Wrong alignment on BP_PlayerDriveComponent_C_ProtectedFinalize");
static_assert(sizeof(BP_PlayerDriveComponent_C_ProtectedFinalize) == 0x000038, "Wrong size on BP_PlayerDriveComponent_C_ProtectedFinalize");
static_assert(offsetof(BP_PlayerDriveComponent_C_ProtectedFinalize, EndPlayReason) == 0x000000, "Member 'BP_PlayerDriveComponent_C_ProtectedFinalize::EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ProtectedFinalize, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_PlayerDriveComponent_C_ProtectedFinalize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ProtectedFinalize, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'BP_PlayerDriveComponent_C_ProtectedFinalize::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ProtectedFinalize, CallFunc_IsValid_ReturnValue_2) == 0x000003, "Member 'BP_PlayerDriveComponent_C_ProtectedFinalize::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ProtectedFinalize, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000008, "Member 'BP_PlayerDriveComponent_C_ProtectedFinalize::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ProtectedFinalize, CallFunc_IsValid_ReturnValue_3) == 0x000018, "Member 'BP_PlayerDriveComponent_C_ProtectedFinalize::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ProtectedFinalize, CallFunc_IsValid_ReturnValue_4) == 0x000019, "Member 'BP_PlayerDriveComponent_C_ProtectedFinalize::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ProtectedFinalize, CallFunc_IsValid_ReturnValue_5) == 0x00001A, "Member 'BP_PlayerDriveComponent_C_ProtectedFinalize::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ProtectedFinalize, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_1) == 0x000020, "Member 'BP_PlayerDriveComponent_C_ProtectedFinalize::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ProtectedFinalize, CallFunc_IsValid_ReturnValue_6) == 0x000030, "Member 'BP_PlayerDriveComponent_C_ProtectedFinalize::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_ProtectedFinalize, CallFunc_IsValid_ReturnValue_7) == 0x000031, "Member 'BP_PlayerDriveComponent_C_ProtectedFinalize::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");

// Function BP_PlayerDriveComponent.BP_PlayerDriveComponent_C.LoadAsset
// 0x02F0 (0x02F0 - 0x0000)
struct BP_PlayerDriveComponent_C_LoadAsset final
{
public:
	EPlayerID                                     UserPlayerID;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MainPlayer;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3166[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3167[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3168[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DriveSequenceParameter_C*           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3169[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_316A[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_316B[0x5];                                     // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        CallFunc_AddActorComponent_ReturnValue;            // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  K2Node_DynamicCast_AsPost_Process_Component;       // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_316C[0xC];                                     // 0x00B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0108(0x0018)()
	class ABP_EventCameraRoot_C*                  CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0128(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0168(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0178(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_316D[0x4];                                     // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PostProcessManager_C*               CallFunc_GetPostProcessManager_Manager;            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_316E[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPostProcessComponent*                  CallFunc_GetPerformPostProcess_PostProcess;        // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_316F[0x3];                                     // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue_1;             // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3170[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance_1;          // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3171[0x5];                                     // 0x01E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01F8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0210(0x0040)(HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class ULevelSequence>>  CallFunc_ProtectedGetLoadSequencerAsset_StartLevelSequences; // 0x0250(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class ULevelSequence>>  CallFunc_ProtectedGetLoadSequencerAsset_EndLevelSequences; // 0x0260(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0270(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0280(0x0018)()
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue_2;             // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ULevelSequence*                         K2Node_DynamicCast_AsLevel_Sequence;               // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3172[0x3];                                     // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3173[0x4];                                     // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue_3;             // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3174[0x4];                                     // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         K2Node_DynamicCast_AsLevel_Sequence_1;             // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3175[0x3];                                     // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerDriveComponent_C_LoadAsset) == 0x000010, "Wrong alignment on BP_PlayerDriveComponent_C_LoadAsset");
static_assert(sizeof(BP_PlayerDriveComponent_C_LoadAsset) == 0x0002F0, "Wrong size on BP_PlayerDriveComponent_C_LoadAsset");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, UserPlayerID) == 0x000000, "Member 'BP_PlayerDriveComponent_C_LoadAsset::UserPlayerID' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, MainPlayer) == 0x000001, "Member 'BP_PlayerDriveComponent_C_LoadAsset::MainPlayer' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, Temp_int_Loop_Num_Variable) == 0x000004, "Member 'BP_PlayerDriveComponent_C_LoadAsset::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_PlayerDriveComponent_C_LoadAsset::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, Temp_int_Array_Index_Variable) == 0x000040, "Member 'BP_PlayerDriveComponent_C_LoadAsset::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000048, "Member 'BP_PlayerDriveComponent_C_LoadAsset::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, CallFunc_FinishSpawningActor_ReturnValue) == 0x000050, "Member 'BP_PlayerDriveComponent_C_LoadAsset::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'BP_PlayerDriveComponent_C_LoadAsset::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'BP_PlayerDriveComponent_C_LoadAsset::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, Temp_int_Array_Index_Variable_1) == 0x000060, "Member 'BP_PlayerDriveComponent_C_LoadAsset::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, Temp_int_Loop_Num_Variable_1) == 0x000064, "Member 'BP_PlayerDriveComponent_C_LoadAsset::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'BP_PlayerDriveComponent_C_LoadAsset::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, CallFunc_LoadSoftObject_ReturnValue) == 0x000070, "Member 'BP_PlayerDriveComponent_C_LoadAsset::CallFunc_LoadSoftObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, K2Node_DynamicCast_AsMaterial_Instance) == 0x000078, "Member 'BP_PlayerDriveComponent_C_LoadAsset::K2Node_DynamicCast_AsMaterial_Instance' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'BP_PlayerDriveComponent_C_LoadAsset::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000088, "Member 'BP_PlayerDriveComponent_C_LoadAsset::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000090, "Member 'BP_PlayerDriveComponent_C_LoadAsset::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, CallFunc_IsValid_ReturnValue) == 0x000091, "Member 'BP_PlayerDriveComponent_C_LoadAsset::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, CallFunc_IsValid_ReturnValue_1) == 0x000092, "Member 'BP_PlayerDriveComponent_C_LoadAsset::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, CallFunc_GetOwner_ReturnValue) == 0x000098, "Member 'BP_PlayerDriveComponent_C_LoadAsset::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, CallFunc_AddActorComponent_ReturnValue) == 0x0000A0, "Member 'BP_PlayerDriveComponent_C_LoadAsset::CallFunc_AddActorComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, K2Node_DynamicCast_AsPost_Process_Component) == 0x0000A8, "Member 'BP_PlayerDriveComponent_C_LoadAsset::K2Node_DynamicCast_AsPost_Process_Component' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'BP_PlayerDriveComponent_C_LoadAsset::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, CallFunc_IsValid_ReturnValue_2) == 0x0000B1, "Member 'BP_PlayerDriveComponent_C_LoadAsset::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, CallFunc_IsValid_ReturnValue_3) == 0x0000B2, "Member 'BP_PlayerDriveComponent_C_LoadAsset::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000B3, "Member 'BP_PlayerDriveComponent_C_LoadAsset::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, CallFunc_MakeTransform_ReturnValue_1) == 0x0000C0, "Member 'BP_PlayerDriveComponent_C_LoadAsset::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDriveComponent_C_LoadAsset, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0000F0, "Member 'BP_PlayerDriveComponent_C_LoadAsset::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
