#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PsychicAttackBaseComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PsychicAttackBaseComponent.BP_PsychicAttackBaseComponent_C.ExecuteUbergraph_BP_PsychicAttackBaseComponent
// 0x0058 (0x0058 - 0x0000)
struct BP_PsychicAttackBaseComponent_C_ExecuteUbergraph_BP_PsychicAttackBaseComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAnimMontage* FirstAttackMontage)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_84E0[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARsBattleHero_C*                        K2Node_DynamicCast_AsRs_Battle_Hero;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84E1[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_CustomEvent_FirstAttackMontage;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAttacking_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAttacking_ReturnValue_1;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicAttackBaseComponent_C_ExecuteUbergraph_BP_PsychicAttackBaseComponent) == 0x000008, "Wrong alignment on BP_PsychicAttackBaseComponent_C_ExecuteUbergraph_BP_PsychicAttackBaseComponent");
static_assert(sizeof(BP_PsychicAttackBaseComponent_C_ExecuteUbergraph_BP_PsychicAttackBaseComponent) == 0x000058, "Wrong size on BP_PsychicAttackBaseComponent_C_ExecuteUbergraph_BP_PsychicAttackBaseComponent");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_ExecuteUbergraph_BP_PsychicAttackBaseComponent, EntryPoint) == 0x000000, "Member 'BP_PsychicAttackBaseComponent_C_ExecuteUbergraph_BP_PsychicAttackBaseComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_ExecuteUbergraph_BP_PsychicAttackBaseComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_PsychicAttackBaseComponent_C_ExecuteUbergraph_BP_PsychicAttackBaseComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_ExecuteUbergraph_BP_PsychicAttackBaseComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_PsychicAttackBaseComponent_C_ExecuteUbergraph_BP_PsychicAttackBaseComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_ExecuteUbergraph_BP_PsychicAttackBaseComponent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'BP_PsychicAttackBaseComponent_C_ExecuteUbergraph_BP_PsychicAttackBaseComponent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_ExecuteUbergraph_BP_PsychicAttackBaseComponent, K2Node_DynamicCast_AsRs_Battle_Hero) == 0x000038, "Member 'BP_PsychicAttackBaseComponent_C_ExecuteUbergraph_BP_PsychicAttackBaseComponent::K2Node_DynamicCast_AsRs_Battle_Hero' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_ExecuteUbergraph_BP_PsychicAttackBaseComponent, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_PsychicAttackBaseComponent_C_ExecuteUbergraph_BP_PsychicAttackBaseComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_ExecuteUbergraph_BP_PsychicAttackBaseComponent, K2Node_CustomEvent_FirstAttackMontage) == 0x000048, "Member 'BP_PsychicAttackBaseComponent_C_ExecuteUbergraph_BP_PsychicAttackBaseComponent::K2Node_CustomEvent_FirstAttackMontage' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_ExecuteUbergraph_BP_PsychicAttackBaseComponent, CallFunc_IsAttacking_ReturnValue) == 0x000050, "Member 'BP_PsychicAttackBaseComponent_C_ExecuteUbergraph_BP_PsychicAttackBaseComponent::CallFunc_IsAttacking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_ExecuteUbergraph_BP_PsychicAttackBaseComponent, CallFunc_IsAttacking_ReturnValue_1) == 0x000051, "Member 'BP_PsychicAttackBaseComponent_C_ExecuteUbergraph_BP_PsychicAttackBaseComponent::CallFunc_IsAttacking_ReturnValue_1' has a wrong offset!");

// Function BP_PsychicAttackBaseComponent.BP_PsychicAttackBaseComponent_C.DispatchCaptureCompleted
// 0x0008 (0x0008 - 0x0000)
struct BP_PsychicAttackBaseComponent_C_DispatchCaptureCompleted final
{
public:
	class UAnimMontage*                           FirstAttackMontage;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicAttackBaseComponent_C_DispatchCaptureCompleted) == 0x000008, "Wrong alignment on BP_PsychicAttackBaseComponent_C_DispatchCaptureCompleted");
static_assert(sizeof(BP_PsychicAttackBaseComponent_C_DispatchCaptureCompleted) == 0x000008, "Wrong size on BP_PsychicAttackBaseComponent_C_DispatchCaptureCompleted");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_DispatchCaptureCompleted, FirstAttackMontage) == 0x000000, "Member 'BP_PsychicAttackBaseComponent_C_DispatchCaptureCompleted::FirstAttackMontage' has a wrong offset!");

// Function BP_PsychicAttackBaseComponent.BP_PsychicAttackBaseComponent_C.OnCaptureCompleted
// 0x0008 (0x0008 - 0x0000)
struct BP_PsychicAttackBaseComponent_C_OnCaptureCompleted final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicAttackBaseComponent_C_OnCaptureCompleted) == 0x000008, "Wrong alignment on BP_PsychicAttackBaseComponent_C_OnCaptureCompleted");
static_assert(sizeof(BP_PsychicAttackBaseComponent_C_OnCaptureCompleted) == 0x000008, "Wrong size on BP_PsychicAttackBaseComponent_C_OnCaptureCompleted");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_OnCaptureCompleted, Montage) == 0x000000, "Member 'BP_PsychicAttackBaseComponent_C_OnCaptureCompleted::Montage' has a wrong offset!");

// Function BP_PsychicAttackBaseComponent.BP_PsychicAttackBaseComponent_C.IsFrontRightFoot
// 0x006C (0x006C - 0x0000)
struct BP_PsychicAttackBaseComponent_C_IsFrontRightFoot final
{
public:
	bool                                          bFront;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LbFront;                                           // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84E2[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LFootDir;                                          // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84E3[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicAttackBaseComponent_C_IsFrontRightFoot) == 0x000004, "Wrong alignment on BP_PsychicAttackBaseComponent_C_IsFrontRightFoot");
static_assert(sizeof(BP_PsychicAttackBaseComponent_C_IsFrontRightFoot) == 0x00006C, "Wrong size on BP_PsychicAttackBaseComponent_C_IsFrontRightFoot");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_IsFrontRightFoot, bFront) == 0x000000, "Member 'BP_PsychicAttackBaseComponent_C_IsFrontRightFoot::bFront' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_IsFrontRightFoot, LbFront) == 0x000001, "Member 'BP_PsychicAttackBaseComponent_C_IsFrontRightFoot::LbFront' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_IsFrontRightFoot, LFootDir) == 0x000004, "Member 'BP_PsychicAttackBaseComponent_C_IsFrontRightFoot::LFootDir' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_IsFrontRightFoot, CallFunc_GetActorForwardVector_ReturnValue) == 0x000010, "Member 'BP_PsychicAttackBaseComponent_C_IsFrontRightFoot::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_IsFrontRightFoot, CallFunc_Dot_VectorVector_ReturnValue) == 0x00001C, "Member 'BP_PsychicAttackBaseComponent_C_IsFrontRightFoot::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_IsFrontRightFoot, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_PsychicAttackBaseComponent_C_IsFrontRightFoot::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_IsFrontRightFoot, CallFunc_GetSocketLocation_ReturnValue) == 0x000024, "Member 'BP_PsychicAttackBaseComponent_C_IsFrontRightFoot::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_IsFrontRightFoot, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000030, "Member 'BP_PsychicAttackBaseComponent_C_IsFrontRightFoot::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_IsFrontRightFoot, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00003C, "Member 'BP_PsychicAttackBaseComponent_C_IsFrontRightFoot::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_IsFrontRightFoot, CallFunc_BreakVector_X) == 0x000048, "Member 'BP_PsychicAttackBaseComponent_C_IsFrontRightFoot::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_IsFrontRightFoot, CallFunc_BreakVector_Y) == 0x00004C, "Member 'BP_PsychicAttackBaseComponent_C_IsFrontRightFoot::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_IsFrontRightFoot, CallFunc_BreakVector_Z) == 0x000050, "Member 'BP_PsychicAttackBaseComponent_C_IsFrontRightFoot::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_IsFrontRightFoot, CallFunc_MakeVector_ReturnValue) == 0x000054, "Member 'BP_PsychicAttackBaseComponent_C_IsFrontRightFoot::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackBaseComponent_C_IsFrontRightFoot, CallFunc_Normal_ReturnValue) == 0x000060, "Member 'BP_PsychicAttackBaseComponent_C_IsFrontRightFoot::CallFunc_Normal_ReturnValue' has a wrong offset!");

}

