#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PhotoModePlayerFacialManager

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PhotoModePlayerFacialManager.BP_PhotoModePlayerFacialManager_C.ExecuteUbergraph_BP_PhotoModePlayerFacialManager
// 0x000C (0x000C - 0x0000)
struct BP_PhotoModePlayerFacialManager_C_ExecuteUbergraph_BP_PhotoModePlayerFacialManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PhotoModePlayerFacialManager_C_ExecuteUbergraph_BP_PhotoModePlayerFacialManager) == 0x000004, "Wrong alignment on BP_PhotoModePlayerFacialManager_C_ExecuteUbergraph_BP_PhotoModePlayerFacialManager");
static_assert(sizeof(BP_PhotoModePlayerFacialManager_C_ExecuteUbergraph_BP_PhotoModePlayerFacialManager) == 0x00000C, "Wrong size on BP_PhotoModePlayerFacialManager_C_ExecuteUbergraph_BP_PhotoModePlayerFacialManager");
static_assert(offsetof(BP_PhotoModePlayerFacialManager_C_ExecuteUbergraph_BP_PhotoModePlayerFacialManager, EntryPoint) == 0x000000, "Member 'BP_PhotoModePlayerFacialManager_C_ExecuteUbergraph_BP_PhotoModePlayerFacialManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PhotoModePlayerFacialManager_C_ExecuteUbergraph_BP_PhotoModePlayerFacialManager, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_PhotoModePlayerFacialManager_C_ExecuteUbergraph_BP_PhotoModePlayerFacialManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PhotoModePlayerFacialManager_C_ExecuteUbergraph_BP_PhotoModePlayerFacialManager, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_PhotoModePlayerFacialManager_C_ExecuteUbergraph_BP_PhotoModePlayerFacialManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PhotoModePlayerFacialManager.BP_PhotoModePlayerFacialManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PhotoModePlayerFacialManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PhotoModePlayerFacialManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PhotoModePlayerFacialManager_C_ReceiveTick");
static_assert(sizeof(BP_PhotoModePlayerFacialManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_PhotoModePlayerFacialManager_C_ReceiveTick");
static_assert(offsetof(BP_PhotoModePlayerFacialManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PhotoModePlayerFacialManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

