#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerActionStateDown

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerActionStateDown.BP_PlayerActionStateDown_C.ExecuteUbergraph_BP_PlayerActionStateDown
// 0x0028 (0x0028 - 0x0000)
struct BP_PlayerActionStateDown_C_ExecuteUbergraph_BP_PlayerActionStateDown final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager_1;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* RevivePlayer)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateDown_C_ExecuteUbergraph_BP_PlayerActionStateDown) == 0x000008, "Wrong alignment on BP_PlayerActionStateDown_C_ExecuteUbergraph_BP_PlayerActionStateDown");
static_assert(sizeof(BP_PlayerActionStateDown_C_ExecuteUbergraph_BP_PlayerActionStateDown) == 0x000028, "Wrong size on BP_PlayerActionStateDown_C_ExecuteUbergraph_BP_PlayerActionStateDown");
static_assert(offsetof(BP_PlayerActionStateDown_C_ExecuteUbergraph_BP_PlayerActionStateDown, EntryPoint) == 0x000000, "Member 'BP_PlayerActionStateDown_C_ExecuteUbergraph_BP_PlayerActionStateDown::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_ExecuteUbergraph_BP_PlayerActionStateDown, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'BP_PlayerActionStateDown_C_ExecuteUbergraph_BP_PlayerActionStateDown::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_ExecuteUbergraph_BP_PlayerActionStateDown, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'BP_PlayerActionStateDown_C_ExecuteUbergraph_BP_PlayerActionStateDown::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_ExecuteUbergraph_BP_PlayerActionStateDown, Temp_bool_IsClosed_Variable_1) == 0x000006, "Member 'BP_PlayerActionStateDown_C_ExecuteUbergraph_BP_PlayerActionStateDown::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_ExecuteUbergraph_BP_PlayerActionStateDown, Temp_bool_Has_Been_Initd_Variable_1) == 0x000007, "Member 'BP_PlayerActionStateDown_C_ExecuteUbergraph_BP_PlayerActionStateDown::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_ExecuteUbergraph_BP_PlayerActionStateDown, CallFunc_GetPlayerManager_PlayerManager) == 0x000008, "Member 'BP_PlayerActionStateDown_C_ExecuteUbergraph_BP_PlayerActionStateDown::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_ExecuteUbergraph_BP_PlayerActionStateDown, CallFunc_GetPlayerManager_PlayerManager_1) == 0x000010, "Member 'BP_PlayerActionStateDown_C_ExecuteUbergraph_BP_PlayerActionStateDown::CallFunc_GetPlayerManager_PlayerManager_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_ExecuteUbergraph_BP_PlayerActionStateDown, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_PlayerActionStateDown_C_ExecuteUbergraph_BP_PlayerActionStateDown::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_PlayerActionStateDown.BP_PlayerActionStateDown_C.Enter
// 0x00C0 (0x00C0 - 0x0000)
struct BP_PlayerActionStateDown_C_Enter final
{
public:
	int32                                         Param;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Enter_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4745[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> CallFunc_ResetBattleThink_self_CastInput;          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ResetBattleThink_Dummy;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsControlAI_bAI;                          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4746[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetDebuggingManager_Manager;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_IsEnemyPlayer_self_CastInput;             // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemyPlayer_bEnemyPlayer;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RevivePlayer_bSuccess;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4747[0x5];                                     // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ENpcInterface_C>  K2Node_DynamicCast_AsBPI_ENpc_Interface;           // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActiveBrainFieldGameOverTimer_ReturnValue; // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EnterDownEnpc_Return;                     // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4748[0x5];                                     // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface;         // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4749[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface_1;       // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_474A[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ENpcComponent_C*                    CallFunc_GetEnpcComp_ReturnComp;                   // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemyPlayer_bEnemyPlayer_1;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsResetBattleThink_isReset;               // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInvalidDamage_Dummy;                   // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInvincible_bInvincible;                 // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_474B[0x1];                                     // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetFootIKEnable_Dummy;                    // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_474C[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_LookAtInterface_C> CallFunc_SetLookAtEnable_self_CastInput;           // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetLookAtEnable_bResult;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateDown_C_Enter) == 0x000008, "Wrong alignment on BP_PlayerActionStateDown_C_Enter");
static_assert(sizeof(BP_PlayerActionStateDown_C_Enter) == 0x0000C0, "Wrong size on BP_PlayerActionStateDown_C_Enter");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, Param) == 0x000000, "Member 'BP_PlayerActionStateDown_C_Enter::Param' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateDown_C_Enter::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, CallFunc_Enter_ReturnValue) == 0x000008, "Member 'BP_PlayerActionStateDown_C_Enter::CallFunc_Enter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, CallFunc_ResetBattleThink_self_CastInput) == 0x000010, "Member 'BP_PlayerActionStateDown_C_Enter::CallFunc_ResetBattleThink_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, CallFunc_ResetBattleThink_Dummy) == 0x000020, "Member 'BP_PlayerActionStateDown_C_Enter::CallFunc_ResetBattleThink_Dummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, CallFunc_IsControlAI_bAI) == 0x000021, "Member 'BP_PlayerActionStateDown_C_Enter::CallFunc_IsControlAI_bAI' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, CallFunc_GetDebuggingManager_Manager) == 0x000028, "Member 'BP_PlayerActionStateDown_C_Enter::CallFunc_GetDebuggingManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, CallFunc_IsEnemyPlayer_self_CastInput) == 0x000030, "Member 'BP_PlayerActionStateDown_C_Enter::CallFunc_IsEnemyPlayer_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, CallFunc_IsEnemyPlayer_bEnemyPlayer) == 0x000040, "Member 'BP_PlayerActionStateDown_C_Enter::CallFunc_IsEnemyPlayer_bEnemyPlayer' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'BP_PlayerActionStateDown_C_Enter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, CallFunc_RevivePlayer_bSuccess) == 0x000042, "Member 'BP_PlayerActionStateDown_C_Enter::CallFunc_RevivePlayer_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, K2Node_DynamicCast_AsBPI_ENpc_Interface) == 0x000048, "Member 'BP_PlayerActionStateDown_C_Enter::K2Node_DynamicCast_AsBPI_ENpc_Interface' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_PlayerActionStateDown_C_Enter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, CallFunc_IsActiveBrainFieldGameOverTimer_ReturnValue) == 0x000059, "Member 'BP_PlayerActionStateDown_C_Enter::CallFunc_IsActiveBrainFieldGameOverTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, CallFunc_EnterDownEnpc_Return) == 0x00005A, "Member 'BP_PlayerActionStateDown_C_Enter::CallFunc_EnterDownEnpc_Return' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, K2Node_DynamicCast_AsBPI_Player_Interface) == 0x000060, "Member 'BP_PlayerActionStateDown_C_Enter::K2Node_DynamicCast_AsBPI_Player_Interface' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'BP_PlayerActionStateDown_C_Enter::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, K2Node_DynamicCast_AsBPI_Player_Interface_1) == 0x000078, "Member 'BP_PlayerActionStateDown_C_Enter::K2Node_DynamicCast_AsBPI_Player_Interface_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, K2Node_DynamicCast_bSuccess_2) == 0x000088, "Member 'BP_PlayerActionStateDown_C_Enter::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, CallFunc_GetEnpcComp_ReturnComp) == 0x000090, "Member 'BP_PlayerActionStateDown_C_Enter::CallFunc_GetEnpcComp_ReturnComp' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, CallFunc_IsEnemyPlayer_bEnemyPlayer_1) == 0x000098, "Member 'BP_PlayerActionStateDown_C_Enter::CallFunc_IsEnemyPlayer_bEnemyPlayer_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, CallFunc_IsValid_ReturnValue_1) == 0x000099, "Member 'BP_PlayerActionStateDown_C_Enter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, CallFunc_IsResetBattleThink_isReset) == 0x00009A, "Member 'BP_PlayerActionStateDown_C_Enter::CallFunc_IsResetBattleThink_isReset' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, CallFunc_SetInvalidDamage_Dummy) == 0x00009B, "Member 'BP_PlayerActionStateDown_C_Enter::CallFunc_SetInvalidDamage_Dummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, CallFunc_IsInvincible_bInvincible) == 0x00009C, "Member 'BP_PlayerActionStateDown_C_Enter::CallFunc_IsInvincible_bInvincible' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, CallFunc_Conv_IntToByte_ReturnValue) == 0x00009D, "Member 'BP_PlayerActionStateDown_C_Enter::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, CallFunc_GetValidValue_ReturnValue) == 0x00009E, "Member 'BP_PlayerActionStateDown_C_Enter::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000A0, "Member 'BP_PlayerActionStateDown_C_Enter::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, CallFunc_SetFootIKEnable_Dummy) == 0x0000A4, "Member 'BP_PlayerActionStateDown_C_Enter::CallFunc_SetFootIKEnable_Dummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, CallFunc_SetLookAtEnable_self_CastInput) == 0x0000A8, "Member 'BP_PlayerActionStateDown_C_Enter::CallFunc_SetLookAtEnable_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Enter, CallFunc_SetLookAtEnable_bResult) == 0x0000B8, "Member 'BP_PlayerActionStateDown_C_Enter::CallFunc_SetLookAtEnable_bResult' has a wrong offset!");

// Function BP_PlayerActionStateDown.BP_PlayerActionStateDown_C.Update
// 0x0618 (0x0618 - 0x0000)
struct BP_PlayerActionStateDown_C_Update final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_474D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleCharacterInterface_C> CallFunc_IsBrainCrashAccessInterface_self_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBrainCrashAccessInterface_bAccess;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_474E[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface;         // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActiveBrainFieldGameOverTimer_ReturnValue; // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemyPlayer_bEnemyPlayer;               // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBrainCrashAccess_ReturnValue;           // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_474F[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharactersParameterBasic              CallFunc_GetParameterBasic_ReturnValue;            // 0x0038(0x0068)()
	class ABP_EnemyManager_C*                     CallFunc_GetEnemyManager_Manager;                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCharactersParameterBasic              K2Node_MakeStruct_CharactersParameterBasic;        // 0x00A8(0x0068)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4750[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisableAction_bEnable;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4751[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface_1;       // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemyPlayer_bEnemyPlayer_1;             // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInvalidDamage_Dummy;                   // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4752[0x4];                                     // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharactersParameterBasic              CallFunc_GetParameterBasic_ReturnValue_1;          // 0x0138(0x0068)()
	struct FCharactersParameterBasic              K2Node_MakeStruct_CharactersParameterBasic_1;      // 0x01A0(0x0068)()
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4753[0x7];                                     // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharactersParameterBasic              CallFunc_GetParameterBasic_ReturnValue_2;          // 0x0210(0x0068)()
	struct FCharactersParameterBasic              K2Node_MakeStruct_CharactersParameterBasic_2;      // 0x0278(0x0068)()
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBrainCrashAccess_ReturnValue_1;         // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4754[0x6];                                     // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharactersParameterBasic              CallFunc_GetParameterBasic_ReturnValue_3;          // 0x02E8(0x0068)()
	struct FCharactersParameterBasic              K2Node_MakeStruct_CharactersParameterBasic_3;      // 0x0350(0x0068)()
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4755[0x7];                                     // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharactersParameterBasic              CallFunc_GetParameterBasic_ReturnValue_4;          // 0x03C0(0x0068)()
	struct FCharactersParameterBasic              K2Node_MakeStruct_CharactersParameterBasic_4;      // 0x0428(0x0068)()
	TScriptInterface<class IBPI_ENpcInterface_C>  CallFunc_Ch0900_ForceCopyDead_self_CastInput;      // 0x0490(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Ch0900_ForceCopyDead_Dummy;               // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4756[0x7];                                     // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      CallFunc_GetPlayerID_self_CastInput;               // 0x04A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue;                  // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x04B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4757[0x6];                                     // 0x04BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_GetEnpcComp_self_CastInput;               // 0x04C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBP_ENpcComponent_C*                    CallFunc_GetEnpcComp_ReturnComp;                   // 0x04D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4758[0x7];                                     // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleCharacterInterface_C> CallFunc_IsBrainCrashAccessInterface_self_CastInput_1; // 0x04E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBrainCrashAccessInterface_bAccess_1;    // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4759[0x7];                                     // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      CallFunc_GetPlayerID_self_CastInput_1;             // 0x04F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue_1;                // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_475A[0x7];                                     // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharacterParamater_C> CallFunc_IsBadStatusElectric_self_CastInput;       // 0x0510(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBadStatusElectric_bBadStatus;           // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LeaveBrainCrashAccess_Dummy;              // 0x0521(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_475B[0x6];                                     // 0x0522(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ENpcInterface_C>  CallFunc_SetStealthReactionInterval_self_CastInput; // 0x0528(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStealthReactionInterval_dummy;         // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetSasStealth_dummy;                      // 0x0539(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStealth_return;                         // 0x053A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_475C[0x5];                                     // 0x053B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      CallFunc_GetPlayerID_self_CastInput_2;             // 0x0540(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue_2;                // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0551(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0552(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0553(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_475D[0x4];                                     // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_GetEnpcComp_self_CastInput_1;             // 0x0558(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBP_ENpcComponent_C*                    CallFunc_GetEnpcComp_ReturnComp_1;                 // 0x0568(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PluginNpcRevive_bSuccess;                 // 0x0571(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterDead_ReturnValue;              // 0x0572(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_475E[0x5];                                     // 0x0573(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPluginNpcAutoReviveAble_ReturnValue;    // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsControlAI_bAI;                          // 0x0581(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAttractSelf_ReturnValue;                // 0x0582(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_475F[0x5];                                     // 0x0583(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface_2;       // 0x0588(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemyPlayer_bEnemyPlayer_2;             // 0x0599(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4760[0x6];                                     // 0x059A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleCharacterInterface_C> CallFunc_IsBrainCrashAccessInterface_self_CastInput_2; // 0x05A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBrainCrashAccessInterface_bAccess_2;    // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4761[0x7];                                     // 0x05B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ENpcInterface_C>  K2Node_DynamicCast_AsBPI_ENpc_Interface;           // 0x05B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EntryBrainCrashAccessEnpc_Return;         // 0x05C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4762[0x6];                                     // 0x05CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EnemyManager_C*                     CallFunc_GetEnemyManager_Manager_1;                // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EntryBrainCrashAccess_Dummy;              // 0x05D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBrainCrashAccess_ReturnValue_2;         // 0x05DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4763[0x5];                                     // 0x05DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface_3;       // 0x05E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4764[0x3];                                     // 0x05F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSpecialDownTimer_SpDownTimer;          // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x05F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4765[0x6];                                     // 0x05FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharacterParamater_C> CallFunc_IsDead_self_CastInput;                    // 0x0600(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDead_bDead;                             // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDisableAction_bEnable_1;                // 0x0611(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4766[0x2];                                     // 0x0612(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Update_ReturnValue;                       // 0x0614(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerActionStateDown_C_Update) == 0x000008, "Wrong alignment on BP_PlayerActionStateDown_C_Update");
static_assert(sizeof(BP_PlayerActionStateDown_C_Update) == 0x000618, "Wrong size on BP_PlayerActionStateDown_C_Update");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, ReturnValue) == 0x000000, "Member 'BP_PlayerActionStateDown_C_Update::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsBrainCrashAccessInterface_self_CastInput) == 0x000008, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsBrainCrashAccessInterface_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsBrainCrashAccessInterface_bAccess) == 0x000018, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsBrainCrashAccessInterface_bAccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'BP_PlayerActionStateDown_C_Update::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, K2Node_DynamicCast_AsBPI_Player_Interface) == 0x000020, "Member 'BP_PlayerActionStateDown_C_Update::K2Node_DynamicCast_AsBPI_Player_Interface' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_PlayerActionStateDown_C_Update::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsActiveBrainFieldGameOverTimer_ReturnValue) == 0x000031, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsActiveBrainFieldGameOverTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsEnemyPlayer_bEnemyPlayer) == 0x000032, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsEnemyPlayer_bEnemyPlayer' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsBrainCrashAccess_ReturnValue) == 0x000033, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsBrainCrashAccess_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_GetParameterBasic_ReturnValue) == 0x000038, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_GetParameterBasic_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_GetEnemyManager_Manager) == 0x0000A0, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_GetEnemyManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, K2Node_MakeStruct_CharactersParameterBasic) == 0x0000A8, "Member 'BP_PlayerActionStateDown_C_Update::K2Node_MakeStruct_CharactersParameterBasic' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsValid_ReturnValue_1) == 0x000110, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000114, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsDisableAction_bEnable) == 0x000118, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsDisableAction_bEnable' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, K2Node_DynamicCast_AsBPI_Player_Interface_1) == 0x000120, "Member 'BP_PlayerActionStateDown_C_Update::K2Node_DynamicCast_AsBPI_Player_Interface_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, K2Node_DynamicCast_bSuccess_1) == 0x000130, "Member 'BP_PlayerActionStateDown_C_Update::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsEnemyPlayer_bEnemyPlayer_1) == 0x000131, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsEnemyPlayer_bEnemyPlayer_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_SetInvalidDamage_Dummy) == 0x000132, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_SetInvalidDamage_Dummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsValid_ReturnValue_2) == 0x000133, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_GetParameterBasic_ReturnValue_1) == 0x000138, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_GetParameterBasic_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, K2Node_MakeStruct_CharactersParameterBasic_1) == 0x0001A0, "Member 'BP_PlayerActionStateDown_C_Update::K2Node_MakeStruct_CharactersParameterBasic_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsValid_ReturnValue_3) == 0x000208, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_GetParameterBasic_ReturnValue_2) == 0x000210, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_GetParameterBasic_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, K2Node_MakeStruct_CharactersParameterBasic_2) == 0x000278, "Member 'BP_PlayerActionStateDown_C_Update::K2Node_MakeStruct_CharactersParameterBasic_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsValid_ReturnValue_4) == 0x0002E0, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsBrainCrashAccess_ReturnValue_1) == 0x0002E1, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsBrainCrashAccess_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_GetParameterBasic_ReturnValue_3) == 0x0002E8, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_GetParameterBasic_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, K2Node_MakeStruct_CharactersParameterBasic_3) == 0x000350, "Member 'BP_PlayerActionStateDown_C_Update::K2Node_MakeStruct_CharactersParameterBasic_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsValid_ReturnValue_5) == 0x0003B8, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_GetParameterBasic_ReturnValue_4) == 0x0003C0, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_GetParameterBasic_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, K2Node_MakeStruct_CharactersParameterBasic_4) == 0x000428, "Member 'BP_PlayerActionStateDown_C_Update::K2Node_MakeStruct_CharactersParameterBasic_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_Ch0900_ForceCopyDead_self_CastInput) == 0x000490, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_Ch0900_ForceCopyDead_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_Ch0900_ForceCopyDead_Dummy) == 0x0004A0, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_Ch0900_ForceCopyDead_Dummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_GetPlayerID_self_CastInput) == 0x0004A8, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_GetPlayerID_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_GetPlayerID_ReturnValue) == 0x0004B8, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_GetPlayerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0004B9, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_GetEnpcComp_self_CastInput) == 0x0004C0, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_GetEnpcComp_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_GetEnpcComp_ReturnComp) == 0x0004D0, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_GetEnpcComp_ReturnComp' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsValid_ReturnValue_6) == 0x0004D8, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsBrainCrashAccessInterface_self_CastInput_1) == 0x0004E0, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsBrainCrashAccessInterface_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsBrainCrashAccessInterface_bAccess_1) == 0x0004F0, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsBrainCrashAccessInterface_bAccess_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_GetPlayerID_self_CastInput_1) == 0x0004F8, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_GetPlayerID_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_GetPlayerID_ReturnValue_1) == 0x000508, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_GetPlayerID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsBadStatusElectric_self_CastInput) == 0x000510, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsBadStatusElectric_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsBadStatusElectric_bBadStatus) == 0x000520, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsBadStatusElectric_bBadStatus' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_LeaveBrainCrashAccess_Dummy) == 0x000521, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_LeaveBrainCrashAccess_Dummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_SetStealthReactionInterval_self_CastInput) == 0x000528, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_SetStealthReactionInterval_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_SetStealthReactionInterval_dummy) == 0x000538, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_SetStealthReactionInterval_dummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_SetSasStealth_dummy) == 0x000539, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_SetSasStealth_dummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsStealth_return) == 0x00053A, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsStealth_return' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_GetPlayerID_self_CastInput_2) == 0x000540, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_GetPlayerID_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_GetPlayerID_ReturnValue_2) == 0x000550, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_GetPlayerID_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000551, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000552, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_BooleanOR_ReturnValue) == 0x000553, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_GetEnpcComp_self_CastInput_1) == 0x000558, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_GetEnpcComp_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_GetEnpcComp_ReturnComp_1) == 0x000568, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_GetEnpcComp_ReturnComp_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsValid_ReturnValue_7) == 0x000570, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_PluginNpcRevive_bSuccess) == 0x000571, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_PluginNpcRevive_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsCharacterDead_ReturnValue) == 0x000572, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsCharacterDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_GetPlayerManager_PlayerManager) == 0x000578, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsPluginNpcAutoReviveAble_ReturnValue) == 0x000580, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsPluginNpcAutoReviveAble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsControlAI_bAI) == 0x000581, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsControlAI_bAI' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsAttractSelf_ReturnValue) == 0x000582, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsAttractSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, K2Node_DynamicCast_AsBPI_Player_Interface_2) == 0x000588, "Member 'BP_PlayerActionStateDown_C_Update::K2Node_DynamicCast_AsBPI_Player_Interface_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, K2Node_DynamicCast_bSuccess_2) == 0x000598, "Member 'BP_PlayerActionStateDown_C_Update::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsEnemyPlayer_bEnemyPlayer_2) == 0x000599, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsEnemyPlayer_bEnemyPlayer_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsBrainCrashAccessInterface_self_CastInput_2) == 0x0005A0, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsBrainCrashAccessInterface_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsBrainCrashAccessInterface_bAccess_2) == 0x0005B0, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsBrainCrashAccessInterface_bAccess_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, K2Node_DynamicCast_AsBPI_ENpc_Interface) == 0x0005B8, "Member 'BP_PlayerActionStateDown_C_Update::K2Node_DynamicCast_AsBPI_ENpc_Interface' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, K2Node_DynamicCast_bSuccess_3) == 0x0005C8, "Member 'BP_PlayerActionStateDown_C_Update::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_EntryBrainCrashAccessEnpc_Return) == 0x0005C9, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_EntryBrainCrashAccessEnpc_Return' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_GetEnemyManager_Manager_1) == 0x0005D0, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_GetEnemyManager_Manager_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsValid_ReturnValue_8) == 0x0005D8, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_EntryBrainCrashAccess_Dummy) == 0x0005D9, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_EntryBrainCrashAccess_Dummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsBrainCrashAccess_ReturnValue_2) == 0x0005DA, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsBrainCrashAccess_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, K2Node_DynamicCast_AsBPI_Player_Interface_3) == 0x0005E0, "Member 'BP_PlayerActionStateDown_C_Update::K2Node_DynamicCast_AsBPI_Player_Interface_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, K2Node_DynamicCast_bSuccess_4) == 0x0005F0, "Member 'BP_PlayerActionStateDown_C_Update::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_GetSpecialDownTimer_SpDownTimer) == 0x0005F4, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_GetSpecialDownTimer_SpDownTimer' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, K2Node_SwitchEnum_CmpSuccess_1) == 0x0005F8, "Member 'BP_PlayerActionStateDown_C_Update::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0005F9, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsDead_self_CastInput) == 0x000600, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsDead_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsDead_bDead) == 0x000610, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsDead_bDead' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_IsDisableAction_bEnable_1) == 0x000611, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_IsDisableAction_bEnable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Update, CallFunc_Update_ReturnValue) == 0x000614, "Member 'BP_PlayerActionStateDown_C_Update::CallFunc_Update_ReturnValue' has a wrong offset!");

// Function BP_PlayerActionStateDown.BP_PlayerActionStateDown_C.Transition
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerActionStateDown_C_Transition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4767[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionStatus_Result;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateDown_C_Transition) == 0x000004, "Wrong alignment on BP_PlayerActionStateDown_C_Transition");
static_assert(sizeof(BP_PlayerActionStateDown_C_Transition) == 0x000010, "Wrong size on BP_PlayerActionStateDown_C_Transition");
static_assert(offsetof(BP_PlayerActionStateDown_C_Transition, ReturnValue) == 0x000000, "Member 'BP_PlayerActionStateDown_C_Transition::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Transition, CallFunc_MakeLiteralByte_ReturnValue) == 0x000001, "Member 'BP_PlayerActionStateDown_C_Transition::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Transition, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateDown_C_Transition::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Transition, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000008, "Member 'BP_PlayerActionStateDown_C_Transition::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateDown_C_Transition, CallFunc_IsActionStatus_Result) == 0x00000C, "Member 'BP_PlayerActionStateDown_C_Transition::CallFunc_IsActionStatus_Result' has a wrong offset!");

// Function BP_PlayerActionStateDown.BP_PlayerActionStateDown_C.Exit
// 0x0050 (0x0050 - 0x0000)
struct BP_PlayerActionStateDown_C_Exit final
{
public:
	int32                                         NextStateIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Exit_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsControlAI_bAI;                          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4768[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EnemyManager_C*                     CallFunc_GetEnemyManager_Manager;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LeaveBrainCrashAccess_Dummy;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInvalidDamage_Dummy;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4769[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
