#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerMaterialManageComponent

#include "Basic.hpp"

#include "EPlayerMaterialManageType_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FPlayerVectorMaterialManageData_structs.hpp"
#include "FPlayerMaterialManageCurveData_structs.hpp"
#include "FPlayerMaterialManageData_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerMaterialManageComponent.BP_PlayerMaterialManageComponent_C.OnCompletedMaterialSetting__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerMaterialManageComponent_C_OnCompletedMaterialSetting__DelegateSignature final
{
public:
	EPlayerMaterialManageType                     Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerMaterialManageComponent_C_OnCompletedMaterialSetting__DelegateSignature) == 0x000001, "Wrong alignment on BP_PlayerMaterialManageComponent_C_OnCompletedMaterialSetting__DelegateSignature");
static_assert(sizeof(BP_PlayerMaterialManageComponent_C_OnCompletedMaterialSetting__DelegateSignature) == 0x000001, "Wrong size on BP_PlayerMaterialManageComponent_C_OnCompletedMaterialSetting__DelegateSignature");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_OnCompletedMaterialSetting__DelegateSignature, Type) == 0x000000, "Member 'BP_PlayerMaterialManageComponent_C_OnCompletedMaterialSetting__DelegateSignature::Type' has a wrong offset!");

// Function BP_PlayerMaterialManageComponent.BP_PlayerMaterialManageComponent_C.ExecuteUbergraph_BP_PlayerMaterialManageComponent
// 0x000C (0x000C - 0x0000)
struct BP_PlayerMaterialManageComponent_C_ExecuteUbergraph_BP_PlayerMaterialManageComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerMaterialManageComponent_C_ExecuteUbergraph_BP_PlayerMaterialManageComponent) == 0x000004, "Wrong alignment on BP_PlayerMaterialManageComponent_C_ExecuteUbergraph_BP_PlayerMaterialManageComponent");
static_assert(sizeof(BP_PlayerMaterialManageComponent_C_ExecuteUbergraph_BP_PlayerMaterialManageComponent) == 0x00000C, "Wrong size on BP_PlayerMaterialManageComponent_C_ExecuteUbergraph_BP_PlayerMaterialManageComponent");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_ExecuteUbergraph_BP_PlayerMaterialManageComponent, EntryPoint) == 0x000000, "Member 'BP_PlayerMaterialManageComponent_C_ExecuteUbergraph_BP_PlayerMaterialManageComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_ExecuteUbergraph_BP_PlayerMaterialManageComponent, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_PlayerMaterialManageComponent_C_ExecuteUbergraph_BP_PlayerMaterialManageComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_ExecuteUbergraph_BP_PlayerMaterialManageComponent, K2Node_Event_EndPlayReason) == 0x000008, "Member 'BP_PlayerMaterialManageComponent_C_ExecuteUbergraph_BP_PlayerMaterialManageComponent::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BP_PlayerMaterialManageComponent.BP_PlayerMaterialManageComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerMaterialManageComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerMaterialManageComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_PlayerMaterialManageComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_PlayerMaterialManageComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_PlayerMaterialManageComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_PlayerMaterialManageComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_PlayerMaterialManageComponent.BP_PlayerMaterialManageComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PlayerMaterialManageComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerMaterialManageComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PlayerMaterialManageComponent_C_ReceiveTick");
static_assert(sizeof(BP_PlayerMaterialManageComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_PlayerMaterialManageComponent_C_ReceiveTick");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PlayerMaterialManageComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PlayerMaterialManageComponent.BP_PlayerMaterialManageComponent_C.Update
// 0x0128 (0x0128 - 0x0000)
struct BP_PlayerMaterialManageComponent_C_Update final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6369[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 LRemoveIndex;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_636A[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable_2;                      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_3;                      // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_636B[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionLight_Action;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_636C[0x2];                                     // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_636D[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_636E[0x2];                                     // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateVectorMaterial_bCompleted;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_636F[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFPlayerVectorMaterialManageData       CallFunc_UpdateVectorMaterial_UpdateDataParam;     // 0x0084(0x0028)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_4;                      // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6370[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateMaterialCurve_bCompleted;           // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6371[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFPlayerMaterialManageCurveData        CallFunc_UpdateMaterialCurve_UpdateData;           // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_5;                      // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6372[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6373[0x3];                                     // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_8;               // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateScalarMaterial_bCompleted;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6374[0x3];                                     // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFPlayerMaterialManageData             CallFunc_UpdateScalarMaterial_UpdateData;          // 0x0104(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6375[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerMaterialManageComponent_C_Update) == 0x000008, "Wrong alignment on BP_PlayerMaterialManageComponent_C_Update");
static_assert(sizeof(BP_PlayerMaterialManageComponent_C_Update) == 0x000128, "Wrong size on BP_PlayerMaterialManageComponent_C_Update");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, DeltaSeconds) == 0x000000, "Member 'BP_PlayerMaterialManageComponent_C_Update::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, LRemoveIndex) == 0x000008, "Member 'BP_PlayerMaterialManageComponent_C_Update::LRemoveIndex' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, Temp_int_Loop_Num_Variable) == 0x000018, "Member 'BP_PlayerMaterialManageComponent_C_Update::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_PlayerMaterialManageComponent_C_Update::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, Temp_int_Loop_Counter_Variable_1) == 0x000020, "Member 'BP_PlayerMaterialManageComponent_C_Update::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_PlayerMaterialManageComponent_C_Update::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, Temp_int_Loop_Num_Variable_1) == 0x000030, "Member 'BP_PlayerMaterialManageComponent_C_Update::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, Temp_int_Loop_Num_Variable_2) == 0x000038, "Member 'BP_PlayerMaterialManageComponent_C_Update::Temp_int_Loop_Num_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, Temp_int_Array_Index_Variable_1) == 0x00003C, "Member 'BP_PlayerMaterialManageComponent_C_Update::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, Temp_int_Loop_Counter_Variable_2) == 0x000040, "Member 'BP_PlayerMaterialManageComponent_C_Update::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_Add_IntInt_ReturnValue_2) == 0x000044, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, Temp_int_Array_Index_Variable_2) == 0x000048, "Member 'BP_PlayerMaterialManageComponent_C_Update::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, Temp_int_Loop_Num_Variable_3) == 0x00004C, "Member 'BP_PlayerMaterialManageComponent_C_Update::Temp_int_Loop_Num_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_Less_IntInt_ReturnValue_1) == 0x000050, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_Not_PreBool_ReturnValue) == 0x000051, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, Temp_int_Array_Index_Variable_3) == 0x000054, "Member 'BP_PlayerMaterialManageComponent_C_Update::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_IsActionLight_Action) == 0x000058, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_IsActionLight_Action' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_Not_PreBool_ReturnValue_1) == 0x000059, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, Temp_int_Loop_Counter_Variable_3) == 0x00005C, "Member 'BP_PlayerMaterialManageComponent_C_Update::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_Less_IntInt_ReturnValue_2) == 0x000060, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_Add_IntInt_ReturnValue_3) == 0x000064, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_Array_Length_ReturnValue_1) == 0x00006C, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_Array_Length_ReturnValue_2) == 0x000070, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_Array_Length_ReturnValue_3) == 0x000074, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000078, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000079, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, Temp_int_Array_Index_Variable_4) == 0x00007C, "Member 'BP_PlayerMaterialManageComponent_C_Update::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_UpdateVectorMaterial_bCompleted) == 0x000080, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_UpdateVectorMaterial_bCompleted' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_UpdateVectorMaterial_UpdateDataParam) == 0x000084, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_UpdateVectorMaterial_UpdateDataParam' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, Temp_int_Loop_Num_Variable_4) == 0x0000AC, "Member 'BP_PlayerMaterialManageComponent_C_Update::Temp_int_Loop_Num_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_Array_Length_ReturnValue_4) == 0x0000B0, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_Less_IntInt_ReturnValue_3) == 0x0000B4, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_Array_Length_ReturnValue_5) == 0x0000B8, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_UpdateMaterialCurve_bCompleted) == 0x0000BC, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_UpdateMaterialCurve_bCompleted' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_UpdateMaterialCurve_UpdateData) == 0x0000C0, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_UpdateMaterialCurve_UpdateData' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, Temp_int_Loop_Num_Variable_5) == 0x0000D8, "Member 'BP_PlayerMaterialManageComponent_C_Update::Temp_int_Loop_Num_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_Array_Length_ReturnValue_6) == 0x0000DC, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x0000E0, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, Temp_int_Loop_Counter_Variable_4) == 0x0000E4, "Member 'BP_PlayerMaterialManageComponent_C_Update::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_Less_IntInt_ReturnValue_4) == 0x0000E8, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_Add_IntInt_ReturnValue_4) == 0x0000EC, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_Array_Length_ReturnValue_7) == 0x0000F0, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_Array_Length_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, Temp_int_Array_Index_Variable_5) == 0x0000F4, "Member 'BP_PlayerMaterialManageComponent_C_Update::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, Temp_int_Loop_Counter_Variable_5) == 0x0000F8, "Member 'BP_PlayerMaterialManageComponent_C_Update::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_Array_Length_ReturnValue_8) == 0x0000FC, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_Array_Length_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_UpdateScalarMaterial_bCompleted) == 0x000100, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_UpdateScalarMaterial_bCompleted' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_UpdateScalarMaterial_UpdateData) == 0x000104, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_UpdateScalarMaterial_UpdateData' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_Less_IntInt_ReturnValue_5) == 0x00011C, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_Update, CallFunc_Add_IntInt_ReturnValue_5) == 0x000120, "Member 'BP_PlayerMaterialManageComponent_C_Update::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");

// Function BP_PlayerMaterialManageComponent.BP_PlayerMaterialManageComponent_C.StartScalarMaterialDirection
// 0x0058 (0x0058 - 0x0000)
struct BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection final
{
public:
	EPlayerMaterialManageType                     Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6376[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartValue;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndValue;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayer;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWeapon;                                           // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCable;                                            // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCopy;                                             // 0x0013(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6377[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFPlayerMaterialManageData             K2Node_MakeStruct_FPlayerMaterialManageData;       // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6378[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6379[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_637A[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_637B[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection) == 0x000004, "Wrong alignment on BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection");
static_assert(sizeof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection) == 0x000058, "Wrong size on BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection, Type) == 0x000000, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection::Type' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection, StartValue) == 0x000004, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection::StartValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection, EndValue) == 0x000008, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection::EndValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection, Time) == 0x00000C, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection::Time' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection, bPlayer) == 0x000010, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection::bPlayer' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection, bWeapon) == 0x000011, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection::bWeapon' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection, bCable) == 0x000012, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection::bCable' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection, bCopy) == 0x000013, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection::bCopy' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection, Temp_bool_True_if_break_was_hit_Variable) == 0x000014, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection, K2Node_MakeStruct_FPlayerMaterialManageData) == 0x000018, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection::K2Node_MakeStruct_FPlayerMaterialManageData' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection, Temp_int_Array_Index_Variable) == 0x000034, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection, Temp_int_Loop_Num_Variable) == 0x000038, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection, CallFunc_BooleanAND_ReturnValue) == 0x000048, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000050, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection, CallFunc_Array_Add_ReturnValue) == 0x000054, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialDirection::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_PlayerMaterialManageComponent.BP_PlayerMaterialManageComponent_C.UpdateScalarMaterial
// 0x00A8 (0x00A8 - 0x0000)
struct BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial final
{
public:
	struct FFPlayerMaterialManageData             InData;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCompleted;                                        // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_637C[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFPlayerMaterialManageData             UpdateData;                                        // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFPlayerMaterialManageData             LTempData;                                         // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LParamName;                                        // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LParamValue;                                       // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LRate;                                             // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LTime;                                             // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LElapsedTime;                                      // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LbCompleted;                                       // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_637D[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerMaterialManageType                     Temp_byte_Variable;                                // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_637E[0x1];                                     // 0x008F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_MathExpression_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_637F[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial) == 0x000004, "Wrong alignment on BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial");
static_assert(sizeof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial) == 0x0000A8, "Wrong size on BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial, InData) == 0x000000, "Member 'BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial::InData' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial, DeltaSeconds) == 0x000018, "Member 'BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial, bCompleted) == 0x00001C, "Member 'BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial::bCompleted' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial, UpdateData) == 0x000020, "Member 'BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial::UpdateData' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial, LTempData) == 0x000038, "Member 'BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial::LTempData' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial, LParamName) == 0x000050, "Member 'BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial::LParamName' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial, LParamValue) == 0x000058, "Member 'BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial::LParamValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial, LRate) == 0x00005C, "Member 'BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial::LRate' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial, LTime) == 0x000060, "Member 'BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial::LTime' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial, LElapsedTime) == 0x000064, "Member 'BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial::LElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial, LbCompleted) == 0x000068, "Member 'BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial::LbCompleted' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial, Temp_name_Variable) == 0x00006C, "Member 'BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial, Temp_name_Variable_1) == 0x000074, "Member 'BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial, Temp_name_Variable_2) == 0x00007C, "Member 'BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial, Temp_name_Variable_3) == 0x000084, "Member 'BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00008C, "Member 'BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial, K2Node_SwitchEnum_CmpSuccess) == 0x00008D, "Member 'BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial, Temp_byte_Variable) == 0x00008E, "Member 'BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial, K2Node_MathExpression_ReturnValue) == 0x000090, "Member 'BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial, K2Node_Select_Default) == 0x000094, "Member 'BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x00009C, "Member 'BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000A0, "Member 'BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000A4, "Member 'BP_PlayerMaterialManageComponent_C_UpdateScalarMaterial::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_PlayerMaterialManageComponent.BP_PlayerMaterialManageComponent_C.StartScalarMaterialCurveDirection
// 0x0058 (0x0058 - 0x0000)
struct BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection final
{
public:
	EPlayerMaterialManageType                     Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6380[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            Curve;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayer;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWeapon;                                           // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCable;                                            // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCopy;                                             // 0x0013(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFPlayerMaterialManageCurveData        K2Node_MakeStruct_FPlayerMaterialManageCurveData;  // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6381[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6382[0x1];                                     // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6383[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6384[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection) == 0x000008, "Wrong alignment on BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection");
static_assert(sizeof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection) == 0x000058, "Wrong size on BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection, Type) == 0x000000, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection::Type' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection, Curve) == 0x000008, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection::Curve' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection, bPlayer) == 0x000010, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection::bPlayer' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection, bWeapon) == 0x000011, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection::bWeapon' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection, bCable) == 0x000012, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection::bCable' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection, bCopy) == 0x000013, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection::bCopy' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection, K2Node_MakeStruct_FPlayerMaterialManageCurveData) == 0x000018, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection::K2Node_MakeStruct_FPlayerMaterialManageCurveData' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection, Temp_int_Loop_Num_Variable) == 0x000034, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection, Temp_bool_True_if_break_was_hit_Variable) == 0x000038, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00003A, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'BP_PlayerMaterialManageComponent_C_StartScalarMaterialCurveDirection::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
