#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerUpperActionStateDamageSAS

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PlayerUpperActionStateDamageSAS.BP_PlayerUpperActionStateDamageSAS_C.Enter
// 0x0060 (0x0060 - 0x0000)
struct BP_PlayerUpperActionStateDamageSAS_C_Enter final
{
public:
	int32                                         Param;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBattle;                                           // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46F8[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           MontageLower;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46F9[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Enter_ReturnValue;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBattleReady_bDummy;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46FA[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetAnimMontageFromSet_Montage;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetAnimMontageFromSet_Montage_1;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetAnimMontageFromSet_Montage_2;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetAnimMontageFromSet_Montage_3;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_Select_Default_1;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentStateIndex_ReturnValue;         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerStatus_Result;                    // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerUpperActionStateDamageSAS_C_Enter) == 0x000008, "Wrong alignment on BP_PlayerUpperActionStateDamageSAS_C_Enter");
static_assert(sizeof(BP_PlayerUpperActionStateDamageSAS_C_Enter) == 0x000060, "Wrong size on BP_PlayerUpperActionStateDamageSAS_C_Enter");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Enter, Param) == 0x000000, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Enter::Param' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Enter, ReturnValue) == 0x000004, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Enter::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Enter, bBattle) == 0x000008, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Enter::bBattle' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Enter, MontageLower) == 0x000010, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Enter::MontageLower' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Enter, Temp_bool_Variable) == 0x000018, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Enter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Enter, CallFunc_Enter_ReturnValue) == 0x00001C, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Enter::CallFunc_Enter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Enter, Temp_bool_Variable_1) == 0x000020, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Enter::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Enter, CallFunc_SetBattleReady_bDummy) == 0x000021, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Enter::CallFunc_SetBattleReady_bDummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Enter, CallFunc_GetAnimMontageFromSet_Montage) == 0x000028, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Enter::CallFunc_GetAnimMontageFromSet_Montage' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Enter, CallFunc_GetAnimMontageFromSet_Montage_1) == 0x000030, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Enter::CallFunc_GetAnimMontageFromSet_Montage_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Enter, K2Node_Select_Default) == 0x000038, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Enter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Enter, CallFunc_GetAnimMontageFromSet_Montage_2) == 0x000040, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Enter::CallFunc_GetAnimMontageFromSet_Montage_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Enter, CallFunc_GetAnimMontageFromSet_Montage_3) == 0x000048, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Enter::CallFunc_GetAnimMontageFromSet_Montage_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Enter, K2Node_Select_Default_1) == 0x000050, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Enter::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Enter, CallFunc_GetCurrentStateIndex_ReturnValue) == 0x000058, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Enter::CallFunc_GetCurrentStateIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Enter, CallFunc_IsPlayerStatus_Result) == 0x00005C, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Enter::CallFunc_IsPlayerStatus_Result' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Enter, CallFunc_Conv_IntToByte_ReturnValue) == 0x00005D, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Enter::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Enter, CallFunc_GetValidValue_ReturnValue) == 0x00005E, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Enter::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Enter, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00005F, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Enter::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_PlayerUpperActionStateDamageSAS.BP_PlayerUpperActionStateDamageSAS_C.Update
// 0x000C (0x000C - 0x0000)
struct BP_PlayerUpperActionStateDamageSAS_C_Update final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayBlendAnimMontage_bPlay;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46FB[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Update_ReturnValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerUpperActionStateDamageSAS_C_Update) == 0x000004, "Wrong alignment on BP_PlayerUpperActionStateDamageSAS_C_Update");
static_assert(sizeof(BP_PlayerUpperActionStateDamageSAS_C_Update) == 0x00000C, "Wrong size on BP_PlayerUpperActionStateDamageSAS_C_Update");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Update, ReturnValue) == 0x000000, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Update::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Update, CallFunc_IsPlayBlendAnimMontage_bPlay) == 0x000004, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Update::CallFunc_IsPlayBlendAnimMontage_bPlay' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Update, CallFunc_Update_ReturnValue) == 0x000008, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Update::CallFunc_Update_ReturnValue' has a wrong offset!");

// Function BP_PlayerUpperActionStateDamageSAS.BP_PlayerUpperActionStateDamageSAS_C.Exit
// 0x000C (0x000C - 0x0000)
struct BP_PlayerUpperActionStateDamageSAS_C_Exit final
{
public:
	int32                                         NextStateIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Exit_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerUpperActionStateDamageSAS_C_Exit) == 0x000004, "Wrong alignment on BP_PlayerUpperActionStateDamageSAS_C_Exit");
static_assert(sizeof(BP_PlayerUpperActionStateDamageSAS_C_Exit) == 0x00000C, "Wrong size on BP_PlayerUpperActionStateDamageSAS_C_Exit");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Exit, NextStateIndex) == 0x000000, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Exit::NextStateIndex' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Exit, ReturnValue) == 0x000004, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Exit::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateDamageSAS_C_Exit, CallFunc_Exit_ReturnValue) == 0x000008, "Member 'BP_PlayerUpperActionStateDamageSAS_C_Exit::CallFunc_Exit_ReturnValue' has a wrong offset!");

}

