#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerPsychicObjectComponent

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_SASKind_structs.hpp"
#include "Engine_structs.hpp"
#include "PsychicGrabPosData_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerPsychicObjectComponent.BP_PlayerPsychicObjectComponent_C.CaptureSuccess__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerPsychicObjectComponent_C_CaptureSuccess__DelegateSignature final
{
public:
	class UAnimMontage*                           Unique_montage;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerPsychicObjectComponent_C_CaptureSuccess__DelegateSignature) == 0x000008, "Wrong alignment on BP_PlayerPsychicObjectComponent_C_CaptureSuccess__DelegateSignature");
static_assert(sizeof(BP_PlayerPsychicObjectComponent_C_CaptureSuccess__DelegateSignature) == 0x000008, "Wrong size on BP_PlayerPsychicObjectComponent_C_CaptureSuccess__DelegateSignature");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_CaptureSuccess__DelegateSignature, Unique_montage) == 0x000000, "Member 'BP_PlayerPsychicObjectComponent_C_CaptureSuccess__DelegateSignature::Unique_montage' has a wrong offset!");

// Function BP_PlayerPsychicObjectComponent.BP_PlayerPsychicObjectComponent_C.UniqueAttackSuccess__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerPsychicObjectComponent_C_UniqueAttackSuccess__DelegateSignature final
{
public:
	class UAnimMontage*                           Unique_montage;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerPsychicObjectComponent_C_UniqueAttackSuccess__DelegateSignature) == 0x000008, "Wrong alignment on BP_PlayerPsychicObjectComponent_C_UniqueAttackSuccess__DelegateSignature");
static_assert(sizeof(BP_PlayerPsychicObjectComponent_C_UniqueAttackSuccess__DelegateSignature) == 0x000008, "Wrong size on BP_PlayerPsychicObjectComponent_C_UniqueAttackSuccess__DelegateSignature");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_UniqueAttackSuccess__DelegateSignature, Unique_montage) == 0x000000, "Member 'BP_PlayerPsychicObjectComponent_C_UniqueAttackSuccess__DelegateSignature::Unique_montage' has a wrong offset!");

// Function BP_PlayerPsychicObjectComponent.BP_PlayerPsychicObjectComponent_C.UniqueObjectEnd__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerPsychicObjectComponent_C_UniqueObjectEnd__DelegateSignature final
{
public:
	bool                                          Input_success_in;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerPsychicObjectComponent_C_UniqueObjectEnd__DelegateSignature) == 0x000001, "Wrong alignment on BP_PlayerPsychicObjectComponent_C_UniqueObjectEnd__DelegateSignature");
static_assert(sizeof(BP_PlayerPsychicObjectComponent_C_UniqueObjectEnd__DelegateSignature) == 0x000001, "Wrong size on BP_PlayerPsychicObjectComponent_C_UniqueObjectEnd__DelegateSignature");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_UniqueObjectEnd__DelegateSignature, Input_success_in) == 0x000000, "Member 'BP_PlayerPsychicObjectComponent_C_UniqueObjectEnd__DelegateSignature::Input_success_in' has a wrong offset!");

// Function BP_PlayerPsychicObjectComponent.BP_PlayerPsychicObjectComponent_C.UniqueObjectControlStart__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerPsychicObjectComponent_C_UniqueObjectControlStart__DelegateSignature final
{
public:
	class ABP_PsychicObjectBasic_C*               Psy_obj_in;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerPsychicObjectComponent_C_UniqueObjectControlStart__DelegateSignature) == 0x000008, "Wrong alignment on BP_PlayerPsychicObjectComponent_C_UniqueObjectControlStart__DelegateSignature");
static_assert(sizeof(BP_PlayerPsychicObjectComponent_C_UniqueObjectControlStart__DelegateSignature) == 0x000008, "Wrong size on BP_PlayerPsychicObjectComponent_C_UniqueObjectControlStart__DelegateSignature");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_UniqueObjectControlStart__DelegateSignature, Psy_obj_in) == 0x000000, "Member 'BP_PlayerPsychicObjectComponent_C_UniqueObjectControlStart__DelegateSignature::Psy_obj_in' has a wrong offset!");

// Function BP_PlayerPsychicObjectComponent.BP_PlayerPsychicObjectComponent_C.ExecuteUbergraph_BP_PlayerPsychicObjectComponent
// 0x000C (0x000C - 0x0000)
struct BP_PlayerPsychicObjectComponent_C_ExecuteUbergraph_BP_PlayerPsychicObjectComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5145[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerPsychicObjectComponent_C_ExecuteUbergraph_BP_PlayerPsychicObjectComponent) == 0x000004, "Wrong alignment on BP_PlayerPsychicObjectComponent_C_ExecuteUbergraph_BP_PlayerPsychicObjectComponent");
static_assert(sizeof(BP_PlayerPsychicObjectComponent_C_ExecuteUbergraph_BP_PlayerPsychicObjectComponent) == 0x00000C, "Wrong size on BP_PlayerPsychicObjectComponent_C_ExecuteUbergraph_BP_PlayerPsychicObjectComponent");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_ExecuteUbergraph_BP_PlayerPsychicObjectComponent, EntryPoint) == 0x000000, "Member 'BP_PlayerPsychicObjectComponent_C_ExecuteUbergraph_BP_PlayerPsychicObjectComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_ExecuteUbergraph_BP_PlayerPsychicObjectComponent, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_PlayerPsychicObjectComponent_C_ExecuteUbergraph_BP_PlayerPsychicObjectComponent::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_ExecuteUbergraph_BP_PlayerPsychicObjectComponent, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'BP_PlayerPsychicObjectComponent_C_ExecuteUbergraph_BP_PlayerPsychicObjectComponent::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_ExecuteUbergraph_BP_PlayerPsychicObjectComponent, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_PlayerPsychicObjectComponent_C_ExecuteUbergraph_BP_PlayerPsychicObjectComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_PlayerPsychicObjectComponent.BP_PlayerPsychicObjectComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PlayerPsychicObjectComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerPsychicObjectComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PlayerPsychicObjectComponent_C_ReceiveTick");
static_assert(sizeof(BP_PlayerPsychicObjectComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_PlayerPsychicObjectComponent_C_ReceiveTick");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PlayerPsychicObjectComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PlayerPsychicObjectComponent.BP_PlayerPsychicObjectComponent_C.Initialize
// 0x00D0 (0x00D0 - 0x0000)
struct BP_PlayerPsychicObjectComponent_C_Initialize final
{
public:
	class FName                                   L_name;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5146[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TriggerEffectManager_C*             CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5147[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5148[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5149[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_514A[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0050(0x0010)(ReferenceParm, HasGetValueTypeHash)
	struct FPsychicGrabPosData                    CallFunc_GetDataTableRowFromName_OutRow;           // 0x0060(0x003C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_514B[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APsychicObjectManager_C*                CallFunc_GetPsychicObjectManager_PsyObjManager;    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_514C[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARsBattleHero_C*                        K2Node_DynamicCast_AsRs_Battle_Hero;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerPsychicObjectComponent_C_Initialize) == 0x000008, "Wrong alignment on BP_PlayerPsychicObjectComponent_C_Initialize");
static_assert(sizeof(BP_PlayerPsychicObjectComponent_C_Initialize) == 0x0000D0, "Wrong size on BP_PlayerPsychicObjectComponent_C_Initialize");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, L_name) == 0x000000, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::L_name' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, Temp_int_Loop_Num_Variable) == 0x000018, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager) == 0x000020, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, CallFunc_GetBrainFieldManager_Manager) == 0x000030, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::CallFunc_GetBrainFieldManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, Temp_int_Loop_Num_Variable_1) == 0x00003C, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, Temp_int_Loop_Counter_Variable_1) == 0x000040, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, CallFunc_Less_IntInt_ReturnValue_1) == 0x000044, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, CallFunc_Add_IntInt_ReturnValue_1) == 0x000048, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000050, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, CallFunc_GetDataTableRowFromName_OutRow) == 0x000060, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x00009C, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, CallFunc_Array_Add_ReturnValue) == 0x0000A0, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, CallFunc_Array_Length_ReturnValue_1) == 0x0000A4, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, CallFunc_GetPsychicObjectManager_PsyObjManager) == 0x0000A8, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::CallFunc_GetPsychicObjectManager_PsyObjManager' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, CallFunc_IsValid_ReturnValue_1) == 0x0000B0, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, CallFunc_GetOwner_ReturnValue) == 0x0000B8, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, K2Node_DynamicCast_AsRs_Battle_Hero) == 0x0000C0, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::K2Node_DynamicCast_AsRs_Battle_Hero' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Initialize, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'BP_PlayerPsychicObjectComponent_C_Initialize::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_PlayerPsychicObjectComponent.BP_PlayerPsychicObjectComponent_C.Update
// 0x0018 (0x0018 - 0x0000)
struct BP_PlayerPsychicObjectComponent_C_Update final
{
public:
	int32                                         L_count;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_514D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 L_str;                                             // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerPsychicObjectComponent_C_Update) == 0x000008, "Wrong alignment on BP_PlayerPsychicObjectComponent_C_Update");
static_assert(sizeof(BP_PlayerPsychicObjectComponent_C_Update) == 0x000018, "Wrong size on BP_PlayerPsychicObjectComponent_C_Update");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Update, L_count) == 0x000000, "Member 'BP_PlayerPsychicObjectComponent_C_Update::L_count' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_Update, L_str) == 0x000008, "Member 'BP_PlayerPsychicObjectComponent_C_Update::L_str' has a wrong offset!");

// Function BP_PlayerPsychicObjectComponent.BP_PlayerPsychicObjectComponent_C.InitOwnerType
// 0x0020 (0x0020 - 0x0000)
struct BP_PlayerPsychicObjectComponent_C_InitOwnerType final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsControlAI_bAI;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_514E[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface;         // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemyPlayer_bEnemyPlayer;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerPsychicObjectComponent_C_InitOwnerType) == 0x000008, "Wrong alignment on BP_PlayerPsychicObjectComponent_C_InitOwnerType");
static_assert(sizeof(BP_PlayerPsychicObjectComponent_C_InitOwnerType) == 0x000020, "Wrong size on BP_PlayerPsychicObjectComponent_C_InitOwnerType");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_InitOwnerType, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_PlayerPsychicObjectComponent_C_InitOwnerType::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_InitOwnerType, CallFunc_IsControlAI_bAI) == 0x000001, "Member 'BP_PlayerPsychicObjectComponent_C_InitOwnerType::CallFunc_IsControlAI_bAI' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_InitOwnerType, K2Node_DynamicCast_AsBPI_Player_Interface) == 0x000008, "Member 'BP_PlayerPsychicObjectComponent_C_InitOwnerType::K2Node_DynamicCast_AsBPI_Player_Interface' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_InitOwnerType, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_PlayerPsychicObjectComponent_C_InitOwnerType::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_InitOwnerType, CallFunc_IsEnemyPlayer_bEnemyPlayer) == 0x000019, "Member 'BP_PlayerPsychicObjectComponent_C_InitOwnerType::CallFunc_IsEnemyPlayer_bEnemyPlayer' has a wrong offset!");

// Function BP_PlayerPsychicObjectComponent.BP_PlayerPsychicObjectComponent_C.CaptureFocusObject
// 0x0006 (0x0006 - 0x0000)
struct BP_PlayerPsychicObjectComponent_C_CaptureFocusObject final
{
public:
	bool                                          Unique_obj_in;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Combo_in;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Air_in;                                            // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Return;                                            // 0x0003(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CaptureFocusObject_return;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerPsychicObjectComponent_C_CaptureFocusObject) == 0x000001, "Wrong alignment on BP_PlayerPsychicObjectComponent_C_CaptureFocusObject");
static_assert(sizeof(BP_PlayerPsychicObjectComponent_C_CaptureFocusObject) == 0x000006, "Wrong size on BP_PlayerPsychicObjectComponent_C_CaptureFocusObject");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_CaptureFocusObject, Unique_obj_in) == 0x000000, "Member 'BP_PlayerPsychicObjectComponent_C_CaptureFocusObject::Unique_obj_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_CaptureFocusObject, Combo_in) == 0x000001, "Member 'BP_PlayerPsychicObjectComponent_C_CaptureFocusObject::Combo_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_CaptureFocusObject, Air_in) == 0x000002, "Member 'BP_PlayerPsychicObjectComponent_C_CaptureFocusObject::Air_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_CaptureFocusObject, Return) == 0x000003, "Member 'BP_PlayerPsychicObjectComponent_C_CaptureFocusObject::Return' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_CaptureFocusObject, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_PlayerPsychicObjectComponent_C_CaptureFocusObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_CaptureFocusObject, CallFunc_CaptureFocusObject_return) == 0x000005, "Member 'BP_PlayerPsychicObjectComponent_C_CaptureFocusObject::CallFunc_CaptureFocusObject_return' has a wrong offset!");

// Function BP_PlayerPsychicObjectComponent.BP_PlayerPsychicObjectComponent_C.AttackCaptureObject
// 0x0038 (0x0038 - 0x0000)
struct BP_PlayerPsychicObjectComponent_C_AttackCaptureObject final
{
public:
	class AActor*                                 Target_actor_in;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Direct_drop_in;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Return;                                            // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_514F[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APsychicObjectManager_C*                L_psyObjMan;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PsychicObjectBasic_C*               L_psyObj;                                          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          L_return;                                          // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckSasCopyParameter_return;             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5150[0x1];                                     // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CheckSasCopyParameter_copy_count;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AttackCaptureObject_return;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5151[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PsychicObjectBasic_C*               CallFunc_AttackCaptureObject_unique_object;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerPsychicObjectComponent_C_AttackCaptureObject) == 0x000008, "Wrong alignment on BP_PlayerPsychicObjectComponent_C_AttackCaptureObject");
static_assert(sizeof(BP_PlayerPsychicObjectComponent_C_AttackCaptureObject) == 0x000038, "Wrong size on BP_PlayerPsychicObjectComponent_C_AttackCaptureObject");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackCaptureObject, Target_actor_in) == 0x000000, "Member 'BP_PlayerPsychicObjectComponent_C_AttackCaptureObject::Target_actor_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackCaptureObject, Direct_drop_in) == 0x000008, "Member 'BP_PlayerPsychicObjectComponent_C_AttackCaptureObject::Direct_drop_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackCaptureObject, Return) == 0x000009, "Member 'BP_PlayerPsychicObjectComponent_C_AttackCaptureObject::Return' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackCaptureObject, L_psyObjMan) == 0x000010, "Member 'BP_PlayerPsychicObjectComponent_C_AttackCaptureObject::L_psyObjMan' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackCaptureObject, L_psyObj) == 0x000018, "Member 'BP_PlayerPsychicObjectComponent_C_AttackCaptureObject::L_psyObj' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackCaptureObject, L_return) == 0x000020, "Member 'BP_PlayerPsychicObjectComponent_C_AttackCaptureObject::L_return' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackCaptureObject, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BP_PlayerPsychicObjectComponent_C_AttackCaptureObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackCaptureObject, CallFunc_CheckSasCopyParameter_return) == 0x000022, "Member 'BP_PlayerPsychicObjectComponent_C_AttackCaptureObject::CallFunc_CheckSasCopyParameter_return' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackCaptureObject, CallFunc_CheckSasCopyParameter_copy_count) == 0x000024, "Member 'BP_PlayerPsychicObjectComponent_C_AttackCaptureObject::CallFunc_CheckSasCopyParameter_copy_count' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackCaptureObject, CallFunc_AttackCaptureObject_return) == 0x000028, "Member 'BP_PlayerPsychicObjectComponent_C_AttackCaptureObject::CallFunc_AttackCaptureObject_return' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackCaptureObject, CallFunc_AttackCaptureObject_unique_object) == 0x000030, "Member 'BP_PlayerPsychicObjectComponent_C_AttackCaptureObject::CallFunc_AttackCaptureObject_unique_object' has a wrong offset!");

// Function BP_PlayerPsychicObjectComponent.BP_PlayerPsychicObjectComponent_C.AttackComboCaptureObject
// 0x0048 (0x0048 - 0x0000)
struct BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject final
{
public:
	class AActor*                                 Target_actor_in;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Attack_level_in;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Attack_index_in;                                   // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Attract_time_in;                                   // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5152[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Anim_seq_in;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Air_combo_in;                                      // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Enemy_direct_shot_in;                              // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Return;                                            // 0x0022(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          L_return;                                          // 0x0023(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5153[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APsychicObjectManager_C*                L_psyObjMan;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSasCopyParameter_return;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5154[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CheckSasCopyParameter_copy_count;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AttackComboCaptureObject_return;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5155[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PsychicObjectBasic_C*               CallFunc_AttackComboCaptureObject_combo_obj;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject) == 0x000008, "Wrong alignment on BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject");
static_assert(sizeof(BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject) == 0x000048, "Wrong size on BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject, Target_actor_in) == 0x000000, "Member 'BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject::Target_actor_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject, Attack_level_in) == 0x000008, "Member 'BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject::Attack_level_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject, Attack_index_in) == 0x00000C, "Member 'BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject::Attack_index_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject, Attract_time_in) == 0x000010, "Member 'BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject::Attract_time_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject, Anim_seq_in) == 0x000018, "Member 'BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject::Anim_seq_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject, Air_combo_in) == 0x000020, "Member 'BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject::Air_combo_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject, Enemy_direct_shot_in) == 0x000021, "Member 'BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject::Enemy_direct_shot_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject, Return) == 0x000022, "Member 'BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject::Return' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject, L_return) == 0x000023, "Member 'BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject::L_return' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject, L_psyObjMan) == 0x000028, "Member 'BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject::L_psyObjMan' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject, CallFunc_CheckSasCopyParameter_return) == 0x000030, "Member 'BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject::CallFunc_CheckSasCopyParameter_return' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject, CallFunc_CheckSasCopyParameter_copy_count) == 0x000034, "Member 'BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject::CallFunc_CheckSasCopyParameter_copy_count' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject, CallFunc_AttackComboCaptureObject_return) == 0x000039, "Member 'BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject::CallFunc_AttackComboCaptureObject_return' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject, CallFunc_AttackComboCaptureObject_combo_obj) == 0x000040, "Member 'BP_PlayerPsychicObjectComponent_C_AttackComboCaptureObject::CallFunc_AttackComboCaptureObject_combo_obj' has a wrong offset!");

// Function BP_PlayerPsychicObjectComponent.BP_PlayerPsychicObjectComponent_C.DetachAttackComboObject
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerPsychicObjectComponent_C_DetachAttackComboObject final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerPsychicObjectComponent_C_DetachAttackComboObject) == 0x000001, "Wrong alignment on BP_PlayerPsychicObjectComponent_C_DetachAttackComboObject");
static_assert(sizeof(BP_PlayerPsychicObjectComponent_C_DetachAttackComboObject) == 0x000001, "Wrong size on BP_PlayerPsychicObjectComponent_C_DetachAttackComboObject");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_DetachAttackComboObject, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_PlayerPsychicObjectComponent_C_DetachAttackComboObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PlayerPsychicObjectComponent.BP_PlayerPsychicObjectComponent_C.GetCurrentPsychicAnimObject
// 0x0028 (0x0028 - 0x0000)
struct BP_PlayerPsychicObjectComponent_C_GetCurrentPsychicAnimObject final
{
public:
	class APsychicAnimObject_C*                   Psy_anim_obj;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PsychicObjectBasic_C*               L_psyObj;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5156[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PsychicObjectBasic_C*               CallFunc_GetPsychicObject_return;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerPsychicObjectComponent_C_GetCurrentPsychicAnimObject) == 0x000008, "Wrong alignment on BP_PlayerPsychicObjectComponent_C_GetCurrentPsychicAnimObject");
static_assert(sizeof(BP_PlayerPsychicObjectComponent_C_GetCurrentPsychicAnimObject) == 0x000028, "Wrong size on BP_PlayerPsychicObjectComponent_C_GetCurrentPsychicAnimObject");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_GetCurrentPsychicAnimObject, Psy_anim_obj) == 0x000000, "Member 'BP_PlayerPsychicObjectComponent_C_GetCurrentPsychicAnimObject::Psy_anim_obj' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_GetCurrentPsychicAnimObject, L_psyObj) == 0x000008, "Member 'BP_PlayerPsychicObjectComponent_C_GetCurrentPsychicAnimObject::L_psyObj' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_GetCurrentPsychicAnimObject, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_PlayerPsychicObjectComponent_C_GetCurrentPsychicAnimObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_GetCurrentPsychicAnimObject, CallFunc_GetPsychicObject_return) == 0x000018, "Member 'BP_PlayerPsychicObjectComponent_C_GetCurrentPsychicAnimObject::CallFunc_GetPsychicObject_return' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_GetCurrentPsychicAnimObject, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'BP_PlayerPsychicObjectComponent_C_GetCurrentPsychicAnimObject::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_PlayerPsychicObjectComponent.BP_PlayerPsychicObjectComponent_C.CancelCaptureObject
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerPsychicObjectComponent_C_CancelCaptureObject final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerPsychicObjectComponent_C_CancelCaptureObject) == 0x000001, "Wrong alignment on BP_PlayerPsychicObjectComponent_C_CancelCaptureObject");
static_assert(sizeof(BP_PlayerPsychicObjectComponent_C_CancelCaptureObject) == 0x000001, "Wrong size on BP_PlayerPsychicObjectComponent_C_CancelCaptureObject");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_CancelCaptureObject, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_PlayerPsychicObjectComponent_C_CancelCaptureObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PlayerPsychicObjectComponent.BP_PlayerPsychicObjectComponent_C.AttackBrainFieldObject
// 0x0050 (0x0050 - 0x0000)
struct BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject final
{
public:
	EPsychicObjectBrainFieldAttackType            Attack_type_in;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5157[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Skill_level_in;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Swing_lerp_in;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5158[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Swing_lerp_time_in;                                // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Swing_update_time_in;                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          L_atkColl;                                         // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5159[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         L_camAngle;                                        // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_indexLoop;                                       // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 L_random;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         L_count;                                           // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_515A[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PsychicObjectBasic_C*               L_psyObj;                                          // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_index;                                           // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject) == 0x000008, "Wrong alignment on BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject");
static_assert(sizeof(BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject) == 0x000050, "Wrong size on BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject, Attack_type_in) == 0x000000, "Member 'BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject::Attack_type_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject, Skill_level_in) == 0x000004, "Member 'BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject::Skill_level_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject, Swing_lerp_in) == 0x000008, "Member 'BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject::Swing_lerp_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject, Swing_lerp_time_in) == 0x00000C, "Member 'BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject::Swing_lerp_time_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject, Swing_update_time_in) == 0x000010, "Member 'BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject::Swing_update_time_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject, L_atkColl) == 0x000014, "Member 'BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject::L_atkColl' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject, L_camAngle) == 0x000018, "Member 'BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject::L_camAngle' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject, L_indexLoop) == 0x00001C, "Member 'BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject::L_indexLoop' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject, L_random) == 0x000020, "Member 'BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject::L_random' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject, L_count) == 0x000030, "Member 'BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject::L_count' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject, L_psyObj) == 0x000038, "Member 'BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject::L_psyObj' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject, L_index) == 0x000040, "Member 'BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject::L_index' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject, K2Node_SwitchEnum_CmpSuccess) == 0x000044, "Member 'BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000045, "Member 'BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject, CallFunc_IsValid_ReturnValue) == 0x000046, "Member 'BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject, CallFunc_IsValid_ReturnValue_1) == 0x000047, "Member 'BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject, CallFunc_Not_PreBool_ReturnValue) == 0x000048, "Member 'BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject, CallFunc_BooleanOR_ReturnValue) == 0x000049, "Member 'BP_PlayerPsychicObjectComponent_C_AttackBrainFieldObject::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_PlayerPsychicObjectComponent.BP_PlayerPsychicObjectComponent_C.CancelUniqueObjectInput
// 0x0030 (0x0030 - 0x0000)
struct BP_PlayerPsychicObjectComponent_C_CancelUniqueObjectInput final
{
public:
	class ABP_PsychicObjectBasic_C*               L_psyObj;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CancelInput_skip;                         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerPsychicObjectComponent_C_CancelUniqueObjectInput) == 0x000008, "Wrong alignment on BP_PlayerPsychicObjectComponent_C_CancelUniqueObjectInput");
static_assert(sizeof(BP_PlayerPsychicObjectComponent_C_CancelUniqueObjectInput) == 0x000030, "Wrong size on BP_PlayerPsychicObjectComponent_C_CancelUniqueObjectInput");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_CancelUniqueObjectInput, L_psyObj) == 0x000000, "Member 'BP_PlayerPsychicObjectComponent_C_CancelUniqueObjectInput::L_psyObj' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_CancelUniqueObjectInput, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'BP_PlayerPsychicObjectComponent_C_CancelUniqueObjectInput::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_CancelUniqueObjectInput, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'BP_PlayerPsychicObjectComponent_C_CancelUniqueObjectInput::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_CancelUniqueObjectInput, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_PlayerPsychicObjectComponent_C_CancelUniqueObjectInput::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_CancelUniqueObjectInput, CallFunc_CancelInput_skip) == 0x000029, "Member 'BP_PlayerPsychicObjectComponent_C_CancelUniqueObjectInput::CallFunc_CancelInput_skip' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_CancelUniqueObjectInput, CallFunc_IsValid_ReturnValue_1) == 0x00002A, "Member 'BP_PlayerPsychicObjectComponent_C_CancelUniqueObjectInput::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_PlayerPsychicObjectComponent.BP_PlayerPsychicObjectComponent_C.CancelPsychicObjectAction
// 0x0003 (0x0003 - 0x0000)
struct BP_PlayerPsychicObjectComponent_C_CancelPsychicObjectAction final
{
public:
	bool                                          Event_in;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Psychic_battle_in;                                 // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerPsychicObjectComponent_C_CancelPsychicObjectAction) == 0x000001, "Wrong alignment on BP_PlayerPsychicObjectComponent_C_CancelPsychicObjectAction");
static_assert(sizeof(BP_PlayerPsychicObjectComponent_C_CancelPsychicObjectAction) == 0x000003, "Wrong size on BP_PlayerPsychicObjectComponent_C_CancelPsychicObjectAction");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_CancelPsychicObjectAction, Event_in) == 0x000000, "Member 'BP_PlayerPsychicObjectComponent_C_CancelPsychicObjectAction::Event_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_CancelPsychicObjectAction, Psychic_battle_in) == 0x000001, "Member 'BP_PlayerPsychicObjectComponent_C_CancelPsychicObjectAction::Psychic_battle_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerPsychicObjectComponent_C_CancelPsychicObjectAction, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'BP_PlayerPsychicObjectComponent_C_CancelPsychicObjectAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PlayerPsychicObjectComponent.BP_PlayerPsychicObjectComponent_C.GetPsychicObject
// 0x0020 (0x0020 - 0x0000)
struct BP_PlayerPsychicObjectComponent_C_GetPsychicObject final
{
public:
	bool                                          Unq_obj_in;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Focus_in;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Capture_in;                                        // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Attack_in;                                         // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
