#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PostProcessVolumeAccess

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PostProcessVolumeAccess.BP_PostProcessVolumeAccess_C.ExecuteUbergraph_BP_PostProcessVolumeAccess
// 0x0004 (0x0004 - 0x0000)
struct BP_PostProcessVolumeAccess_C_ExecuteUbergraph_BP_PostProcessVolumeAccess final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PostProcessVolumeAccess_C_ExecuteUbergraph_BP_PostProcessVolumeAccess) == 0x000004, "Wrong alignment on BP_PostProcessVolumeAccess_C_ExecuteUbergraph_BP_PostProcessVolumeAccess");
static_assert(sizeof(BP_PostProcessVolumeAccess_C_ExecuteUbergraph_BP_PostProcessVolumeAccess) == 0x000004, "Wrong size on BP_PostProcessVolumeAccess_C_ExecuteUbergraph_BP_PostProcessVolumeAccess");
static_assert(offsetof(BP_PostProcessVolumeAccess_C_ExecuteUbergraph_BP_PostProcessVolumeAccess, EntryPoint) == 0x000000, "Member 'BP_PostProcessVolumeAccess_C_ExecuteUbergraph_BP_PostProcessVolumeAccess::EntryPoint' has a wrong offset!");

// Function BP_PostProcessVolumeAccess.BP_PostProcessVolumeAccess_C.GetPostProcessVolume
// 0x0040 (0x0040 - 0x0000)
struct BP_PostProcessVolumeAccess_C_GetPostProcessVolume final
{
public:
	class APostProcessVolume*                     Param_PostProcessVolume;                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APostProcessVolume*>             LTempArray;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	class APostProcessVolume*                     CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37CF[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APostProcessVolume*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0028(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PostProcessVolumeAccess_C_GetPostProcessVolume) == 0x000008, "Wrong alignment on BP_PostProcessVolumeAccess_C_GetPostProcessVolume");
static_assert(sizeof(BP_PostProcessVolumeAccess_C_GetPostProcessVolume) == 0x000040, "Wrong size on BP_PostProcessVolumeAccess_C_GetPostProcessVolume");
static_assert(offsetof(BP_PostProcessVolumeAccess_C_GetPostProcessVolume, Param_PostProcessVolume) == 0x000000, "Member 'BP_PostProcessVolumeAccess_C_GetPostProcessVolume::Param_PostProcessVolume' has a wrong offset!");
static_assert(offsetof(BP_PostProcessVolumeAccess_C_GetPostProcessVolume, LTempArray) == 0x000008, "Member 'BP_PostProcessVolumeAccess_C_GetPostProcessVolume::LTempArray' has a wrong offset!");
static_assert(offsetof(BP_PostProcessVolumeAccess_C_GetPostProcessVolume, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_PostProcessVolumeAccess_C_GetPostProcessVolume::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PostProcessVolumeAccess_C_GetPostProcessVolume, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_PostProcessVolumeAccess_C_GetPostProcessVolume::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessVolumeAccess_C_GetPostProcessVolume, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'BP_PostProcessVolumeAccess_C_GetPostProcessVolume::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessVolumeAccess_C_GetPostProcessVolume, CallFunc_GetAllActorsOfClass_OutActors) == 0x000028, "Member 'BP_PostProcessVolumeAccess_C_GetPostProcessVolume::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_PostProcessVolumeAccess_C_GetPostProcessVolume, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_PostProcessVolumeAccess_C_GetPostProcessVolume::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

