#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerActionStateAttack

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "BP_PlayerActionStateCommonBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerActionStateAttack.BP_PlayerActionStateAttack_C
// 0x0020 (0x0108 - 0x00E8)
class UBP_PlayerActionStateAttack_C final : public UBP_PlayerActionStateCommonBase_C
{
public:
	ERSAttackInputKind                            AttackInputKind;                                   // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_984F[0x3];                                     // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ClaimantName;                                      // 0x00EC(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPsychicEffect;                                    // 0x00F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9850[0x3];                                     // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ObstructTimer;                                     // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StoreCharacterHitTimeSliceNum;                     // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPsychicSlow;                                      // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bStealthFlag;                                      // 0x0101(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bObstruct;                                         // 0x0102(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bForceEnableRootMotion;                            // 0x0103(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	int32 Enter(int32 Param);
	int32 Update();
	int32 Exit(int32 NextStateIndex);
	void SetSuperArmor(bool bEnable);
	void RootMotionSetting();
	void EnableUseRootMotion(bool* bDummy);
	void ResetUseRootMotion(bool* bDummy);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerActionStateAttack_C">();
	}
	static class UBP_PlayerActionStateAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PlayerActionStateAttack_C>();
	}
};
static_assert(alignof(UBP_PlayerActionStateAttack_C) == 0x000008, "Wrong alignment on UBP_PlayerActionStateAttack_C");
static_assert(sizeof(UBP_PlayerActionStateAttack_C) == 0x000108, "Wrong size on UBP_PlayerActionStateAttack_C");
static_assert(offsetof(UBP_PlayerActionStateAttack_C, AttackInputKind) == 0x0000E8, "Member 'UBP_PlayerActionStateAttack_C::AttackInputKind' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateAttack_C, ClaimantName) == 0x0000EC, "Member 'UBP_PlayerActionStateAttack_C::ClaimantName' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateAttack_C, bPsychicEffect) == 0x0000F4, "Member 'UBP_PlayerActionStateAttack_C::bPsychicEffect' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateAttack_C, ObstructTimer) == 0x0000F8, "Member 'UBP_PlayerActionStateAttack_C::ObstructTimer' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateAttack_C, StoreCharacterHitTimeSliceNum) == 0x0000FC, "Member 'UBP_PlayerActionStateAttack_C::StoreCharacterHitTimeSliceNum' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateAttack_C, bPsychicSlow) == 0x000100, "Member 'UBP_PlayerActionStateAttack_C::bPsychicSlow' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateAttack_C, bStealthFlag) == 0x000101, "Member 'UBP_PlayerActionStateAttack_C::bStealthFlag' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateAttack_C, bObstruct) == 0x000102, "Member 'UBP_PlayerActionStateAttack_C::bObstruct' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateAttack_C, bForceEnableRootMotion) == 0x000103, "Member 'UBP_PlayerActionStateAttack_C::bForceEnableRootMotion' has a wrong offset!");

}

