#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PsychicObjectStatic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_PsychicObjectBasic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PsychicObjectStatic.BP_PsychicObjectStatic_C
// 0x0020 (0x05D0 - 0x05B0)
class ABP_PsychicObjectStatic_C : public ABP_PsychicObjectBasic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_PsychicObjectStatic_C;           // 0x05A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCapsuleComponent*                      PhysicsCapsule;                                    // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ShadowMesh;                                        // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AuraMesh;                                          // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PsychicObjectStatic(int32 EntryPoint);
	void BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();
	void Initialize(bool* Return);
	bool GetDebrisEffectData(class UParticleSystem** ParticleTemplate, class UMaterialInterface** OverrideMaterial);

	void GetTriangleData(struct FMeshTriangleData* Triangle_data) const;
	int32 GetDataRevision() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PsychicObjectStatic_C">();
	}
	static class ABP_PsychicObjectStatic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PsychicObjectStatic_C>();
	}
};
static_assert(alignof(ABP_PsychicObjectStatic_C) == 0x000010, "Wrong alignment on ABP_PsychicObjectStatic_C");
static_assert(sizeof(ABP_PsychicObjectStatic_C) == 0x0005D0, "Wrong size on ABP_PsychicObjectStatic_C");
static_assert(offsetof(ABP_PsychicObjectStatic_C, UberGraphFrame_BP_PsychicObjectStatic_C) == 0x0005A8, "Member 'ABP_PsychicObjectStatic_C::UberGraphFrame_BP_PsychicObjectStatic_C' has a wrong offset!");
static_assert(offsetof(ABP_PsychicObjectStatic_C, PhysicsCapsule) == 0x0005B0, "Member 'ABP_PsychicObjectStatic_C::PhysicsCapsule' has a wrong offset!");
static_assert(offsetof(ABP_PsychicObjectStatic_C, ShadowMesh) == 0x0005B8, "Member 'ABP_PsychicObjectStatic_C::ShadowMesh' has a wrong offset!");
static_assert(offsetof(ABP_PsychicObjectStatic_C, AuraMesh) == 0x0005C0, "Member 'ABP_PsychicObjectStatic_C::AuraMesh' has a wrong offset!");
static_assert(offsetof(ABP_PsychicObjectStatic_C, StaticMesh) == 0x0005C8, "Member 'ABP_PsychicObjectStatic_C::StaticMesh' has a wrong offset!");

}

