#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerActionStateIdle

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "BP_PlayerActionStateCommonBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerActionStateIdle.BP_PlayerActionStateIdle_C
// 0x0010 (0x00F8 - 0x00E8)
class UBP_PlayerActionStateIdle_C final : public UBP_PlayerActionStateCommonBase_C
{
public:
	struct FGameTimer                             BoringTimer;                                       // 0x00E8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bChangePriority;                                   // 0x00F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ECharacterHitPriority                         StorePriority;                                     // 0x00F5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int32 Enter(int32 Param);
	int32 Update();
	bool Transition();
	int32 Exit(int32 NextStateIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerActionStateIdle_C">();
	}
	static class UBP_PlayerActionStateIdle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PlayerActionStateIdle_C>();
	}
};
static_assert(alignof(UBP_PlayerActionStateIdle_C) == 0x000008, "Wrong alignment on UBP_PlayerActionStateIdle_C");
static_assert(sizeof(UBP_PlayerActionStateIdle_C) == 0x0000F8, "Wrong size on UBP_PlayerActionStateIdle_C");
static_assert(offsetof(UBP_PlayerActionStateIdle_C, BoringTimer) == 0x0000E8, "Member 'UBP_PlayerActionStateIdle_C::BoringTimer' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateIdle_C, bChangePriority) == 0x0000F4, "Member 'UBP_PlayerActionStateIdle_C::bChangePriority' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateIdle_C, StorePriority) == 0x0000F5, "Member 'UBP_PlayerActionStateIdle_C::StorePriority' has a wrong offset!");

}

