#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerActionStateUseItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_PlayerActionStateCommonBase_classes.hpp"
#include "EPlayerUseItemSpeed_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerActionStateUseItem.BP_PlayerActionStateUseItem_C
// 0x0018 (0x0100 - 0x00E8)
class UBP_PlayerActionStateUseItem_C final : public UBP_PlayerActionStateCommonBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_PlayerActionStateUseItem_C;      // 0x00E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   ClaimantName;                                      // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseSuccess;                                       // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_PlayerActionStateUseItem(int32 EntryPoint);
	void OnSuccessItemApply();
	void UnbindItemApply();
	void BindItemApply();
	int32 Enter(int32 Param);
	int32 Update();
	int32 Exit(int32 NextStateIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerActionStateUseItem_C">();
	}
	static class UBP_PlayerActionStateUseItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PlayerActionStateUseItem_C>();
	}
};
static_assert(alignof(UBP_PlayerActionStateUseItem_C) == 0x000008, "Wrong alignment on UBP_PlayerActionStateUseItem_C");
static_assert(sizeof(UBP_PlayerActionStateUseItem_C) == 0x000100, "Wrong size on UBP_PlayerActionStateUseItem_C");
static_assert(offsetof(UBP_PlayerActionStateUseItem_C, UberGraphFrame_BP_PlayerActionStateUseItem_C) == 0x0000E8, "Member 'UBP_PlayerActionStateUseItem_C::UberGraphFrame_BP_PlayerActionStateUseItem_C' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateUseItem_C, ClaimantName) == 0x0000F0, "Member 'UBP_PlayerActionStateUseItem_C::ClaimantName' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateUseItem_C, bUseSuccess) == 0x0000F8, "Member 'UBP_PlayerActionStateUseItem_C::bUseSuccess' has a wrong offset!");

}

