#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerActionStateUseItem

#include "Basic.hpp"

#include "EPlayerUseItemSpeed_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerActionStateUseItem.BP_PlayerActionStateUseItem_C.ExecuteUbergraph_BP_PlayerActionStateUseItem
// 0x001C (0x001C - 0x0000)
struct BP_PlayerActionStateUseItem_C_ExecuteUbergraph_BP_PlayerActionStateUseItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_453F[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateUseItem_C_ExecuteUbergraph_BP_PlayerActionStateUseItem) == 0x000004, "Wrong alignment on BP_PlayerActionStateUseItem_C_ExecuteUbergraph_BP_PlayerActionStateUseItem");
static_assert(sizeof(BP_PlayerActionStateUseItem_C_ExecuteUbergraph_BP_PlayerActionStateUseItem) == 0x00001C, "Wrong size on BP_PlayerActionStateUseItem_C_ExecuteUbergraph_BP_PlayerActionStateUseItem");
static_assert(offsetof(BP_PlayerActionStateUseItem_C_ExecuteUbergraph_BP_PlayerActionStateUseItem, EntryPoint) == 0x000000, "Member 'BP_PlayerActionStateUseItem_C_ExecuteUbergraph_BP_PlayerActionStateUseItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateUseItem_C_ExecuteUbergraph_BP_PlayerActionStateUseItem, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_PlayerActionStateUseItem_C_ExecuteUbergraph_BP_PlayerActionStateUseItem::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateUseItem_C_ExecuteUbergraph_BP_PlayerActionStateUseItem, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'BP_PlayerActionStateUseItem_C_ExecuteUbergraph_BP_PlayerActionStateUseItem::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateUseItem_C_ExecuteUbergraph_BP_PlayerActionStateUseItem, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_PlayerActionStateUseItem_C_ExecuteUbergraph_BP_PlayerActionStateUseItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateUseItem_C_ExecuteUbergraph_BP_PlayerActionStateUseItem, Temp_bool_Has_Been_Initd_Variable_1) == 0x000018, "Member 'BP_PlayerActionStateUseItem_C_ExecuteUbergraph_BP_PlayerActionStateUseItem::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateUseItem_C_ExecuteUbergraph_BP_PlayerActionStateUseItem, Temp_bool_IsClosed_Variable_1) == 0x000019, "Member 'BP_PlayerActionStateUseItem_C_ExecuteUbergraph_BP_PlayerActionStateUseItem::Temp_bool_IsClosed_Variable_1' has a wrong offset!");

// Function BP_PlayerActionStateUseItem.BP_PlayerActionStateUseItem_C.Enter
// 0x0028 (0x0028 - 0x0000)
struct BP_PlayerActionStateUseItem_C_Enter final
{
public:
	int32                                         Param;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Enter_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4540[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_LookAtInterface_C> CallFunc_SetLookAtEnable_self_CastInput;           // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetLookAtEnable_bResult;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerUseItemSpeed                           CallFunc_GetUseItemSpeed_Speed;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4541[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerActionStateUseItem_C_Enter) == 0x000008, "Wrong alignment on BP_PlayerActionStateUseItem_C_Enter");
static_assert(sizeof(BP_PlayerActionStateUseItem_C_Enter) == 0x000028, "Wrong size on BP_PlayerActionStateUseItem_C_Enter");
static_assert(offsetof(BP_PlayerActionStateUseItem_C_Enter, Param) == 0x000000, "Member 'BP_PlayerActionStateUseItem_C_Enter::Param' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateUseItem_C_Enter, ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateUseItem_C_Enter::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateUseItem_C_Enter, CallFunc_Enter_ReturnValue) == 0x000008, "Member 'BP_PlayerActionStateUseItem_C_Enter::CallFunc_Enter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateUseItem_C_Enter, CallFunc_SetLookAtEnable_self_CastInput) == 0x000010, "Member 'BP_PlayerActionStateUseItem_C_Enter::CallFunc_SetLookAtEnable_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateUseItem_C_Enter, CallFunc_SetLookAtEnable_bResult) == 0x000020, "Member 'BP_PlayerActionStateUseItem_C_Enter::CallFunc_SetLookAtEnable_bResult' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateUseItem_C_Enter, CallFunc_GetUseItemSpeed_Speed) == 0x000021, "Member 'BP_PlayerActionStateUseItem_C_Enter::CallFunc_GetUseItemSpeed_Speed' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateUseItem_C_Enter, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000024, "Member 'BP_PlayerActionStateUseItem_C_Enter::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function BP_PlayerActionStateUseItem.BP_PlayerActionStateUseItem_C.Update
// 0x000C (0x000C - 0x0000)
struct BP_PlayerActionStateUseItem_C_Update final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsASAnimPlayEnd_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4542[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Update_ReturnValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerActionStateUseItem_C_Update) == 0x000004, "Wrong alignment on BP_PlayerActionStateUseItem_C_Update");
static_assert(sizeof(BP_PlayerActionStateUseItem_C_Update) == 0x00000C, "Wrong size on BP_PlayerActionStateUseItem_C_Update");
static_assert(offsetof(BP_PlayerActionStateUseItem_C_Update, ReturnValue) == 0x000000, "Member 'BP_PlayerActionStateUseItem_C_Update::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateUseItem_C_Update, CallFunc_IsASAnimPlayEnd_ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateUseItem_C_Update::CallFunc_IsASAnimPlayEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateUseItem_C_Update, CallFunc_Update_ReturnValue) == 0x000008, "Member 'BP_PlayerActionStateUseItem_C_Update::CallFunc_Update_ReturnValue' has a wrong offset!");

// Function BP_PlayerActionStateUseItem.BP_PlayerActionStateUseItem_C.Exit
// 0x0038 (0x0038 - 0x0000)
struct BP_PlayerActionStateUseItem_C_Exit final
{
public:
	int32                                         NextStateIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Exit_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4543[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_LookAtInterface_C> CallFunc_SetLookAtEnable_self_CastInput;           // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetLookAtEnable_bResult;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4544[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsControlAI_bAI;                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInvalidDamage_Dummy;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateUseItem_C_Exit) == 0x000008, "Wrong alignment on BP_PlayerActionStateUseItem_C_Exit");
static_assert(sizeof(BP_PlayerActionStateUseItem_C_Exit) == 0x000038, "Wrong size on BP_PlayerActionStateUseItem_C_Exit");
static_assert(offsetof(BP_PlayerActionStateUseItem_C_Exit, NextStateIndex) == 0x000000, "Member 'BP_PlayerActionStateUseItem_C_Exit::NextStateIndex' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateUseItem_C_Exit, ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateUseItem_C_Exit::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateUseItem_C_Exit, CallFunc_Exit_ReturnValue) == 0x000008, "Member 'BP_PlayerActionStateUseItem_C_Exit::CallFunc_Exit_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateUseItem_C_Exit, CallFunc_SetLookAtEnable_self_CastInput) == 0x000010, "Member 'BP_PlayerActionStateUseItem_C_Exit::CallFunc_SetLookAtEnable_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateUseItem_C_Exit, CallFunc_SetLookAtEnable_bResult) == 0x000020, "Member 'BP_PlayerActionStateUseItem_C_Exit::CallFunc_SetLookAtEnable_bResult' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateUseItem_C_Exit, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000028, "Member 'BP_PlayerActionStateUseItem_C_Exit::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateUseItem_C_Exit, CallFunc_IsControlAI_bAI) == 0x000030, "Member 'BP_PlayerActionStateUseItem_C_Exit::CallFunc_IsControlAI_bAI' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateUseItem_C_Exit, CallFunc_SetInvalidDamage_Dummy) == 0x000031, "Member 'BP_PlayerActionStateUseItem_C_Exit::CallFunc_SetInvalidDamage_Dummy' has a wrong offset!");

}

