#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerActionStateCaptureMapGimmick

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerActionStateCaptureMapGimmick.BP_PlayerActionStateCaptureMapGimmick_C.ExecuteUbergraph_BP_PlayerActionStateCaptureMapGimmick
// 0x0040 (0x0040 - 0x0000)
struct BP_PlayerActionStateCaptureMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCaptureMapGimmick final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45CD[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMapGimmickManager*                     CallFunc_GetMapGimmickManager_MapGimmickManager;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMapGimmickManager*                     CallFunc_GetMapGimmickManager_MapGimmickManager_1; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARsBattleHero_C*                        K2Node_DynamicCast_AsRs_Battle_Hero;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45CE[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AMapGimmickObject* Gimmick)> K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateCaptureMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCaptureMapGimmick) == 0x000008, "Wrong alignment on BP_PlayerActionStateCaptureMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCaptureMapGimmick");
static_assert(sizeof(BP_PlayerActionStateCaptureMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCaptureMapGimmick) == 0x000040, "Wrong size on BP_PlayerActionStateCaptureMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCaptureMapGimmick");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCaptureMapGimmick, EntryPoint) == 0x000000, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCaptureMapGimmick::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCaptureMapGimmick, CallFunc_GetMapGimmickManager_MapGimmickManager) == 0x000008, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCaptureMapGimmick::CallFunc_GetMapGimmickManager_MapGimmickManager' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCaptureMapGimmick, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCaptureMapGimmick::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCaptureMapGimmick, CallFunc_GetMapGimmickManager_MapGimmickManager_1) == 0x000018, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCaptureMapGimmick::CallFunc_GetMapGimmickManager_MapGimmickManager_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCaptureMapGimmick, K2Node_DynamicCast_AsRs_Battle_Hero) == 0x000020, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCaptureMapGimmick::K2Node_DynamicCast_AsRs_Battle_Hero' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCaptureMapGimmick, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCaptureMapGimmick::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCaptureMapGimmick, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCaptureMapGimmick::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_PlayerActionStateCaptureMapGimmick.BP_PlayerActionStateCaptureMapGimmick_C.Enter
// 0x0198 (0x0198 - 0x0000)
struct BP_PlayerActionStateCaptureMapGimmick_C_Enter final
{
public:
	int32                                         Param;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           StartAnim;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MapGimmickObjectBase_C*             bp_mg;                                             // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Enter_ReturnValue;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45CF[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MapGimmickObjectBase_C*             K2Node_DynamicCast_AsBP_Map_Gimmick_Object_Base;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45D0[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetActorToPlayerDistance_Distance;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45D1[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_1;         // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45D2[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IPlayerInterface>      CallFunc_GetPlayerID_self_CastInput;               // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45D3[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      CallFunc_GetPlayerID_self_CastInput_1;             // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue_1;                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45D4[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APsychicObjectManager_C*                CallFunc_GetPsychicObjectManager_PsyObjManager;    // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IPlayerInterface>      CallFunc_SpawnBattleParticle_self_CastInput;       // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SpawnBattleParticle_ReturnValue;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45D5[0x2];                                     // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalcAnimMoveDistance_Length;              // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_2;         // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45D6[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45D7[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_3;         // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetPlayerLoopAnimation_ReturnValue;       // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetPlayerStartAnimation_ReturnValue;      // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMapGimmickObject*                      CallFunc_GetMapGimmickObject_MapGimmickObject;     // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetMapGimmickLookAtLocation_Location;     // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerCaptureAnimPattern                     CallFunc_CheckCaptureAnimPattern_Pattern;          // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetBattleReady_bDummy;                    // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45D8[0x2];                                     // 0x017E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_LookAtInterface_C> CallFunc_SetLookAtEnable_self_CastInput;           // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetLookAtEnable_bResult;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateCaptureMapGimmick_C_Enter) == 0x000008, "Wrong alignment on BP_PlayerActionStateCaptureMapGimmick_C_Enter");
static_assert(sizeof(BP_PlayerActionStateCaptureMapGimmick_C_Enter) == 0x000198, "Wrong size on BP_PlayerActionStateCaptureMapGimmick_C_Enter");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, Param) == 0x000000, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::Param' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, StartAnim) == 0x000008, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::StartAnim' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, bp_mg) == 0x000010, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::bp_mg' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000018, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_Enter_ReturnValue) == 0x000020, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_Enter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, K2Node_DynamicCast_AsBP_Map_Gimmick_Object_Base) == 0x000028, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::K2Node_DynamicCast_AsBP_Map_Gimmick_Object_Base' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_Conv_FloatToString_ReturnValue) == 0x000038, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_GetActorToPlayerDistance_Distance) == 0x000058, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_GetActorToPlayerDistance_Distance' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000060, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_Conv_FloatToString_ReturnValue_1) == 0x000070, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_Conv_FloatToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000080, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000088, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000098, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_GetPlayerID_self_CastInput) == 0x0000A8, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_GetPlayerID_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_GetPlayerID_ReturnValue) == 0x0000B8, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_GetPlayerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_GetPlayerID_self_CastInput_1) == 0x0000C0, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_GetPlayerID_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_GetPlayerID_ReturnValue_1) == 0x0000D0, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_GetPlayerID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_GetPsychicObjectManager_PsyObjManager) == 0x0000D8, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_GetPsychicObjectManager_PsyObjManager' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_SpawnBattleParticle_self_CastInput) == 0x0000E0, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_SpawnBattleParticle_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_SpawnBattleParticle_ReturnValue) == 0x0000F0, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_SpawnBattleParticle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_IsValid_ReturnValue) == 0x0000F1, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_CalcAnimMoveDistance_Length) == 0x0000F4, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_CalcAnimMoveDistance_Length' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_Conv_FloatToString_ReturnValue_2) == 0x0000F8, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_Conv_FloatToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000108, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000110, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_FMax_ReturnValue) == 0x000120, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000128, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_Conv_FloatToString_ReturnValue_3) == 0x000138, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_Conv_FloatToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000148, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_GetPlayerLoopAnimation_ReturnValue) == 0x000158, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_GetPlayerLoopAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_GetPlayerStartAnimation_ReturnValue) == 0x000160, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_GetPlayerStartAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_GetMapGimmickObject_MapGimmickObject) == 0x000168, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_GetMapGimmickObject_MapGimmickObject' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_GetMapGimmickLookAtLocation_Location) == 0x000170, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_GetMapGimmickLookAtLocation_Location' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_CheckCaptureAnimPattern_Pattern) == 0x00017C, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_CheckCaptureAnimPattern_Pattern' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_SetBattleReady_bDummy) == 0x00017D, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_SetBattleReady_bDummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_SetLookAtEnable_self_CastInput) == 0x000180, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_SetLookAtEnable_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Enter, CallFunc_SetLookAtEnable_bResult) == 0x000190, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Enter::CallFunc_SetLookAtEnable_bResult' has a wrong offset!");

// Function BP_PlayerActionStateCaptureMapGimmick.BP_PlayerActionStateCaptureMapGimmick_C.Exit
// 0x0070 (0x0070 - 0x0000)
struct BP_PlayerActionStateCaptureMapGimmick_C_Exit final
{
public:
	int32                                         NextStateIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Exit_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45D9[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APsychicObjectManager_C*                CallFunc_GetPsychicObjectManager_PsyObjManager;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45DA[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MapGimmickObjectBase_C*             K2Node_DynamicCast_AsBP_Map_Gimmick_Object_Base;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInvalidDamage_Dummy;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45DB[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARsBattleHero_C*                        K2Node_DynamicCast_AsRs_Battle_Hero;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45DC[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      CallFunc_ClearBattleParticle_self_CastInput;       // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClearBattleParticle_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateCaptureMapGimmick_C_Exit) == 0x000008, "Wrong alignment on BP_PlayerActionStateCaptureMapGimmick_C_Exit");
static_assert(sizeof(BP_PlayerActionStateCaptureMapGimmick_C_Exit) == 0x000070, "Wrong size on BP_PlayerActionStateCaptureMapGimmick_C_Exit");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Exit, NextStateIndex) == 0x000000, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Exit::NextStateIndex' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Exit, ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Exit::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Exit, CallFunc_Exit_ReturnValue) == 0x000008, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Exit::CallFunc_Exit_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Exit, CallFunc_GetPsychicObjectManager_PsyObjManager) == 0x000010, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Exit::CallFunc_GetPsychicObjectManager_PsyObjManager' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Exit, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000018, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Exit::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Exit, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Exit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Exit, K2Node_DynamicCast_AsBP_Map_Gimmick_Object_Base) == 0x000028, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Exit::K2Node_DynamicCast_AsBP_Map_Gimmick_Object_Base' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Exit, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Exit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Exit, CallFunc_SetInvalidDamage_Dummy) == 0x000031, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Exit::CallFunc_SetInvalidDamage_Dummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Exit, CallFunc_GetPlayerManager_PlayerManager) == 0x000038, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Exit::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Exit, CallFunc_GetPlayer_ReturnValue) == 0x000040, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Exit::CallFunc_GetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Exit, K2Node_DynamicCast_AsRs_Battle_Hero) == 0x000048, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Exit::K2Node_DynamicCast_AsRs_Battle_Hero' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Exit, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Exit::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Exit, CallFunc_ClearBattleParticle_self_CastInput) == 0x000058, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Exit::CallFunc_ClearBattleParticle_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Exit, CallFunc_ClearBattleParticle_ReturnValue) == 0x000068, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Exit::CallFunc_ClearBattleParticle_ReturnValue' has a wrong offset!");

// Function BP_PlayerActionStateCaptureMapGimmick.BP_PlayerActionStateCaptureMapGimmick_C.Update
// 0x0030 (0x0030 - 0x0000)
struct BP_PlayerActionStateCaptureMapGimmick_C_Update final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayBlendAnimMontage_bPlay;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayBlendAnimMontage_bPlay_1;           // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInvalidDamage_Dummy;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionStatus_Result;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionStatus_Result_1;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45DD[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARsBattleHero_C*                        K2Node_DynamicCast_AsRs_Battle_Hero;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateCaptureMapGimmick_C_Update) == 0x000008, "Wrong alignment on BP_PlayerActionStateCaptureMapGimmick_C_Update");
static_assert(sizeof(BP_PlayerActionStateCaptureMapGimmick_C_Update) == 0x000030, "Wrong size on BP_PlayerActionStateCaptureMapGimmick_C_Update");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Update, ReturnValue) == 0x000000, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Update::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Update, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Update, CallFunc_IsPlayBlendAnimMontage_bPlay) == 0x000005, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Update::CallFunc_IsPlayBlendAnimMontage_bPlay' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Update, CallFunc_IsPlayBlendAnimMontage_bPlay_1) == 0x000006, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Update::CallFunc_IsPlayBlendAnimMontage_bPlay_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Update, CallFunc_SetInvalidDamage_Dummy) == 0x000007, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Update::CallFunc_SetInvalidDamage_Dummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Update, CallFunc_IsActionStatus_Result) == 0x000008, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Update::CallFunc_IsActionStatus_Result' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Update, CallFunc_IsActionStatus_Result_1) == 0x000009, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Update::CallFunc_IsActionStatus_Result_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Update, CallFunc_GetPlayerManager_PlayerManager) == 0x000010, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Update::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Update, CallFunc_GetPlayer_ReturnValue) == 0x000018, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Update::CallFunc_GetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Update, K2Node_DynamicCast_AsRs_Battle_Hero) == 0x000020, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Update::K2Node_DynamicCast_AsRs_Battle_Hero' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Update, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Update::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Update, K2Node_SwitchInteger_CmpSuccess) == 0x000029, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Update::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function BP_PlayerActionStateCaptureMapGimmick.BP_PlayerActionStateCaptureMapGimmick_C.Transition
// 0x0020 (0x0020 - 0x0000)
struct BP_PlayerActionStateCaptureMapGimmick_C_Transition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45DE[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MapGimmickObjectBase_C*             K2Node_DynamicCast_AsBP_Map_Gimmick_Object_Base;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45DF[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionStatus_Result;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCancelMapGimmick_bCancel;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Transition_ReturnValue;                   // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateCaptureMapGimmick_C_Transition) == 0x000008, "Wrong alignment on BP_PlayerActionStateCaptureMapGimmick_C_Transition");
static_assert(sizeof(BP_PlayerActionStateCaptureMapGimmick_C_Transition) == 0x000020, "Wrong size on BP_PlayerActionStateCaptureMapGimmick_C_Transition");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Transition, ReturnValue) == 0x000000, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Transition::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Transition, K2Node_DynamicCast_AsBP_Map_Gimmick_Object_Base) == 0x000008, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Transition::K2Node_DynamicCast_AsBP_Map_Gimmick_Object_Base' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Transition, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Transition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Transition, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000014, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Transition::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Transition, CallFunc_IsActionStatus_Result) == 0x000018, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Transition::CallFunc_IsActionStatus_Result' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Transition, CallFunc_IsCancelMapGimmick_bCancel) == 0x000019, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Transition::CallFunc_IsCancelMapGimmick_bCancel' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Transition, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Transition::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_Transition, CallFunc_Transition_ReturnValue) == 0x00001B, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_Transition::CallFunc_Transition_ReturnValue' has a wrong offset!");

// Function BP_PlayerActionStateCaptureMapGimmick.BP_PlayerActionStateCaptureMapGimmick_C.OnExecMapGimmickEvent
// 0x0030 (0x0030 - 0x0000)
struct BP_PlayerActionStateCaptureMapGimmick_C_OnExecMapGimmickEvent final
{
public:
	class AMapGimmickObject*                      Param_MapGimmick;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetInvalidDamage_Dummy;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45E0[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MapGimmickObjectBase_C*             K2Node_DynamicCast_AsBP_Map_Gimmick_Object_Base;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45E1[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetPlayerFinishAnimation_AnimMontage;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanAddDriveGauge_ReturnValue;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateCaptureMapGimmick_C_OnExecMapGimmickEvent) == 0x000008, "Wrong alignment on BP_PlayerActionStateCaptureMapGimmick_C_OnExecMapGimmickEvent");
static_assert(sizeof(BP_PlayerActionStateCaptureMapGimmick_C_OnExecMapGimmickEvent) == 0x000030, "Wrong size on BP_PlayerActionStateCaptureMapGimmick_C_OnExecMapGimmickEvent");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_OnExecMapGimmickEvent, Param_MapGimmick) == 0x000000, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_OnExecMapGimmickEvent::Param_MapGimmick' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_OnExecMapGimmickEvent, CallFunc_SetInvalidDamage_Dummy) == 0x000008, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_OnExecMapGimmickEvent::CallFunc_SetInvalidDamage_Dummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_OnExecMapGimmickEvent, K2Node_DynamicCast_AsBP_Map_Gimmick_Object_Base) == 0x000010, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_OnExecMapGimmickEvent::K2Node_DynamicCast_AsBP_Map_Gimmick_Object_Base' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_OnExecMapGimmickEvent, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_OnExecMapGimmickEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_OnExecMapGimmickEvent, CallFunc_GetPlayerFinishAnimation_AnimMontage) == 0x000020, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_OnExecMapGimmickEvent::CallFunc_GetPlayerFinishAnimation_AnimMontage' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_OnExecMapGimmickEvent, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_OnExecMapGimmickEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_OnExecMapGimmickEvent, CallFunc_CanAddDriveGauge_ReturnValue) == 0x000029, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_OnExecMapGimmickEvent::CallFunc_CanAddDriveGauge_ReturnValue' has a wrong offset!");

// Function BP_PlayerActionStateCaptureMapGimmick.BP_PlayerActionStateCaptureMapGimmick_C.PlayVibration
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerActionStateCaptureMapGimmick_C_PlayVibration final
{
public:
	class ABP_GameSystemManager_C*                CallFunc_GetGameSystemManager_Manager;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerActionStateCaptureMapGimmick_C_PlayVibration) == 0x000008, "Wrong alignment on BP_PlayerActionStateCaptureMapGimmick_C_PlayVibration");
static_assert(sizeof(BP_PlayerActionStateCaptureMapGimmick_C_PlayVibration) == 0x000008, "Wrong size on BP_PlayerActionStateCaptureMapGimmick_C_PlayVibration");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_PlayVibration, CallFunc_GetGameSystemManager_Manager) == 0x000000, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_PlayVibration::CallFunc_GetGameSystemManager_Manager' has a wrong offset!");

// Function BP_PlayerActionStateCaptureMapGimmick.BP_PlayerActionStateCaptureMapGimmick_C.StopVibration
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerActionStateCaptureMapGimmick_C_StopVibration final
{
public:
	class ABP_GameSystemManager_C*                CallFunc_GetGameSystemManager_Manager;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerActionStateCaptureMapGimmick_C_StopVibration) == 0x000008, "Wrong alignment on BP_PlayerActionStateCaptureMapGimmick_C_StopVibration");
static_assert(sizeof(BP_PlayerActionStateCaptureMapGimmick_C_StopVibration) == 0x000008, "Wrong size on BP_PlayerActionStateCaptureMapGimmick_C_StopVibration");
static_assert(offsetof(BP_PlayerActionStateCaptureMapGimmick_C_StopVibration, CallFunc_GetGameSystemManager_Manager) == 0x000000, "Member 'BP_PlayerActionStateCaptureMapGimmick_C_StopVibration::CallFunc_GetGameSystemManager_Manager' has a wrong offset!");

}

