#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PsychicObjectDestructibleBasic

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PsychicObjectDestructibleBasic.BP_PsychicObjectDestructibleBasic_C
// 0x0018 (0x0248 - 0x0230)
class ABP_PsychicObjectDestructibleBasic_C final : public AActor
{
public:
	class UArrowComponent*                        DestructPoint;                                     // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDestructibleComponent*                 Destructible;                                      // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PsychicObjectDestructibleBasic_C">();
	}
	static class ABP_PsychicObjectDestructibleBasic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PsychicObjectDestructibleBasic_C>();
	}
};
static_assert(alignof(ABP_PsychicObjectDestructibleBasic_C) == 0x000008, "Wrong alignment on ABP_PsychicObjectDestructibleBasic_C");
static_assert(sizeof(ABP_PsychicObjectDestructibleBasic_C) == 0x000248, "Wrong size on ABP_PsychicObjectDestructibleBasic_C");
static_assert(offsetof(ABP_PsychicObjectDestructibleBasic_C, DestructPoint) == 0x000230, "Member 'ABP_PsychicObjectDestructibleBasic_C::DestructPoint' has a wrong offset!");
static_assert(offsetof(ABP_PsychicObjectDestructibleBasic_C, Destructible) == 0x000238, "Member 'ABP_PsychicObjectDestructibleBasic_C::Destructible' has a wrong offset!");
static_assert(offsetof(ABP_PsychicObjectDestructibleBasic_C, DefaultSceneRoot) == 0x000240, "Member 'ABP_PsychicObjectDestructibleBasic_C::DefaultSceneRoot' has a wrong offset!");

}

