#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerActionStateWakeUp

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "BP_PlayerActionStateCommonBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerActionStateWakeUp.BP_PlayerActionStateWakeUp_C
// 0x0010 (0x00F8 - 0x00E8)
class UBP_PlayerActionStateWakeUp_C final : public UBP_PlayerActionStateCommonBase_C
{
public:
	class FName                                   ClaimantName;                                      // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InvalidDamageTimer;                                // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerDownType                               WakeUpType;                                        // 0x00F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int32 Enter(int32 Param);
	int32 Update();
	int32 Exit(int32 NextStateIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerActionStateWakeUp_C">();
	}
	static class UBP_PlayerActionStateWakeUp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PlayerActionStateWakeUp_C>();
	}
};
static_assert(alignof(UBP_PlayerActionStateWakeUp_C) == 0x000008, "Wrong alignment on UBP_PlayerActionStateWakeUp_C");
static_assert(sizeof(UBP_PlayerActionStateWakeUp_C) == 0x0000F8, "Wrong size on UBP_PlayerActionStateWakeUp_C");
static_assert(offsetof(UBP_PlayerActionStateWakeUp_C, ClaimantName) == 0x0000E8, "Member 'UBP_PlayerActionStateWakeUp_C::ClaimantName' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateWakeUp_C, InvalidDamageTimer) == 0x0000F0, "Member 'UBP_PlayerActionStateWakeUp_C::InvalidDamageTimer' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateWakeUp_C, WakeUpType) == 0x0000F4, "Member 'UBP_PlayerActionStateWakeUp_C::WakeUpType' has a wrong offset!");

}

