#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerActionStateEvent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EPlayerTalkTurnType_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerActionStateEvent.BP_PlayerActionStateEvent_C.ExecuteUbergraph_BP_PlayerActionStateEvent
// 0x001C (0x001C - 0x0000)
struct BP_PlayerActionStateEvent_C_ExecuteUbergraph_BP_PlayerActionStateEvent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FC6[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float LookAtAngle)>            K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateEvent_C_ExecuteUbergraph_BP_PlayerActionStateEvent) == 0x000004, "Wrong alignment on BP_PlayerActionStateEvent_C_ExecuteUbergraph_BP_PlayerActionStateEvent");
static_assert(sizeof(BP_PlayerActionStateEvent_C_ExecuteUbergraph_BP_PlayerActionStateEvent) == 0x00001C, "Wrong size on BP_PlayerActionStateEvent_C_ExecuteUbergraph_BP_PlayerActionStateEvent");
static_assert(offsetof(BP_PlayerActionStateEvent_C_ExecuteUbergraph_BP_PlayerActionStateEvent, EntryPoint) == 0x000000, "Member 'BP_PlayerActionStateEvent_C_ExecuteUbergraph_BP_PlayerActionStateEvent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_ExecuteUbergraph_BP_PlayerActionStateEvent, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_PlayerActionStateEvent_C_ExecuteUbergraph_BP_PlayerActionStateEvent::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_ExecuteUbergraph_BP_PlayerActionStateEvent, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'BP_PlayerActionStateEvent_C_ExecuteUbergraph_BP_PlayerActionStateEvent::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_ExecuteUbergraph_BP_PlayerActionStateEvent, Temp_bool_Has_Been_Initd_Variable_1) == 0x000006, "Member 'BP_PlayerActionStateEvent_C_ExecuteUbergraph_BP_PlayerActionStateEvent::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_ExecuteUbergraph_BP_PlayerActionStateEvent, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_PlayerActionStateEvent_C_ExecuteUbergraph_BP_PlayerActionStateEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_ExecuteUbergraph_BP_PlayerActionStateEvent, Temp_bool_IsClosed_Variable_1) == 0x000018, "Member 'BP_PlayerActionStateEvent_C_ExecuteUbergraph_BP_PlayerActionStateEvent::Temp_bool_IsClosed_Variable_1' has a wrong offset!");

// Function BP_PlayerActionStateEvent.BP_PlayerActionStateEvent_C.Enter
// 0x0028 (0x0028 - 0x0000)
struct BP_PlayerActionStateEvent_C_Enter final
{
public:
	int32                                         Param;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Enter_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FC7[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_PlayerAnimInstanceInterface_C> K2Node_DynamicCast_AsBP_Player_Anim_Instance_Interface; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BeginEvent_bDummy;                        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateEvent_C_Enter) == 0x000008, "Wrong alignment on BP_PlayerActionStateEvent_C_Enter");
static_assert(sizeof(BP_PlayerActionStateEvent_C_Enter) == 0x000028, "Wrong size on BP_PlayerActionStateEvent_C_Enter");
static_assert(offsetof(BP_PlayerActionStateEvent_C_Enter, Param) == 0x000000, "Member 'BP_PlayerActionStateEvent_C_Enter::Param' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_Enter, ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateEvent_C_Enter::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_Enter, CallFunc_Enter_ReturnValue) == 0x000008, "Member 'BP_PlayerActionStateEvent_C_Enter::CallFunc_Enter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_Enter, K2Node_DynamicCast_AsBP_Player_Anim_Instance_Interface) == 0x000010, "Member 'BP_PlayerActionStateEvent_C_Enter::K2Node_DynamicCast_AsBP_Player_Anim_Instance_Interface' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_Enter, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_PlayerActionStateEvent_C_Enter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_Enter, CallFunc_BeginEvent_bDummy) == 0x000021, "Member 'BP_PlayerActionStateEvent_C_Enter::CallFunc_BeginEvent_bDummy' has a wrong offset!");

// Function BP_PlayerActionStateEvent.BP_PlayerActionStateEvent_C.OnTalkTurn
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerActionStateEvent_C_OnTalkTurn final
{
public:
	float                                         Angle;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerTalkTurnType                           TurnType;                                          // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FC8[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateEvent_C_OnTalkTurn) == 0x000004, "Wrong alignment on BP_PlayerActionStateEvent_C_OnTalkTurn");
static_assert(sizeof(BP_PlayerActionStateEvent_C_OnTalkTurn) == 0x000010, "Wrong size on BP_PlayerActionStateEvent_C_OnTalkTurn");
static_assert(offsetof(BP_PlayerActionStateEvent_C_OnTalkTurn, Angle) == 0x000000, "Member 'BP_PlayerActionStateEvent_C_OnTalkTurn::Angle' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_OnTalkTurn, TurnType) == 0x000004, "Member 'BP_PlayerActionStateEvent_C_OnTalkTurn::TurnType' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_OnTalkTurn, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'BP_PlayerActionStateEvent_C_OnTalkTurn::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_OnTalkTurn, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_PlayerActionStateEvent_C_OnTalkTurn::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_OnTalkTurn, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00000D, "Member 'BP_PlayerActionStateEvent_C_OnTalkTurn::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_OnTalkTurn, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x00000E, "Member 'BP_PlayerActionStateEvent_C_OnTalkTurn::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function BP_PlayerActionStateEvent.BP_PlayerActionStateEvent_C.Update
// 0x0058 (0x0058 - 0x0000)
struct BP_PlayerActionStateEvent_C_Update final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FC9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_GetTalkLookAtLocation_self_CastInput;     // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetTalkLookAtLocation_bTalkLookAt;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FCA[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetTalkLookAtLocation_Location;           // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_LookAtInterface_C> CallFunc_SetEventLookAtLocation_self_CastInput;    // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetEventLookAtLocation_bDummy;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FCB[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_IsAnimationEndTalkTurn_self_CastInput;    // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationEndTalkTurn_bAnimation;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateEvent_C_Update) == 0x000008, "Wrong alignment on BP_PlayerActionStateEvent_C_Update");
static_assert(sizeof(BP_PlayerActionStateEvent_C_Update) == 0x000058, "Wrong size on BP_PlayerActionStateEvent_C_Update");
static_assert(offsetof(BP_PlayerActionStateEvent_C_Update, ReturnValue) == 0x000000, "Member 'BP_PlayerActionStateEvent_C_Update::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_Update, CallFunc_GetTalkLookAtLocation_self_CastInput) == 0x000008, "Member 'BP_PlayerActionStateEvent_C_Update::CallFunc_GetTalkLookAtLocation_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_Update, CallFunc_GetTalkLookAtLocation_bTalkLookAt) == 0x000018, "Member 'BP_PlayerActionStateEvent_C_Update::CallFunc_GetTalkLookAtLocation_bTalkLookAt' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_Update, CallFunc_GetTalkLookAtLocation_Location) == 0x00001C, "Member 'BP_PlayerActionStateEvent_C_Update::CallFunc_GetTalkLookAtLocation_Location' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_Update, CallFunc_SetEventLookAtLocation_self_CastInput) == 0x000028, "Member 'BP_PlayerActionStateEvent_C_Update::CallFunc_SetEventLookAtLocation_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_Update, CallFunc_SetEventLookAtLocation_bDummy) == 0x000038, "Member 'BP_PlayerActionStateEvent_C_Update::CallFunc_SetEventLookAtLocation_bDummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_Update, CallFunc_IsAnimationEndTalkTurn_self_CastInput) == 0x000040, "Member 'BP_PlayerActionStateEvent_C_Update::CallFunc_IsAnimationEndTalkTurn_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_Update, CallFunc_IsAnimationEndTalkTurn_bAnimation) == 0x000050, "Member 'BP_PlayerActionStateEvent_C_Update::CallFunc_IsAnimationEndTalkTurn_bAnimation' has a wrong offset!");

// Function BP_PlayerActionStateEvent.BP_PlayerActionStateEvent_C.Exit
// 0x0040 (0x0040 - 0x0000)
struct BP_PlayerActionStateEvent_C_Exit final
{
public:
	int32                                         NextStateIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Exit_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FCC[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_EndTalkLookAtTurn_self_CastInput;         // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EndTalkLookAtTurn_bDummy;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FCD[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_PlayerAnimInstanceInterface_C> K2Node_DynamicCast_AsBP_Player_Anim_Instance_Interface; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EndEvent_bDummy;                          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateEvent_C_Exit) == 0x000008, "Wrong alignment on BP_PlayerActionStateEvent_C_Exit");
static_assert(sizeof(BP_PlayerActionStateEvent_C_Exit) == 0x000040, "Wrong size on BP_PlayerActionStateEvent_C_Exit");
static_assert(offsetof(BP_PlayerActionStateEvent_C_Exit, NextStateIndex) == 0x000000, "Member 'BP_PlayerActionStateEvent_C_Exit::NextStateIndex' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_Exit, ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateEvent_C_Exit::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_Exit, CallFunc_Exit_ReturnValue) == 0x000008, "Member 'BP_PlayerActionStateEvent_C_Exit::CallFunc_Exit_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_Exit, CallFunc_EndTalkLookAtTurn_self_CastInput) == 0x000010, "Member 'BP_PlayerActionStateEvent_C_Exit::CallFunc_EndTalkLookAtTurn_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_Exit, CallFunc_EndTalkLookAtTurn_bDummy) == 0x000020, "Member 'BP_PlayerActionStateEvent_C_Exit::CallFunc_EndTalkLookAtTurn_bDummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_Exit, K2Node_DynamicCast_AsBP_Player_Anim_Instance_Interface) == 0x000028, "Member 'BP_PlayerActionStateEvent_C_Exit::K2Node_DynamicCast_AsBP_Player_Anim_Instance_Interface' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_Exit, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_PlayerActionStateEvent_C_Exit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEvent_C_Exit, CallFunc_EndEvent_bDummy) == 0x000039, "Member 'BP_PlayerActionStateEvent_C_Exit::CallFunc_EndEvent_bDummy' has a wrong offset!");

}

