#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerActionStateCancelMapGimmick

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerActionStateCancelMapGimmick.BP_PlayerActionStateCancelMapGimmick_C.ExecuteUbergraph_BP_PlayerActionStateCancelMapGimmick
// 0x0020 (0x0020 - 0x0000)
struct BP_PlayerActionStateCancelMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCancelMapGimmick final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9860[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARsBattleHero_C*                        K2Node_DynamicCast_AsRs_Battle_Hero;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateCancelMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCancelMapGimmick) == 0x000008, "Wrong alignment on BP_PlayerActionStateCancelMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCancelMapGimmick");
static_assert(sizeof(BP_PlayerActionStateCancelMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCancelMapGimmick) == 0x000020, "Wrong size on BP_PlayerActionStateCancelMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCancelMapGimmick");
static_assert(offsetof(BP_PlayerActionStateCancelMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCancelMapGimmick, EntryPoint) == 0x000000, "Member 'BP_PlayerActionStateCancelMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCancelMapGimmick::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCancelMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCancelMapGimmick, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_PlayerActionStateCancelMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCancelMapGimmick::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCancelMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCancelMapGimmick, K2Node_DynamicCast_AsRs_Battle_Hero) == 0x000010, "Member 'BP_PlayerActionStateCancelMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCancelMapGimmick::K2Node_DynamicCast_AsRs_Battle_Hero' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCancelMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCancelMapGimmick, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_PlayerActionStateCancelMapGimmick_C_ExecuteUbergraph_BP_PlayerActionStateCancelMapGimmick::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_PlayerActionStateCancelMapGimmick.BP_PlayerActionStateCancelMapGimmick_C.Enter
// 0x0068 (0x0068 - 0x0000)
struct BP_PlayerActionStateCancelMapGimmick_C_Enter final
{
public:
	int32                                         Param;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Enter_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9861[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      CallFunc_GetPlayerID_self_CastInput;               // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9862[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMapGimmickObject*                      CallFunc_GetMapGimmickObject_MapGimmickObject;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9863[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MapGimmickObjectBase_C*             K2Node_DynamicCast_AsBP_Map_Gimmick_Object_Base;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9864[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetPlayerEndAnimation_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_LookAtInterface_C> CallFunc_SetLookAtEnable_self_CastInput;           // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetLookAtEnable_bResult;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateCancelMapGimmick_C_Enter) == 0x000008, "Wrong alignment on BP_PlayerActionStateCancelMapGimmick_C_Enter");
static_assert(sizeof(BP_PlayerActionStateCancelMapGimmick_C_Enter) == 0x000068, "Wrong size on BP_PlayerActionStateCancelMapGimmick_C_Enter");
static_assert(offsetof(BP_PlayerActionStateCancelMapGimmick_C_Enter, Param) == 0x000000, "Member 'BP_PlayerActionStateCancelMapGimmick_C_Enter::Param' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCancelMapGimmick_C_Enter, ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateCancelMapGimmick_C_Enter::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCancelMapGimmick_C_Enter, CallFunc_Enter_ReturnValue) == 0x000008, "Member 'BP_PlayerActionStateCancelMapGimmick_C_Enter::CallFunc_Enter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCancelMapGimmick_C_Enter, CallFunc_GetPlayerID_self_CastInput) == 0x000010, "Member 'BP_PlayerActionStateCancelMapGimmick_C_Enter::CallFunc_GetPlayerID_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCancelMapGimmick_C_Enter, CallFunc_GetPlayerID_ReturnValue) == 0x000020, "Member 'BP_PlayerActionStateCancelMapGimmick_C_Enter::CallFunc_GetPlayerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCancelMapGimmick_C_Enter, CallFunc_GetMapGimmickObject_MapGimmickObject) == 0x000028, "Member 'BP_PlayerActionStateCancelMapGimmick_C_Enter::CallFunc_GetMapGimmickObject_MapGimmickObject' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCancelMapGimmick_C_Enter, CallFunc_Conv_IntToByte_ReturnValue) == 0x000030, "Member 'BP_PlayerActionStateCancelMapGimmick_C_Enter::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCancelMapGimmick_C_Enter, K2Node_DynamicCast_AsBP_Map_Gimmick_Object_Base) == 0x000038, "Member 'BP_PlayerActionStateCancelMapGimmick_C_Enter::K2Node_DynamicCast_AsBP_Map_Gimmick_Object_Base' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCancelMapGimmick_C_Enter, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_PlayerActionStateCancelMapGimmick_C_Enter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCancelMapGimmick_C_Enter, CallFunc_GetValidValue_ReturnValue) == 0x000041, "Member 'BP_PlayerActionStateCancelMapGimmick_C_Enter::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCancelMapGimmick_C_Enter, CallFunc_GetPlayerEndAnimation_ReturnValue) == 0x000048, "Member 'BP_PlayerActionStateCancelMapGimmick_C_Enter::CallFunc_GetPlayerEndAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCancelMapGimmick_C_Enter, CallFunc_SetLookAtEnable_self_CastInput) == 0x000050, "Member 'BP_PlayerActionStateCancelMapGimmick_C_Enter::CallFunc_SetLookAtEnable_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCancelMapGimmick_C_Enter, CallFunc_SetLookAtEnable_bResult) == 0x000060, "Member 'BP_PlayerActionStateCancelMapGimmick_C_Enter::CallFunc_SetLookAtEnable_bResult' has a wrong offset!");

// Function BP_PlayerActionStateCancelMapGimmick.BP_PlayerActionStateCancelMapGimmick_C.Exit
// 0x000C (0x000C - 0x0000)
struct BP_PlayerActionStateCancelMapGimmick_C_Exit final
{
public:
	int32                                         NextStateIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Exit_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerActionStateCancelMapGimmick_C_Exit) == 0x000004, "Wrong alignment on BP_PlayerActionStateCancelMapGimmick_C_Exit");
static_assert(sizeof(BP_PlayerActionStateCancelMapGimmick_C_Exit) == 0x00000C, "Wrong size on BP_PlayerActionStateCancelMapGimmick_C_Exit");
static_assert(offsetof(BP_PlayerActionStateCancelMapGimmick_C_Exit, NextStateIndex) == 0x000000, "Member 'BP_PlayerActionStateCancelMapGimmick_C_Exit::NextStateIndex' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCancelMapGimmick_C_Exit, ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateCancelMapGimmick_C_Exit::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCancelMapGimmick_C_Exit, CallFunc_Exit_ReturnValue) == 0x000008, "Member 'BP_PlayerActionStateCancelMapGimmick_C_Exit::CallFunc_Exit_ReturnValue' has a wrong offset!");

// Function BP_PlayerActionStateCancelMapGimmick.BP_PlayerActionStateCancelMapGimmick_C.Update
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerActionStateCancelMapGimmick_C_Update final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayBlendAnimMontage_bPlay;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateCancelMapGimmick_C_Update) == 0x000004, "Wrong alignment on BP_PlayerActionStateCancelMapGimmick_C_Update");
static_assert(sizeof(BP_PlayerActionStateCancelMapGimmick_C_Update) == 0x000008, "Wrong size on BP_PlayerActionStateCancelMapGimmick_C_Update");
static_assert(offsetof(BP_PlayerActionStateCancelMapGimmick_C_Update, ReturnValue) == 0x000000, "Member 'BP_PlayerActionStateCancelMapGimmick_C_Update::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateCancelMapGimmick_C_Update, CallFunc_IsPlayBlendAnimMontage_bPlay) == 0x000004, "Member 'BP_PlayerActionStateCancelMapGimmick_C_Update::CallFunc_IsPlayBlendAnimMontage_bPlay' has a wrong offset!");

}

