#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PsychicComponentMain

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "Engine_structs.hpp"
#include "E_SASKind_structs.hpp"
#include "PsychicObjectAttackType_structs.hpp"
#include "SPsychicCaptureMaterial_structs.hpp"
#include "PsychicObjectAttackSwingType_structs.hpp"
#include "PsychicObjectID_structs.hpp"


namespace SDK::Params
{

// Function BP_PsychicComponentMain.BP_PsychicComponentMain_C.SetupComponentParam
// 0x0038 (0x0038 - 0x0000)
struct BP_PsychicComponentMain_C_SetupComponentParam final
{
public:
	class UMeshComponent*                         Meah_comp;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         Aura_comp;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         Shadow_comp;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Dir_comp;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInertialMoveComponent_C*               Inertial_move_comp;                                // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Hit_primitive;                                     // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Attack_primitive;                                  // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicComponentMain_C_SetupComponentParam) == 0x000008, "Wrong alignment on BP_PsychicComponentMain_C_SetupComponentParam");
static_assert(sizeof(BP_PsychicComponentMain_C_SetupComponentParam) == 0x000038, "Wrong size on BP_PsychicComponentMain_C_SetupComponentParam");
static_assert(offsetof(BP_PsychicComponentMain_C_SetupComponentParam, Meah_comp) == 0x000000, "Member 'BP_PsychicComponentMain_C_SetupComponentParam::Meah_comp' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_SetupComponentParam, Aura_comp) == 0x000008, "Member 'BP_PsychicComponentMain_C_SetupComponentParam::Aura_comp' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_SetupComponentParam, Shadow_comp) == 0x000010, "Member 'BP_PsychicComponentMain_C_SetupComponentParam::Shadow_comp' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_SetupComponentParam, Dir_comp) == 0x000018, "Member 'BP_PsychicComponentMain_C_SetupComponentParam::Dir_comp' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_SetupComponentParam, Inertial_move_comp) == 0x000020, "Member 'BP_PsychicComponentMain_C_SetupComponentParam::Inertial_move_comp' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_SetupComponentParam, Hit_primitive) == 0x000028, "Member 'BP_PsychicComponentMain_C_SetupComponentParam::Hit_primitive' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_SetupComponentParam, Attack_primitive) == 0x000030, "Member 'BP_PsychicComponentMain_C_SetupComponentParam::Attack_primitive' has a wrong offset!");

// Function BP_PsychicComponentMain.BP_PsychicComponentMain_C.Update
// 0x00A0 (0x00A0 - 0x0000)
struct BP_PsychicComponentMain_C_Update final
{
public:
	float                                         Delta_second;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F32[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 L_str;                                             // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F33[0xF];                                     // 0x0021(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class APsychicObjectManager_C*                CallFunc_GetPsychicObjectManager_PsyObjManager;    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayerFixParamater_C*               CallFunc_GetPlayerFixParam_Param;                  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F34[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F35[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicComponentMain_C_Update) == 0x000010, "Wrong alignment on BP_PsychicComponentMain_C_Update");
static_assert(sizeof(BP_PsychicComponentMain_C_Update) == 0x0000A0, "Wrong size on BP_PsychicComponentMain_C_Update");
static_assert(offsetof(BP_PsychicComponentMain_C_Update, Delta_second) == 0x000000, "Member 'BP_PsychicComponentMain_C_Update::Delta_second' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_Update, L_str) == 0x000008, "Member 'BP_PsychicComponentMain_C_Update::L_str' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_Update, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_PsychicComponentMain_C_Update::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_Update, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_PsychicComponentMain_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_Update, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'BP_PsychicComponentMain_C_Update::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_Update, CallFunc_GetPsychicObjectManager_PsyObjManager) == 0x000060, "Member 'BP_PsychicComponentMain_C_Update::CallFunc_GetPsychicObjectManager_PsyObjManager' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_Update, CallFunc_GetPlayerFixParam_Param) == 0x000068, "Member 'BP_PsychicComponentMain_C_Update::CallFunc_GetPlayerFixParam_Param' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_Update, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'BP_PsychicComponentMain_C_Update::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_Update, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000074, "Member 'BP_PsychicComponentMain_C_Update::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_Update, CallFunc_IsValid_ReturnValue_2) == 0x000080, "Member 'BP_PsychicComponentMain_C_Update::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_Update, CallFunc_GetOwner_ReturnValue_1) == 0x000088, "Member 'BP_PsychicComponentMain_C_Update::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_Update, CallFunc_IsValid_ReturnValue_3) == 0x000090, "Member 'BP_PsychicComponentMain_C_Update::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function BP_PsychicComponentMain.BP_PsychicComponentMain_C.UpdateThrowLinear
// 0x0128 (0x0128 - 0x0000)
struct BP_PsychicComponentMain_C_UpdateThrowLinear final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          L_checkFloor;                                      // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F36[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               L_rot;                                             // 0x0008(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         L_deltaSec;                                        // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F37[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckHitBackground_return;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F38[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F39[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetActorDeltaSeconds_ReturnValue;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_NegateRotator_ReturnValue;                // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0098(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicComponentMain_C_UpdateThrowLinear) == 0x000008, "Wrong alignment on BP_PsychicComponentMain_C_UpdateThrowLinear");
static_assert(sizeof(BP_PsychicComponentMain_C_UpdateThrowLinear) == 0x000128, "Wrong size on BP_PsychicComponentMain_C_UpdateThrowLinear");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateThrowLinear, DeltaSeconds) == 0x000000, "Member 'BP_PsychicComponentMain_C_UpdateThrowLinear::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateThrowLinear, L_checkFloor) == 0x000004, "Member 'BP_PsychicComponentMain_C_UpdateThrowLinear::L_checkFloor' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateThrowLinear, L_rot) == 0x000008, "Member 'BP_PsychicComponentMain_C_UpdateThrowLinear::L_rot' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateThrowLinear, L_deltaSec) == 0x000014, "Member 'BP_PsychicComponentMain_C_UpdateThrowLinear::L_deltaSec' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateThrowLinear, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'BP_PsychicComponentMain_C_UpdateThrowLinear::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateThrowLinear, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BP_PsychicComponentMain_C_UpdateThrowLinear::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateThrowLinear, CallFunc_CheckHitBackground_return) == 0x000028, "Member 'BP_PsychicComponentMain_C_UpdateThrowLinear::CallFunc_CheckHitBackground_return' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateThrowLinear, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00002C, "Member 'BP_PsychicComponentMain_C_UpdateThrowLinear::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateThrowLinear, CallFunc_GetOwner_ReturnValue_1) == 0x000038, "Member 'BP_PsychicComponentMain_C_UpdateThrowLinear::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateThrowLinear, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_PsychicComponentMain_C_UpdateThrowLinear::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateThrowLinear, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000044, "Member 'BP_PsychicComponentMain_C_UpdateThrowLinear::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateThrowLinear, CallFunc_GetActorDeltaSeconds_ReturnValue) == 0x000050, "Member 'BP_PsychicComponentMain_C_UpdateThrowLinear::CallFunc_GetActorDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateThrowLinear, CallFunc_NegateRotator_ReturnValue) == 0x000054, "Member 'BP_PsychicComponentMain_C_UpdateThrowLinear::CallFunc_NegateRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateThrowLinear, CallFunc_MakeRotFromX_ReturnValue) == 0x000060, "Member 'BP_PsychicComponentMain_C_UpdateThrowLinear::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateThrowLinear, CallFunc_ComposeRotators_ReturnValue) == 0x00006C, "Member 'BP_PsychicComponentMain_C_UpdateThrowLinear::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateThrowLinear, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000078, "Member 'BP_PsychicComponentMain_C_UpdateThrowLinear::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateThrowLinear, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00007C, "Member 'BP_PsychicComponentMain_C_UpdateThrowLinear::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateThrowLinear, CallFunc_Add_FloatFloat_ReturnValue) == 0x000088, "Member 'BP_PsychicComponentMain_C_UpdateThrowLinear::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateThrowLinear, CallFunc_Add_VectorVector_ReturnValue) == 0x00008C, "Member 'BP_PsychicComponentMain_C_UpdateThrowLinear::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateThrowLinear, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x000098, "Member 'BP_PsychicComponentMain_C_UpdateThrowLinear::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateThrowLinear, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x000120, "Member 'BP_PsychicComponentMain_C_UpdateThrowLinear::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");

// Function BP_PsychicComponentMain.BP_PsychicComponentMain_C.StartMoveThrow
// 0x0018 (0x0018 - 0x0000)
struct BP_PsychicComponentMain_C_StartMoveThrow final
{
public:
	struct FVector                                WorkPos;                                           // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WorkScale;                                         // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicComponentMain_C_StartMoveThrow) == 0x000004, "Wrong alignment on BP_PsychicComponentMain_C_StartMoveThrow");
static_assert(sizeof(BP_PsychicComponentMain_C_StartMoveThrow) == 0x000018, "Wrong size on BP_PsychicComponentMain_C_StartMoveThrow");
static_assert(offsetof(BP_PsychicComponentMain_C_StartMoveThrow, WorkPos) == 0x000000, "Member 'BP_PsychicComponentMain_C_StartMoveThrow::WorkPos' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_StartMoveThrow, WorkScale) == 0x00000C, "Member 'BP_PsychicComponentMain_C_StartMoveThrow::WorkScale' has a wrong offset!");

// Function BP_PsychicComponentMain.BP_PsychicComponentMain_C.CalcDirectionVectorToTarget
// 0x0128 (0x0128 - 0x0000)
struct BP_PsychicComponentMain_C_CalcDirectionVectorToTarget final
{
public:
	bool                                          bPlayerTarget;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bNowRot;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F3A[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F3B[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TargetadjustZ;                                     // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetDiffZ;                                       // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OwnRot;                                            // 0x001C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                TgtPos;                                            // 0x0028(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDone;                                             // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F3C[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TgtActor;                                          // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F3D[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetGrabOwnerTarget_target;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F3E[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAttackPos_attack_pos;                  // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F3F[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue_1; // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget) == 0x000008, "Wrong alignment on BP_PsychicComponentMain_C_CalcDirectionVectorToTarget");
static_assert(sizeof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget) == 0x000128, "Wrong size on BP_PsychicComponentMain_C_CalcDirectionVectorToTarget");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, bPlayerTarget) == 0x000000, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::bPlayerTarget' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, bNowRot) == 0x000001, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::bNowRot' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, ReturnValue) == 0x000004, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, Return) == 0x000010, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::Return' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, TargetadjustZ) == 0x000014, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::TargetadjustZ' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, TargetDiffZ) == 0x000018, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::TargetDiffZ' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, OwnRot) == 0x00001C, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::OwnRot' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, TgtPos) == 0x000028, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::TgtPos' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, bDone) == 0x000034, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::bDone' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, TgtActor) == 0x000038, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::TgtActor' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000048, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_GetGrabOwnerTarget_target) == 0x000058, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_GetGrabOwnerTarget_target' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_MakeVector_ReturnValue) == 0x000060, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000070, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_BreakVector_X) == 0x000078, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_BreakVector_Y) == 0x00007C, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_BreakVector_Z) == 0x000080, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_GetCameraRotation_ReturnValue) == 0x000084, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x000090, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_GetAttackPos_attack_pos) == 0x00009C, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_GetAttackPos_attack_pos' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_GetOwner_ReturnValue_1) == 0x0000B0, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_GetActorScale3D_ReturnValue) == 0x0000B8, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000C4, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_BreakVector_X_1) == 0x0000D0, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_BreakVector_Y_1) == 0x0000D4, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_BreakVector_Z_1) == 0x0000D8, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000DC, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000E0, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0000E4, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_MakeVector_ReturnValue_1) == 0x0000E8, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_GreaterGreater_VectorRotator_ReturnValue_1) == 0x0000F4, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_GreaterGreater_VectorRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_Add_VectorVector_ReturnValue) == 0x000100, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00010C, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_CalcDirectionVectorToTarget, CallFunc_Normal_ReturnValue) == 0x000118, "Member 'BP_PsychicComponentMain_C_CalcDirectionVectorToTarget::CallFunc_Normal_ReturnValue' has a wrong offset!");

// Function BP_PsychicComponentMain.BP_PsychicComponentMain_C.SetAttackThrow
// 0x0010 (0x0010 - 0x0000)
struct BP_PsychicComponentMain_C_SetAttackThrow final
{
public:
	class AActor*                                 Param_TargetActor;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Force_throw;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Psychic_combo;                                     // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Psychic_ex_in;                                     // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Check_attach;                                      // 0x000B(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicComponentMain_C_SetAttackThrow) == 0x000008, "Wrong alignment on BP_PsychicComponentMain_C_SetAttackThrow");
static_assert(sizeof(BP_PsychicComponentMain_C_SetAttackThrow) == 0x000010, "Wrong size on BP_PsychicComponentMain_C_SetAttackThrow");
static_assert(offsetof(BP_PsychicComponentMain_C_SetAttackThrow, Param_TargetActor) == 0x000000, "Member 'BP_PsychicComponentMain_C_SetAttackThrow::Param_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_SetAttackThrow, Force_throw) == 0x000008, "Member 'BP_PsychicComponentMain_C_SetAttackThrow::Force_throw' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_SetAttackThrow, Psychic_combo) == 0x000009, "Member 'BP_PsychicComponentMain_C_SetAttackThrow::Psychic_combo' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_SetAttackThrow, Psychic_ex_in) == 0x00000A, "Member 'BP_PsychicComponentMain_C_SetAttackThrow::Psychic_ex_in' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_SetAttackThrow, Check_attach) == 0x00000B, "Member 'BP_PsychicComponentMain_C_SetAttackThrow::Check_attach' has a wrong offset!");

// Function BP_PsychicComponentMain.BP_PsychicComponentMain_C.UpdateGrabGauge
// 0x0018 (0x0018 - 0x0000)
struct BP_PsychicComponentMain_C_UpdateGrabGauge final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F40[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F41[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicComponentMain_C_UpdateGrabGauge) == 0x000004, "Wrong alignment on BP_PsychicComponentMain_C_UpdateGrabGauge");
static_assert(sizeof(BP_PsychicComponentMain_C_UpdateGrabGauge) == 0x000018, "Wrong size on BP_PsychicComponentMain_C_UpdateGrabGauge");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateGrabGauge, Return) == 0x000000, "Member 'BP_PsychicComponentMain_C_UpdateGrabGauge::Return' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateGrabGauge, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000001, "Member 'BP_PsychicComponentMain_C_UpdateGrabGauge::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateGrabGauge, CallFunc_Add_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_PsychicComponentMain_C_UpdateGrabGauge::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateGrabGauge, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_PsychicComponentMain_C_UpdateGrabGauge::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateGrabGauge, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00000C, "Member 'BP_PsychicComponentMain_C_UpdateGrabGauge::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateGrabGauge, CallFunc_Less_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_PsychicComponentMain_C_UpdateGrabGauge::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_UpdateGrabGauge, CallFunc_FClamp_ReturnValue) == 0x000014, "Member 'BP_PsychicComponentMain_C_UpdateGrabGauge::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function BP_PsychicComponentMain.BP_PsychicComponentMain_C.DebugDisplay
// 0x00C8 (0x00C8 - 0x0000)
struct BP_PsychicComponentMain_C_DebugDisplay final
{
public:
	class FString                                 StrDisplay;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugDisplaySearchInfo_return;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugDisplayName_return;                  // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugDisplayIndex_str_out;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugDisplayState_return;                 // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugDisplayGauge_return;                 // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugDisplayPos_return;                   // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugDisplayDistance_return;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugDisplayAttack_return;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DebugDisplayAura_return;                  // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F42[0x5];                                     // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F43[0x2];                                     // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x00B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicComponentMain_C_DebugDisplay) == 0x000008, "Wrong alignment on BP_PsychicComponentMain_C_DebugDisplay");
static_assert(sizeof(BP_PsychicComponentMain_C_DebugDisplay) == 0x0000C8, "Wrong size on BP_PsychicComponentMain_C_DebugDisplay");
static_assert(offsetof(BP_PsychicComponentMain_C_DebugDisplay, StrDisplay) == 0x000000, "Member 'BP_PsychicComponentMain_C_DebugDisplay::StrDisplay' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_DebugDisplay, CallFunc_DebugDisplaySearchInfo_return) == 0x000010, "Member 'BP_PsychicComponentMain_C_DebugDisplay::CallFunc_DebugDisplaySearchInfo_return' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_DebugDisplay, CallFunc_DebugDisplayName_return) == 0x000020, "Member 'BP_PsychicComponentMain_C_DebugDisplay::CallFunc_DebugDisplayName_return' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_DebugDisplay, CallFunc_DebugDisplayIndex_str_out) == 0x000030, "Member 'BP_PsychicComponentMain_C_DebugDisplay::CallFunc_DebugDisplayIndex_str_out' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_DebugDisplay, CallFunc_DebugDisplayState_return) == 0x000040, "Member 'BP_PsychicComponentMain_C_DebugDisplay::CallFunc_DebugDisplayState_return' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_DebugDisplay, CallFunc_DebugDisplayGauge_return) == 0x000050, "Member 'BP_PsychicComponentMain_C_DebugDisplay::CallFunc_DebugDisplayGauge_return' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_DebugDisplay, CallFunc_DebugDisplayPos_return) == 0x000060, "Member 'BP_PsychicComponentMain_C_DebugDisplay::CallFunc_DebugDisplayPos_return' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_DebugDisplay, CallFunc_DebugDisplayDistance_return) == 0x000070, "Member 'BP_PsychicComponentMain_C_DebugDisplay::CallFunc_DebugDisplayDistance_return' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_DebugDisplay, CallFunc_DebugDisplayAttack_return) == 0x000080, "Member 'BP_PsychicComponentMain_C_DebugDisplay::CallFunc_DebugDisplayAttack_return' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_DebugDisplay, CallFunc_DebugDisplayAura_return) == 0x000090, "Member 'BP_PsychicComponentMain_C_DebugDisplay::CallFunc_DebugDisplayAura_return' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_DebugDisplay, CallFunc_BooleanOR_ReturnValue) == 0x0000A0, "Member 'BP_PsychicComponentMain_C_DebugDisplay::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_DebugDisplay, CallFunc_BooleanOR_ReturnValue_1) == 0x0000A1, "Member 'BP_PsychicComponentMain_C_DebugDisplay::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_DebugDisplay, CallFunc_BooleanOR_ReturnValue_2) == 0x0000A2, "Member 'BP_PsychicComponentMain_C_DebugDisplay::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_DebugDisplay, CallFunc_GetOwner_ReturnValue) == 0x0000A8, "Member 'BP_PsychicComponentMain_C_DebugDisplay::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_DebugDisplay, CallFunc_BooleanOR_ReturnValue_3) == 0x0000B0, "Member 'BP_PsychicComponentMain_C_DebugDisplay::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_DebugDisplay, CallFunc_BooleanOR_ReturnValue_4) == 0x0000B1, "Member 'BP_PsychicComponentMain_C_DebugDisplay::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_DebugDisplay, CallFunc_SelectColor_ReturnValue) == 0x0000B4, "Member 'BP_PsychicComponentMain_C_DebugDisplay::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_DebugDisplay, CallFunc_BooleanOR_ReturnValue_5) == 0x0000C4, "Member 'BP_PsychicComponentMain_C_DebugDisplay::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_DebugDisplay, CallFunc_BooleanOR_ReturnValue_6) == 0x0000C5, "Member 'BP_PsychicComponentMain_C_DebugDisplay::CallFunc_BooleanOR_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PsychicComponentMain_C_DebugDisplay, CallFunc_BooleanOR_ReturnValue_7) == 0x0000C6, "Member 'BP_PsychicComponentMain_C_DebugDisplay::CallFunc_BooleanOR_ReturnValue_7' has a wrong offset!");

// Function BP_PsychicComponentMain.BP_PsychicComponentMain_C.UpdateGrabMove
// 0x0650 (0x0650 - 0x0000)
struct BP_PsychicComponentMain_C_UpdateGrabMove final
{
public:
	struct FVector                                L_actorPos;                                        // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DstPos;                                            // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AxisSlope;                                         // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VecFront;                                          // 0x0024(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotFrontRate;                                      // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PosTarget;                                         // 0x0034(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F44[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F45[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_4;                   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAttachPos_grab_pos;                    // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F46[0x3];                                     // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue_1;               // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_5;                   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F47[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_6;                   // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_NegateRotator_ReturnValue;                // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
