#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerUpperActionStateChangeBattle

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PlayerUpperActionStateChangeBattle.BP_PlayerUpperActionStateChangeBattle_C.Enter
// 0x00A0 (0x00A0 - 0x0000)
struct BP_PlayerUpperActionStateChangeBattle_C_Enter final
{
public:
	int32                                         Param_Param;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LDisableMove;                                      // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D25[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           LowerAnimMontage;                                  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Enter_ReturnValue;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D26[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ch0200_C>         K2Node_DynamicCast_AsBPI_Ch_0200;                  // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D27[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ch0200_C>         K2Node_DynamicCast_AsBPI_Ch_0200_1;                // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EndBattleWeaponAnimInterface_bDummy;      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BeginBattleWeaponAnimInterface_bDummy;    // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsControlAI_bAI;                          // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetCurrentStateIndex_ReturnValue;         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D28[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetAnimMontageFromSet_Montage;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D29[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetAnimMontageFromSet_Montage_1;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D2A[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Select_Default;                             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetAnimMontageFromSet_Montage_2;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetAnimMontageFromSet_Montage_3;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_Select_Default_1;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerUpperActionStateChangeBattle_C_Enter) == 0x000008, "Wrong alignment on BP_PlayerUpperActionStateChangeBattle_C_Enter");
static_assert(sizeof(BP_PlayerUpperActionStateChangeBattle_C_Enter) == 0x0000A0, "Wrong size on BP_PlayerUpperActionStateChangeBattle_C_Enter");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, Param_Param) == 0x000000, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::Param_Param' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, ReturnValue) == 0x000004, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, LDisableMove) == 0x000008, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::LDisableMove' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, LowerAnimMontage) == 0x000010, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::LowerAnimMontage' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, Temp_int_Variable) == 0x000018, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, Temp_int_Variable_1) == 0x00001C, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, CallFunc_Enter_ReturnValue) == 0x000020, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::CallFunc_Enter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000024, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, K2Node_DynamicCast_AsBPI_Ch_0200) == 0x000028, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::K2Node_DynamicCast_AsBPI_Ch_0200' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, K2Node_DynamicCast_AsBPI_Ch_0200_1) == 0x000040, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::K2Node_DynamicCast_AsBPI_Ch_0200_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, CallFunc_EndBattleWeaponAnimInterface_bDummy) == 0x000051, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::CallFunc_EndBattleWeaponAnimInterface_bDummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, CallFunc_BeginBattleWeaponAnimInterface_bDummy) == 0x000052, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::CallFunc_BeginBattleWeaponAnimInterface_bDummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, CallFunc_IsControlAI_bAI) == 0x000053, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::CallFunc_IsControlAI_bAI' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, CallFunc_GetCurrentStateIndex_ReturnValue) == 0x000054, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::CallFunc_GetCurrentStateIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, CallFunc_Conv_IntToByte_ReturnValue) == 0x000058, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, CallFunc_GetAnimMontageFromSet_Montage) == 0x000060, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::CallFunc_GetAnimMontageFromSet_Montage' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, CallFunc_GetValidValue_ReturnValue) == 0x000068, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, CallFunc_GetAnimMontageFromSet_Montage_1) == 0x000070, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::CallFunc_GetAnimMontageFromSet_Montage_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000078, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, K2Node_Select_Default) == 0x000080, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, CallFunc_GetAnimMontageFromSet_Montage_2) == 0x000088, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::CallFunc_GetAnimMontageFromSet_Montage_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, CallFunc_GetAnimMontageFromSet_Montage_3) == 0x000090, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::CallFunc_GetAnimMontageFromSet_Montage_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Enter, K2Node_Select_Default_1) == 0x000098, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Enter::K2Node_Select_Default_1' has a wrong offset!");

// Function BP_PlayerUpperActionStateChangeBattle.BP_PlayerUpperActionStateChangeBattle_C.Update
// 0x000C (0x000C - 0x0000)
struct BP_PlayerUpperActionStateChangeBattle_C_Update final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayBlendAnimMontage_bPlay;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D2B[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Update_ReturnValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerUpperActionStateChangeBattle_C_Update) == 0x000004, "Wrong alignment on BP_PlayerUpperActionStateChangeBattle_C_Update");
static_assert(sizeof(BP_PlayerUpperActionStateChangeBattle_C_Update) == 0x00000C, "Wrong size on BP_PlayerUpperActionStateChangeBattle_C_Update");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Update, ReturnValue) == 0x000000, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Update::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Update, CallFunc_IsPlayBlendAnimMontage_bPlay) == 0x000004, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Update::CallFunc_IsPlayBlendAnimMontage_bPlay' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Update, CallFunc_Update_ReturnValue) == 0x000008, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Update::CallFunc_Update_ReturnValue' has a wrong offset!");

// Function BP_PlayerUpperActionStateChangeBattle.BP_PlayerUpperActionStateChangeBattle_C.Exit
// 0x001C (0x001C - 0x0000)
struct BP_PlayerUpperActionStateChangeBattle_C_Exit final
{
public:
	int32                                         NextStateIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D2C[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Exit_ReturnValue;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D2D[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBattleReady_bDummy;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerUpperActionStateChangeBattle_C_Exit) == 0x000004, "Wrong alignment on BP_PlayerUpperActionStateChangeBattle_C_Exit");
static_assert(sizeof(BP_PlayerUpperActionStateChangeBattle_C_Exit) == 0x00001C, "Wrong size on BP_PlayerUpperActionStateChangeBattle_C_Exit");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Exit, NextStateIndex) == 0x000000, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Exit::NextStateIndex' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Exit, ReturnValue) == 0x000004, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Exit::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Exit, Temp_bool_Variable) == 0x000008, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Exit::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Exit, CallFunc_Exit_ReturnValue) == 0x00000C, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Exit::CallFunc_Exit_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Exit, Temp_bool_Variable_1) == 0x000010, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Exit::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Exit, Temp_int_Variable) == 0x000014, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Exit::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Exit, K2Node_Select_Default) == 0x000018, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Exit::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStateChangeBattle_C_Exit, CallFunc_SetBattleReady_bDummy) == 0x000019, "Member 'BP_PlayerUpperActionStateChangeBattle_C_Exit::CallFunc_SetBattleReady_bDummy' has a wrong offset!");

}

