#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerActionStateAfterEvent

#include "Basic.hpp"

#include "EParamAfterEventAction_structs.hpp"
#include "BP_PlayerActionStateCommonBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerActionStateAfterEvent.BP_PlayerActionStateAfterEvent_C
// 0x0028 (0x0110 - 0x00E8)
class UBP_PlayerActionStateAfterEvent_C final : public UBP_PlayerActionStateCommonBase_C
{
public:
	class UAnimMontage*                           AnimMontage;                                       // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SpAttackMontage;                                   // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SpEndMontage;                                      // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EParamAfterEventAction                        Param;                                             // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_845F[0x3];                                     // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ClaimantName;                                      // 0x0104(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int32 Enter(int32 Param_Param);
	int32 Exit(int32 NextStateIndex);
	int32 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerActionStateAfterEvent_C">();
	}
	static class UBP_PlayerActionStateAfterEvent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PlayerActionStateAfterEvent_C>();
	}
};
static_assert(alignof(UBP_PlayerActionStateAfterEvent_C) == 0x000008, "Wrong alignment on UBP_PlayerActionStateAfterEvent_C");
static_assert(sizeof(UBP_PlayerActionStateAfterEvent_C) == 0x000110, "Wrong size on UBP_PlayerActionStateAfterEvent_C");
static_assert(offsetof(UBP_PlayerActionStateAfterEvent_C, AnimMontage) == 0x0000E8, "Member 'UBP_PlayerActionStateAfterEvent_C::AnimMontage' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateAfterEvent_C, SpAttackMontage) == 0x0000F0, "Member 'UBP_PlayerActionStateAfterEvent_C::SpAttackMontage' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateAfterEvent_C, SpEndMontage) == 0x0000F8, "Member 'UBP_PlayerActionStateAfterEvent_C::SpEndMontage' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateAfterEvent_C, Param) == 0x000100, "Member 'UBP_PlayerActionStateAfterEvent_C::Param' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateAfterEvent_C, ClaimantName) == 0x000104, "Member 'UBP_PlayerActionStateAfterEvent_C::ClaimantName' has a wrong offset!");

}

