#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerRessurectComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerRessurectComponent.BP_PlayerRessurectComponent_C.ExecuteUbergraph_BP_PlayerRessurectComponent
// 0x0028 (0x0028 - 0x0000)
struct BP_PlayerRessurectComponent_C_ExecuteUbergraph_BP_PlayerRessurectComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A0C[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A0D[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TriggerEffectManager_C*             CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A0E[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_Resurrection_1_C*                CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerRessurectComponent_C_ExecuteUbergraph_BP_PlayerRessurectComponent) == 0x000008, "Wrong alignment on BP_PlayerRessurectComponent_C_ExecuteUbergraph_BP_PlayerRessurectComponent");
static_assert(sizeof(BP_PlayerRessurectComponent_C_ExecuteUbergraph_BP_PlayerRessurectComponent) == 0x000028, "Wrong size on BP_PlayerRessurectComponent_C_ExecuteUbergraph_BP_PlayerRessurectComponent");
static_assert(offsetof(BP_PlayerRessurectComponent_C_ExecuteUbergraph_BP_PlayerRessurectComponent, EntryPoint) == 0x000000, "Member 'BP_PlayerRessurectComponent_C_ExecuteUbergraph_BP_PlayerRessurectComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerRessurectComponent_C_ExecuteUbergraph_BP_PlayerRessurectComponent, K2Node_Event_EndPlayReason) == 0x000004, "Member 'BP_PlayerRessurectComponent_C_ExecuteUbergraph_BP_PlayerRessurectComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_PlayerRessurectComponent_C_ExecuteUbergraph_BP_PlayerRessurectComponent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000005, "Member 'BP_PlayerRessurectComponent_C_ExecuteUbergraph_BP_PlayerRessurectComponent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerRessurectComponent_C_ExecuteUbergraph_BP_PlayerRessurectComponent, Temp_bool_Has_Been_Initd_Variable) == 0x000006, "Member 'BP_PlayerRessurectComponent_C_ExecuteUbergraph_BP_PlayerRessurectComponent::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerRessurectComponent_C_ExecuteUbergraph_BP_PlayerRessurectComponent, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_PlayerRessurectComponent_C_ExecuteUbergraph_BP_PlayerRessurectComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PlayerRessurectComponent_C_ExecuteUbergraph_BP_PlayerRessurectComponent, CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager) == 0x000010, "Member 'BP_PlayerRessurectComponent_C_ExecuteUbergraph_BP_PlayerRessurectComponent::CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager' has a wrong offset!");
static_assert(offsetof(BP_PlayerRessurectComponent_C_ExecuteUbergraph_BP_PlayerRessurectComponent, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_PlayerRessurectComponent_C_ExecuteUbergraph_BP_PlayerRessurectComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerRessurectComponent_C_ExecuteUbergraph_BP_PlayerRessurectComponent, Temp_bool_IsClosed_Variable) == 0x000019, "Member 'BP_PlayerRessurectComponent_C_ExecuteUbergraph_BP_PlayerRessurectComponent::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerRessurectComponent_C_ExecuteUbergraph_BP_PlayerRessurectComponent, CallFunc_Create_ReturnValue) == 0x000020, "Member 'BP_PlayerRessurectComponent_C_ExecuteUbergraph_BP_PlayerRessurectComponent::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function BP_PlayerRessurectComponent.BP_PlayerRessurectComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PlayerRessurectComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerRessurectComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PlayerRessurectComponent_C_ReceiveTick");
static_assert(sizeof(BP_PlayerRessurectComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_PlayerRessurectComponent_C_ReceiveTick");
static_assert(offsetof(BP_PlayerRessurectComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PlayerRessurectComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PlayerRessurectComponent.BP_PlayerRessurectComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerRessurectComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerRessurectComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_PlayerRessurectComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_PlayerRessurectComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_PlayerRessurectComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_PlayerRessurectComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_PlayerRessurectComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_PlayerRessurectComponent.BP_PlayerRessurectComponent_C.GetUI
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerRessurectComponent_C_GetUI final
{
public:
	class UUIResurrectionGauge*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerRessurectComponent_C_GetUI) == 0x000008, "Wrong alignment on BP_PlayerRessurectComponent_C_GetUI");
static_assert(sizeof(BP_PlayerRessurectComponent_C_GetUI) == 0x000008, "Wrong size on BP_PlayerRessurectComponent_C_GetUI");
static_assert(offsetof(BP_PlayerRessurectComponent_C_GetUI, ReturnValue) == 0x000000, "Member 'BP_PlayerRessurectComponent_C_GetUI::ReturnValue' has a wrong offset!");

}

