#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerActionStateBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PlayerActionStateBase.BP_PlayerActionStateBase_C.ExecuteUbergraph_BP_PlayerActionStateBase
// 0x0028 (0x0028 - 0x0000)
struct BP_PlayerActionStateBase_C_ExecuteUbergraph_BP_PlayerActionStateBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A5C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PlayerFixParamater_C*               CallFunc_GetPlayerFixParam_Param;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateBase_C_ExecuteUbergraph_BP_PlayerActionStateBase) == 0x000008, "Wrong alignment on BP_PlayerActionStateBase_C_ExecuteUbergraph_BP_PlayerActionStateBase");
static_assert(sizeof(BP_PlayerActionStateBase_C_ExecuteUbergraph_BP_PlayerActionStateBase) == 0x000028, "Wrong size on BP_PlayerActionStateBase_C_ExecuteUbergraph_BP_PlayerActionStateBase");
static_assert(offsetof(BP_PlayerActionStateBase_C_ExecuteUbergraph_BP_PlayerActionStateBase, EntryPoint) == 0x000000, "Member 'BP_PlayerActionStateBase_C_ExecuteUbergraph_BP_PlayerActionStateBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateBase_C_ExecuteUbergraph_BP_PlayerActionStateBase, CallFunc_GetPlayerFixParam_Param) == 0x000008, "Member 'BP_PlayerActionStateBase_C_ExecuteUbergraph_BP_PlayerActionStateBase::CallFunc_GetPlayerFixParam_Param' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateBase_C_ExecuteUbergraph_BP_PlayerActionStateBase, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_PlayerActionStateBase_C_ExecuteUbergraph_BP_PlayerActionStateBase::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateBase_C_ExecuteUbergraph_BP_PlayerActionStateBase, K2Node_DynamicCast_AsRSBattle_Player) == 0x000018, "Member 'BP_PlayerActionStateBase_C_ExecuteUbergraph_BP_PlayerActionStateBase::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateBase_C_ExecuteUbergraph_BP_PlayerActionStateBase, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_PlayerActionStateBase_C_ExecuteUbergraph_BP_PlayerActionStateBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_PlayerActionStateBase.BP_PlayerActionStateBase_C.Enter
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerActionStateBase_C_Enter final
{
public:
	int32                                         Param;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Enter_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClearActionStatus_bDummy;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateBase_C_Enter) == 0x000004, "Wrong alignment on BP_PlayerActionStateBase_C_Enter");
static_assert(sizeof(BP_PlayerActionStateBase_C_Enter) == 0x000010, "Wrong size on BP_PlayerActionStateBase_C_Enter");
static_assert(offsetof(BP_PlayerActionStateBase_C_Enter, Param) == 0x000000, "Member 'BP_PlayerActionStateBase_C_Enter::Param' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateBase_C_Enter, ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateBase_C_Enter::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateBase_C_Enter, CallFunc_Enter_ReturnValue) == 0x000008, "Member 'BP_PlayerActionStateBase_C_Enter::CallFunc_Enter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateBase_C_Enter, CallFunc_ClearActionStatus_bDummy) == 0x00000C, "Member 'BP_PlayerActionStateBase_C_Enter::CallFunc_ClearActionStatus_bDummy' has a wrong offset!");

// Function BP_PlayerActionStateBase.BP_PlayerActionStateBase_C.Exit
// 0x000C (0x000C - 0x0000)
struct BP_PlayerActionStateBase_C_Exit final
{
public:
	int32                                         NextStateIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Exit_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerActionStateBase_C_Exit) == 0x000004, "Wrong alignment on BP_PlayerActionStateBase_C_Exit");
static_assert(sizeof(BP_PlayerActionStateBase_C_Exit) == 0x00000C, "Wrong size on BP_PlayerActionStateBase_C_Exit");
static_assert(offsetof(BP_PlayerActionStateBase_C_Exit, NextStateIndex) == 0x000000, "Member 'BP_PlayerActionStateBase_C_Exit::NextStateIndex' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateBase_C_Exit, ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateBase_C_Exit::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateBase_C_Exit, CallFunc_Exit_ReturnValue) == 0x000008, "Member 'BP_PlayerActionStateBase_C_Exit::CallFunc_Exit_ReturnValue' has a wrong offset!");

}

