#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerHologram

#include "Basic.hpp"

#include "AttackCollisionInfoBP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "ECharaExecuteNotifyKind_structs.hpp"
#include "EHologramKind_structs.hpp"
#include "Engine_structs.hpp"
#include "EBonusGhostType_structs.hpp"
#include "EBulletType_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerHologram.BP_PlayerHologram_C.DispatcherOnMontageBlendingOutCh0100__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0100__DelegateSignature final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0100__DelegateSignature) == 0x000008, "Wrong alignment on BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0100__DelegateSignature");
static_assert(sizeof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0100__DelegateSignature) == 0x000010, "Wrong size on BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0100__DelegateSignature");
static_assert(offsetof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0100__DelegateSignature, Montage) == 0x000000, "Member 'BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0100__DelegateSignature::Montage' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0100__DelegateSignature, bInterrupted) == 0x000008, "Member 'BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0100__DelegateSignature::bInterrupted' has a wrong offset!");

// Function BP_PlayerHologram.BP_PlayerHologram_C.DispatcherOnMontageBlendingOutCh0200__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0200__DelegateSignature final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0200__DelegateSignature) == 0x000008, "Wrong alignment on BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0200__DelegateSignature");
static_assert(sizeof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0200__DelegateSignature) == 0x000010, "Wrong size on BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0200__DelegateSignature");
static_assert(offsetof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0200__DelegateSignature, Montage) == 0x000000, "Member 'BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0200__DelegateSignature::Montage' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0200__DelegateSignature, bInterrupted) == 0x000008, "Member 'BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0200__DelegateSignature::bInterrupted' has a wrong offset!");

// Function BP_PlayerHologram.BP_PlayerHologram_C.DispatcherOnMontageBlendingOutCh0300__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0300__DelegateSignature final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0300__DelegateSignature) == 0x000008, "Wrong alignment on BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0300__DelegateSignature");
static_assert(sizeof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0300__DelegateSignature) == 0x000010, "Wrong size on BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0300__DelegateSignature");
static_assert(offsetof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0300__DelegateSignature, Montage) == 0x000000, "Member 'BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0300__DelegateSignature::Montage' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0300__DelegateSignature, bInterrupted) == 0x000008, "Member 'BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0300__DelegateSignature::bInterrupted' has a wrong offset!");

// Function BP_PlayerHologram.BP_PlayerHologram_C.DispatcherOnMontageBlendingOutCh0400__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0400__DelegateSignature final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0400__DelegateSignature) == 0x000008, "Wrong alignment on BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0400__DelegateSignature");
static_assert(sizeof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0400__DelegateSignature) == 0x000010, "Wrong size on BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0400__DelegateSignature");
static_assert(offsetof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0400__DelegateSignature, Montage) == 0x000000, "Member 'BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0400__DelegateSignature::Montage' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0400__DelegateSignature, bInterrupted) == 0x000008, "Member 'BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0400__DelegateSignature::bInterrupted' has a wrong offset!");

// Function BP_PlayerHologram.BP_PlayerHologram_C.DispatcherOnMontageBlendingOutCh0500__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0500__DelegateSignature final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0500__DelegateSignature) == 0x000008, "Wrong alignment on BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0500__DelegateSignature");
static_assert(sizeof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0500__DelegateSignature) == 0x000010, "Wrong size on BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0500__DelegateSignature");
static_assert(offsetof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0500__DelegateSignature, Montage) == 0x000000, "Member 'BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0500__DelegateSignature::Montage' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0500__DelegateSignature, bInterrupted) == 0x000008, "Member 'BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0500__DelegateSignature::bInterrupted' has a wrong offset!");

// Function BP_PlayerHologram.BP_PlayerHologram_C.DispatcherOnMontageBlendingOutCh0600__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0600__DelegateSignature final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0600__DelegateSignature) == 0x000008, "Wrong alignment on BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0600__DelegateSignature");
static_assert(sizeof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0600__DelegateSignature) == 0x000010, "Wrong size on BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0600__DelegateSignature");
static_assert(offsetof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0600__DelegateSignature, Montage) == 0x000000, "Member 'BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0600__DelegateSignature::Montage' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0600__DelegateSignature, bInterrupted) == 0x000008, "Member 'BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0600__DelegateSignature::bInterrupted' has a wrong offset!");

// Function BP_PlayerHologram.BP_PlayerHologram_C.DispatcherOnMontageBlendingOutCh0700__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0700__DelegateSignature final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0700__DelegateSignature) == 0x000008, "Wrong alignment on BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0700__DelegateSignature");
static_assert(sizeof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0700__DelegateSignature) == 0x000010, "Wrong size on BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0700__DelegateSignature");
static_assert(offsetof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0700__DelegateSignature, Montage) == 0x000000, "Member 'BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0700__DelegateSignature::Montage' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0700__DelegateSignature, bInterrupted) == 0x000008, "Member 'BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0700__DelegateSignature::bInterrupted' has a wrong offset!");

// Function BP_PlayerHologram.BP_PlayerHologram_C.DispatcherOnMontageBlendingOutCh0800__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0800__DelegateSignature final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0800__DelegateSignature) == 0x000008, "Wrong alignment on BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0800__DelegateSignature");
static_assert(sizeof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0800__DelegateSignature) == 0x000010, "Wrong size on BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0800__DelegateSignature");
static_assert(offsetof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0800__DelegateSignature, Montage) == 0x000000, "Member 'BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0800__DelegateSignature::Montage' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0800__DelegateSignature, bInterrupted) == 0x000008, "Member 'BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0800__DelegateSignature::bInterrupted' has a wrong offset!");

// Function BP_PlayerHologram.BP_PlayerHologram_C.DispatcherOnMontageBlendingOutCh0900__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0900__DelegateSignature final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0900__DelegateSignature) == 0x000008, "Wrong alignment on BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0900__DelegateSignature");
static_assert(sizeof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0900__DelegateSignature) == 0x000010, "Wrong size on BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0900__DelegateSignature");
static_assert(offsetof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0900__DelegateSignature, Montage) == 0x000000, "Member 'BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0900__DelegateSignature::Montage' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0900__DelegateSignature, bInterrupted) == 0x000008, "Member 'BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh0900__DelegateSignature::bInterrupted' has a wrong offset!");

// Function BP_PlayerHologram.BP_PlayerHologram_C.DispatcherOnMontageBlendingOutCh1000__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh1000__DelegateSignature final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh1000__DelegateSignature) == 0x000008, "Wrong alignment on BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh1000__DelegateSignature");
static_assert(sizeof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh1000__DelegateSignature) == 0x000010, "Wrong size on BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh1000__DelegateSignature");
static_assert(offsetof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh1000__DelegateSignature, Montage) == 0x000000, "Member 'BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh1000__DelegateSignature::Montage' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh1000__DelegateSignature, bInterrupted) == 0x000008, "Member 'BP_PlayerHologram_C_DispatcherOnMontageBlendingOutCh1000__DelegateSignature::bInterrupted' has a wrong offset!");

// Function BP_PlayerHologram.BP_PlayerHologram_C.DispatcherHitThrowWeapon__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct BP_PlayerHologram_C_DispatcherHitThrowWeapon__DelegateSignature final
{
public:
	struct FVector                                HitLocation;                                       // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerHologram_C_DispatcherHitThrowWeapon__DelegateSignature) == 0x000004, "Wrong alignment on BP_PlayerHologram_C_DispatcherHitThrowWeapon__DelegateSignature");
static_assert(sizeof(BP_PlayerHologram_C_DispatcherHitThrowWeapon__DelegateSignature) == 0x00000C, "Wrong size on BP_PlayerHologram_C_DispatcherHitThrowWeapon__DelegateSignature");
static_assert(offsetof(BP_PlayerHologram_C_DispatcherHitThrowWeapon__DelegateSignature, HitLocation) == 0x000000, "Member 'BP_PlayerHologram_C_DispatcherHitThrowWeapon__DelegateSignature::HitLocation' has a wrong offset!");

// Function BP_PlayerHologram.BP_PlayerHologram_C.DispatchAttackNotify__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_PlayerHologram_C_DispatchAttackNotify__DelegateSignature final
{
public:
	int32                                         Param;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerHologram_C_DispatchAttackNotify__DelegateSignature) == 0x000004, "Wrong alignment on BP_PlayerHologram_C_DispatchAttackNotify__DelegateSignature");
static_assert(sizeof(BP_PlayerHologram_C_DispatchAttackNotify__DelegateSignature) == 0x000004, "Wrong size on BP_PlayerHologram_C_DispatchAttackNotify__DelegateSignature");
static_assert(offsetof(BP_PlayerHologram_C_DispatchAttackNotify__DelegateSignature, Param) == 0x000000, "Member 'BP_PlayerHologram_C_DispatchAttackNotify__DelegateSignature::Param' has a wrong offset!");

// Function BP_PlayerHologram.BP_PlayerHologram_C.ExecuteUbergraph_BP_PlayerHologram
// 0x0230 (0x0230 - 0x0000)
struct BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7733[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7734[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAnimMontage* Montage, bool bInterrupted)> K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UAnimMontage* Montage, bool bInterrupted)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UAnimMontage* Montage, bool bInterrupted)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UAnimMontage* Montage, bool bInterrupted)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UAnimMontage* Montage, bool bInterrupted)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UAnimMontage* Montage, bool bInterrupted)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UAnimMontage* Montage, bool bInterrupted)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UAnimMontage* Montage, bool bInterrupted)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UAnimMontage* Montage, bool bInterrupted)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UAnimMontage* Montage, bool bInterrupted)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7735[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Active;                               // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7736[0x1];                                     // 0x00D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Time;                                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBonusGhostType                               K2Node_Event_Type;                                 // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7737[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_AliveTime_1;                          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7738[0x2];                                     // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_3;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_4;            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_5;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_6;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_7;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_8;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_9;            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_CustomEvent_Montage_9;                      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInterrupted_9;                 // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7739[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_CustomEvent_Montage_8;                      // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInterrupted_8;                 // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_773A[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_CustomEvent_Montage_7;                      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInterrupted_7;                 // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_773B[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_CustomEvent_Montage_6;                      // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInterrupted_6;                 // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_773C[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_CustomEvent_Montage_5;                      // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInterrupted_5;                 // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_773D[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_CustomEvent_Montage_4;                      // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInterrupted_4;                 // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_773E[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_CustomEvent_Montage_3;                      // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInterrupted_3;                 // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_773F[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_CustomEvent_Montage_2;                      // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInterrupted_2;                 // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7740[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_CustomEvent_Montage_1;                      // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInterrupted_1;                 // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7741[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_CustomEvent_Montage;                        // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInterrupted;                   // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7742[0x1];                                     // 0x01D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_AliveTime;                            // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_CustomEvent_Mesh;                           // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldNormalDeltaSeconds_ReturnValue;   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7743[0x2];                                     // 0x01E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7744[0x2];                                     // 0x01EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float DeltaSeconds)>           K2Node_CreateDelegate_OutputDelegate_10;           // 0x01F0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7745[0x6];                                     // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_WeaponBase_C*>               CallFunc_GetWeapon_Weapon;                         // 0x0208(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7746[0x3];                                     // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_10;           // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyMontagePlaying_ReturnValue;          // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram) == 0x000008, "Wrong alignment on BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram");
static_assert(sizeof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram) == 0x000230, "Wrong size on BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, EntryPoint) == 0x000000, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, Temp_int_Variable) == 0x000004, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, Temp_int_Variable_1) == 0x000008, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_Conv_IntToByte_ReturnValue) == 0x00000C, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_GetValidValue_ReturnValue) == 0x000014, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000015, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000016, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000018, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CreateDelegate_OutputDelegate_3) == 0x00004C, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CreateDelegate_OutputDelegate_4) == 0x00005C, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CreateDelegate_OutputDelegate_5) == 0x00006C, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CreateDelegate_OutputDelegate_6) == 0x00007C, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CreateDelegate_OutputDelegate_7) == 0x00008C, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CreateDelegate_OutputDelegate_8) == 0x00009C, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CreateDelegate_OutputDelegate_9) == 0x0000AC, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, Temp_bool_Has_Been_Initd_Variable) == 0x0000BC, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, Temp_int_Loop_Counter_Variable) == 0x0000C0, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000C4, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, Temp_int_Array_Index_Variable) == 0x0000C8, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, Temp_int_Loop_Num_Variable) == 0x0000CC, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_Less_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, Temp_bool_Has_Been_Initd_Variable_1) == 0x0000D1, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_Event_Active) == 0x0000D2, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_Event_Active' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_Event_Time) == 0x0000D4, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_Event_Type) == 0x0000D8, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_Event_Type' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_Event_AliveTime_1) == 0x0000DC, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_Event_AliveTime_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_Event_DeltaSeconds) == 0x0000E0, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_Event_EndPlayReason) == 0x0000E4, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_SwitchEnum_CmpSuccess) == 0x0000E5, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_GetAnimInstance_ReturnValue) == 0x0000E8, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_GetAnimInstance_ReturnValue_1) == 0x0000F0, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_GetAnimInstance_ReturnValue_2) == 0x0000F8, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_GetAnimInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_GetAnimInstance_ReturnValue_3) == 0x000100, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_GetAnimInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_GetAnimInstance_ReturnValue_4) == 0x000108, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_GetAnimInstance_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_GetAnimInstance_ReturnValue_5) == 0x000110, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_GetAnimInstance_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_GetAnimInstance_ReturnValue_6) == 0x000118, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_GetAnimInstance_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_GetAnimInstance_ReturnValue_7) == 0x000120, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_GetAnimInstance_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_GetAnimInstance_ReturnValue_8) == 0x000128, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_GetAnimInstance_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_GetAnimInstance_ReturnValue_9) == 0x000130, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_GetAnimInstance_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CustomEvent_Montage_9) == 0x000138, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CustomEvent_Montage_9' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CustomEvent_bInterrupted_9) == 0x000140, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CustomEvent_bInterrupted_9' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CustomEvent_Montage_8) == 0x000148, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CustomEvent_Montage_8' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CustomEvent_bInterrupted_8) == 0x000150, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CustomEvent_bInterrupted_8' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CustomEvent_Montage_7) == 0x000158, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CustomEvent_Montage_7' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CustomEvent_bInterrupted_7) == 0x000160, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CustomEvent_bInterrupted_7' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CustomEvent_Montage_6) == 0x000168, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CustomEvent_Montage_6' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CustomEvent_bInterrupted_6) == 0x000170, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CustomEvent_bInterrupted_6' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CustomEvent_Montage_5) == 0x000178, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CustomEvent_Montage_5' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CustomEvent_bInterrupted_5) == 0x000180, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CustomEvent_bInterrupted_5' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CustomEvent_Montage_4) == 0x000188, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CustomEvent_Montage_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CustomEvent_bInterrupted_4) == 0x000190, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CustomEvent_bInterrupted_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CustomEvent_Montage_3) == 0x000198, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CustomEvent_Montage_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CustomEvent_bInterrupted_3) == 0x0001A0, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CustomEvent_bInterrupted_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CustomEvent_Montage_2) == 0x0001A8, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CustomEvent_Montage_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CustomEvent_bInterrupted_2) == 0x0001B0, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CustomEvent_bInterrupted_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CustomEvent_Montage_1) == 0x0001B8, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CustomEvent_Montage_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CustomEvent_bInterrupted_1) == 0x0001C0, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CustomEvent_bInterrupted_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CustomEvent_Montage) == 0x0001C8, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CustomEvent_Montage' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CustomEvent_bInterrupted) == 0x0001D0, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CustomEvent_bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, Temp_bool_IsClosed_Variable) == 0x0001D1, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_IsValid_ReturnValue) == 0x0001D2, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_Event_AliveTime) == 0x0001D4, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_Event_AliveTime' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CustomEvent_Mesh) == 0x0001D8, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CustomEvent_Mesh' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_GetWorldNormalDeltaSeconds_ReturnValue) == 0x0001E0, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_GetWorldNormalDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_IsValid_ReturnValue_1) == 0x0001E4, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, Temp_bool_IsClosed_Variable_1) == 0x0001E5, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_MakeLiteralInt_ReturnValue) == 0x0001E8, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001EC, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_IsValid_ReturnValue_2) == 0x0001ED, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, K2Node_CreateDelegate_OutputDelegate_10) == 0x0001F0, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_IsValid_ReturnValue_3) == 0x000200, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_IsValid_ReturnValue_4) == 0x000201, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_GetWeapon_Weapon) == 0x000208, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_GetWeapon_Weapon' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_Array_Length_ReturnValue) == 0x000218, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_IsValid_ReturnValue_5) == 0x00021C, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_GetAnimInstance_ReturnValue_10) == 0x000220, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_GetAnimInstance_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram, CallFunc_IsAnyMontagePlaying_ReturnValue) == 0x000228, "Member 'BP_PlayerHologram_C_ExecuteUbergraph_BP_PlayerHologram::CallFunc_IsAnyMontagePlaying_ReturnValue' has a wrong offset!");

// Function BP_PlayerHologram.BP_PlayerHologram_C.DelayMeshTickDisable
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerHologram_C_DelayMeshTickDisable final
{
public:
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerHologram_C_DelayMeshTickDisable) == 0x000008, "Wrong alignment on BP_PlayerHologram_C_DelayMeshTickDisable");
static_assert(sizeof(BP_PlayerHologram_C_DelayMeshTickDisable) == 0x000008, "Wrong size on BP_PlayerHologram_C_DelayMeshTickDisable");
static_assert(offsetof(BP_PlayerHologram_C_DelayMeshTickDisable, Mesh) == 0x000000, "Member 'BP_PlayerHologram_C_DelayMeshTickDisable::Mesh' has a wrong offset!");

// Function BP_PlayerHologram.BP_PlayerHologram_C.OnGhostOneShot
// 0x0004 (0x0004 - 0x0000)
struct BP_PlayerHologram_C_OnGhostOneShot final
{
public:
	float                                         AliveTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerHologram_C_OnGhostOneShot) == 0x000004, "Wrong alignment on BP_PlayerHologram_C_OnGhostOneShot");
static_assert(sizeof(BP_PlayerHologram_C_OnGhostOneShot) == 0x000004, "Wrong size on BP_PlayerHologram_C_OnGhostOneShot");
static_assert(offsetof(BP_PlayerHologram_C_OnGhostOneShot, AliveTime) == 0x000000, "Member 'BP_PlayerHologram_C_OnGhostOneShot::AliveTime' has a wrong offset!");

// Function BP_PlayerHologram.BP_PlayerHologram_C.OnMontageBlendingOutCh1000
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerHologram_C_OnMontageBlendingOutCh1000 final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerHologram_C_OnMontageBlendingOutCh1000) == 0x000008, "Wrong alignment on BP_PlayerHologram_C_OnMontageBlendingOutCh1000");
static_assert(sizeof(BP_PlayerHologram_C_OnMontageBlendingOutCh1000) == 0x000010, "Wrong size on BP_PlayerHologram_C_OnMontageBlendingOutCh1000");
static_assert(offsetof(BP_PlayerHologram_C_OnMontageBlendingOutCh1000, Montage) == 0x000000, "Member 'BP_PlayerHologram_C_OnMontageBlendingOutCh1000::Montage' has a wrong offset!");
static_assert(offsetof(BP_PlayerHologram_C_OnMontageBlendingOutCh1000, bInterrupted) == 0x000008, "Member 'BP_PlayerHologram_C_OnMontageBlendingOutCh1000::bInterrupted' has a wrong offset!");

// Function BP_PlayerHologram.BP_PlayerHologram_C.OnMontageBlendingOutCh0900
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerHologram_C_OnMontageBlendingOutCh0900 final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerHologram_C_OnMontageBlendingOutCh0900) == 0x000008, "Wrong alignment on BP_PlayerHologram_C_OnMontageBlendingOutCh0900");
