#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerAnimInstanceInterface

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PlayerAnimInstanceInterface.BP_PlayerAnimInstanceInterface_C.BeginEvent
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerAnimInstanceInterface_C_BeginEvent final
{
public:
	bool                                          bDummy;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerAnimInstanceInterface_C_BeginEvent) == 0x000001, "Wrong alignment on BP_PlayerAnimInstanceInterface_C_BeginEvent");
static_assert(sizeof(BP_PlayerAnimInstanceInterface_C_BeginEvent) == 0x000001, "Wrong size on BP_PlayerAnimInstanceInterface_C_BeginEvent");
static_assert(offsetof(BP_PlayerAnimInstanceInterface_C_BeginEvent, bDummy) == 0x000000, "Member 'BP_PlayerAnimInstanceInterface_C_BeginEvent::bDummy' has a wrong offset!");

// Function BP_PlayerAnimInstanceInterface.BP_PlayerAnimInstanceInterface_C.EndEvent
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerAnimInstanceInterface_C_EndEvent final
{
public:
	bool                                          bDummy;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerAnimInstanceInterface_C_EndEvent) == 0x000001, "Wrong alignment on BP_PlayerAnimInstanceInterface_C_EndEvent");
static_assert(sizeof(BP_PlayerAnimInstanceInterface_C_EndEvent) == 0x000001, "Wrong size on BP_PlayerAnimInstanceInterface_C_EndEvent");
static_assert(offsetof(BP_PlayerAnimInstanceInterface_C_EndEvent, bDummy) == 0x000000, "Member 'BP_PlayerAnimInstanceInterface_C_EndEvent::bDummy' has a wrong offset!");

}

