#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "AcceleratorParam_structs.hpp"
#include "FPlayerCostumeData_structs.hpp"
#include "EPlayerFacialAnim_structs.hpp"
#include "FPhotoModeFacialData_structs.hpp"
#include "SPlayerAIAssistThinkData_structs.hpp"
#include "FAttachmentData_structs.hpp"
#include "CharactersLevelData_structs.hpp"
#include "CharactersSkillData_structs.hpp"
#include "E_SASKind_structs.hpp"
#include "Engine_structs.hpp"
#include "EHologramKind_structs.hpp"
#include "EPlayerCapsuleSize_structs.hpp"
#include "E_SceneType_structs.hpp"
#include "SPlayerAIAssistCountData_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerManager.BP_PlayerManager_C.DispatchSuccessResurrect__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerManager_C_DispatchSuccessResurrect__DelegateSignature final
{
public:
	class AActor*                                 RevivePlayer;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerManager_C_DispatchSuccessResurrect__DelegateSignature) == 0x000008, "Wrong alignment on BP_PlayerManager_C_DispatchSuccessResurrect__DelegateSignature");
static_assert(sizeof(BP_PlayerManager_C_DispatchSuccessResurrect__DelegateSignature) == 0x000008, "Wrong size on BP_PlayerManager_C_DispatchSuccessResurrect__DelegateSignature");
static_assert(offsetof(BP_PlayerManager_C_DispatchSuccessResurrect__DelegateSignature, RevivePlayer) == 0x000000, "Member 'BP_PlayerManager_C_DispatchSuccessResurrect__DelegateSignature::RevivePlayer' has a wrong offset!");

// Function BP_PlayerManager.BP_PlayerManager_C.ExecuteUbergraph_BP_PlayerManager
// 0x00D0 (0x00D0 - 0x0000)
struct BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B75[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_RevivePlayer_1;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_RevivePlayer;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ARSBattlePlayer_C*>              CallFunc_GetPlayersAll_Player;                     // 0x0020(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class ABP_RSPlayerCameraManager_C*            K2Node_DynamicCast_AsBP_RSPlayer_Camera_Manager;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B76[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     K2Node_Event_player_id_in_1;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerSkill                                  K2Node_Event_skill_id_in;                          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     K2Node_Event_player_id_in;                         // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B77[0x1];                                     // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_PresetName;                           // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isCheckBattleMemberMain;              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B78[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_HP;                                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_BadStatus;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Revive;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RigitBodyEmptyUpdateSeconds;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERSPartyPlayerKind                            K2Node_Event_kind_3;                               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B79[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       K2Node_Event_Player;                               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B7A[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4B7B[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B7C[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B7D[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ERSPartyPlayerKind                            K2Node_Event_kind_2;                               // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     K2Node_Event_id;                                   // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSpawn;                               // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B7E[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetBattleMemberCore_ReturnValue;          // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B7F[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ERSPartyPlayerKind                            K2Node_Event_kind_1;                               // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerFacialAnim_Native                      K2Node_Event_Anim;                                 // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERSPartyPlayerKind                            K2Node_Event_kind;                                 // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible;                             // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager) == 0x000008, "Wrong alignment on BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager");
static_assert(sizeof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager) == 0x0000D0, "Wrong size on BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, EntryPoint) == 0x000000, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_ComponentBoundEvent_RevivePlayer_1) == 0x000008, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_ComponentBoundEvent_RevivePlayer_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_ComponentBoundEvent_RevivePlayer) == 0x000010, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_ComponentBoundEvent_RevivePlayer' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000018, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, CallFunc_GetPlayersAll_Player) == 0x000020, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::CallFunc_GetPlayersAll_Player' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_DynamicCast_AsBP_RSPlayer_Camera_Manager) == 0x000030, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_DynamicCast_AsBP_RSPlayer_Camera_Manager' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_Event_player_id_in_1) == 0x000040, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_Event_player_id_in_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_Event_skill_id_in) == 0x000041, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_Event_skill_id_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_Event_player_id_in) == 0x000042, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_Event_player_id_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_Event_PresetName) == 0x000044, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_Event_PresetName' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_Event_isCheckBattleMemberMain) == 0x00004C, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_Event_isCheckBattleMemberMain' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_Event_HP) == 0x000050, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_Event_HP' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_Event_BadStatus) == 0x000054, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_Event_BadStatus' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_Event_Revive) == 0x000058, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_Event_Revive' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_Event_DeltaSeconds) == 0x00005C, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_Event_RigitBodyEmptyUpdateSeconds) == 0x000060, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_Event_RigitBodyEmptyUpdateSeconds' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_Event_kind_3) == 0x000064, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_Event_kind_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_Event_Player) == 0x000068, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_CreateDelegate_OutputDelegate) == 0x000074, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000088, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_DynamicCast_AsRSBattle_Player) == 0x000090, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, Temp_int_Loop_Counter_Variable) == 0x00009C, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, CallFunc_Add_IntInt_ReturnValue) == 0x0000A4, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_Event_EndPlayReason) == 0x0000A8, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_SwitchEnum_CmpSuccess) == 0x0000A9, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_Event_kind_2) == 0x0000AA, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_Event_kind_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_Event_id) == 0x0000AB, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_Event_id' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_Event_bSpawn) == 0x0000AC, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_Event_bSpawn' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, Temp_int_Array_Index_Variable) == 0x0000B0, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, CallFunc_SetBattleMemberCore_ReturnValue) == 0x0000B4, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::CallFunc_SetBattleMemberCore_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, CallFunc_IsValid_ReturnValue_1) == 0x0000C0, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, Temp_bool_Has_Been_Initd_Variable) == 0x0000C1, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_Event_kind_1) == 0x0000C2, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_Event_kind_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_Event_Anim) == 0x0000C3, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_Event_Anim' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000C4, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, CallFunc_Conv_IntToByte_ReturnValue) == 0x0000C8, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_Event_kind) == 0x0000C9, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_Event_kind' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, K2Node_Event_bVisible) == 0x0000CA, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::K2Node_Event_bVisible' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager, CallFunc_GetValidValue_ReturnValue) == 0x0000CB, "Member 'BP_PlayerManager_C_ExecuteUbergraph_BP_PlayerManager::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");

// Function BP_PlayerManager.BP_PlayerManager_C.SetPhotoModeHood_Native
// 0x0002 (0x0002 - 0x0000)
struct BP_PlayerManager_C_SetPhotoModeHood_Native final
{
public:
	ERSPartyPlayerKind                            Kind;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bVisible;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerManager_C_SetPhotoModeHood_Native) == 0x000001, "Wrong alignment on BP_PlayerManager_C_SetPhotoModeHood_Native");
static_assert(sizeof(BP_PlayerManager_C_SetPhotoModeHood_Native) == 0x000002, "Wrong size on BP_PlayerManager_C_SetPhotoModeHood_Native");
static_assert(offsetof(BP_PlayerManager_C_SetPhotoModeHood_Native, Kind) == 0x000000, "Member 'BP_PlayerManager_C_SetPhotoModeHood_Native::Kind' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_SetPhotoModeHood_Native, bVisible) == 0x000001, "Member 'BP_PlayerManager_C_SetPhotoModeHood_Native::bVisible' has a wrong offset!");

// Function BP_PlayerManager.BP_PlayerManager_C.PlayPhotoModeFacialAnim_Native
// 0x0002 (0x0002 - 0x0000)
struct BP_PlayerManager_C_PlayPhotoModeFacialAnim_Native final
{
public:
	ERSPartyPlayerKind                            Kind;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerFacialAnim_Native                      Anim;                                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerManager_C_PlayPhotoModeFacialAnim_Native) == 0x000001, "Wrong alignment on BP_PlayerManager_C_PlayPhotoModeFacialAnim_Native");
static_assert(sizeof(BP_PlayerManager_C_PlayPhotoModeFacialAnim_Native) == 0x000002, "Wrong size on BP_PlayerManager_C_PlayPhotoModeFacialAnim_Native");
static_assert(offsetof(BP_PlayerManager_C_PlayPhotoModeFacialAnim_Native, Kind) == 0x000000, "Member 'BP_PlayerManager_C_PlayPhotoModeFacialAnim_Native::Kind' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_PlayPhotoModeFacialAnim_Native, Anim) == 0x000001, "Member 'BP_PlayerManager_C_PlayPhotoModeFacialAnim_Native::Anim' has a wrong offset!");

// Function BP_PlayerManager.BP_PlayerManager_C.SetBattleMember
// 0x0003 (0x0003 - 0x0000)
struct BP_PlayerManager_C_SetBattleMember final
{
public:
	ERSPartyPlayerKind                            Kind;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     ID;                                                // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSpawn;                                            // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerManager_C_SetBattleMember) == 0x000001, "Wrong alignment on BP_PlayerManager_C_SetBattleMember");
static_assert(sizeof(BP_PlayerManager_C_SetBattleMember) == 0x000003, "Wrong size on BP_PlayerManager_C_SetBattleMember");
static_assert(offsetof(BP_PlayerManager_C_SetBattleMember, Kind) == 0x000000, "Member 'BP_PlayerManager_C_SetBattleMember::Kind' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_SetBattleMember, ID) == 0x000001, "Member 'BP_PlayerManager_C_SetBattleMember::ID' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_SetBattleMember, bSpawn) == 0x000002, "Member 'BP_PlayerManager_C_SetBattleMember::bSpawn' has a wrong offset!");

// Function BP_PlayerManager.BP_PlayerManager_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerManager_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerManager_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_PlayerManager_C_ReceiveEndPlay");
static_assert(sizeof(BP_PlayerManager_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_PlayerManager_C_ReceiveEndPlay");
static_assert(offsetof(BP_PlayerManager_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_PlayerManager_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_PlayerManager.BP_PlayerManager_C.PlayerSetting
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerManager_C_PlayerSetting final
{
public:
	ERSPartyPlayerKind                            Kind;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B80[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       Player;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerManager_C_PlayerSetting) == 0x000008, "Wrong alignment on BP_PlayerManager_C_PlayerSetting");
static_assert(sizeof(BP_PlayerManager_C_PlayerSetting) == 0x000010, "Wrong size on BP_PlayerManager_C_PlayerSetting");
static_assert(offsetof(BP_PlayerManager_C_PlayerSetting, Kind) == 0x000000, "Member 'BP_PlayerManager_C_PlayerSetting::Kind' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_PlayerSetting, Player) == 0x000008, "Member 'BP_PlayerManager_C_PlayerSetting::Player' has a wrong offset!");

// Function BP_PlayerManager.BP_PlayerManager_C.EventManagerRigitBodyEmptyUpdateSeconds
// 0x0004 (0x0004 - 0x0000)
struct BP_PlayerManager_C_EventManagerRigitBodyEmptyUpdateSeconds final
{
public:
	float                                         RigitBodyEmptyUpdateSeconds;                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerManager_C_EventManagerRigitBodyEmptyUpdateSeconds) == 0x000004, "Wrong alignment on BP_PlayerManager_C_EventManagerRigitBodyEmptyUpdateSeconds");
static_assert(sizeof(BP_PlayerManager_C_EventManagerRigitBodyEmptyUpdateSeconds) == 0x000004, "Wrong size on BP_PlayerManager_C_EventManagerRigitBodyEmptyUpdateSeconds");
static_assert(offsetof(BP_PlayerManager_C_EventManagerRigitBodyEmptyUpdateSeconds, RigitBodyEmptyUpdateSeconds) == 0x000000, "Member 'BP_PlayerManager_C_EventManagerRigitBodyEmptyUpdateSeconds::RigitBodyEmptyUpdateSeconds' has a wrong offset!");

// Function BP_PlayerManager.BP_PlayerManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PlayerManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PlayerManager_C_ReceiveTick");
static_assert(sizeof(BP_PlayerManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_PlayerManager_C_ReceiveTick");
static_assert(offsetof(BP_PlayerManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PlayerManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PlayerManager.BP_PlayerManager_C.Set Assist Count
// 0x000C (0x000C - 0x0000)
struct BP_PlayerManager_C_Set_Assist_Count final
{
public:
	int32                                         HP;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BadStatus;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Revive;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerManager_C_Set_Assist_Count) == 0x000004, "Wrong alignment on BP_PlayerManager_C_Set_Assist_Count");
static_assert(sizeof(BP_PlayerManager_C_Set_Assist_Count) == 0x00000C, "Wrong size on BP_PlayerManager_C_Set_Assist_Count");
static_assert(offsetof(BP_PlayerManager_C_Set_Assist_Count, HP) == 0x000000, "Member 'BP_PlayerManager_C_Set_Assist_Count::HP' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_Set_Assist_Count, BadStatus) == 0x000004, "Member 'BP_PlayerManager_C_Set_Assist_Count::BadStatus' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_Set_Assist_Count, Revive) == 0x000008, "Member 'BP_PlayerManager_C_Set_Assist_Count::Revive' has a wrong offset!");

// Function BP_PlayerManager.BP_PlayerManager_C.IPresetAddPartyMember
// 0x000C (0x000C - 0x0000)
struct BP_PlayerManager_C_IPresetAddPartyMember final
{
public:
	class FName                                   PresetName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCheckBattleMemberMain;                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerManager_C_IPresetAddPartyMember) == 0x000004, "Wrong alignment on BP_PlayerManager_C_IPresetAddPartyMember");
static_assert(sizeof(BP_PlayerManager_C_IPresetAddPartyMember) == 0x00000C, "Wrong size on BP_PlayerManager_C_IPresetAddPartyMember");
static_assert(offsetof(BP_PlayerManager_C_IPresetAddPartyMember, PresetName) == 0x000000, "Member 'BP_PlayerManager_C_IPresetAddPartyMember::PresetName' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_IPresetAddPartyMember, IsCheckBattleMemberMain) == 0x000008, "Member 'BP_PlayerManager_C_IPresetAddPartyMember::IsCheckBattleMemberMain' has a wrong offset!");

// Function BP_PlayerManager.BP_PlayerManager_C.ResetSkill
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerManager_C_ResetSkill final
{
public:
	EPlayerID                                     Player_id_in;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerManager_C_ResetSkill) == 0x000001, "Wrong alignment on BP_PlayerManager_C_ResetSkill");
static_assert(sizeof(BP_PlayerManager_C_ResetSkill) == 0x000001, "Wrong size on BP_PlayerManager_C_ResetSkill");
static_assert(offsetof(BP_PlayerManager_C_ResetSkill, Player_id_in) == 0x000000, "Member 'BP_PlayerManager_C_ResetSkill::Player_id_in' has a wrong offset!");

// Function BP_PlayerManager.BP_PlayerManager_C.AddSkill
// 0x0002 (0x0002 - 0x0000)
struct BP_PlayerManager_C_AddSkill final
{
public:
	EPlayerID                                     Player_id_in;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerSkill                                  Skill_id_in;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerManager_C_AddSkill) == 0x000001, "Wrong alignment on BP_PlayerManager_C_AddSkill");
static_assert(sizeof(BP_PlayerManager_C_AddSkill) == 0x000002, "Wrong size on BP_PlayerManager_C_AddSkill");
static_assert(offsetof(BP_PlayerManager_C_AddSkill, Player_id_in) == 0x000000, "Member 'BP_PlayerManager_C_AddSkill::Player_id_in' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_AddSkill, Skill_id_in) == 0x000001, "Member 'BP_PlayerManager_C_AddSkill::Skill_id_in' has a wrong offset!");

// Function BP_PlayerManager.BP_PlayerManager_C.BndEvt__BP_PlayerRessurectRight_K2Node_ComponentBoundEvent_1_RessurectSuccessDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerManager_C_BndEvt__BP_PlayerRessurectRight_K2Node_ComponentBoundEvent_1_RessurectSuccessDelegate__DelegateSignature final
{
public:
	class AActor*                                 RevivePlayer;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerManager_C_BndEvt__BP_PlayerRessurectRight_K2Node_ComponentBoundEvent_1_RessurectSuccessDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_PlayerManager_C_BndEvt__BP_PlayerRessurectRight_K2Node_ComponentBoundEvent_1_RessurectSuccessDelegate__DelegateSignature");
static_assert(sizeof(BP_PlayerManager_C_BndEvt__BP_PlayerRessurectRight_K2Node_ComponentBoundEvent_1_RessurectSuccessDelegate__DelegateSignature) == 0x000008, "Wrong size on BP_PlayerManager_C_BndEvt__BP_PlayerRessurectRight_K2Node_ComponentBoundEvent_1_RessurectSuccessDelegate__DelegateSignature");
static_assert(offsetof(BP_PlayerManager_C_BndEvt__BP_PlayerRessurectRight_K2Node_ComponentBoundEvent_1_RessurectSuccessDelegate__DelegateSignature, RevivePlayer) == 0x000000, "Member 'BP_PlayerManager_C_BndEvt__BP_PlayerRessurectRight_K2Node_ComponentBoundEvent_1_RessurectSuccessDelegate__DelegateSignature::RevivePlayer' has a wrong offset!");

// Function BP_PlayerManager.BP_PlayerManager_C.BndEvt__BP_PlayerRessurecttLeft_K2Node_ComponentBoundEvent_0_RessurectSuccessDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerManager_C_BndEvt__BP_PlayerRessurecttLeft_K2Node_ComponentBoundEvent_0_RessurectSuccessDelegate__DelegateSignature final
{
public:
	class AActor*                                 RevivePlayer;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerManager_C_BndEvt__BP_PlayerRessurecttLeft_K2Node_ComponentBoundEvent_0_RessurectSuccessDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_PlayerManager_C_BndEvt__BP_PlayerRessurecttLeft_K2Node_ComponentBoundEvent_0_RessurectSuccessDelegate__DelegateSignature");
static_assert(sizeof(BP_PlayerManager_C_BndEvt__BP_PlayerRessurecttLeft_K2Node_ComponentBoundEvent_0_RessurectSuccessDelegate__DelegateSignature) == 0x000008, "Wrong size on BP_PlayerManager_C_BndEvt__BP_PlayerRessurecttLeft_K2Node_ComponentBoundEvent_0_RessurectSuccessDelegate__DelegateSignature");
static_assert(offsetof(BP_PlayerManager_C_BndEvt__BP_PlayerRessurecttLeft_K2Node_ComponentBoundEvent_0_RessurectSuccessDelegate__DelegateSignature, RevivePlayer) == 0x000000, "Member 'BP_PlayerManager_C_BndEvt__BP_PlayerRessurecttLeft_K2Node_ComponentBoundEvent_0_RessurectSuccessDelegate__DelegateSignature::RevivePlayer' has a wrong offset!");

// Function BP_PlayerManager.BP_PlayerManager_C.UpdateWarpPartner
// 0x00F8 (0x00F8 - 0x0000)
struct BP_PlayerManager_C_UpdateWarpPartner final
{
public:
	float                                         LWarpDistance;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B81[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ERSPartyPlayerKind>                    LPlayerKindList;                                   // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	bool                                          LbBattle;                                          // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	ERSPartyPlayerKind                            LPlayerKind;                                       // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B82[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LMainPlayer;                                       // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 LPlayer;                                           // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface;       // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerStatusAI_bResult;                 // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B83[0x5];                                     // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ERSPartyPlayerKind>                    K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B84[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface_1;     // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionStatusAI_bResult;                 // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B85[0x1];                                     // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BattlefieldManager_C*               CallFunc_GetBattlefieldManager_BP_BattlefieldManager; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyFenceEnabled_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B86[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface;         // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetNpcWarpDither_bDummy;                  // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B87[0x2];                                     // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BattleManager_C*                    CallFunc_GetBattleManager_BattleManager;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface_1;       // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBattleMode_ReturnValue;                 // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsForceWarpAble_Interface_bWarpAble;      // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B88[0x1];                                     // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerNum_ReturnValue;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B89[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue_1;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckDistance_bResult;                    // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInAntiWarpField_bInAntiWarp;            // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerManager_C_UpdateWarpPartner) == 0x000008, "Wrong alignment on BP_PlayerManager_C_UpdateWarpPartner");
static_assert(sizeof(BP_PlayerManager_C_UpdateWarpPartner) == 0x0000F8, "Wrong size on BP_PlayerManager_C_UpdateWarpPartner");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, LWarpDistance) == 0x000000, "Member 'BP_PlayerManager_C_UpdateWarpPartner::LWarpDistance' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, LPlayerKindList) == 0x000008, "Member 'BP_PlayerManager_C_UpdateWarpPartner::LPlayerKindList' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, LbBattle) == 0x000018, "Member 'BP_PlayerManager_C_UpdateWarpPartner::LbBattle' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, LPlayerKind) == 0x000019, "Member 'BP_PlayerManager_C_UpdateWarpPartner::LPlayerKind' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, LMainPlayer) == 0x000020, "Member 'BP_PlayerManager_C_UpdateWarpPartner::LMainPlayer' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, LPlayer) == 0x000028, "Member 'BP_PlayerManager_C_UpdateWarpPartner::LPlayer' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, CallFunc_GetPlayer_ReturnValue) == 0x000030, "Member 'BP_PlayerManager_C_UpdateWarpPartner::CallFunc_GetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, K2Node_DynamicCast_AsBPI_Player_AIInterface) == 0x000038, "Member 'BP_PlayerManager_C_UpdateWarpPartner::K2Node_DynamicCast_AsBPI_Player_AIInterface' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_PlayerManager_C_UpdateWarpPartner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, CallFunc_IsPlayerStatusAI_bResult) == 0x000049, "Member 'BP_PlayerManager_C_UpdateWarpPartner::CallFunc_IsPlayerStatusAI_bResult' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, CallFunc_IsValid_ReturnValue) == 0x00004A, "Member 'BP_PlayerManager_C_UpdateWarpPartner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, K2Node_MakeArray_Array) == 0x000050, "Member 'BP_PlayerManager_C_UpdateWarpPartner::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, Temp_int_Array_Index_Variable) == 0x000060, "Member 'BP_PlayerManager_C_UpdateWarpPartner::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, Temp_int_Loop_Num_Variable) == 0x000064, "Member 'BP_PlayerManager_C_UpdateWarpPartner::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'BP_PlayerManager_C_UpdateWarpPartner::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, K2Node_DynamicCast_AsBPI_Player_AIInterface_1) == 0x000070, "Member 'BP_PlayerManager_C_UpdateWarpPartner::K2Node_DynamicCast_AsBPI_Player_AIInterface_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'BP_PlayerManager_C_UpdateWarpPartner::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, CallFunc_Less_IntInt_ReturnValue) == 0x000081, "Member 'BP_PlayerManager_C_UpdateWarpPartner::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, CallFunc_IsActionStatusAI_bResult) == 0x000082, "Member 'BP_PlayerManager_C_UpdateWarpPartner::CallFunc_IsActionStatusAI_bResult' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, CallFunc_Add_IntInt_ReturnValue) == 0x000084, "Member 'BP_PlayerManager_C_UpdateWarpPartner::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, CallFunc_GetBattlefieldManager_BP_BattlefieldManager) == 0x000088, "Member 'BP_PlayerManager_C_UpdateWarpPartner::CallFunc_GetBattlefieldManager_BP_BattlefieldManager' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, CallFunc_IsAnyFenceEnabled_ReturnValue) == 0x000090, "Member 'BP_PlayerManager_C_UpdateWarpPartner::CallFunc_IsAnyFenceEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, K2Node_DynamicCast_AsBPI_Player_Interface) == 0x000098, "Member 'BP_PlayerManager_C_UpdateWarpPartner::K2Node_DynamicCast_AsBPI_Player_Interface' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, K2Node_DynamicCast_bSuccess_2) == 0x0000A8, "Member 'BP_PlayerManager_C_UpdateWarpPartner::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, CallFunc_SetNpcWarpDither_bDummy) == 0x0000A9, "Member 'BP_PlayerManager_C_UpdateWarpPartner::CallFunc_SetNpcWarpDither_bDummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, CallFunc_Array_Length_ReturnValue) == 0x0000AC, "Member 'BP_PlayerManager_C_UpdateWarpPartner::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, CallFunc_GetBattleManager_BattleManager) == 0x0000B0, "Member 'BP_PlayerManager_C_UpdateWarpPartner::CallFunc_GetBattleManager_BattleManager' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, K2Node_DynamicCast_AsBPI_Player_Interface_1) == 0x0000B8, "Member 'BP_PlayerManager_C_UpdateWarpPartner::K2Node_DynamicCast_AsBPI_Player_Interface_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, K2Node_DynamicCast_bSuccess_3) == 0x0000C8, "Member 'BP_PlayerManager_C_UpdateWarpPartner::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, CallFunc_IsBattleMode_ReturnValue) == 0x0000C9, "Member 'BP_PlayerManager_C_UpdateWarpPartner::CallFunc_IsBattleMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, CallFunc_IsForceWarpAble_Interface_bWarpAble) == 0x0000CA, "Member 'BP_PlayerManager_C_UpdateWarpPartner::CallFunc_IsForceWarpAble_Interface_bWarpAble' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, CallFunc_GetPlayerNum_ReturnValue) == 0x0000CC, "Member 'BP_PlayerManager_C_UpdateWarpPartner::CallFunc_GetPlayerNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_PlayerManager_C_UpdateWarpPartner::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000D4, "Member 'BP_PlayerManager_C_UpdateWarpPartner::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, CallFunc_GetPlayer_ReturnValue_1) == 0x0000E0, "Member 'BP_PlayerManager_C_UpdateWarpPartner::CallFunc_GetPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000E8, "Member 'BP_PlayerManager_C_UpdateWarpPartner::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, CallFunc_CheckDistance_bResult) == 0x0000F4, "Member 'BP_PlayerManager_C_UpdateWarpPartner::CallFunc_CheckDistance_bResult' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, CallFunc_IsInAntiWarpField_bInAntiWarp) == 0x0000F5, "Member 'BP_PlayerManager_C_UpdateWarpPartner::CallFunc_IsInAntiWarpField_bInAntiWarp' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_UpdateWarpPartner, CallFunc_Not_PreBool_ReturnValue) == 0x0000F6, "Member 'BP_PlayerManager_C_UpdateWarpPartner::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_PlayerManager.BP_PlayerManager_C.AllPlayerRigitBodyEmptyUpdate
// 0x0058 (0x0058 - 0x0000)
struct BP_PlayerManager_C_AllPlayerRigitBodyEmptyUpdate final
{
public:
	float                                         EmptyUpdateSeconds;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B8A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARSCharacterBase*>               LPlayerList;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B8B[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEventInterface>       K2Node_DynamicCast_AsEvent_Interface;              // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B8C[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ARSCharacterBase*>               CallFunc_GetPlayerList_ReturnValue;                // 0x0048(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerManager_C_AllPlayerRigitBodyEmptyUpdate) == 0x000008, "Wrong alignment on BP_PlayerManager_C_AllPlayerRigitBodyEmptyUpdate");
static_assert(sizeof(BP_PlayerManager_C_AllPlayerRigitBodyEmptyUpdate) == 0x000058, "Wrong size on BP_PlayerManager_C_AllPlayerRigitBodyEmptyUpdate");
static_assert(offsetof(BP_PlayerManager_C_AllPlayerRigitBodyEmptyUpdate, EmptyUpdateSeconds) == 0x000000, "Member 'BP_PlayerManager_C_AllPlayerRigitBodyEmptyUpdate::EmptyUpdateSeconds' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_AllPlayerRigitBodyEmptyUpdate, LPlayerList) == 0x000008, "Member 'BP_PlayerManager_C_AllPlayerRigitBodyEmptyUpdate::LPlayerList' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_AllPlayerRigitBodyEmptyUpdate, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_PlayerManager_C_AllPlayerRigitBodyEmptyUpdate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_AllPlayerRigitBodyEmptyUpdate, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_PlayerManager_C_AllPlayerRigitBodyEmptyUpdate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerManager_C_AllPlayerRigitBodyEmptyUpdate, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_PlayerManager_C_AllPlayerRigitBodyEmptyUpdate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
