#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerActionStateEndBrainCrash

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PlayerActionStateEndBrainCrash.BP_PlayerActionStateEndBrainCrash_C.Enter
// 0x0028 (0x0028 - 0x0000)
struct BP_PlayerActionStateEndBrainCrash_C_Enter final
{
public:
	int32                                         Param;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Enter_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93C8[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_LookAtInterface_C> CallFunc_SetLookAtEnable_self_CastInput;           // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetLookAtEnable_bResult;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93C9[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayAnimMontage_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerActionStateEndBrainCrash_C_Enter) == 0x000008, "Wrong alignment on BP_PlayerActionStateEndBrainCrash_C_Enter");
static_assert(sizeof(BP_PlayerActionStateEndBrainCrash_C_Enter) == 0x000028, "Wrong size on BP_PlayerActionStateEndBrainCrash_C_Enter");
static_assert(offsetof(BP_PlayerActionStateEndBrainCrash_C_Enter, Param) == 0x000000, "Member 'BP_PlayerActionStateEndBrainCrash_C_Enter::Param' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEndBrainCrash_C_Enter, ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateEndBrainCrash_C_Enter::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEndBrainCrash_C_Enter, CallFunc_Enter_ReturnValue) == 0x000008, "Member 'BP_PlayerActionStateEndBrainCrash_C_Enter::CallFunc_Enter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEndBrainCrash_C_Enter, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'BP_PlayerActionStateEndBrainCrash_C_Enter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEndBrainCrash_C_Enter, CallFunc_SetLookAtEnable_self_CastInput) == 0x000010, "Member 'BP_PlayerActionStateEndBrainCrash_C_Enter::CallFunc_SetLookAtEnable_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEndBrainCrash_C_Enter, CallFunc_SetLookAtEnable_bResult) == 0x000020, "Member 'BP_PlayerActionStateEndBrainCrash_C_Enter::CallFunc_SetLookAtEnable_bResult' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEndBrainCrash_C_Enter, CallFunc_PlayAnimMontage_ReturnValue) == 0x000024, "Member 'BP_PlayerActionStateEndBrainCrash_C_Enter::CallFunc_PlayAnimMontage_ReturnValue' has a wrong offset!");

// Function BP_PlayerActionStateEndBrainCrash.BP_PlayerActionStateEndBrainCrash_C.Exit
// 0x0028 (0x0028 - 0x0000)
struct BP_PlayerActionStateEndBrainCrash_C_Exit final
{
public:
	int32                                         NextStateIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Exit_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93CA[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_LookAtInterface_C> CallFunc_SetLookAtEnable_self_CastInput;           // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetLookAtEnable_bResult;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateEndBrainCrash_C_Exit) == 0x000008, "Wrong alignment on BP_PlayerActionStateEndBrainCrash_C_Exit");
static_assert(sizeof(BP_PlayerActionStateEndBrainCrash_C_Exit) == 0x000028, "Wrong size on BP_PlayerActionStateEndBrainCrash_C_Exit");
static_assert(offsetof(BP_PlayerActionStateEndBrainCrash_C_Exit, NextStateIndex) == 0x000000, "Member 'BP_PlayerActionStateEndBrainCrash_C_Exit::NextStateIndex' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEndBrainCrash_C_Exit, ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateEndBrainCrash_C_Exit::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEndBrainCrash_C_Exit, CallFunc_Exit_ReturnValue) == 0x000008, "Member 'BP_PlayerActionStateEndBrainCrash_C_Exit::CallFunc_Exit_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEndBrainCrash_C_Exit, CallFunc_SetLookAtEnable_self_CastInput) == 0x000010, "Member 'BP_PlayerActionStateEndBrainCrash_C_Exit::CallFunc_SetLookAtEnable_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEndBrainCrash_C_Exit, CallFunc_SetLookAtEnable_bResult) == 0x000020, "Member 'BP_PlayerActionStateEndBrainCrash_C_Exit::CallFunc_SetLookAtEnable_bResult' has a wrong offset!");

// Function BP_PlayerActionStateEndBrainCrash.BP_PlayerActionStateEndBrainCrash_C.Update
// 0x0018 (0x0018 - 0x0000)
struct BP_PlayerActionStateEndBrainCrash_C_Update final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Update_ReturnValue;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimMontageStoped_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateEndBrainCrash_C_Update) == 0x000008, "Wrong alignment on BP_PlayerActionStateEndBrainCrash_C_Update");
static_assert(sizeof(BP_PlayerActionStateEndBrainCrash_C_Update) == 0x000018, "Wrong size on BP_PlayerActionStateEndBrainCrash_C_Update");
static_assert(offsetof(BP_PlayerActionStateEndBrainCrash_C_Update, ReturnValue) == 0x000000, "Member 'BP_PlayerActionStateEndBrainCrash_C_Update::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEndBrainCrash_C_Update, CallFunc_Update_ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateEndBrainCrash_C_Update::CallFunc_Update_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEndBrainCrash_C_Update, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'BP_PlayerActionStateEndBrainCrash_C_Update::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEndBrainCrash_C_Update, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_PlayerActionStateEndBrainCrash_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateEndBrainCrash_C_Update, CallFunc_IsAnimMontageStoped_ReturnValue) == 0x000011, "Member 'BP_PlayerActionStateEndBrainCrash_C_Update::CallFunc_IsAnimMontageStoped_ReturnValue' has a wrong offset!");

}

