#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PsychicAttackComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BP_PsychicAttackComponent.BP_PsychicAttackComponent_C.ExecuteUbergraph_BP_PsychicAttackComponent
// 0x000C (0x000C - 0x0000)
struct BP_PsychicAttackComponent_C_ExecuteUbergraph_BP_PsychicAttackComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetAttackMontage_bSuccess;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetAttackMontage_bCancel;                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EndAttack_Dummy;                          // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicAttackComponent_C_ExecuteUbergraph_BP_PsychicAttackComponent) == 0x000004, "Wrong alignment on BP_PsychicAttackComponent_C_ExecuteUbergraph_BP_PsychicAttackComponent");
static_assert(sizeof(BP_PsychicAttackComponent_C_ExecuteUbergraph_BP_PsychicAttackComponent) == 0x00000C, "Wrong size on BP_PsychicAttackComponent_C_ExecuteUbergraph_BP_PsychicAttackComponent");
static_assert(offsetof(BP_PsychicAttackComponent_C_ExecuteUbergraph_BP_PsychicAttackComponent, EntryPoint) == 0x000000, "Member 'BP_PsychicAttackComponent_C_ExecuteUbergraph_BP_PsychicAttackComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_ExecuteUbergraph_BP_PsychicAttackComponent, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_PsychicAttackComponent_C_ExecuteUbergraph_BP_PsychicAttackComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_ExecuteUbergraph_BP_PsychicAttackComponent, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_PsychicAttackComponent_C_ExecuteUbergraph_BP_PsychicAttackComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_ExecuteUbergraph_BP_PsychicAttackComponent, CallFunc_SetAttackMontage_bSuccess) == 0x000009, "Member 'BP_PsychicAttackComponent_C_ExecuteUbergraph_BP_PsychicAttackComponent::CallFunc_SetAttackMontage_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_ExecuteUbergraph_BP_PsychicAttackComponent, CallFunc_SetAttackMontage_bCancel) == 0x00000A, "Member 'BP_PsychicAttackComponent_C_ExecuteUbergraph_BP_PsychicAttackComponent::CallFunc_SetAttackMontage_bCancel' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_ExecuteUbergraph_BP_PsychicAttackComponent, CallFunc_EndAttack_Dummy) == 0x00000B, "Member 'BP_PsychicAttackComponent_C_ExecuteUbergraph_BP_PsychicAttackComponent::CallFunc_EndAttack_Dummy' has a wrong offset!");

// Function BP_PsychicAttackComponent.BP_PsychicAttackComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PsychicAttackComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicAttackComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PsychicAttackComponent_C_ReceiveTick");
static_assert(sizeof(BP_PsychicAttackComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_PsychicAttackComponent_C_ReceiveTick");
static_assert(offsetof(BP_PsychicAttackComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PsychicAttackComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PsychicAttackComponent.BP_PsychicAttackComponent_C.InputButtonByCombo
// 0x0005 (0x0005 - 0x0000)
struct BP_PsychicAttackComponent_C_InputButtonByCombo final
{
public:
	bool                                          bPressed;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bComboFirst;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckStartAttack_ReturnValue;             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableAttack_bEnable;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicAttackComponent_C_InputButtonByCombo) == 0x000001, "Wrong alignment on BP_PsychicAttackComponent_C_InputButtonByCombo");
static_assert(sizeof(BP_PsychicAttackComponent_C_InputButtonByCombo) == 0x000005, "Wrong size on BP_PsychicAttackComponent_C_InputButtonByCombo");
static_assert(offsetof(BP_PsychicAttackComponent_C_InputButtonByCombo, bPressed) == 0x000000, "Member 'BP_PsychicAttackComponent_C_InputButtonByCombo::bPressed' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_InputButtonByCombo, bComboFirst) == 0x000001, "Member 'BP_PsychicAttackComponent_C_InputButtonByCombo::bComboFirst' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_InputButtonByCombo, ReturnValue) == 0x000002, "Member 'BP_PsychicAttackComponent_C_InputButtonByCombo::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_InputButtonByCombo, CallFunc_CheckStartAttack_ReturnValue) == 0x000003, "Member 'BP_PsychicAttackComponent_C_InputButtonByCombo::CallFunc_CheckStartAttack_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_InputButtonByCombo, CallFunc_IsEnableAttack_bEnable) == 0x000004, "Member 'BP_PsychicAttackComponent_C_InputButtonByCombo::CallFunc_IsEnableAttack_bEnable' has a wrong offset!");

// Function BP_PsychicAttackComponent.BP_PsychicAttackComponent_C.CheckStartAttack
// 0x001C (0x001C - 0x0000)
struct BP_PsychicAttackComponent_C_CheckStartAttack final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	EPsychicObjectState                           LObjState;                                         // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetFootIKEnable_Dummy;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerCaptureAnimPattern                     CallFunc_AnimPatternSetting_Pattern;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPsychicObjectState                           CallFunc_GetCapturePsychicObjectState_State;       // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_850B[0x1];                                     // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableAttack_bEnable;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAttacking_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicAttackComponent_C_CheckStartAttack) == 0x000004, "Wrong alignment on BP_PsychicAttackComponent_C_CheckStartAttack");
static_assert(sizeof(BP_PsychicAttackComponent_C_CheckStartAttack) == 0x00001C, "Wrong size on BP_PsychicAttackComponent_C_CheckStartAttack");
static_assert(offsetof(BP_PsychicAttackComponent_C_CheckStartAttack, DeltaTime) == 0x000000, "Member 'BP_PsychicAttackComponent_C_CheckStartAttack::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_CheckStartAttack, ReturnValue) == 0x000004, "Member 'BP_PsychicAttackComponent_C_CheckStartAttack::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_CheckStartAttack, LObjState) == 0x000005, "Member 'BP_PsychicAttackComponent_C_CheckStartAttack::LObjState' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_CheckStartAttack, CallFunc_SetFootIKEnable_Dummy) == 0x000006, "Member 'BP_PsychicAttackComponent_C_CheckStartAttack::CallFunc_SetFootIKEnable_Dummy' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_CheckStartAttack, CallFunc_IsValid_ReturnValue) == 0x000007, "Member 'BP_PsychicAttackComponent_C_CheckStartAttack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_CheckStartAttack, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'BP_PsychicAttackComponent_C_CheckStartAttack::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_CheckStartAttack, CallFunc_AnimPatternSetting_Pattern) == 0x000009, "Member 'BP_PsychicAttackComponent_C_CheckStartAttack::CallFunc_AnimPatternSetting_Pattern' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_CheckStartAttack, CallFunc_GetCapturePsychicObjectState_State) == 0x00000A, "Member 'BP_PsychicAttackComponent_C_CheckStartAttack::CallFunc_GetCapturePsychicObjectState_State' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_CheckStartAttack, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00000C, "Member 'BP_PsychicAttackComponent_C_CheckStartAttack::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_CheckStartAttack, CallFunc_IsEnableAttack_bEnable) == 0x000018, "Member 'BP_PsychicAttackComponent_C_CheckStartAttack::CallFunc_IsEnableAttack_bEnable' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_CheckStartAttack, CallFunc_IsAttacking_ReturnValue) == 0x000019, "Member 'BP_PsychicAttackComponent_C_CheckStartAttack::CallFunc_IsAttacking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_CheckStartAttack, CallFunc_IsValid_ReturnValue_1) == 0x00001A, "Member 'BP_PsychicAttackComponent_C_CheckStartAttack::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_PsychicAttackComponent.BP_PsychicAttackComponent_C.OnMontageBlendingOut
// 0x0018 (0x0018 - 0x0000)
struct BP_PsychicAttackComponent_C_OnMontageBlendingOut final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAttacking_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetAttackMontage_bSuccess;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetAttackMontage_bCancel;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EndAttack_Dummy;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicAttackComponent_C_OnMontageBlendingOut) == 0x000008, "Wrong alignment on BP_PsychicAttackComponent_C_OnMontageBlendingOut");
static_assert(sizeof(BP_PsychicAttackComponent_C_OnMontageBlendingOut) == 0x000018, "Wrong size on BP_PsychicAttackComponent_C_OnMontageBlendingOut");
static_assert(offsetof(BP_PsychicAttackComponent_C_OnMontageBlendingOut, Montage) == 0x000000, "Member 'BP_PsychicAttackComponent_C_OnMontageBlendingOut::Montage' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_OnMontageBlendingOut, bInterrupted) == 0x000008, "Member 'BP_PsychicAttackComponent_C_OnMontageBlendingOut::bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_OnMontageBlendingOut, ReturnValue) == 0x000009, "Member 'BP_PsychicAttackComponent_C_OnMontageBlendingOut::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_OnMontageBlendingOut, CallFunc_IsAttacking_ReturnValue) == 0x00000A, "Member 'BP_PsychicAttackComponent_C_OnMontageBlendingOut::CallFunc_IsAttacking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_OnMontageBlendingOut, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00000B, "Member 'BP_PsychicAttackComponent_C_OnMontageBlendingOut::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_OnMontageBlendingOut, CallFunc_SetAttackMontage_bSuccess) == 0x00000C, "Member 'BP_PsychicAttackComponent_C_OnMontageBlendingOut::CallFunc_SetAttackMontage_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_OnMontageBlendingOut, CallFunc_SetAttackMontage_bCancel) == 0x00000D, "Member 'BP_PsychicAttackComponent_C_OnMontageBlendingOut::CallFunc_SetAttackMontage_bCancel' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_OnMontageBlendingOut, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x00000E, "Member 'BP_PsychicAttackComponent_C_OnMontageBlendingOut::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_OnMontageBlendingOut, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x00000F, "Member 'BP_PsychicAttackComponent_C_OnMontageBlendingOut::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_OnMontageBlendingOut, CallFunc_EndAttack_Dummy) == 0x000010, "Member 'BP_PsychicAttackComponent_C_OnMontageBlendingOut::CallFunc_EndAttack_Dummy' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_OnMontageBlendingOut, CallFunc_EqualEqual_ObjectObject_ReturnValue_3) == 0x000011, "Member 'BP_PsychicAttackComponent_C_OnMontageBlendingOut::CallFunc_EqualEqual_ObjectObject_ReturnValue_3' has a wrong offset!");

// Function BP_PsychicAttackComponent.BP_PsychicAttackComponent_C.EndAttack
// 0x0014 (0x0014 - 0x0000)
struct BP_PsychicAttackComponent_C_EndAttack final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_850C[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetFlyingPsychicComboLevelMax_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetFootIKEnable_Dummy;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_850D[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPsychicComboLevelMax_ReturnValue;      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAttacking_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EndAttack_Dummy;                          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicAttackComponent_C_EndAttack) == 0x000004, "Wrong alignment on BP_PsychicAttackComponent_C_EndAttack");
static_assert(sizeof(BP_PsychicAttackComponent_C_EndAttack) == 0x000014, "Wrong size on BP_PsychicAttackComponent_C_EndAttack");
static_assert(offsetof(BP_PsychicAttackComponent_C_EndAttack, Dummy) == 0x000000, "Member 'BP_PsychicAttackComponent_C_EndAttack::Dummy' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_EndAttack, CallFunc_GetFlyingPsychicComboLevelMax_ReturnValue) == 0x000004, "Member 'BP_PsychicAttackComponent_C_EndAttack::CallFunc_GetFlyingPsychicComboLevelMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_EndAttack, CallFunc_SetFootIKEnable_Dummy) == 0x000008, "Member 'BP_PsychicAttackComponent_C_EndAttack::CallFunc_SetFootIKEnable_Dummy' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_EndAttack, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000009, "Member 'BP_PsychicAttackComponent_C_EndAttack::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_EndAttack, CallFunc_GetPsychicComboLevelMax_ReturnValue) == 0x00000C, "Member 'BP_PsychicAttackComponent_C_EndAttack::CallFunc_GetPsychicComboLevelMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_EndAttack, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000010, "Member 'BP_PsychicAttackComponent_C_EndAttack::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_EndAttack, CallFunc_IsAttacking_ReturnValue) == 0x000011, "Member 'BP_PsychicAttackComponent_C_EndAttack::CallFunc_IsAttacking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_EndAttack, CallFunc_EndAttack_Dummy) == 0x000012, "Member 'BP_PsychicAttackComponent_C_EndAttack::CallFunc_EndAttack_Dummy' has a wrong offset!");

// Function BP_PsychicAttackComponent.BP_PsychicAttackComponent_C.SetMontage
// 0x0010 (0x0010 - 0x0000)
struct BP_PsychicAttackComponent_C_SetMontage final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAddCombo;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAttacking_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicAttackComponent_C_SetMontage) == 0x000008, "Wrong alignment on BP_PsychicAttackComponent_C_SetMontage");
static_assert(sizeof(BP_PsychicAttackComponent_C_SetMontage) == 0x000010, "Wrong size on BP_PsychicAttackComponent_C_SetMontage");
static_assert(offsetof(BP_PsychicAttackComponent_C_SetMontage, Montage) == 0x000000, "Member 'BP_PsychicAttackComponent_C_SetMontage::Montage' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_SetMontage, bAddCombo) == 0x000008, "Member 'BP_PsychicAttackComponent_C_SetMontage::bAddCombo' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_SetMontage, CallFunc_Greater_IntInt_ReturnValue) == 0x000009, "Member 'BP_PsychicAttackComponent_C_SetMontage::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_SetMontage, CallFunc_IsAttacking_ReturnValue) == 0x00000A, "Member 'BP_PsychicAttackComponent_C_SetMontage::CallFunc_IsAttacking_ReturnValue' has a wrong offset!");

// Function BP_PsychicAttackComponent.BP_PsychicAttackComponent_C.SetAttackMontage
// 0x0008 (0x0008 - 0x0000)
struct BP_PsychicAttackComponent_C_SetAttackMontage final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCancel;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LbCancel;                                          // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LbSuccess;                                         // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetFootIKEnable_Dummy;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPsychicObjectState                           CallFunc_GetCapturePsychicObjectState_State;       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicAttackComponent_C_SetAttackMontage) == 0x000001, "Wrong alignment on BP_PsychicAttackComponent_C_SetAttackMontage");
static_assert(sizeof(BP_PsychicAttackComponent_C_SetAttackMontage) == 0x000008, "Wrong size on BP_PsychicAttackComponent_C_SetAttackMontage");
static_assert(offsetof(BP_PsychicAttackComponent_C_SetAttackMontage, bSuccess) == 0x000000, "Member 'BP_PsychicAttackComponent_C_SetAttackMontage::bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_SetAttackMontage, bCancel) == 0x000001, "Member 'BP_PsychicAttackComponent_C_SetAttackMontage::bCancel' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_SetAttackMontage, LbCancel) == 0x000002, "Member 'BP_PsychicAttackComponent_C_SetAttackMontage::LbCancel' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_SetAttackMontage, LbSuccess) == 0x000003, "Member 'BP_PsychicAttackComponent_C_SetAttackMontage::LbSuccess' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_SetAttackMontage, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'BP_PsychicAttackComponent_C_SetAttackMontage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_SetAttackMontage, CallFunc_SetFootIKEnable_Dummy) == 0x000005, "Member 'BP_PsychicAttackComponent_C_SetAttackMontage::CallFunc_SetFootIKEnable_Dummy' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_SetAttackMontage, CallFunc_GetCapturePsychicObjectState_State) == 0x000006, "Member 'BP_PsychicAttackComponent_C_SetAttackMontage::CallFunc_GetCapturePsychicObjectState_State' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_SetAttackMontage, K2Node_SwitchEnum_CmpSuccess) == 0x000007, "Member 'BP_PsychicAttackComponent_C_SetAttackMontage::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_PsychicAttackComponent.BP_PsychicAttackComponent_C.AnimPatternSetting
// 0x0038 (0x0038 - 0x0000)
struct BP_PsychicAttackComponent_C_AnimPatternSetting final
{
public:
	EPlayerCaptureAnimPattern                     Pattern;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_850E[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LIndex;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LbEndLeft;                                         // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_850F[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         COS60;                                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LObjectDirDot;                                     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LbObjectRight;                                     // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LbObjectLeft;                                      // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LbFrontRightFoot;                                  // 0x0016(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerCaptureAnimPattern                     LPattern;                                          // 0x0017(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PsychicObjectBasic_C*               CallFunc_GetCapturePsychicObject_return;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8510[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerCaptureAnimPattern                     CallFunc_CheckCaptureAnimPattern_Pattern;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicAttackComponent_C_AnimPatternSetting) == 0x000008, "Wrong alignment on BP_PsychicAttackComponent_C_AnimPatternSetting");
static_assert(sizeof(BP_PsychicAttackComponent_C_AnimPatternSetting) == 0x000038, "Wrong size on BP_PsychicAttackComponent_C_AnimPatternSetting");
static_assert(offsetof(BP_PsychicAttackComponent_C_AnimPatternSetting, Pattern) == 0x000000, "Member 'BP_PsychicAttackComponent_C_AnimPatternSetting::Pattern' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_AnimPatternSetting, LIndex) == 0x000004, "Member 'BP_PsychicAttackComponent_C_AnimPatternSetting::LIndex' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_AnimPatternSetting, LbEndLeft) == 0x000008, "Member 'BP_PsychicAttackComponent_C_AnimPatternSetting::LbEndLeft' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_AnimPatternSetting, COS60) == 0x00000C, "Member 'BP_PsychicAttackComponent_C_AnimPatternSetting::COS60' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_AnimPatternSetting, LObjectDirDot) == 0x000010, "Member 'BP_PsychicAttackComponent_C_AnimPatternSetting::LObjectDirDot' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_AnimPatternSetting, LbObjectRight) == 0x000014, "Member 'BP_PsychicAttackComponent_C_AnimPatternSetting::LbObjectRight' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_AnimPatternSetting, LbObjectLeft) == 0x000015, "Member 'BP_PsychicAttackComponent_C_AnimPatternSetting::LbObjectLeft' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_AnimPatternSetting, LbFrontRightFoot) == 0x000016, "Member 'BP_PsychicAttackComponent_C_AnimPatternSetting::LbFrontRightFoot' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_AnimPatternSetting, LPattern) == 0x000017, "Member 'BP_PsychicAttackComponent_C_AnimPatternSetting::LPattern' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_AnimPatternSetting, CallFunc_GetCapturePsychicObject_return) == 0x000018, "Member 'BP_PsychicAttackComponent_C_AnimPatternSetting::CallFunc_GetCapturePsychicObject_return' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_AnimPatternSetting, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_PsychicAttackComponent_C_AnimPatternSetting::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_AnimPatternSetting, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000024, "Member 'BP_PsychicAttackComponent_C_AnimPatternSetting::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_AnimPatternSetting, CallFunc_CheckCaptureAnimPattern_Pattern) == 0x000030, "Member 'BP_PsychicAttackComponent_C_AnimPatternSetting::CallFunc_CheckCaptureAnimPattern_Pattern' has a wrong offset!");

// Function BP_PsychicAttackComponent.BP_PsychicAttackComponent_C.AnimationSetting
// 0x0030 (0x0030 - 0x0000)
struct BP_PsychicAttackComponent_C_AnimationSetting final
{
public:
	EPlayerCaptureAnimPattern                     Pattern;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8511[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LIndex;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8512[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_Array_Get_Item_1;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_Array_Get_Item_2;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_Array_Get_Item_3;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicAttackComponent_C_AnimationSetting) == 0x000008, "Wrong alignment on BP_PsychicAttackComponent_C_AnimationSetting");
static_assert(sizeof(BP_PsychicAttackComponent_C_AnimationSetting) == 0x000030, "Wrong size on BP_PsychicAttackComponent_C_AnimationSetting");
static_assert(offsetof(BP_PsychicAttackComponent_C_AnimationSetting, Pattern) == 0x000000, "Member 'BP_PsychicAttackComponent_C_AnimationSetting::Pattern' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_AnimationSetting, LIndex) == 0x000004, "Member 'BP_PsychicAttackComponent_C_AnimationSetting::LIndex' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_AnimationSetting, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'BP_PsychicAttackComponent_C_AnimationSetting::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_AnimationSetting, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_PsychicAttackComponent_C_AnimationSetting::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_AnimationSetting, CallFunc_Array_Get_Item_1) == 0x000018, "Member 'BP_PsychicAttackComponent_C_AnimationSetting::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_AnimationSetting, CallFunc_Array_Get_Item_2) == 0x000020, "Member 'BP_PsychicAttackComponent_C_AnimationSetting::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_AnimationSetting, CallFunc_Array_Get_Item_3) == 0x000028, "Member 'BP_PsychicAttackComponent_C_AnimationSetting::CallFunc_Array_Get_Item_3' has a wrong offset!");

// Function BP_PsychicAttackComponent.BP_PsychicAttackComponent_C.EndCaptureObjectSE
// 0x0001 (0x0001 - 0x0000)
struct BP_PsychicAttackComponent_C_EndCaptureObjectSE final
{
public:
	bool                                          CallFunc_StopPsychicComboCaptureSE_bDummy;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicAttackComponent_C_EndCaptureObjectSE) == 0x000001, "Wrong alignment on BP_PsychicAttackComponent_C_EndCaptureObjectSE");
static_assert(sizeof(BP_PsychicAttackComponent_C_EndCaptureObjectSE) == 0x000001, "Wrong size on BP_PsychicAttackComponent_C_EndCaptureObjectSE");
static_assert(offsetof(BP_PsychicAttackComponent_C_EndCaptureObjectSE, CallFunc_StopPsychicComboCaptureSE_bDummy) == 0x000000, "Member 'BP_PsychicAttackComponent_C_EndCaptureObjectSE::CallFunc_StopPsychicComboCaptureSE_bDummy' has a wrong offset!");

// Function BP_PsychicAttackComponent.BP_PsychicAttackComponent_C.GetCurrentMontage
// 0x0008 (0x0008 - 0x0000)
struct BP_PsychicAttackComponent_C_GetCurrentMontage final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicAttackComponent_C_GetCurrentMontage) == 0x000008, "Wrong alignment on BP_PsychicAttackComponent_C_GetCurrentMontage");
static_assert(sizeof(BP_PsychicAttackComponent_C_GetCurrentMontage) == 0x000008, "Wrong size on BP_PsychicAttackComponent_C_GetCurrentMontage");
static_assert(offsetof(BP_PsychicAttackComponent_C_GetCurrentMontage, Montage) == 0x000000, "Member 'BP_PsychicAttackComponent_C_GetCurrentMontage::Montage' has a wrong offset!");

// Function BP_PsychicAttackComponent.BP_PsychicAttackComponent_C.IsEnableAttack
// 0x0002 (0x0002 - 0x0000)
struct BP_PsychicAttackComponent_C_IsEnableAttack final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableActionPsychic_bEnable;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicAttackComponent_C_IsEnableAttack) == 0x000001, "Wrong alignment on BP_PsychicAttackComponent_C_IsEnableAttack");
static_assert(sizeof(BP_PsychicAttackComponent_C_IsEnableAttack) == 0x000002, "Wrong size on BP_PsychicAttackComponent_C_IsEnableAttack");
static_assert(offsetof(BP_PsychicAttackComponent_C_IsEnableAttack, bEnable) == 0x000000, "Member 'BP_PsychicAttackComponent_C_IsEnableAttack::bEnable' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_IsEnableAttack, CallFunc_IsEnableActionPsychic_bEnable) == 0x000001, "Member 'BP_PsychicAttackComponent_C_IsEnableAttack::CallFunc_IsEnableActionPsychic_bEnable' has a wrong offset!");

// Function BP_PsychicAttackComponent.BP_PsychicAttackComponent_C.IsEnableAcceptInputAttack
// 0x0002 (0x0002 - 0x0000)
struct BP_PsychicAttackComponent_C_IsEnableAcceptInputAttack final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNotifyInputPsychic_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicAttackComponent_C_IsEnableAcceptInputAttack) == 0x000001, "Wrong alignment on BP_PsychicAttackComponent_C_IsEnableAcceptInputAttack");
static_assert(sizeof(BP_PsychicAttackComponent_C_IsEnableAcceptInputAttack) == 0x000002, "Wrong size on BP_PsychicAttackComponent_C_IsEnableAcceptInputAttack");
static_assert(offsetof(BP_PsychicAttackComponent_C_IsEnableAcceptInputAttack, bEnable) == 0x000000, "Member 'BP_PsychicAttackComponent_C_IsEnableAcceptInputAttack::bEnable' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_IsEnableAcceptInputAttack, CallFunc_IsNotifyInputPsychic_ReturnValue) == 0x000001, "Member 'BP_PsychicAttackComponent_C_IsEnableAcceptInputAttack::CallFunc_IsNotifyInputPsychic_ReturnValue' has a wrong offset!");

// Function BP_PsychicAttackComponent.BP_PsychicAttackComponent_C.GetObjectAnimation
// 0x0018 (0x0018 - 0x0000)
struct BP_PsychicAttackComponent_C_GetObjectAnimation final
{
public:
	class UAnimSequence*                          Animation;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8513[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicAttackComponent_C_GetObjectAnimation) == 0x000008, "Wrong alignment on BP_PsychicAttackComponent_C_GetObjectAnimation");
static_assert(sizeof(BP_PsychicAttackComponent_C_GetObjectAnimation) == 0x000018, "Wrong size on BP_PsychicAttackComponent_C_GetObjectAnimation");
static_assert(offsetof(BP_PsychicAttackComponent_C_GetObjectAnimation, Animation) == 0x000000, "Member 'BP_PsychicAttackComponent_C_GetObjectAnimation::Animation' has a wrong offset!");
static_assert(offsetof(BP_PsychicAttackComponent_C_GetObjectAnimation, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'BP_PsychicAttackComponent_C_GetObjectAnimation::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
