#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerActionStateBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerActionStateBase.BP_PlayerActionStateBase_C
// 0x0018 (0x00E8 - 0x00D0)
class UBP_PlayerActionStateBase_C : public URSStateComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ARSBattlePlayer_C*                      Player;                                            // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayerFixParamater_C*               PlayerFixParam;                                    // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PlayerActionStateBase(int32 EntryPoint);
	void ReceiveBeginPlay();
	int32 Enter(int32 Param);
	int32 Exit(int32 NextStateIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerActionStateBase_C">();
	}
	static class UBP_PlayerActionStateBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PlayerActionStateBase_C>();
	}
};
static_assert(alignof(UBP_PlayerActionStateBase_C) == 0x000008, "Wrong alignment on UBP_PlayerActionStateBase_C");
static_assert(sizeof(UBP_PlayerActionStateBase_C) == 0x0000E8, "Wrong size on UBP_PlayerActionStateBase_C");
static_assert(offsetof(UBP_PlayerActionStateBase_C, UberGraphFrame) == 0x0000D0, "Member 'UBP_PlayerActionStateBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateBase_C, Player) == 0x0000D8, "Member 'UBP_PlayerActionStateBase_C::Player' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateBase_C, PlayerFixParam) == 0x0000E0, "Member 'UBP_PlayerActionStateBase_C::PlayerFixParam' has a wrong offset!");

}

