#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerActionStateCancelMapGimmick

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_PlayerActionStateCommonBase_classes.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerActionStateCancelMapGimmick.BP_PlayerActionStateCancelMapGimmick_C
// 0x0018 (0x0100 - 0x00E8)
class UBP_PlayerActionStateCancelMapGimmick_C final : public UBP_PlayerActionStateCommonBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_PlayerActionStateCancelMapGimmick_C; // 0x00E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ARsBattleHero_C*                        OwnerHero;                                         // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMapGimmickObject*                      MapGimmick;                                        // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PlayerActionStateCancelMapGimmick(int32 EntryPoint);
	void ReceiveBeginPlay();
	int32 Enter(int32 Param);
	int32 Exit(int32 NextStateIndex);
	int32 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerActionStateCancelMapGimmick_C">();
	}
	static class UBP_PlayerActionStateCancelMapGimmick_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PlayerActionStateCancelMapGimmick_C>();
	}
};
static_assert(alignof(UBP_PlayerActionStateCancelMapGimmick_C) == 0x000008, "Wrong alignment on UBP_PlayerActionStateCancelMapGimmick_C");
static_assert(sizeof(UBP_PlayerActionStateCancelMapGimmick_C) == 0x000100, "Wrong size on UBP_PlayerActionStateCancelMapGimmick_C");
static_assert(offsetof(UBP_PlayerActionStateCancelMapGimmick_C, UberGraphFrame_BP_PlayerActionStateCancelMapGimmick_C) == 0x0000E8, "Member 'UBP_PlayerActionStateCancelMapGimmick_C::UberGraphFrame_BP_PlayerActionStateCancelMapGimmick_C' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateCancelMapGimmick_C, OwnerHero) == 0x0000F0, "Member 'UBP_PlayerActionStateCancelMapGimmick_C::OwnerHero' has a wrong offset!");
static_assert(offsetof(UBP_PlayerActionStateCancelMapGimmick_C, MapGimmick) == 0x0000F8, "Member 'UBP_PlayerActionStateCancelMapGimmick_C::MapGimmick' has a wrong offset!");

}

