#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerAIComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EPlayerAIBattleThinkType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FPlayerAIBattleThinkTransitionData_structs.hpp"
#include "EPlayerAIBattleThinkTransition_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "FPlayerAIBattleThinkData_structs.hpp"
#include "SNpcSelfRecoveryData_structs.hpp"
#include "EPlayerAIMoveMode_structs.hpp"
#include "EPlayerAIThinkTableType_structs.hpp"
#include "FNotifyAttackData_structs.hpp"
#include "EPlayerAIBattleThinkParam_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerAIComponent.BP_PlayerAIComponent_C.ExecuteUbergraph_BP_PlayerAIComponent
// 0x00A0 (0x00A0 - 0x0000)
struct BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(float DeltaSeconds)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UPlayerAIEvaluateLocationComponent*     CallFunc_GetEvaluateLocation_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerAIEvaluateLocationComponent*     CallFunc_GetEvaluateLocation_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6863[0x1];                                     // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DeltaSeconds;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Update_Check_Battle_Action_Start_bActionStart; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EREDActorStatType                             CallFunc_GetActorStatType_ReturnValue;             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6864[0x1];                                     // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6865[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerAiGoalActor_C*                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent) == 0x000010, "Wrong alignment on BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent");
static_assert(sizeof(BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent) == 0x0000A0, "Wrong size on BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent");
static_assert(offsetof(BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent, EntryPoint) == 0x000000, "Member 'BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent, Temp_bool_IsClosed_Variable_1) == 0x000006, "Member 'BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent, Temp_bool_Has_Been_Initd_Variable_1) == 0x000007, "Member 'BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent, CallFunc_GetEvaluateLocation_ReturnValue) == 0x000018, "Member 'BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent::CallFunc_GetEvaluateLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent, CallFunc_GetEvaluateLocation_ReturnValue_1) == 0x000020, "Member 'BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent::CallFunc_GetEvaluateLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent, K2Node_Event_EndPlayReason) == 0x000038, "Member 'BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent, Temp_bool_Has_Been_Initd_Variable_2) == 0x000039, "Member 'BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent, CallFunc_IsValid_ReturnValue) == 0x00003A, "Member 'BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent, K2Node_CustomEvent_DeltaSeconds) == 0x00003C, "Member 'BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent::K2Node_CustomEvent_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent, CallFunc_Update_Check_Battle_Action_Start_bActionStart) == 0x000040, "Member 'BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent::CallFunc_Update_Check_Battle_Action_Start_bActionStart' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent, Temp_bool_IsClosed_Variable_2) == 0x000041, "Member 'BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent, CallFunc_GetActorStatType_ReturnValue) == 0x000042, "Member 'BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent::CallFunc_GetActorStatType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent, CallFunc_IsValid_ReturnValue_1) == 0x000054, "Member 'BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000058, "Member 'BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000090, "Member 'BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent, CallFunc_FinishSpawningActor_ReturnValue) == 0x000098, "Member 'BP_PlayerAIComponent_C_ExecuteUbergraph_BP_PlayerAIComponent::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_PlayerAIComponent.BP_PlayerAIComponent_C.OnCheckBattleActionStartTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PlayerAIComponent_C_OnCheckBattleActionStartTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerAIComponent_C_OnCheckBattleActionStartTick) == 0x000004, "Wrong alignment on BP_PlayerAIComponent_C_OnCheckBattleActionStartTick");
static_assert(sizeof(BP_PlayerAIComponent_C_OnCheckBattleActionStartTick) == 0x000004, "Wrong size on BP_PlayerAIComponent_C_OnCheckBattleActionStartTick");
static_assert(offsetof(BP_PlayerAIComponent_C_OnCheckBattleActionStartTick, DeltaSeconds) == 0x000000, "Member 'BP_PlayerAIComponent_C_OnCheckBattleActionStartTick::DeltaSeconds' has a wrong offset!");

// Function BP_PlayerAIComponent.BP_PlayerAIComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerAIComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerAIComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_PlayerAIComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_PlayerAIComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_PlayerAIComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_PlayerAIComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_PlayerAIComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_PlayerAIComponent.BP_PlayerAIComponent_C.Update
// 0x0018 (0x0018 - 0x0000)
struct BP_PlayerAIComponent_C_Update final
{
public:
	class FString                                 WorkStr;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUpdate_bUpdate;                         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerAIComponent_C_Update) == 0x000008, "Wrong alignment on BP_PlayerAIComponent_C_Update");
static_assert(sizeof(BP_PlayerAIComponent_C_Update) == 0x000018, "Wrong size on BP_PlayerAIComponent_C_Update");
static_assert(offsetof(BP_PlayerAIComponent_C_Update, WorkStr) == 0x000000, "Member 'BP_PlayerAIComponent_C_Update::WorkStr' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Update, CallFunc_BooleanAND_ReturnValue) == 0x000010, "Member 'BP_PlayerAIComponent_C_Update::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Update, CallFunc_IsUpdate_bUpdate) == 0x000011, "Member 'BP_PlayerAIComponent_C_Update::CallFunc_IsUpdate_bUpdate' has a wrong offset!");

// Function BP_PlayerAIComponent.BP_PlayerAIComponent_C.UpdateMovePos
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerAIComponent_C_UpdateMovePos final
{
public:
	float                                         UpdateInterval;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEventMove_result;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckMovePos_bReset;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerAIComponent_C_UpdateMovePos) == 0x000004, "Wrong alignment on BP_PlayerAIComponent_C_UpdateMovePos");
static_assert(sizeof(BP_PlayerAIComponent_C_UpdateMovePos) == 0x000008, "Wrong size on BP_PlayerAIComponent_C_UpdateMovePos");
static_assert(offsetof(BP_PlayerAIComponent_C_UpdateMovePos, UpdateInterval) == 0x000000, "Member 'BP_PlayerAIComponent_C_UpdateMovePos::UpdateInterval' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_UpdateMovePos, CallFunc_BooleanAND_ReturnValue) == 0x000004, "Member 'BP_PlayerAIComponent_C_UpdateMovePos::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_UpdateMovePos, CallFunc_IsEventMove_result) == 0x000005, "Member 'BP_PlayerAIComponent_C_UpdateMovePos::CallFunc_IsEventMove_result' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_UpdateMovePos, K2Node_SwitchEnum_CmpSuccess) == 0x000006, "Member 'BP_PlayerAIComponent_C_UpdateMovePos::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_UpdateMovePos, CallFunc_CheckMovePos_bReset) == 0x000007, "Member 'BP_PlayerAIComponent_C_UpdateMovePos::CallFunc_CheckMovePos_bReset' has a wrong offset!");

// Function BP_PlayerAIComponent.BP_PlayerAIComponent_C.Initialize
// 0x0300 (0x0300 - 0x0000)
struct BP_PlayerAIComponent_C_Initialize final
{
public:
	int32                                         NewLocalVar_1;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6866[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 NewLocalVar_0;                                     // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6867[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6868[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6869[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerAIEvaluateLocationComponent*     CallFunc_GetEvaluateLocation_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayerAIEvaluateTargetParameter       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0050(0x0048)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_686A[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerAIEvaluateLocationComponent*     CallFunc_GetEvaluateLocation_ReturnValue_1;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_686B[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetName_ReturnValue;                      // 0x00AC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_686C[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerAIParameter                     CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x00B8(0x0050)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_686D[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IRSGameModeBPInterface_C> K2Node_DynamicCast_AsRSGame_Mode_BPInterface;      // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_686E[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IRSGameModeBPInterface_C> K2Node_DynamicCast_AsRSGame_Mode_BPInterface_1;    // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_686F[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_GetLeftPlayerBP_Player;                   // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_GetMainPlayerBP_Player;                   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6870[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_IsEnemyPlayer_self_CastInput;             // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemyPlayer_bEnemyPlayer;               // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6871[0x3];                                     // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IPlayerInterface>      CallFunc_GetPlayerID_self_CastInput;               // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue;                  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6872[0x3];                                     // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerInfo                            CallFunc_GetPartyMemberInfo_ReturnValue;           // 0x019C(0x00D0)(NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6873[0x3];                                     // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerAIEvaluateTargetParameter       Temp_struct_Variable;                              // 0x0270(0x0048)(ConstParm)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6874[0x4];                                     // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICommonAIInterface_C>  CallFunc_GetIsBattleMode_self_CastInput;           // 0x02C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsBattleMode_IsBattleMode;             // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6875[0x3];                                     // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x02D4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6876[0x4];                                     // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player_1;            // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerAIComponent_C_Initialize) == 0x000008, "Wrong alignment on BP_PlayerAIComponent_C_Initialize");
static_assert(sizeof(BP_PlayerAIComponent_C_Initialize) == 0x000300, "Wrong size on BP_PlayerAIComponent_C_Initialize");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, NewLocalVar_1) == 0x000000, "Member 'BP_PlayerAIComponent_C_Initialize::NewLocalVar_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, NewLocalVar_0) == 0x000008, "Member 'BP_PlayerAIComponent_C_Initialize::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, Temp_int_Variable) == 0x000018, "Member 'BP_PlayerAIComponent_C_Initialize::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_Conv_IntToString_ReturnValue) == 0x000020, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_Conv_StringToName_ReturnValue) == 0x000030, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000038, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_GetEvaluateLocation_ReturnValue) == 0x000048, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_GetEvaluateLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_GetDataTableRowFromName_OutRow) == 0x000050, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000098, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_Array_Add_ReturnValue) == 0x00009C, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_GetEvaluateLocation_ReturnValue_1) == 0x0000A0, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_GetEvaluateLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_IsValid_ReturnValue_1) == 0x0000A8, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_GetName_ReturnValue) == 0x0000AC, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_GetName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0000B8, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000108, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_GetGameMode_ReturnValue) == 0x000110, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_GetPlayerManager_PlayerManager) == 0x000118, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, K2Node_DynamicCast_AsRSGame_Mode_BPInterface) == 0x000120, "Member 'BP_PlayerAIComponent_C_Initialize::K2Node_DynamicCast_AsRSGame_Mode_BPInterface' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'BP_PlayerAIComponent_C_Initialize::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, K2Node_DynamicCast_AsRSGame_Mode_BPInterface_1) == 0x000138, "Member 'BP_PlayerAIComponent_C_Initialize::K2Node_DynamicCast_AsRSGame_Mode_BPInterface_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, K2Node_DynamicCast_bSuccess_1) == 0x000148, "Member 'BP_PlayerAIComponent_C_Initialize::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_GetLeftPlayerBP_Player) == 0x000150, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_GetLeftPlayerBP_Player' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_GetMainPlayerBP_Player) == 0x000158, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_GetMainPlayerBP_Player' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, K2Node_DynamicCast_AsRSBattle_Player) == 0x000160, "Member 'BP_PlayerAIComponent_C_Initialize::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, K2Node_DynamicCast_bSuccess_2) == 0x000168, "Member 'BP_PlayerAIComponent_C_Initialize::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_IsEnemyPlayer_self_CastInput) == 0x000170, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_IsEnemyPlayer_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_IsEnemyPlayer_bEnemyPlayer) == 0x000180, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_IsEnemyPlayer_bEnemyPlayer' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_MakeLiteralInt_ReturnValue) == 0x000184, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_GetPlayerID_self_CastInput) == 0x000188, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_GetPlayerID_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_GetPlayerID_ReturnValue) == 0x000198, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_GetPlayerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_GetPartyMemberInfo_ReturnValue) == 0x00019C, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_GetPartyMemberInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_Not_PreBool_ReturnValue) == 0x00026C, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, Temp_struct_Variable) == 0x000270, "Member 'BP_PlayerAIComponent_C_Initialize::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_Array_Add_ReturnValue_1) == 0x0002B8, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_GetIsBattleMode_self_CastInput) == 0x0002C0, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_GetIsBattleMode_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_GetIsBattleMode_IsBattleMode) == 0x0002D0, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_GetIsBattleMode_IsBattleMode' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, K2Node_CreateDelegate_OutputDelegate) == 0x0002D4, "Member 'BP_PlayerAIComponent_C_Initialize::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_GetOwner_ReturnValue) == 0x0002E8, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, K2Node_DynamicCast_AsRSBattle_Player_1) == 0x0002F0, "Member 'BP_PlayerAIComponent_C_Initialize::K2Node_DynamicCast_AsRSBattle_Player_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, K2Node_DynamicCast_bSuccess_3) == 0x0002F8, "Member 'BP_PlayerAIComponent_C_Initialize::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerAIComponent_C_Initialize, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0002F9, "Member 'BP_PlayerAIComponent_C_Initialize::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_PlayerAIComponent.BP_PlayerAIComponent_C.SetMoveMode
// 0x03E0 (0x03E0 - 0x0000)
struct BP_PlayerAIComponent_C_SetMoveMode final
{
public:
	EPlayerAIMoveModeCPP                          ModeCPP;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerAIBattleThinkTypeCPP                   LCurrentThinkCPP;                                  // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerAIMoveModeCPP                          LPrevMoveModeCPP;                                  // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6877[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      LOtherNpc;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LbBattleRangeFar;                                  // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LbDisableLocation;                                 // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6878[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LTargetLocation;                                   // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LTempLocation;                                     // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LTargetToPlayerRotate;                             // 0x002C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         LRadius;                                           // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LDir;                                              // 0x003C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LArmAngle;                                         // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LArmLength;                                        // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6879[0x1];                                     // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_687A[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      CallFunc_GetPartyPlayerKind_self_CastInput;        // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ERSPartyPlayerKind                            CallFunc_GetPartyPlayerKind_ReturnValue;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_687B[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      CallFunc_GetRightPlayer_Player;                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_687C[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      CallFunc_GetLeftPlayer_Player;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_687D[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_687E[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerAIEvaluateLocationComponent*     CallFunc_GetEvaluateLocation_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAIBattleRange                                CallFunc_GetAIBattleRangeType_ReturnValue;         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_687F[0x2];                                     // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICommonAIInterface_C>  K2Node_DynamicCast_AsCommon_AIInterface;           // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6880[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCapsuleRadius_Radius;                  // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerAIEvaluateLocationComponent*     CallFunc_GetEvaluateLocation_ReturnValue_1;        // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAIBattleRange_ReturnValue;             // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_2;                      // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6881[0x4];                                     // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerAIEvaluateLocationComponent*     CallFunc_GetEvaluateLocation_ReturnValue_2;        // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLocationPriorityRank_outRank;          // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationPriorityRank_outLocation;      // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLocationPriorityRank_ReturnValue;      // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6882[0x3];                                     // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_3;      // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue_1; // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6883[0x3];                                     // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6884[0x4];                                     // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerAIEvaluateLocationComponent*     CallFunc_GetEvaluateLocation_ReturnValue_3;        // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue_1; // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAIBattleRange_ReturnValue_1;           // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue_1;               // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAIBattleRange_ReturnValue_2;           // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerAIEvaluateLocationComponent*     CallFunc_GetEvaluateLocation_ReturnValue_4;        // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetHighPriorityLocationByRange_outLocation; // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHighPriorityLocationByRange_ReturnValue; // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6885[0x3];                                     // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerAIEvaluateLocationComponent*     CallFunc_GetEvaluateLocation_ReturnValue_5;        // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetHighPriorityLocation_outLocation;      // 0x0288(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHighPriorityLocation_ReturnValue;      // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0295(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6886[0x2];                                     // 0x0296(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6887[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICommonAIInterface_C>  K2Node_DynamicCast_AsCommon_AIInterface_1;         // 0x02B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6888[0x3];                                     // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_7;        // 0x02CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCapsuleRadius_Radius_1;                // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x02EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerAIEvaluateLocationComponent*     CallFunc_GetEvaluateLocation_ReturnValue_6;        // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerAIEvaluateLocationComponent*     CallFunc_GetEvaluateLocation_ReturnValue_7;        // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLocationPriorityRank_outRank_1;        // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationPriorityRank_outLocation_1;    // 0x030C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLocationPriorityRank_ReturnValue_1;    // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6889[0x3];                                     // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLocationPriorityRank_outRank_2;        // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationPriorityRank_outLocation_2;    // 0x0320(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLocationPriorityRank_ReturnValue_2;    // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x032D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_688A[0x2];                                     // 0x032E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_8;        // 0x0330(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_9;        // 0x033C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_688B[0x3];                                     // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
