#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerActionStateSprint

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerActionStateSprint.BP_PlayerActionStateSprint_C.CheckSprintEnd
// 0x001C (0x001C - 0x0000)
struct BP_PlayerActionStateSprint_C_CheckSprintEnd final
{
public:
	bool                                          bEnd;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93A3[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRestriction_ReturnValue;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerStatus_Result;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsControlAI_bAI;                          // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerStatus_Result_1;                  // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93A4[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateSprint_C_CheckSprintEnd) == 0x000004, "Wrong alignment on BP_PlayerActionStateSprint_C_CheckSprintEnd");
static_assert(sizeof(BP_PlayerActionStateSprint_C_CheckSprintEnd) == 0x00001C, "Wrong size on BP_PlayerActionStateSprint_C_CheckSprintEnd");
static_assert(offsetof(BP_PlayerActionStateSprint_C_CheckSprintEnd, bEnd) == 0x000000, "Member 'BP_PlayerActionStateSprint_C_CheckSprintEnd::bEnd' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_CheckSprintEnd, Temp_float_Variable) == 0x000004, "Member 'BP_PlayerActionStateSprint_C_CheckSprintEnd::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_CheckSprintEnd, Temp_float_Variable_1) == 0x000008, "Member 'BP_PlayerActionStateSprint_C_CheckSprintEnd::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_CheckSprintEnd, CallFunc_IsRestriction_ReturnValue) == 0x00000C, "Member 'BP_PlayerActionStateSprint_C_CheckSprintEnd::CallFunc_IsRestriction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_CheckSprintEnd, CallFunc_IsPlayerStatus_Result) == 0x00000D, "Member 'BP_PlayerActionStateSprint_C_CheckSprintEnd::CallFunc_IsPlayerStatus_Result' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_CheckSprintEnd, CallFunc_IsControlAI_bAI) == 0x00000E, "Member 'BP_PlayerActionStateSprint_C_CheckSprintEnd::CallFunc_IsControlAI_bAI' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_CheckSprintEnd, CallFunc_IsPlayerStatus_Result_1) == 0x00000F, "Member 'BP_PlayerActionStateSprint_C_CheckSprintEnd::CallFunc_IsPlayerStatus_Result_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_CheckSprintEnd, Temp_bool_Variable) == 0x000010, "Member 'BP_PlayerActionStateSprint_C_CheckSprintEnd::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_CheckSprintEnd, K2Node_Select_Default) == 0x000014, "Member 'BP_PlayerActionStateSprint_C_CheckSprintEnd::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_CheckSprintEnd, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_PlayerActionStateSprint_C_CheckSprintEnd::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_PlayerActionStateSprint.BP_PlayerActionStateSprint_C.Enter
// 0x0078 (0x0078 - 0x0000)
struct BP_PlayerActionStateSprint_C_Enter final
{
public:
	int32                                         Param;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Enter_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerStatus_Result;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93A5[0x1];                                     // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93A6[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UASCharacterMovementComponent*          K2Node_DynamicCast_AsASCharacter_Movement_Component; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93A7[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CalcInputWorldVector_ReturnValue;         // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckHardenRestriction_dummy;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93A8[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_PlaySASCodeDirection_self_CastInput;      // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlaySASCodeDirection_bDummy;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateSprint_C_Enter) == 0x000008, "Wrong alignment on BP_PlayerActionStateSprint_C_Enter");
static_assert(sizeof(BP_PlayerActionStateSprint_C_Enter) == 0x000078, "Wrong size on BP_PlayerActionStateSprint_C_Enter");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Enter, Param) == 0x000000, "Member 'BP_PlayerActionStateSprint_C_Enter::Param' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Enter, ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateSprint_C_Enter::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Enter, CallFunc_Enter_ReturnValue) == 0x000008, "Member 'BP_PlayerActionStateSprint_C_Enter::CallFunc_Enter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Enter, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'BP_PlayerActionStateSprint_C_Enter::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Enter, CallFunc_IsPlayerStatus_Result) == 0x00000D, "Member 'BP_PlayerActionStateSprint_C_Enter::CallFunc_IsPlayerStatus_Result' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Enter, CallFunc_BooleanAND_ReturnValue) == 0x00000E, "Member 'BP_PlayerActionStateSprint_C_Enter::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Enter, CallFunc_GetVelocity_ReturnValue) == 0x000010, "Member 'BP_PlayerActionStateSprint_C_Enter::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Enter, K2Node_DynamicCast_AsASCharacter_Movement_Component) == 0x000020, "Member 'BP_PlayerActionStateSprint_C_Enter::K2Node_DynamicCast_AsASCharacter_Movement_Component' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Enter, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_PlayerActionStateSprint_C_Enter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Enter, CallFunc_GetActorForwardVector_ReturnValue) == 0x00002C, "Member 'BP_PlayerActionStateSprint_C_Enter::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Enter, CallFunc_Dot_VectorVector_ReturnValue) == 0x000038, "Member 'BP_PlayerActionStateSprint_C_Enter::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Enter, CallFunc_Abs_ReturnValue) == 0x00003C, "Member 'BP_PlayerActionStateSprint_C_Enter::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Enter, CallFunc_Lerp_ReturnValue) == 0x000040, "Member 'BP_PlayerActionStateSprint_C_Enter::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Enter, CallFunc_CalcInputWorldVector_ReturnValue) == 0x000044, "Member 'BP_PlayerActionStateSprint_C_Enter::CallFunc_CalcInputWorldVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Enter, CallFunc_Normal_ReturnValue) == 0x000050, "Member 'BP_PlayerActionStateSprint_C_Enter::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Enter, CallFunc_CheckHardenRestriction_dummy) == 0x00005C, "Member 'BP_PlayerActionStateSprint_C_Enter::CallFunc_CheckHardenRestriction_dummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Enter, CallFunc_PlaySASCodeDirection_self_CastInput) == 0x000060, "Member 'BP_PlayerActionStateSprint_C_Enter::CallFunc_PlaySASCodeDirection_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Enter, CallFunc_PlaySASCodeDirection_bDummy) == 0x000070, "Member 'BP_PlayerActionStateSprint_C_Enter::CallFunc_PlaySASCodeDirection_bDummy' has a wrong offset!");

// Function BP_PlayerActionStateSprint.BP_PlayerActionStateSprint_C.Update
// 0x0064 (0x0064 - 0x0000)
struct BP_PlayerActionStateSprint_C_Update final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LSpeed;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LDir;                                              // 0x0008(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetActorDeltaSeconds_ActorDeltaSeconds;   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93A9[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetActorDeltaSeconds_ActorDeltaSeconds_1; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOver_ReturnValue;                       // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOver_ReturnValue_1;                     // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93AA[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRate_ReturnValue;                      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnable_ReturnValue;                     // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOver_ReturnValue_2;                     // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93AB[0x1];                                     // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_REase_ReturnValue;                        // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableAddMovementInput_bEnable;         // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLeftStickZero_ReturnValue;              // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetActorDeltaSeconds_ReturnValue;         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Update_ReturnValue;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerActionStateSprint_C_Update) == 0x000004, "Wrong alignment on BP_PlayerActionStateSprint_C_Update");
static_assert(sizeof(BP_PlayerActionStateSprint_C_Update) == 0x000064, "Wrong size on BP_PlayerActionStateSprint_C_Update");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Update, ReturnValue) == 0x000000, "Member 'BP_PlayerActionStateSprint_C_Update::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Update, LSpeed) == 0x000004, "Member 'BP_PlayerActionStateSprint_C_Update::LSpeed' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Update, LDir) == 0x000008, "Member 'BP_PlayerActionStateSprint_C_Update::LDir' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Update, CallFunc_GetActorDeltaSeconds_ActorDeltaSeconds) == 0x000014, "Member 'BP_PlayerActionStateSprint_C_Update::CallFunc_GetActorDeltaSeconds_ActorDeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Update, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_PlayerActionStateSprint_C_Update::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Update, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_PlayerActionStateSprint_C_Update::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Update, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000020, "Member 'BP_PlayerActionStateSprint_C_Update::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Update, CallFunc_GetActorDeltaSeconds_ActorDeltaSeconds_1) == 0x00002C, "Member 'BP_PlayerActionStateSprint_C_Update::CallFunc_GetActorDeltaSeconds_ActorDeltaSeconds_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Update, CallFunc_Add_FloatFloat_ReturnValue) == 0x000030, "Member 'BP_PlayerActionStateSprint_C_Update::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Update, CallFunc_IsOver_ReturnValue) == 0x000034, "Member 'BP_PlayerActionStateSprint_C_Update::CallFunc_IsOver_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Update, CallFunc_IsOver_ReturnValue_1) == 0x000035, "Member 'BP_PlayerActionStateSprint_C_Update::CallFunc_IsOver_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Update, CallFunc_GetRate_ReturnValue) == 0x000038, "Member 'BP_PlayerActionStateSprint_C_Update::CallFunc_GetRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Update, CallFunc_IsEnable_ReturnValue) == 0x00003C, "Member 'BP_PlayerActionStateSprint_C_Update::CallFunc_IsEnable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Update, CallFunc_IsOver_ReturnValue_2) == 0x00003D, "Member 'BP_PlayerActionStateSprint_C_Update::CallFunc_IsOver_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Update, CallFunc_Not_PreBool_ReturnValue) == 0x00003E, "Member 'BP_PlayerActionStateSprint_C_Update::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Update, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000040, "Member 'BP_PlayerActionStateSprint_C_Update::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Update, CallFunc_REase_ReturnValue) == 0x00004C, "Member 'BP_PlayerActionStateSprint_C_Update::CallFunc_REase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Update, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000058, "Member 'BP_PlayerActionStateSprint_C_Update::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Update, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000059, "Member 'BP_PlayerActionStateSprint_C_Update::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Update, CallFunc_IsEnableAddMovementInput_bEnable) == 0x00005A, "Member 'BP_PlayerActionStateSprint_C_Update::CallFunc_IsEnableAddMovementInput_bEnable' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Update, CallFunc_IsLeftStickZero_ReturnValue) == 0x00005B, "Member 'BP_PlayerActionStateSprint_C_Update::CallFunc_IsLeftStickZero_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Update, CallFunc_GetActorDeltaSeconds_ReturnValue) == 0x00005C, "Member 'BP_PlayerActionStateSprint_C_Update::CallFunc_GetActorDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Update, CallFunc_Update_ReturnValue) == 0x000060, "Member 'BP_PlayerActionStateSprint_C_Update::CallFunc_Update_ReturnValue' has a wrong offset!");

// Function BP_PlayerActionStateSprint.BP_PlayerActionStateSprint_C.Transition
// 0x000C (0x000C - 0x0000)
struct BP_PlayerActionStateSprint_C_Transition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93AC[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckTurnBack_bTurnBack;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Transition_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckSprintEnd_bEnd;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateSprint_C_Transition) == 0x000004, "Wrong alignment on BP_PlayerActionStateSprint_C_Transition");
static_assert(sizeof(BP_PlayerActionStateSprint_C_Transition) == 0x00000C, "Wrong size on BP_PlayerActionStateSprint_C_Transition");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Transition, ReturnValue) == 0x000000, "Member 'BP_PlayerActionStateSprint_C_Transition::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Transition, CallFunc_MakeLiteralByte_ReturnValue) == 0x000001, "Member 'BP_PlayerActionStateSprint_C_Transition::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Transition, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateSprint_C_Transition::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Transition, CallFunc_CheckTurnBack_bTurnBack) == 0x000008, "Member 'BP_PlayerActionStateSprint_C_Transition::CallFunc_CheckTurnBack_bTurnBack' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Transition, CallFunc_Transition_ReturnValue) == 0x000009, "Member 'BP_PlayerActionStateSprint_C_Transition::CallFunc_Transition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Transition, CallFunc_CheckSprintEnd_bEnd) == 0x00000A, "Member 'BP_PlayerActionStateSprint_C_Transition::CallFunc_CheckSprintEnd_bEnd' has a wrong offset!");

// Function BP_PlayerActionStateSprint.BP_PlayerActionStateSprint_C.Exit
// 0x0030 (0x0030 - 0x0000)
struct BP_PlayerActionStateSprint_C_Exit final
{
public:
	int32                                         NextStateIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerActionKind                             LNextState;                                        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93AD[0x1];                                     // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Exit_ReturnValue;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93AE[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_StopSASCodeDirection_self_CastInput;      // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StopSASCodeDirection_bDummy;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateSprint_C_Exit) == 0x000008, "Wrong alignment on BP_PlayerActionStateSprint_C_Exit");
static_assert(sizeof(BP_PlayerActionStateSprint_C_Exit) == 0x000030, "Wrong size on BP_PlayerActionStateSprint_C_Exit");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Exit, NextStateIndex) == 0x000000, "Member 'BP_PlayerActionStateSprint_C_Exit::NextStateIndex' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Exit, ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateSprint_C_Exit::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Exit, LNextState) == 0x000008, "Member 'BP_PlayerActionStateSprint_C_Exit::LNextState' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Exit, CallFunc_Conv_IntToByte_ReturnValue) == 0x000009, "Member 'BP_PlayerActionStateSprint_C_Exit::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Exit, CallFunc_GetValidValue_ReturnValue) == 0x00000A, "Member 'BP_PlayerActionStateSprint_C_Exit::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Exit, CallFunc_Exit_ReturnValue) == 0x00000C, "Member 'BP_PlayerActionStateSprint_C_Exit::CallFunc_Exit_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Exit, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000010, "Member 'BP_PlayerActionStateSprint_C_Exit::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Exit, CallFunc_StopSASCodeDirection_self_CastInput) == 0x000018, "Member 'BP_PlayerActionStateSprint_C_Exit::CallFunc_StopSASCodeDirection_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_Exit, CallFunc_StopSASCodeDirection_bDummy) == 0x000028, "Member 'BP_PlayerActionStateSprint_C_Exit::CallFunc_StopSASCodeDirection_bDummy' has a wrong offset!");

// Function BP_PlayerActionStateSprint.BP_PlayerActionStateSprint_C.ChangeMaxAcceleration
// 0x0004 (0x0004 - 0x0000)
struct BP_PlayerActionStateSprint_C_ChangeMaxAcceleration final
{
public:
	float                                         CallFunc_GetMaxAcceleration_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerActionStateSprint_C_ChangeMaxAcceleration) == 0x000004, "Wrong alignment on BP_PlayerActionStateSprint_C_ChangeMaxAcceleration");
static_assert(sizeof(BP_PlayerActionStateSprint_C_ChangeMaxAcceleration) == 0x000004, "Wrong size on BP_PlayerActionStateSprint_C_ChangeMaxAcceleration");
static_assert(offsetof(BP_PlayerActionStateSprint_C_ChangeMaxAcceleration, CallFunc_GetMaxAcceleration_ReturnValue) == 0x000000, "Member 'BP_PlayerActionStateSprint_C_ChangeMaxAcceleration::CallFunc_GetMaxAcceleration_ReturnValue' has a wrong offset!");

// Function BP_PlayerActionStateSprint.BP_PlayerActionStateSprint_C.CheckTurnBack
// 0x0038 (0x0038 - 0x0000)
struct BP_PlayerActionStateSprint_C_CheckTurnBack final
{
public:
	bool                                          bTurnBack;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93AF[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LDotValue;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LbTurnBack;                                        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93B0[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOver_ReturnValue;                       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsControlAI_bAI;                          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93B1[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_CalcInputWorldVector_ReturnValue;         // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLeftStickZero_ReturnValue;              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93B2[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerActionStateSprint_C_CheckTurnBack) == 0x000004, "Wrong alignment on BP_PlayerActionStateSprint_C_CheckTurnBack");
static_assert(sizeof(BP_PlayerActionStateSprint_C_CheckTurnBack) == 0x000038, "Wrong size on BP_PlayerActionStateSprint_C_CheckTurnBack");
static_assert(offsetof(BP_PlayerActionStateSprint_C_CheckTurnBack, bTurnBack) == 0x000000, "Member 'BP_PlayerActionStateSprint_C_CheckTurnBack::bTurnBack' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_CheckTurnBack, LDotValue) == 0x000004, "Member 'BP_PlayerActionStateSprint_C_CheckTurnBack::LDotValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateSprint_C_CheckTurnBack, LbTurnBack) == 0x000008, "Member 'BP_PlayerActionStateSprint_C_CheckTurnBack::LbTurnBack' has a wrong offset!");
