#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerUpperActionStatePsychicAttack

#include "Basic.hpp"

#include "EPlayerPsychicActionParam_structs.hpp"
#include "EPlayerAnimMontage_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerUpperActionStatePsychicAttack.BP_PlayerUpperActionStatePsychicAttack_C.ExecuteUbergraph_BP_PlayerUpperActionStatePsychicAttack
// 0x0014 (0x0014 - 0x0000)
struct BP_PlayerUpperActionStatePsychicAttack_C_ExecuteUbergraph_BP_PlayerUpperActionStatePsychicAttack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAnimMontage* Montage, bool bInterrupted)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_PlayerUpperActionStatePsychicAttack_C_ExecuteUbergraph_BP_PlayerUpperActionStatePsychicAttack) == 0x000004, "Wrong alignment on BP_PlayerUpperActionStatePsychicAttack_C_ExecuteUbergraph_BP_PlayerUpperActionStatePsychicAttack");
static_assert(sizeof(BP_PlayerUpperActionStatePsychicAttack_C_ExecuteUbergraph_BP_PlayerUpperActionStatePsychicAttack) == 0x000014, "Wrong size on BP_PlayerUpperActionStatePsychicAttack_C_ExecuteUbergraph_BP_PlayerUpperActionStatePsychicAttack");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_ExecuteUbergraph_BP_PlayerUpperActionStatePsychicAttack, EntryPoint) == 0x000000, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_ExecuteUbergraph_BP_PlayerUpperActionStatePsychicAttack::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_ExecuteUbergraph_BP_PlayerUpperActionStatePsychicAttack, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_ExecuteUbergraph_BP_PlayerUpperActionStatePsychicAttack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_PlayerUpperActionStatePsychicAttack.BP_PlayerUpperActionStatePsychicAttack_C.Enter
// 0x0048 (0x0048 - 0x0000)
struct BP_PlayerUpperActionStatePsychicAttack_C_Enter final
{
public:
	int32                                         Param;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           LowerAnimMontage;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Enter_ReturnValue;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D3[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_SetPsychicEmissionInterface_self_CastInput; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBattleReady_bDummy;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D4[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_LookAtInterface_C> CallFunc_SetLookAtEnable_self_CastInput;           // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetLookAtEnable_bResult;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerUpperActionStatePsychicAttack_C_Enter) == 0x000008, "Wrong alignment on BP_PlayerUpperActionStatePsychicAttack_C_Enter");
static_assert(sizeof(BP_PlayerUpperActionStatePsychicAttack_C_Enter) == 0x000048, "Wrong size on BP_PlayerUpperActionStatePsychicAttack_C_Enter");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Enter, Param) == 0x000000, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Enter::Param' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Enter, ReturnValue) == 0x000004, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Enter::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Enter, LowerAnimMontage) == 0x000008, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Enter::LowerAnimMontage' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Enter, CallFunc_Enter_ReturnValue) == 0x000010, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Enter::CallFunc_Enter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Enter, CallFunc_SetPsychicEmissionInterface_self_CastInput) == 0x000018, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Enter::CallFunc_SetPsychicEmissionInterface_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Enter, CallFunc_SetBattleReady_bDummy) == 0x000028, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Enter::CallFunc_SetBattleReady_bDummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Enter, K2Node_SwitchEnum_CmpSuccess) == 0x000029, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Enter::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Enter, CallFunc_Conv_IntToByte_ReturnValue) == 0x00002A, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Enter::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Enter, CallFunc_GetValidValue_ReturnValue) == 0x00002B, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Enter::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Enter, CallFunc_SetLookAtEnable_self_CastInput) == 0x000030, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Enter::CallFunc_SetLookAtEnable_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Enter, CallFunc_SetLookAtEnable_bResult) == 0x000040, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Enter::CallFunc_SetLookAtEnable_bResult' has a wrong offset!");

// Function BP_PlayerUpperActionStatePsychicAttack.BP_PlayerUpperActionStatePsychicAttack_C.Update
// 0x0014 (0x0014 - 0x0000)
struct BP_PlayerUpperActionStatePsychicAttack_C_Update final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayBlendAnimMontage_bPlay;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D5[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetProcess_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D6[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Update_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerUpperActionStatePsychicAttack_C_Update) == 0x000004, "Wrong alignment on BP_PlayerUpperActionStatePsychicAttack_C_Update");
static_assert(sizeof(BP_PlayerUpperActionStatePsychicAttack_C_Update) == 0x000014, "Wrong size on BP_PlayerUpperActionStatePsychicAttack_C_Update");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Update, ReturnValue) == 0x000000, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Update::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Update, CallFunc_IsPlayBlendAnimMontage_bPlay) == 0x000004, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Update::CallFunc_IsPlayBlendAnimMontage_bPlay' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Update, CallFunc_GetProcess_ReturnValue) == 0x000008, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Update::CallFunc_GetProcess_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Update, K2Node_SwitchInteger_CmpSuccess) == 0x00000C, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Update::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Update, CallFunc_Update_ReturnValue) == 0x000010, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Update::CallFunc_Update_ReturnValue' has a wrong offset!");

// Function BP_PlayerUpperActionStatePsychicAttack.BP_PlayerUpperActionStatePsychicAttack_C.Exit
// 0x0048 (0x0048 - 0x0000)
struct BP_PlayerUpperActionStatePsychicAttack_C_Exit final
{
public:
	int32                                         NextStateIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Exit_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerStatus_Result;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D7[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_SetPsychicEmissionInterface_self_CastInput; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_LookAtInterface_C> CallFunc_SetLookAtEnable_self_CastInput;           // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetLookAtEnable_bResult;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D8[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARsBattleHero_C*                        K2Node_DynamicCast_AsRs_Battle_Hero;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerUpperActionStatePsychicAttack_C_Exit) == 0x000008, "Wrong alignment on BP_PlayerUpperActionStatePsychicAttack_C_Exit");
static_assert(sizeof(BP_PlayerUpperActionStatePsychicAttack_C_Exit) == 0x000048, "Wrong size on BP_PlayerUpperActionStatePsychicAttack_C_Exit");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Exit, NextStateIndex) == 0x000000, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Exit::NextStateIndex' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Exit, ReturnValue) == 0x000004, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Exit::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Exit, CallFunc_Exit_ReturnValue) == 0x000008, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Exit::CallFunc_Exit_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Exit, CallFunc_IsPlayerStatus_Result) == 0x00000C, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Exit::CallFunc_IsPlayerStatus_Result' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Exit, CallFunc_SetPsychicEmissionInterface_self_CastInput) == 0x000010, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Exit::CallFunc_SetPsychicEmissionInterface_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Exit, CallFunc_SetLookAtEnable_self_CastInput) == 0x000020, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Exit::CallFunc_SetLookAtEnable_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Exit, CallFunc_SetLookAtEnable_bResult) == 0x000030, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Exit::CallFunc_SetLookAtEnable_bResult' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Exit, K2Node_DynamicCast_AsRs_Battle_Hero) == 0x000038, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Exit::K2Node_DynamicCast_AsRs_Battle_Hero' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_Exit, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_Exit::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_PlayerUpperActionStatePsychicAttack.BP_PlayerUpperActionStatePsychicAttack_C.SetProcessAttack
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerUpperActionStatePsychicAttack_C_SetProcessAttack final
{
public:
	EPlayerPsychicActionParam                     Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerAnimMontage                            Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerAnimMontage                            Temp_byte_Variable_2;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerAnimMontage                            Temp_byte_Variable_3;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerAnimMontage                            Temp_byte_Variable_4;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerAnimMontage                            Temp_byte_Variable_5;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerAnimMontage                            K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D9[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetAnimMontageFromSet_Montage;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerUpperActionStatePsychicAttack_C_SetProcessAttack) == 0x000008, "Wrong alignment on BP_PlayerUpperActionStatePsychicAttack_C_SetProcessAttack");
static_assert(sizeof(BP_PlayerUpperActionStatePsychicAttack_C_SetProcessAttack) == 0x000010, "Wrong size on BP_PlayerUpperActionStatePsychicAttack_C_SetProcessAttack");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_SetProcessAttack, Temp_byte_Variable) == 0x000000, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_SetProcessAttack::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_SetProcessAttack, Temp_byte_Variable_1) == 0x000001, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_SetProcessAttack::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_SetProcessAttack, Temp_byte_Variable_2) == 0x000002, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_SetProcessAttack::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_SetProcessAttack, Temp_byte_Variable_3) == 0x000003, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_SetProcessAttack::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_SetProcessAttack, Temp_byte_Variable_4) == 0x000004, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_SetProcessAttack::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_SetProcessAttack, Temp_byte_Variable_5) == 0x000005, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_SetProcessAttack::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_SetProcessAttack, K2Node_Select_Default) == 0x000006, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_SetProcessAttack::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_SetProcessAttack, CallFunc_GetAnimMontageFromSet_Montage) == 0x000008, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_SetProcessAttack::CallFunc_GetAnimMontageFromSet_Montage' has a wrong offset!");

// Function BP_PlayerUpperActionStatePsychicAttack.BP_PlayerUpperActionStatePsychicAttack_C.SetProcessEnd
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerUpperActionStatePsychicAttack_C_SetProcessEnd final
{
public:
	EPlayerPsychicActionParam                     Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerAnimMontage                            Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerAnimMontage                            Temp_byte_Variable_2;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerAnimMontage                            Temp_byte_Variable_3;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerAnimMontage                            Temp_byte_Variable_4;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerAnimMontage                            Temp_byte_Variable_5;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerAnimMontage                            K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12DA[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetAnimMontageFromSet_Montage;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerUpperActionStatePsychicAttack_C_SetProcessEnd) == 0x000008, "Wrong alignment on BP_PlayerUpperActionStatePsychicAttack_C_SetProcessEnd");
static_assert(sizeof(BP_PlayerUpperActionStatePsychicAttack_C_SetProcessEnd) == 0x000010, "Wrong size on BP_PlayerUpperActionStatePsychicAttack_C_SetProcessEnd");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_SetProcessEnd, Temp_byte_Variable) == 0x000000, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_SetProcessEnd::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_SetProcessEnd, Temp_byte_Variable_1) == 0x000001, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_SetProcessEnd::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_SetProcessEnd, Temp_byte_Variable_2) == 0x000002, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_SetProcessEnd::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_SetProcessEnd, Temp_byte_Variable_3) == 0x000003, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_SetProcessEnd::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_SetProcessEnd, Temp_byte_Variable_4) == 0x000004, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_SetProcessEnd::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_SetProcessEnd, Temp_byte_Variable_5) == 0x000005, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_SetProcessEnd::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_SetProcessEnd, K2Node_Select_Default) == 0x000006, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_SetProcessEnd::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_SetProcessEnd, CallFunc_GetAnimMontageFromSet_Montage) == 0x000008, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_SetProcessEnd::CallFunc_GetAnimMontageFromSet_Montage' has a wrong offset!");

// Function BP_PlayerUpperActionStatePsychicAttack.BP_PlayerUpperActionStatePsychicAttack_C.OnMontageBlendingOut
// 0x0018 (0x0018 - 0x0000)
struct BP_PlayerUpperActionStatePsychicAttack_C_OnMontageBlendingOut final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12DB[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetProcess_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerUpperActionStatePsychicAttack_C_OnMontageBlendingOut) == 0x000008, "Wrong alignment on BP_PlayerUpperActionStatePsychicAttack_C_OnMontageBlendingOut");
static_assert(sizeof(BP_PlayerUpperActionStatePsychicAttack_C_OnMontageBlendingOut) == 0x000018, "Wrong size on BP_PlayerUpperActionStatePsychicAttack_C_OnMontageBlendingOut");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_OnMontageBlendingOut, Montage) == 0x000000, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_OnMontageBlendingOut::Montage' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_OnMontageBlendingOut, bInterrupted) == 0x000008, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_OnMontageBlendingOut::bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_OnMontageBlendingOut, CallFunc_GetProcess_ReturnValue) == 0x00000C, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_OnMontageBlendingOut::CallFunc_GetProcess_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_OnMontageBlendingOut, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_OnMontageBlendingOut::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUpperActionStatePsychicAttack_C_OnMontageBlendingOut, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000011, "Member 'BP_PlayerUpperActionStatePsychicAttack_C_OnMontageBlendingOut::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

}

