#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PsychicObjectStatic

#include "Basic.hpp"

#include "CascadeExtensionPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PsychicObjectStatic.BP_PsychicObjectStatic_C.ExecuteUbergraph_BP_PsychicObjectStatic
// 0x0168 (0x0168 - 0x0000)
struct BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUniqueObject_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53EF[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x002C(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53F0[0x2];                                     // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53F1[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53F2[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      K2Node_DynamicCast_AsPlayer_Interface;             // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsControlAI_CallFromCPP_ReturnValue;      // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53F3[0x2];                                     // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic) == 0x000008, "Wrong alignment on BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic");
static_assert(sizeof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic) == 0x000168, "Wrong size on BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, EntryPoint) == 0x000000, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, CallFunc_IsUniqueObject_ReturnValue) == 0x000004, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::CallFunc_IsUniqueObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, K2Node_ComponentBoundEvent_HitComponent) == 0x000008, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000020, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, K2Node_ComponentBoundEvent_Hit) == 0x00002C, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000B4, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, CallFunc_BreakHitResult_bBlockingHit) == 0x0000B8, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000B9, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, CallFunc_BreakHitResult_Time) == 0x0000BC, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, CallFunc_BreakHitResult_Distance) == 0x0000C0, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, CallFunc_BreakHitResult_Location) == 0x0000C4, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, CallFunc_BreakHitResult_ImpactPoint) == 0x0000D0, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, CallFunc_BreakHitResult_Normal) == 0x0000DC, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, CallFunc_BreakHitResult_ImpactNormal) == 0x0000E8, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, CallFunc_BreakHitResult_PhysMat) == 0x0000F8, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, CallFunc_BreakHitResult_HitActor) == 0x000100, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, CallFunc_BreakHitResult_HitComponent) == 0x000108, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, CallFunc_BreakHitResult_HitBoneName) == 0x000110, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, CallFunc_BreakHitResult_HitItem) == 0x000118, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, CallFunc_BreakHitResult_FaceIndex) == 0x00011C, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, CallFunc_BreakHitResult_TraceStart) == 0x000120, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, CallFunc_BreakHitResult_TraceEnd) == 0x00012C, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000138, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, K2Node_DynamicCast_AsPlayer_Interface) == 0x000148, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::K2Node_DynamicCast_AsPlayer_Interface' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, CallFunc_IsControlAI_CallFromCPP_ReturnValue) == 0x000159, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::CallFunc_IsControlAI_CallFromCPP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, K2Node_Event_DeltaSeconds) == 0x00015C, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic, Temp_bool_Variable) == 0x000160, "Member 'BP_PsychicObjectStatic_C_ExecuteUbergraph_BP_PsychicObjectStatic::Temp_bool_Variable' has a wrong offset!");

// Function BP_PsychicObjectStatic.BP_PsychicObjectStatic_C.BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct BP_PsychicObjectStatic_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0024(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_PsychicObjectStatic_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_PsychicObjectStatic_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(BP_PsychicObjectStatic_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature) == 0x0000B0, "Wrong size on BP_PsychicObjectStatic_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(BP_PsychicObjectStatic_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'BP_PsychicObjectStatic_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_PsychicObjectStatic_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_PsychicObjectStatic_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'BP_PsychicObjectStatic_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, Hit) == 0x000024, "Member 'BP_PsychicObjectStatic_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function BP_PsychicObjectStatic.BP_PsychicObjectStatic_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PsychicObjectStatic_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicObjectStatic_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PsychicObjectStatic_C_ReceiveTick");
static_assert(sizeof(BP_PsychicObjectStatic_C_ReceiveTick) == 0x000004, "Wrong size on BP_PsychicObjectStatic_C_ReceiveTick");
static_assert(offsetof(BP_PsychicObjectStatic_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PsychicObjectStatic_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PsychicObjectStatic.BP_PsychicObjectStatic_C.UserConstructionScript
// 0x0040 (0x0040 - 0x0000)
struct BP_PsychicObjectStatic_C_UserConstructionScript final
{
public:
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCutSceneEvent_IsCutSceneEvent;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53F4[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicObjectStatic_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_PsychicObjectStatic_C_UserConstructionScript");
static_assert(sizeof(BP_PsychicObjectStatic_C_UserConstructionScript) == 0x000040, "Wrong size on BP_PsychicObjectStatic_C_UserConstructionScript");
static_assert(offsetof(BP_PsychicObjectStatic_C_UserConstructionScript, CallFunc_GetEventManager_EventManager) == 0x000000, "Member 'BP_PsychicObjectStatic_C_UserConstructionScript::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_PsychicObjectStatic_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_UserConstructionScript, CallFunc_IsCutSceneEvent_IsCutSceneEvent) == 0x000009, "Member 'BP_PsychicObjectStatic_C_UserConstructionScript::CallFunc_IsCutSceneEvent_IsCutSceneEvent' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_UserConstructionScript, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'BP_PsychicObjectStatic_C_UserConstructionScript::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");

// Function BP_PsychicObjectStatic.BP_PsychicObjectStatic_C.Initialize
// 0x0060 (0x0060 - 0x0000)
struct BP_PsychicObjectStatic_C_Initialize final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          L_return;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53F5[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53F6[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Initialize_return;                        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53F7[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0038(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53F8[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53F9[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicObjectStatic_C_Initialize) == 0x000008, "Wrong alignment on BP_PsychicObjectStatic_C_Initialize");
static_assert(sizeof(BP_PsychicObjectStatic_C_Initialize) == 0x000060, "Wrong size on BP_PsychicObjectStatic_C_Initialize");
static_assert(offsetof(BP_PsychicObjectStatic_C_Initialize, Return) == 0x000000, "Member 'BP_PsychicObjectStatic_C_Initialize::Return' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_Initialize, L_return) == 0x000001, "Member 'BP_PsychicObjectStatic_C_Initialize::L_return' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_Initialize, Temp_int_Loop_Num_Variable) == 0x000004, "Member 'BP_PsychicObjectStatic_C_Initialize::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_Initialize, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_PsychicObjectStatic_C_Initialize::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_Initialize, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'BP_PsychicObjectStatic_C_Initialize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_Initialize, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'BP_PsychicObjectStatic_C_Initialize::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_Initialize, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'BP_PsychicObjectStatic_C_Initialize::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_Initialize, CallFunc_Initialize_return) == 0x000030, "Member 'BP_PsychicObjectStatic_C_Initialize::CallFunc_Initialize_return' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_Initialize, CallFunc_GetMaterials_ReturnValue) == 0x000038, "Member 'BP_PsychicObjectStatic_C_Initialize::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_Initialize, CallFunc_SetStaticMesh_ReturnValue) == 0x000048, "Member 'BP_PsychicObjectStatic_C_Initialize::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_Initialize, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'BP_PsychicObjectStatic_C_Initialize::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_Initialize, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'BP_PsychicObjectStatic_C_Initialize::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_Initialize, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'BP_PsychicObjectStatic_C_Initialize::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_Initialize, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'BP_PsychicObjectStatic_C_Initialize::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_PsychicObjectStatic.BP_PsychicObjectStatic_C.GetDebrisEffectData
// 0x0030 (0x0030 - 0x0000)
struct BP_PsychicObjectStatic_C_GetDebrisEffectData final
{
public:
	class UParticleSystem*                        ParticleTemplate;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     OverrideMaterial;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53FA[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        CallFunc_GetDebrisEffectBase_Particle;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetDebrisEffectBase_OverrideMaterial;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDebrisEffectBase_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicObjectStatic_C_GetDebrisEffectData) == 0x000008, "Wrong alignment on BP_PsychicObjectStatic_C_GetDebrisEffectData");
static_assert(sizeof(BP_PsychicObjectStatic_C_GetDebrisEffectData) == 0x000030, "Wrong size on BP_PsychicObjectStatic_C_GetDebrisEffectData");
static_assert(offsetof(BP_PsychicObjectStatic_C_GetDebrisEffectData, ParticleTemplate) == 0x000000, "Member 'BP_PsychicObjectStatic_C_GetDebrisEffectData::ParticleTemplate' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_GetDebrisEffectData, OverrideMaterial) == 0x000008, "Member 'BP_PsychicObjectStatic_C_GetDebrisEffectData::OverrideMaterial' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_GetDebrisEffectData, ReturnValue) == 0x000010, "Member 'BP_PsychicObjectStatic_C_GetDebrisEffectData::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_GetDebrisEffectData, CallFunc_GetDebrisEffectBase_Particle) == 0x000018, "Member 'BP_PsychicObjectStatic_C_GetDebrisEffectData::CallFunc_GetDebrisEffectBase_Particle' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_GetDebrisEffectData, CallFunc_GetDebrisEffectBase_OverrideMaterial) == 0x000020, "Member 'BP_PsychicObjectStatic_C_GetDebrisEffectData::CallFunc_GetDebrisEffectBase_OverrideMaterial' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_GetDebrisEffectData, CallFunc_GetDebrisEffectBase_ReturnValue) == 0x000028, "Member 'BP_PsychicObjectStatic_C_GetDebrisEffectData::CallFunc_GetDebrisEffectBase_ReturnValue' has a wrong offset!");

// Function BP_PsychicObjectStatic.BP_PsychicObjectStatic_C.GetTriangleData
// 0x0060 (0x0060 - 0x0000)
struct BP_PsychicObjectStatic_C_GetTriangleData final
{
public:
	struct FMeshTriangleData                      Triangle_data;                                     // 0x0000(0x0020)(Parm, OutParm)
	class UStaticMesh*                            CallFunc_GetMeshComp_mesh_comp;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetMeshComp_scale;                        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53FB[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLowLODIndex_Index;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53FC[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMeshTriangleData                      CallFunc_GetStaticMeshTriangleData_MeshTriangleData; // 0x0040(0x0020)()
};
static_assert(alignof(BP_PsychicObjectStatic_C_GetTriangleData) == 0x000008, "Wrong alignment on BP_PsychicObjectStatic_C_GetTriangleData");
static_assert(sizeof(BP_PsychicObjectStatic_C_GetTriangleData) == 0x000060, "Wrong size on BP_PsychicObjectStatic_C_GetTriangleData");
static_assert(offsetof(BP_PsychicObjectStatic_C_GetTriangleData, Triangle_data) == 0x000000, "Member 'BP_PsychicObjectStatic_C_GetTriangleData::Triangle_data' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_GetTriangleData, CallFunc_GetMeshComp_mesh_comp) == 0x000020, "Member 'BP_PsychicObjectStatic_C_GetTriangleData::CallFunc_GetMeshComp_mesh_comp' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_GetTriangleData, CallFunc_GetMeshComp_scale) == 0x000028, "Member 'BP_PsychicObjectStatic_C_GetTriangleData::CallFunc_GetMeshComp_scale' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_GetTriangleData, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'BP_PsychicObjectStatic_C_GetTriangleData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_GetTriangleData, CallFunc_GetLowLODIndex_Index) == 0x000038, "Member 'BP_PsychicObjectStatic_C_GetTriangleData::CallFunc_GetLowLODIndex_Index' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_GetTriangleData, CallFunc_GetStaticMeshTriangleData_MeshTriangleData) == 0x000040, "Member 'BP_PsychicObjectStatic_C_GetTriangleData::CallFunc_GetStaticMeshTriangleData_MeshTriangleData' has a wrong offset!");

// Function BP_PsychicObjectStatic.BP_PsychicObjectStatic_C.GetDataRevision
// 0x0008 (0x0008 - 0x0000)
struct BP_PsychicObjectStatic_C_GetDataRevision final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDataRevision_revision;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicObjectStatic_C_GetDataRevision) == 0x000004, "Wrong alignment on BP_PsychicObjectStatic_C_GetDataRevision");
static_assert(sizeof(BP_PsychicObjectStatic_C_GetDataRevision) == 0x000008, "Wrong size on BP_PsychicObjectStatic_C_GetDataRevision");
static_assert(offsetof(BP_PsychicObjectStatic_C_GetDataRevision, ReturnValue) == 0x000000, "Member 'BP_PsychicObjectStatic_C_GetDataRevision::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectStatic_C_GetDataRevision, CallFunc_GetDataRevision_revision) == 0x000004, "Member 'BP_PsychicObjectStatic_C_GetDataRevision::CallFunc_GetDataRevision_revision' has a wrong offset!");

}

