#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ParticleManager

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_SASKind_structs.hpp"
#include "Engine_structs.hpp"
#include "FSASCommand_structs.hpp"
#include "FSASElectricParam_structs.hpp"
#include "FSASFireParam_structs.hpp"
#include "FSASSeeThroughParam_structs.hpp"
#include "FSASMetalParam_structs.hpp"
#include "FSASTelepoParam_structs.hpp"
#include "FSASStealthParam_structs.hpp"
#include "FSASCopyParam_structs.hpp"
#include "FSASPsychicParam_structs.hpp"
#include "AcceleratorParam_structs.hpp"


namespace SDK::Params
{

// Function BP_ParticleManager.BP_ParticleManager_C.ExecuteUbergraph_BP_ParticleManager
// 0x01F0 (0x01F0 - 0x0000)
struct BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASElectricParam                     K2Node_Event_param_15;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CC8[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_17;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASElectricParam                     K2Node_Event_param_14;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CC9[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_16;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_8;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASFireParam                         K2Node_Event_param_13;                             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CCA[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_15;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASFireParam                         K2Node_Event_param_12;                             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CCB[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_14;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_7;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASMetalParam                        K2Node_Event_param_11;                             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CCC[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_13;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASMetalParam                        K2Node_Event_param_10;                             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CCD[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_12;                             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_6;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASSeeThroughParam                   K2Node_Event_param_9;                              // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CCE[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_11;                             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASSeeThroughParam                   K2Node_Event_param_8;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CCF[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_10;                             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_5;                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASTelepoParam                       K2Node_Event_param_7;                              // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CD0[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_9;                              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASTelepoParam                       K2Node_Event_param_6;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CD1[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_8;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_4;                         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASStealthParam                      K2Node_Event_param_5;                              // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CD2[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_7;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASStealthParam                      K2Node_Event_param_4;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CD3[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_6;                              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_3;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASCopyParam                         K2Node_Event_param_3;                              // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CD4[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_5;                              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASCopyParam                         K2Node_Event_param_2;                              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CD5[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_4;                              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_2;                         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASPsychicParam                      K2Node_Event_param_1;                              // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CD6[0x3];                                     // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_3;                              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASPsychicParam                      K2Node_Event_param;                                // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CD7[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_2;                              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_1;                         // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAcceleratorParam                      K2Node_Event_Parameter_1;                          // 0x011C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Owner_1;                              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHologram_1;                          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8CD8[0x3];                                     // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAcceleratorParam                      K2Node_Event_Parameter;                            // 0x0134(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Owner;                                // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime;                           // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHologram;                            // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8CD9[0x3];                                     // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSParticleSystemComponentBase*         CallFunc_Array_Get_Item;                           // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CDA[0x4];                                     // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SASInterface_C>   K2Node_DynamicCast_AsBPI_SASInterface;             // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CDB[0x1];                                     // 0x0183(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EffectBackground_C*                 K2Node_Event_EffectBackGround;                     // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EffectBackGroundMother_C*           K2Node_Event_MotherActor;                          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_toHide;                         // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8CDC[0x2];                                     // 0x019A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8CDD[0x3];                                     // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue_1;        // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8CDE[0x2];                                     // 0x01AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8CDF[0x3];                                     // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSParticleSystemComponentBase*         CallFunc_Array_Get_Item_1;                         // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8CE0[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SASInterface_C>   K2Node_DynamicCast_AsBPI_SASInterface_1;           // 0x01D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8CE1[0x3];                                     // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8CE2[0x3];                                     // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager) == 0x000008, "Wrong alignment on BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager");
static_assert(sizeof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager) == 0x0001F0, "Wrong size on BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, EntryPoint) == 0x000000, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, Temp_int_Variable) == 0x000004, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_param_15) == 0x00001C, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_param_15' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_Owner_17) == 0x000020, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_Owner_17' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_param_14) == 0x000028, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_param_14' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_Owner_16) == 0x000030, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_Owner_16' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_RemainTime_8) == 0x000038, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_RemainTime_8' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_param_13) == 0x00003C, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_param_13' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_Owner_15) == 0x000040, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_Owner_15' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_param_12) == 0x000048, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_param_12' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_Owner_14) == 0x000050, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_Owner_14' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_RemainTime_7) == 0x000058, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_RemainTime_7' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_param_11) == 0x00005C, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_param_11' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_Owner_13) == 0x000060, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_Owner_13' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_param_10) == 0x000068, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_param_10' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_Owner_12) == 0x000070, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_Owner_12' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_RemainTime_6) == 0x000078, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_RemainTime_6' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_param_9) == 0x00007C, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_param_9' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_Owner_11) == 0x000080, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_Owner_11' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_param_8) == 0x000088, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_param_8' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_Owner_10) == 0x000090, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_Owner_10' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_RemainTime_5) == 0x000098, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_RemainTime_5' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_param_7) == 0x00009C, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_param_7' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_Owner_9) == 0x0000A0, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_Owner_9' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_param_6) == 0x0000A8, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_param_6' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_Owner_8) == 0x0000B0, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_Owner_8' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_RemainTime_4) == 0x0000B8, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_RemainTime_4' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_param_5) == 0x0000BC, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_param_5' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_Owner_7) == 0x0000C0, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_Owner_7' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_param_4) == 0x0000C8, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_param_4' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_Owner_6) == 0x0000D0, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_Owner_6' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_RemainTime_3) == 0x0000D8, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_RemainTime_3' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_param_3) == 0x0000DC, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_param_3' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_Owner_5) == 0x0000E0, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_Owner_5' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_param_2) == 0x0000E8, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_param_2' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_Owner_4) == 0x0000F0, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_Owner_4' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_RemainTime_2) == 0x0000F8, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_RemainTime_2' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_param_1) == 0x0000FC, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_param_1' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_Owner_3) == 0x000100, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_Owner_3' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_param) == 0x000108, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_param' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_Owner_2) == 0x000110, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_Owner_2' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_RemainTime_1) == 0x000118, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_RemainTime_1' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_Parameter_1) == 0x00011C, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_Parameter_1' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_Owner_1) == 0x000128, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_Owner_1' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_bHologram_1) == 0x000130, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_bHologram_1' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_Parameter) == 0x000134, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_Parameter' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_Owner) == 0x000140, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_Owner' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_RemainTime) == 0x000148, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_RemainTime' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_bHologram) == 0x00014C, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_bHologram' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, Temp_int_Loop_Counter_Variable_1) == 0x000150, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, CallFunc_Array_Length_ReturnValue) == 0x000154, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, CallFunc_Add_IntInt_ReturnValue_2) == 0x000158, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_DeltaSeconds) == 0x00015C, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, CallFunc_Array_Get_Item) == 0x000160, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, CallFunc_Array_Length_ReturnValue_1) == 0x000168, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_DynamicCast_AsBPI_SASInterface) == 0x000170, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_DynamicCast_AsBPI_SASInterface' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_DynamicCast_bSuccess) == 0x000180, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, CallFunc_Less_IntInt_ReturnValue) == 0x000181, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_EndPlayReason) == 0x000182, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, Temp_int_Array_Index_Variable_2) == 0x000184, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_EffectBackGround) == 0x000188, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_EffectBackGround' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_Event_MotherActor) == 0x000190, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_Event_MotherActor' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_CustomEvent_toHide) == 0x000198, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_CustomEvent_toHide' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, CallFunc_Not_PreBool_ReturnValue) == 0x000199, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, CallFunc_Array_Length_ReturnValue_2) == 0x00019C, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, CallFunc_IsVisible_ReturnValue) == 0x0001A0, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, CallFunc_IsValid_ReturnValue) == 0x0001A1, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x0001A2, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, CallFunc_IsValid_ReturnValue_1) == 0x0001A3, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, CallFunc_IsVisible_ReturnValue_1) == 0x0001A4, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, CallFunc_Array_Length_ReturnValue_3) == 0x0001A8, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, CallFunc_EqualEqual_BoolBool_ReturnValue_1) == 0x0001AC, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::CallFunc_EqualEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001AD, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, CallFunc_Array_Length_ReturnValue_4) == 0x0001B0, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, Temp_int_Variable_1) == 0x0001B4, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001B8, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, CallFunc_Add_IntInt_ReturnValue_3) == 0x0001BC, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, CallFunc_Array_Get_Item_1) == 0x0001C0, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, CallFunc_Less_IntInt_ReturnValue_3) == 0x0001C8, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_DynamicCast_AsBPI_SASInterface_1) == 0x0001D0, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_DynamicCast_AsBPI_SASInterface_1' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, K2Node_DynamicCast_bSuccess_1) == 0x0001E0, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, Temp_int_Loop_Counter_Variable_2) == 0x0001E4, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, CallFunc_Less_IntInt_ReturnValue_4) == 0x0001E8, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager, CallFunc_Add_IntInt_ReturnValue_4) == 0x0001EC, "Member 'BP_ParticleManager_C_ExecuteUbergraph_BP_ParticleManager::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");

// Function BP_ParticleManager.BP_ParticleManager_C.HideBGEffect
// 0x0001 (0x0001 - 0x0000)
struct BP_ParticleManager_C_HideBGEffect final
{
public:
	bool                                          ToHide;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ParticleManager_C_HideBGEffect) == 0x000001, "Wrong alignment on BP_ParticleManager_C_HideBGEffect");
static_assert(sizeof(BP_ParticleManager_C_HideBGEffect) == 0x000001, "Wrong size on BP_ParticleManager_C_HideBGEffect");
static_assert(offsetof(BP_ParticleManager_C_HideBGEffect, ToHide) == 0x000000, "Member 'BP_ParticleManager_C_HideBGEffect::ToHide' has a wrong offset!");

// Function BP_ParticleManager.BP_ParticleManager_C.UnregistEffectBackGroundMother
// 0x0008 (0x0008 - 0x0000)
struct BP_ParticleManager_C_UnregistEffectBackGroundMother final
{
public:
	class ABP_EffectBackGroundMother_C*           MotherActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ParticleManager_C_UnregistEffectBackGroundMother) == 0x000008, "Wrong alignment on BP_ParticleManager_C_UnregistEffectBackGroundMother");
static_assert(sizeof(BP_ParticleManager_C_UnregistEffectBackGroundMother) == 0x000008, "Wrong size on BP_ParticleManager_C_UnregistEffectBackGroundMother");
static_assert(offsetof(BP_ParticleManager_C_UnregistEffectBackGroundMother, MotherActor) == 0x000000, "Member 'BP_ParticleManager_C_UnregistEffectBackGroundMother::MotherActor' has a wrong offset!");

// Function BP_ParticleManager.BP_ParticleManager_C.UnregistEffectBackGround
// 0x0008 (0x0008 - 0x0000)
struct BP_ParticleManager_C_UnregistEffectBackGround final
{
public:
	class ABP_EffectBackground_C*                 EffectBackground;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ParticleManager_C_UnregistEffectBackGround) == 0x000008, "Wrong alignment on BP_ParticleManager_C_UnregistEffectBackGround");
static_assert(sizeof(BP_ParticleManager_C_UnregistEffectBackGround) == 0x000008, "Wrong size on BP_ParticleManager_C_UnregistEffectBackGround");
static_assert(offsetof(BP_ParticleManager_C_UnregistEffectBackGround, EffectBackground) == 0x000000, "Member 'BP_ParticleManager_C_UnregistEffectBackGround::EffectBackground' has a wrong offset!");

// Function BP_ParticleManager.BP_ParticleManager_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_ParticleManager_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ParticleManager_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_ParticleManager_C_ReceiveEndPlay");
static_assert(sizeof(BP_ParticleManager_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_ParticleManager_C_ReceiveEndPlay");
static_assert(offsetof(BP_ParticleManager_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_ParticleManager_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_ParticleManager.BP_ParticleManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ParticleManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ParticleManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ParticleManager_C_ReceiveTick");
static_assert(sizeof(BP_ParticleManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_ParticleManager_C_ReceiveTick");
static_assert(offsetof(BP_ParticleManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ParticleManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ParticleManager.BP_ParticleManager_C.OnAcceleratorEnd
// 0x0020 (0x0020 - 0x0000)
struct BP_ParticleManager_C_OnAcceleratorEnd final
{
public:
	struct FAcceleratorParam                      Parameter;                                         // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CE3[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHologram;                                         // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ParticleManager_C_OnAcceleratorEnd) == 0x000008, "Wrong alignment on BP_ParticleManager_C_OnAcceleratorEnd");
static_assert(sizeof(BP_ParticleManager_C_OnAcceleratorEnd) == 0x000020, "Wrong size on BP_ParticleManager_C_OnAcceleratorEnd");
static_assert(offsetof(BP_ParticleManager_C_OnAcceleratorEnd, Parameter) == 0x000000, "Member 'BP_ParticleManager_C_OnAcceleratorEnd::Parameter' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_OnAcceleratorEnd, Param_Owner) == 0x000010, "Member 'BP_ParticleManager_C_OnAcceleratorEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_OnAcceleratorEnd, RemainTime) == 0x000018, "Member 'BP_ParticleManager_C_OnAcceleratorEnd::RemainTime' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_OnAcceleratorEnd, bHologram) == 0x00001C, "Member 'BP_ParticleManager_C_OnAcceleratorEnd::bHologram' has a wrong offset!");

// Function BP_ParticleManager.BP_ParticleManager_C.OnAcceleratorStart
// 0x0020 (0x0020 - 0x0000)
struct BP_ParticleManager_C_OnAcceleratorStart final
{
public:
	struct FAcceleratorParam                      Parameter;                                         // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CE4[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHologram;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ParticleManager_C_OnAcceleratorStart) == 0x000008, "Wrong alignment on BP_ParticleManager_C_OnAcceleratorStart");
static_assert(sizeof(BP_ParticleManager_C_OnAcceleratorStart) == 0x000020, "Wrong size on BP_ParticleManager_C_OnAcceleratorStart");
static_assert(offsetof(BP_ParticleManager_C_OnAcceleratorStart, Parameter) == 0x000000, "Member 'BP_ParticleManager_C_OnAcceleratorStart::Parameter' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_OnAcceleratorStart, Param_Owner) == 0x000010, "Member 'BP_ParticleManager_C_OnAcceleratorStart::Param_Owner' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_OnAcceleratorStart, bHologram) == 0x000018, "Member 'BP_ParticleManager_C_OnAcceleratorStart::bHologram' has a wrong offset!");

// Function BP_ParticleManager.BP_ParticleManager_C.OnPsychicEnd
// 0x0018 (0x0018 - 0x0000)
struct BP_ParticleManager_C_OnPsychicEnd final
{
public:
	struct FFSASPsychicParam                      Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CE5[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ParticleManager_C_OnPsychicEnd) == 0x000008, "Wrong alignment on BP_ParticleManager_C_OnPsychicEnd");
static_assert(sizeof(BP_ParticleManager_C_OnPsychicEnd) == 0x000018, "Wrong size on BP_ParticleManager_C_OnPsychicEnd");
static_assert(offsetof(BP_ParticleManager_C_OnPsychicEnd, Param) == 0x000000, "Member 'BP_ParticleManager_C_OnPsychicEnd::Param' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_OnPsychicEnd, Param_Owner) == 0x000008, "Member 'BP_ParticleManager_C_OnPsychicEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_OnPsychicEnd, RemainTime) == 0x000010, "Member 'BP_ParticleManager_C_OnPsychicEnd::RemainTime' has a wrong offset!");

// Function BP_ParticleManager.BP_ParticleManager_C.OnPsychicStart
// 0x0010 (0x0010 - 0x0000)
struct BP_ParticleManager_C_OnPsychicStart final
{
public:
	struct FFSASPsychicParam                      Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CE6[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ParticleManager_C_OnPsychicStart) == 0x000008, "Wrong alignment on BP_ParticleManager_C_OnPsychicStart");
static_assert(sizeof(BP_ParticleManager_C_OnPsychicStart) == 0x000010, "Wrong size on BP_ParticleManager_C_OnPsychicStart");
static_assert(offsetof(BP_ParticleManager_C_OnPsychicStart, Param) == 0x000000, "Member 'BP_ParticleManager_C_OnPsychicStart::Param' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_OnPsychicStart, Param_Owner) == 0x000008, "Member 'BP_ParticleManager_C_OnPsychicStart::Param_Owner' has a wrong offset!");

// Function BP_ParticleManager.BP_ParticleManager_C.OnCopyEnd
// 0x0018 (0x0018 - 0x0000)
struct BP_ParticleManager_C_OnCopyEnd final
{
public:
	struct FFSASCopyParam                         Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CE7[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ParticleManager_C_OnCopyEnd) == 0x000008, "Wrong alignment on BP_ParticleManager_C_OnCopyEnd");
static_assert(sizeof(BP_ParticleManager_C_OnCopyEnd) == 0x000018, "Wrong size on BP_ParticleManager_C_OnCopyEnd");
static_assert(offsetof(BP_ParticleManager_C_OnCopyEnd, Param) == 0x000000, "Member 'BP_ParticleManager_C_OnCopyEnd::Param' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_OnCopyEnd, Param_Owner) == 0x000008, "Member 'BP_ParticleManager_C_OnCopyEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_OnCopyEnd, RemainTime) == 0x000010, "Member 'BP_ParticleManager_C_OnCopyEnd::RemainTime' has a wrong offset!");

// Function BP_ParticleManager.BP_ParticleManager_C.OnCopyStart
// 0x0010 (0x0010 - 0x0000)
struct BP_ParticleManager_C_OnCopyStart final
{
public:
	struct FFSASCopyParam                         Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CE8[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ParticleManager_C_OnCopyStart) == 0x000008, "Wrong alignment on BP_ParticleManager_C_OnCopyStart");
static_assert(sizeof(BP_ParticleManager_C_OnCopyStart) == 0x000010, "Wrong size on BP_ParticleManager_C_OnCopyStart");
static_assert(offsetof(BP_ParticleManager_C_OnCopyStart, Param) == 0x000000, "Member 'BP_ParticleManager_C_OnCopyStart::Param' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_OnCopyStart, Param_Owner) == 0x000008, "Member 'BP_ParticleManager_C_OnCopyStart::Param_Owner' has a wrong offset!");

// Function BP_ParticleManager.BP_ParticleManager_C.OnStealthEnd
// 0x0018 (0x0018 - 0x0000)
struct BP_ParticleManager_C_OnStealthEnd final
{
public:
	struct FFSASStealthParam                      Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CE9[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ParticleManager_C_OnStealthEnd) == 0x000008, "Wrong alignment on BP_ParticleManager_C_OnStealthEnd");
static_assert(sizeof(BP_ParticleManager_C_OnStealthEnd) == 0x000018, "Wrong size on BP_ParticleManager_C_OnStealthEnd");
static_assert(offsetof(BP_ParticleManager_C_OnStealthEnd, Param) == 0x000000, "Member 'BP_ParticleManager_C_OnStealthEnd::Param' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_OnStealthEnd, Param_Owner) == 0x000008, "Member 'BP_ParticleManager_C_OnStealthEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(BP_ParticleManager_C_OnStealthEnd, RemainTime) == 0x000010, "Member 'BP_ParticleManager_C_OnStealthEnd::RemainTime' has a wrong offset!");

// Function BP_ParticleManager.BP_ParticleManager_C.OnStealthStart
// 0x0010 (0x0010 - 0x0000)
struct BP_ParticleManager_C_OnStealthStart final
{
public:
	struct FFSASStealthParam                      Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CEA[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ParticleManager_C_OnStealthStart) == 0x000008, "Wrong alignment on BP_ParticleManager_C_OnStealthStart");
static_assert(sizeof(BP_ParticleManager_C_OnStealthStart) == 0x000010, "Wrong size on BP_ParticleManager_C_OnStealthStart");
