#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PsychicObjectBasic

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "PsychicObjectAttackType_structs.hpp"
#include "FSASFireParam_structs.hpp"
#include "PsyObjType_structs.hpp"
#include "CascadeExtensionPlugin_structs.hpp"
#include "FSASCommand_structs.hpp"
#include "Engine_structs.hpp"
#include "E_SASKind_structs.hpp"
#include "FSASPsychicParam_structs.hpp"
#include "FSASElectricParam_structs.hpp"
#include "FSASCopyParam_structs.hpp"
#include "AcceleratorParam_structs.hpp"
#include "FSASSeeThroughParam_structs.hpp"
#include "FSASMetalParam_structs.hpp"
#include "FSASTelepoParam_structs.hpp"
#include "FSASStealthParam_structs.hpp"


namespace SDK::Params
{

// Function BP_PsychicObjectBasic.BP_PsychicObjectBasic_C.ExecuteUbergraph_BP_PsychicObjectBasic
// 0x03E8 (0x03E8 - 0x0000)
struct BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASCopyParam                         K2Node_Event_param_11;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8849[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_13;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASFireParam                         K2Node_Event_param_10;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_884A[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_12;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_7;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASElectricParam                     K2Node_Event_param_9;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_884B[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_11;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_6;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASCopyParam                         K2Node_Event_param_8;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_884C[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_10;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_5;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAcceleratorParam                      K2Node_Event_Parameter_1;                          // 0x0044(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Owner_9;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHologram_1;                          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_884D[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAcceleratorParam                      K2Node_Event_Parameter;                            // 0x005C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Owner_8;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_4;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHologram;                            // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFSASMetalParam                        K2Node_Event_param_7;                              // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_884E[0x2];                                     // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_7;                              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASMetalParam                        K2Node_Event_param_6;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_884F[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_6;                              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_3;                         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASSeeThroughParam                   K2Node_Event_param_5;                              // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8850[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_5;                              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASSeeThroughParam                   K2Node_Event_param_4;                              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8851[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_4;                              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_2;                         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASTelepoParam                       K2Node_Event_param_3;                              // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8852[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_3;                              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASTelepoParam                       K2Node_Event_param_2;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8853[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_2;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_1;                         // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASStealthParam                      K2Node_Event_param_1;                              // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8854[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_1;                              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASStealthParam                      K2Node_Event_param;                                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8855[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner;                                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime;                           // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Update_return;                            // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFSASFireParam                         K2Node_Event_param_12;                             // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8856[0x6];                                     // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_14;                             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASElectricParam                     K2Node_Event_param_13;                             // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8857[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_15;                             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Initialize_return;                        // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DebugDisplay_return;                      // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8858[0x6];                                     // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHCHitResult                           K2Node_ComponentBoundEvent_Result;                 // 0x0120(0x01C0)(ContainsInstancedReference)
	bool                                          K2Node_Event_isActive;                             // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_On_Hit_Attack_return;                     // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetPsychicObjectActiveC_ReturnValue;      // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckRepeatHitAttackActor_bOK;            // 0x02E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8859[0x3];                                     // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_885A[0x3];                                     // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0304(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0310(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x031C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0328(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FFSASPsychicParam                      K2Node_Event_param_14;                             // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_885B[0x7];                                     // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_16;                             // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_8;                         // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASPsychicParam                      K2Node_Event_param_15;                             // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_885C[0x3];                                     // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_17;                             // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_flag_in;                              // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_is_mesh_only;                         // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_885D[0x6];                                     // 0x03D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APsychicObjectManager_C*                CallFunc_GetPsychicObjectManager_PsyObjManager;    // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetVisibilityPsyObj_return;               // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic) == 0x000008, "Wrong alignment on BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic");
static_assert(sizeof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic) == 0x0003E8, "Wrong size on BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, EntryPoint) == 0x000000, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_param_11) == 0x000004, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_param_11' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_Owner_13) == 0x000008, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_Owner_13' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_param_10) == 0x000010, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_param_10' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_Owner_12) == 0x000018, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_Owner_12' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_RemainTime_7) == 0x000020, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_RemainTime_7' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_param_9) == 0x000024, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_param_9' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_Owner_11) == 0x000028, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_Owner_11' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_RemainTime_6) == 0x000030, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_RemainTime_6' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_param_8) == 0x000034, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_param_8' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_Owner_10) == 0x000038, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_Owner_10' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_RemainTime_5) == 0x000040, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_RemainTime_5' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_Parameter_1) == 0x000044, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_Parameter_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_Owner_9) == 0x000050, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_Owner_9' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_bHologram_1) == 0x000058, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_bHologram_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_Parameter) == 0x00005C, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_Parameter' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_Owner_8) == 0x000068, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_Owner_8' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_RemainTime_4) == 0x000070, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_RemainTime_4' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_bHologram) == 0x000074, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_bHologram' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_param_7) == 0x000075, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_param_7' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_Owner_7) == 0x000078, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_Owner_7' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_param_6) == 0x000080, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_param_6' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_Owner_6) == 0x000088, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_Owner_6' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_RemainTime_3) == 0x000090, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_RemainTime_3' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_param_5) == 0x000094, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_param_5' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_Owner_5) == 0x000098, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_Owner_5' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_param_4) == 0x0000A0, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_param_4' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_Owner_4) == 0x0000A8, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_Owner_4' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_RemainTime_2) == 0x0000B0, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_RemainTime_2' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_param_3) == 0x0000B4, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_param_3' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_Owner_3) == 0x0000B8, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_Owner_3' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_param_2) == 0x0000C0, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_param_2' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_Owner_2) == 0x0000C8, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_Owner_2' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_RemainTime_1) == 0x0000D0, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_RemainTime_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_param_1) == 0x0000D4, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_param_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_Owner_1) == 0x0000D8, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_Owner_1' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_param) == 0x0000E0, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_param' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_Owner) == 0x0000E8, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_Owner' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_RemainTime) == 0x0000F0, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_RemainTime' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_DeltaSeconds) == 0x0000F4, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, CallFunc_Update_return) == 0x0000F8, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::CallFunc_Update_return' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_param_12) == 0x0000F9, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_param_12' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_Owner_14) == 0x000100, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_Owner_14' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_param_13) == 0x000108, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_param_13' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_Owner_15) == 0x000110, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_Owner_15' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, CallFunc_Initialize_return) == 0x000118, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::CallFunc_Initialize_return' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, CallFunc_DebugDisplay_return) == 0x000119, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::CallFunc_DebugDisplay_return' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_ComponentBoundEvent_Result) == 0x000120, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_ComponentBoundEvent_Result' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_isActive) == 0x0002E0, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_isActive' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, CallFunc_On_Hit_Attack_return) == 0x0002E1, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::CallFunc_On_Hit_Attack_return' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, CallFunc_SetPsychicObjectActiveC_ReturnValue) == 0x0002E2, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::CallFunc_SetPsychicObjectActiveC_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, CallFunc_CheckRepeatHitAttackActor_bOK) == 0x0002E3, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::CallFunc_CheckRepeatHitAttackActor_bOK' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_EndPlayReason) == 0x0002E4, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_MyComp) == 0x0002E8, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_Other) == 0x0002F0, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_OtherComp) == 0x0002F8, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_bSelfMoved) == 0x000300, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_HitLocation) == 0x000304, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_HitNormal) == 0x000310, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_NormalImpulse) == 0x00031C, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_Hit) == 0x000328, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_param_14) == 0x0003B0, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_param_14' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_Owner_16) == 0x0003B8, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_Owner_16' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_RemainTime_8) == 0x0003C0, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_RemainTime_8' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_param_15) == 0x0003C4, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_param_15' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_Owner_17) == 0x0003C8, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_Owner_17' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_flag_in) == 0x0003D0, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_flag_in' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, K2Node_Event_is_mesh_only) == 0x0003D1, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::K2Node_Event_is_mesh_only' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, CallFunc_GetPsychicObjectManager_PsyObjManager) == 0x0003D8, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::CallFunc_GetPsychicObjectManager_PsyObjManager' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, CallFunc_SetVisibilityPsyObj_return) == 0x0003E0, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::CallFunc_SetVisibilityPsyObj_return' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic, CallFunc_IsValid_ReturnValue) == 0x0003E1, "Member 'BP_PsychicObjectBasic_C_ExecuteUbergraph_BP_PsychicObjectBasic::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PsychicObjectBasic.BP_PsychicObjectBasic_C.SetPsychicObjectVisibility
// 0x0002 (0x0002 - 0x0000)
struct BP_PsychicObjectBasic_C_SetPsychicObjectVisibility final
{
public:
	bool                                          Flag_in;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Is_mesh_only;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicObjectBasic_C_SetPsychicObjectVisibility) == 0x000001, "Wrong alignment on BP_PsychicObjectBasic_C_SetPsychicObjectVisibility");
static_assert(sizeof(BP_PsychicObjectBasic_C_SetPsychicObjectVisibility) == 0x000002, "Wrong size on BP_PsychicObjectBasic_C_SetPsychicObjectVisibility");
static_assert(offsetof(BP_PsychicObjectBasic_C_SetPsychicObjectVisibility, Flag_in) == 0x000000, "Member 'BP_PsychicObjectBasic_C_SetPsychicObjectVisibility::Flag_in' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_SetPsychicObjectVisibility, Is_mesh_only) == 0x000001, "Member 'BP_PsychicObjectBasic_C_SetPsychicObjectVisibility::Is_mesh_only' has a wrong offset!");

// Function BP_PsychicObjectBasic.BP_PsychicObjectBasic_C.ReceiveHit
// 0x00C8 (0x00C8 - 0x0000)
struct BP_PsychicObjectBasic_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_885E[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_PsychicObjectBasic_C_ReceiveHit) == 0x000008, "Wrong alignment on BP_PsychicObjectBasic_C_ReceiveHit");
static_assert(sizeof(BP_PsychicObjectBasic_C_ReceiveHit) == 0x0000C8, "Wrong size on BP_PsychicObjectBasic_C_ReceiveHit");
static_assert(offsetof(BP_PsychicObjectBasic_C_ReceiveHit, MyComp) == 0x000000, "Member 'BP_PsychicObjectBasic_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ReceiveHit, Other) == 0x000008, "Member 'BP_PsychicObjectBasic_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ReceiveHit, OtherComp) == 0x000010, "Member 'BP_PsychicObjectBasic_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'BP_PsychicObjectBasic_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ReceiveHit, HitLocation) == 0x00001C, "Member 'BP_PsychicObjectBasic_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ReceiveHit, HitNormal) == 0x000028, "Member 'BP_PsychicObjectBasic_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ReceiveHit, NormalImpulse) == 0x000034, "Member 'BP_PsychicObjectBasic_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_ReceiveHit, Hit) == 0x000040, "Member 'BP_PsychicObjectBasic_C_ReceiveHit::Hit' has a wrong offset!");

// Function BP_PsychicObjectBasic.BP_PsychicObjectBasic_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_PsychicObjectBasic_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicObjectBasic_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_PsychicObjectBasic_C_ReceiveEndPlay");
static_assert(sizeof(BP_PsychicObjectBasic_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_PsychicObjectBasic_C_ReceiveEndPlay");
static_assert(offsetof(BP_PsychicObjectBasic_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_PsychicObjectBasic_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_PsychicObjectBasic.BP_PsychicObjectBasic_C.SetPsychicObjectActive
// 0x0001 (0x0001 - 0x0000)
struct BP_PsychicObjectBasic_C_SetPsychicObjectActive final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicObjectBasic_C_SetPsychicObjectActive) == 0x000001, "Wrong alignment on BP_PsychicObjectBasic_C_SetPsychicObjectActive");
static_assert(sizeof(BP_PsychicObjectBasic_C_SetPsychicObjectActive) == 0x000001, "Wrong size on BP_PsychicObjectBasic_C_SetPsychicObjectActive");
static_assert(offsetof(BP_PsychicObjectBasic_C_SetPsychicObjectActive, IsActive) == 0x000000, "Member 'BP_PsychicObjectBasic_C_SetPsychicObjectActive::IsActive' has a wrong offset!");

// Function BP_PsychicObjectBasic.BP_PsychicObjectBasic_C.BndEvt__HitCheckReceiver_K2Node_ComponentBoundEvent_0_HitResultDelegate__DelegateSignature
// 0x01C0 (0x01C0 - 0x0000)
struct BP_PsychicObjectBasic_C_BndEvt__HitCheckReceiver_K2Node_ComponentBoundEvent_0_HitResultDelegate__DelegateSignature final
{
public:
	struct FHCHitResult                           Result;                                            // 0x0000(0x01C0)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_PsychicObjectBasic_C_BndEvt__HitCheckReceiver_K2Node_ComponentBoundEvent_0_HitResultDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_PsychicObjectBasic_C_BndEvt__HitCheckReceiver_K2Node_ComponentBoundEvent_0_HitResultDelegate__DelegateSignature");
static_assert(sizeof(BP_PsychicObjectBasic_C_BndEvt__HitCheckReceiver_K2Node_ComponentBoundEvent_0_HitResultDelegate__DelegateSignature) == 0x0001C0, "Wrong size on BP_PsychicObjectBasic_C_BndEvt__HitCheckReceiver_K2Node_ComponentBoundEvent_0_HitResultDelegate__DelegateSignature");
static_assert(offsetof(BP_PsychicObjectBasic_C_BndEvt__HitCheckReceiver_K2Node_ComponentBoundEvent_0_HitResultDelegate__DelegateSignature, Result) == 0x000000, "Member 'BP_PsychicObjectBasic_C_BndEvt__HitCheckReceiver_K2Node_ComponentBoundEvent_0_HitResultDelegate__DelegateSignature::Result' has a wrong offset!");

// Function BP_PsychicObjectBasic.BP_PsychicObjectBasic_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PsychicObjectBasic_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicObjectBasic_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PsychicObjectBasic_C_ReceiveTick");
static_assert(sizeof(BP_PsychicObjectBasic_C_ReceiveTick) == 0x000004, "Wrong size on BP_PsychicObjectBasic_C_ReceiveTick");
static_assert(offsetof(BP_PsychicObjectBasic_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PsychicObjectBasic_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PsychicObjectBasic.BP_PsychicObjectBasic_C.OnStealthEnd
// 0x0018 (0x0018 - 0x0000)
struct BP_PsychicObjectBasic_C_OnStealthEnd final
{
public:
	struct FFSASStealthParam                      Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_885F[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicObjectBasic_C_OnStealthEnd) == 0x000008, "Wrong alignment on BP_PsychicObjectBasic_C_OnStealthEnd");
static_assert(sizeof(BP_PsychicObjectBasic_C_OnStealthEnd) == 0x000018, "Wrong size on BP_PsychicObjectBasic_C_OnStealthEnd");
static_assert(offsetof(BP_PsychicObjectBasic_C_OnStealthEnd, Param) == 0x000000, "Member 'BP_PsychicObjectBasic_C_OnStealthEnd::Param' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_OnStealthEnd, Param_Owner) == 0x000008, "Member 'BP_PsychicObjectBasic_C_OnStealthEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_OnStealthEnd, RemainTime) == 0x000010, "Member 'BP_PsychicObjectBasic_C_OnStealthEnd::RemainTime' has a wrong offset!");

// Function BP_PsychicObjectBasic.BP_PsychicObjectBasic_C.OnStealthStart
// 0x0010 (0x0010 - 0x0000)
struct BP_PsychicObjectBasic_C_OnStealthStart final
{
public:
	struct FFSASStealthParam                      Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8860[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicObjectBasic_C_OnStealthStart) == 0x000008, "Wrong alignment on BP_PsychicObjectBasic_C_OnStealthStart");
static_assert(sizeof(BP_PsychicObjectBasic_C_OnStealthStart) == 0x000010, "Wrong size on BP_PsychicObjectBasic_C_OnStealthStart");
static_assert(offsetof(BP_PsychicObjectBasic_C_OnStealthStart, Param) == 0x000000, "Member 'BP_PsychicObjectBasic_C_OnStealthStart::Param' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_OnStealthStart, Param_Owner) == 0x000008, "Member 'BP_PsychicObjectBasic_C_OnStealthStart::Param_Owner' has a wrong offset!");

// Function BP_PsychicObjectBasic.BP_PsychicObjectBasic_C.OnTelepoEnd
// 0x0018 (0x0018 - 0x0000)
struct BP_PsychicObjectBasic_C_OnTelepoEnd final
{
public:
	struct FFSASTelepoParam                       Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8861[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicObjectBasic_C_OnTelepoEnd) == 0x000008, "Wrong alignment on BP_PsychicObjectBasic_C_OnTelepoEnd");
static_assert(sizeof(BP_PsychicObjectBasic_C_OnTelepoEnd) == 0x000018, "Wrong size on BP_PsychicObjectBasic_C_OnTelepoEnd");
static_assert(offsetof(BP_PsychicObjectBasic_C_OnTelepoEnd, Param) == 0x000000, "Member 'BP_PsychicObjectBasic_C_OnTelepoEnd::Param' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_OnTelepoEnd, Param_Owner) == 0x000008, "Member 'BP_PsychicObjectBasic_C_OnTelepoEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_OnTelepoEnd, RemainTime) == 0x000010, "Member 'BP_PsychicObjectBasic_C_OnTelepoEnd::RemainTime' has a wrong offset!");

// Function BP_PsychicObjectBasic.BP_PsychicObjectBasic_C.OnTelepoStart
// 0x0010 (0x0010 - 0x0000)
struct BP_PsychicObjectBasic_C_OnTelepoStart final
{
public:
	struct FFSASTelepoParam                       Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8862[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicObjectBasic_C_OnTelepoStart) == 0x000008, "Wrong alignment on BP_PsychicObjectBasic_C_OnTelepoStart");
static_assert(sizeof(BP_PsychicObjectBasic_C_OnTelepoStart) == 0x000010, "Wrong size on BP_PsychicObjectBasic_C_OnTelepoStart");
static_assert(offsetof(BP_PsychicObjectBasic_C_OnTelepoStart, Param) == 0x000000, "Member 'BP_PsychicObjectBasic_C_OnTelepoStart::Param' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_OnTelepoStart, Param_Owner) == 0x000008, "Member 'BP_PsychicObjectBasic_C_OnTelepoStart::Param_Owner' has a wrong offset!");

// Function BP_PsychicObjectBasic.BP_PsychicObjectBasic_C.OnSeeThroughEnd
// 0x0018 (0x0018 - 0x0000)
struct BP_PsychicObjectBasic_C_OnSeeThroughEnd final
{
public:
	struct FFSASSeeThroughParam                   Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8863[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicObjectBasic_C_OnSeeThroughEnd) == 0x000008, "Wrong alignment on BP_PsychicObjectBasic_C_OnSeeThroughEnd");
static_assert(sizeof(BP_PsychicObjectBasic_C_OnSeeThroughEnd) == 0x000018, "Wrong size on BP_PsychicObjectBasic_C_OnSeeThroughEnd");
static_assert(offsetof(BP_PsychicObjectBasic_C_OnSeeThroughEnd, Param) == 0x000000, "Member 'BP_PsychicObjectBasic_C_OnSeeThroughEnd::Param' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_OnSeeThroughEnd, Param_Owner) == 0x000008, "Member 'BP_PsychicObjectBasic_C_OnSeeThroughEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_OnSeeThroughEnd, RemainTime) == 0x000010, "Member 'BP_PsychicObjectBasic_C_OnSeeThroughEnd::RemainTime' has a wrong offset!");

// Function BP_PsychicObjectBasic.BP_PsychicObjectBasic_C.OnSeeThroughStart
// 0x0010 (0x0010 - 0x0000)
struct BP_PsychicObjectBasic_C_OnSeeThroughStart final
{
public:
	struct FFSASSeeThroughParam                   Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8864[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicObjectBasic_C_OnSeeThroughStart) == 0x000008, "Wrong alignment on BP_PsychicObjectBasic_C_OnSeeThroughStart");
static_assert(sizeof(BP_PsychicObjectBasic_C_OnSeeThroughStart) == 0x000010, "Wrong size on BP_PsychicObjectBasic_C_OnSeeThroughStart");
static_assert(offsetof(BP_PsychicObjectBasic_C_OnSeeThroughStart, Param) == 0x000000, "Member 'BP_PsychicObjectBasic_C_OnSeeThroughStart::Param' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_OnSeeThroughStart, Param_Owner) == 0x000008, "Member 'BP_PsychicObjectBasic_C_OnSeeThroughStart::Param_Owner' has a wrong offset!");

// Function BP_PsychicObjectBasic.BP_PsychicObjectBasic_C.OnMetalEnd
// 0x0018 (0x0018 - 0x0000)
struct BP_PsychicObjectBasic_C_OnMetalEnd final
{
public:
	struct FFSASMetalParam                        Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8865[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicObjectBasic_C_OnMetalEnd) == 0x000008, "Wrong alignment on BP_PsychicObjectBasic_C_OnMetalEnd");
static_assert(sizeof(BP_PsychicObjectBasic_C_OnMetalEnd) == 0x000018, "Wrong size on BP_PsychicObjectBasic_C_OnMetalEnd");
static_assert(offsetof(BP_PsychicObjectBasic_C_OnMetalEnd, Param) == 0x000000, "Member 'BP_PsychicObjectBasic_C_OnMetalEnd::Param' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_OnMetalEnd, Param_Owner) == 0x000008, "Member 'BP_PsychicObjectBasic_C_OnMetalEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_OnMetalEnd, RemainTime) == 0x000010, "Member 'BP_PsychicObjectBasic_C_OnMetalEnd::RemainTime' has a wrong offset!");

// Function BP_PsychicObjectBasic.BP_PsychicObjectBasic_C.OnMetalStart
// 0x0010 (0x0010 - 0x0000)
struct BP_PsychicObjectBasic_C_OnMetalStart final
{
public:
	struct FFSASMetalParam                        Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8866[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PsychicObjectBasic_C_OnMetalStart) == 0x000008, "Wrong alignment on BP_PsychicObjectBasic_C_OnMetalStart");
static_assert(sizeof(BP_PsychicObjectBasic_C_OnMetalStart) == 0x000010, "Wrong size on BP_PsychicObjectBasic_C_OnMetalStart");
static_assert(offsetof(BP_PsychicObjectBasic_C_OnMetalStart, Param) == 0x000000, "Member 'BP_PsychicObjectBasic_C_OnMetalStart::Param' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_OnMetalStart, Param_Owner) == 0x000008, "Member 'BP_PsychicObjectBasic_C_OnMetalStart::Param_Owner' has a wrong offset!");

// Function BP_PsychicObjectBasic.BP_PsychicObjectBasic_C.OnAcceleratorEnd
// 0x0020 (0x0020 - 0x0000)
struct BP_PsychicObjectBasic_C_OnAcceleratorEnd final
{
public:
	struct FAcceleratorParam                      Parameter;                                         // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8867[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHologram;                                         // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicObjectBasic_C_OnAcceleratorEnd) == 0x000008, "Wrong alignment on BP_PsychicObjectBasic_C_OnAcceleratorEnd");
static_assert(sizeof(BP_PsychicObjectBasic_C_OnAcceleratorEnd) == 0x000020, "Wrong size on BP_PsychicObjectBasic_C_OnAcceleratorEnd");
static_assert(offsetof(BP_PsychicObjectBasic_C_OnAcceleratorEnd, Parameter) == 0x000000, "Member 'BP_PsychicObjectBasic_C_OnAcceleratorEnd::Parameter' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_OnAcceleratorEnd, Param_Owner) == 0x000010, "Member 'BP_PsychicObjectBasic_C_OnAcceleratorEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_OnAcceleratorEnd, RemainTime) == 0x000018, "Member 'BP_PsychicObjectBasic_C_OnAcceleratorEnd::RemainTime' has a wrong offset!");
static_assert(offsetof(BP_PsychicObjectBasic_C_OnAcceleratorEnd, bHologram) == 0x00001C, "Member 'BP_PsychicObjectBasic_C_OnAcceleratorEnd::bHologram' has a wrong offset!");

// Function BP_PsychicObjectBasic.BP_PsychicObjectBasic_C.OnAcceleratorStart
// 0x0020 (0x0020 - 0x0000)
struct BP_PsychicObjectBasic_C_OnAcceleratorStart final
{
public:
	struct FAcceleratorParam                      Parameter;                                         // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8868[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHologram;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PsychicObjectBasic_C_OnAcceleratorStart) == 0x000008, "Wrong alignment on BP_PsychicObjectBasic_C_OnAcceleratorStart");
