#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PostProcessManager

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PostProcessManager.BP_PostProcessManager_C.ExecuteUbergraph_BP_PostProcessManager
// 0x00B0 (0x00B0 - 0x0000)
struct BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86AB[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ParticleManager_C*                  CallFunc_GetParticleManager_Particle_Manager;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86AC[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86AD[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86AE[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EChangeAreaStatus Status, bool IsChangeLocation)> K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager_1;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86AF[0x8];                                     // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86B0[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPostProcessComponent*                  CallFunc_AddComponent_ReturnValue;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EChangeAreaStatus Status, bool IsChangeLocation)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager) == 0x000010, "Wrong alignment on BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager");
static_assert(sizeof(BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager) == 0x0000B0, "Wrong size on BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager");
static_assert(offsetof(BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager, EntryPoint) == 0x000000, "Member 'BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager, K2Node_Event_EndPlayReason) == 0x00000C, "Member 'BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager, CallFunc_GetParticleManager_Particle_Manager) == 0x000010, "Member 'BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager::CallFunc_GetParticleManager_Particle_Manager' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager, CallFunc_GetPlatformType_ReturnValue) == 0x000019, "Member 'BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager, CallFunc_GetSceneManager_SceneManager) == 0x000020, "Member 'BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager::CallFunc_GetSceneManager_SceneManager' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager, Temp_int_Variable) == 0x00002C, "Member 'BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000030, "Member 'BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager, CallFunc_Add_FloatFloat_ReturnValue) == 0x000034, "Member 'BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000038, "Member 'BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager, CallFunc_GetSceneManager_SceneManager_1) == 0x000050, "Member 'BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager::CallFunc_GetSceneManager_SceneManager_1' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager, CallFunc_IsValid_ReturnValue_2) == 0x000090, "Member 'BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager, CallFunc_AddComponent_ReturnValue) == 0x000098, "Member 'BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000A0, "Member 'BP_PostProcessManager_C_ExecuteUbergraph_BP_PostProcessManager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function BP_PostProcessManager.BP_PostProcessManager_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_PostProcessManager_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PostProcessManager_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_PostProcessManager_C_ReceiveEndPlay");
static_assert(sizeof(BP_PostProcessManager_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_PostProcessManager_C_ReceiveEndPlay");
static_assert(offsetof(BP_PostProcessManager_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_PostProcessManager_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_PostProcessManager.BP_PostProcessManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PostProcessManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PostProcessManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PostProcessManager_C_ReceiveTick");
static_assert(sizeof(BP_PostProcessManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_PostProcessManager_C_ReceiveTick");
static_assert(offsetof(BP_PostProcessManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PostProcessManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PostProcessManager.BP_PostProcessManager_C.StartPostProcess
// 0x07B0 (0x07B0 - 0x0000)
struct BP_PostProcessManager_C_StartPostProcess final
{
public:
	struct FPostProcessSettings                   Settings;                                          // 0x0000(0x0780)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         TimeSeconds;                                       // 0x0780(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Handle;                                            // 0x0784(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x078C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0794(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86B1[0x3];                                     // 0x0795(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetUnusedComponent_Index;                 // 0x0798(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86B2[0x4];                                     // 0x079C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPostProcessComponent*                  CallFunc_Array_Get_Item;                           // 0x07A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x07A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PostProcessManager_C_StartPostProcess) == 0x000010, "Wrong alignment on BP_PostProcessManager_C_StartPostProcess");
static_assert(sizeof(BP_PostProcessManager_C_StartPostProcess) == 0x0007B0, "Wrong size on BP_PostProcessManager_C_StartPostProcess");
static_assert(offsetof(BP_PostProcessManager_C_StartPostProcess, Settings) == 0x000000, "Member 'BP_PostProcessManager_C_StartPostProcess::Settings' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_StartPostProcess, TimeSeconds) == 0x000780, "Member 'BP_PostProcessManager_C_StartPostProcess::TimeSeconds' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_StartPostProcess, Handle) == 0x000784, "Member 'BP_PostProcessManager_C_StartPostProcess::Handle' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_StartPostProcess, CallFunc_Add_FloatFloat_ReturnValue) == 0x000788, "Member 'BP_PostProcessManager_C_StartPostProcess::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_StartPostProcess, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00078C, "Member 'BP_PostProcessManager_C_StartPostProcess::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_StartPostProcess, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000790, "Member 'BP_PostProcessManager_C_StartPostProcess::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_StartPostProcess, Temp_bool_Variable) == 0x000794, "Member 'BP_PostProcessManager_C_StartPostProcess::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_StartPostProcess, CallFunc_GetUnusedComponent_Index) == 0x000798, "Member 'BP_PostProcessManager_C_StartPostProcess::CallFunc_GetUnusedComponent_Index' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_StartPostProcess, CallFunc_Array_Get_Item) == 0x0007A0, "Member 'BP_PostProcessManager_C_StartPostProcess::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_StartPostProcess, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0007A8, "Member 'BP_PostProcessManager_C_StartPostProcess::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_PostProcessManager.BP_PostProcessManager_C.GetUnusedComponent
// 0x0024 (0x0024 - 0x0000)
struct BP_PostProcessManager_C_GetUnusedComponent final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetIndex;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86B3[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86B4[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PostProcessManager_C_GetUnusedComponent) == 0x000004, "Wrong alignment on BP_PostProcessManager_C_GetUnusedComponent");
static_assert(sizeof(BP_PostProcessManager_C_GetUnusedComponent) == 0x000024, "Wrong size on BP_PostProcessManager_C_GetUnusedComponent");
static_assert(offsetof(BP_PostProcessManager_C_GetUnusedComponent, Param_Index) == 0x000000, "Member 'BP_PostProcessManager_C_GetUnusedComponent::Param_Index' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_GetUnusedComponent, RetIndex) == 0x000004, "Member 'BP_PostProcessManager_C_GetUnusedComponent::RetIndex' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_GetUnusedComponent, Temp_bool_True_if_break_was_hit_Variable) == 0x000008, "Member 'BP_PostProcessManager_C_GetUnusedComponent::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_GetUnusedComponent, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_PostProcessManager_C_GetUnusedComponent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_GetUnusedComponent, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'BP_PostProcessManager_C_GetUnusedComponent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_GetUnusedComponent, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_PostProcessManager_C_GetUnusedComponent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_GetUnusedComponent, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_PostProcessManager_C_GetUnusedComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_GetUnusedComponent, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_PostProcessManager_C_GetUnusedComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_GetUnusedComponent, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_PostProcessManager_C_GetUnusedComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_GetUnusedComponent, CallFunc_Less_IntInt_ReturnValue) == 0x000021, "Member 'BP_PostProcessManager_C_GetUnusedComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_GetUnusedComponent, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'BP_PostProcessManager_C_GetUnusedComponent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_PostProcessManager.BP_PostProcessManager_C.Update
// 0x0070 (0x0070 - 0x0000)
struct BP_PostProcessManager_C_Update final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86B5[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      MainPlayer;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerManager_C*                    PlayerManager;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AnyMove;                                           // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AnyLive;                                           // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86B6[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldNormalDeltaSeconds_ReturnValue;   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateRecoverNPC_Active;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86B7[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateLevelup_Active;                     // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdatePerformShot_Active;                 // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateVisionFog_Active;                   // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPostProcessComponent*                  CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86B8[0x1];                                     // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x003C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0040(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86B9[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0050(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86BA[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86BB[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PostProcessManager_C_Update) == 0x000008, "Wrong alignment on BP_PostProcessManager_C_Update");
static_assert(sizeof(BP_PostProcessManager_C_Update) == 0x000070, "Wrong size on BP_PostProcessManager_C_Update");
static_assert(offsetof(BP_PostProcessManager_C_Update, DeltaSeconds) == 0x000000, "Member 'BP_PostProcessManager_C_Update::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, MainPlayer) == 0x000008, "Member 'BP_PostProcessManager_C_Update::MainPlayer' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, PlayerManager) == 0x000010, "Member 'BP_PostProcessManager_C_Update::PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, AnyMove) == 0x000018, "Member 'BP_PostProcessManager_C_Update::AnyMove' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, AnyLive) == 0x000019, "Member 'BP_PostProcessManager_C_Update::AnyLive' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, Temp_int_Loop_Num_Variable) == 0x00001C, "Member 'BP_PostProcessManager_C_Update::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, CallFunc_GetWorldNormalDeltaSeconds_ReturnValue) == 0x000020, "Member 'BP_PostProcessManager_C_Update::CallFunc_GetWorldNormalDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, CallFunc_UpdateRecoverNPC_Active) == 0x000024, "Member 'BP_PostProcessManager_C_Update::CallFunc_UpdateRecoverNPC_Active' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_PostProcessManager_C_Update::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, CallFunc_UpdateLevelup_Active) == 0x00002C, "Member 'BP_PostProcessManager_C_Update::CallFunc_UpdateLevelup_Active' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, CallFunc_UpdatePerformShot_Active) == 0x00002D, "Member 'BP_PostProcessManager_C_Update::CallFunc_UpdatePerformShot_Active' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, CallFunc_UpdateVisionFog_Active) == 0x00002E, "Member 'BP_PostProcessManager_C_Update::CallFunc_UpdateVisionFog_Active' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, CallFunc_BooleanOR_ReturnValue) == 0x00002F, "Member 'BP_PostProcessManager_C_Update::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_PostProcessManager_C_Update::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, CallFunc_BooleanOR_ReturnValue_1) == 0x000038, "Member 'BP_PostProcessManager_C_Update::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, CallFunc_BooleanOR_ReturnValue_2) == 0x000039, "Member 'BP_PostProcessManager_C_Update::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, CallFunc_BooleanOR_ReturnValue_3) == 0x00003A, "Member 'BP_PostProcessManager_C_Update::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, Temp_float_Variable) == 0x00003C, "Member 'BP_PostProcessManager_C_Update::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, Temp_float_Variable_1) == 0x000040, "Member 'BP_PostProcessManager_C_Update::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'BP_PostProcessManager_C_Update::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BP_PostProcessManager_C_Update::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'BP_PostProcessManager_C_Update::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, Temp_bool_Variable) == 0x000050, "Member 'BP_PostProcessManager_C_Update::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000054, "Member 'BP_PostProcessManager_C_Update::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'BP_PostProcessManager_C_Update::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000060, "Member 'BP_PostProcessManager_C_Update::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000061, "Member 'BP_PostProcessManager_C_Update::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'BP_PostProcessManager_C_Update::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, CallFunc_Add_FloatFloat_ReturnValue) == 0x000068, "Member 'BP_PostProcessManager_C_Update::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_Update, CallFunc_FClamp_ReturnValue) == 0x00006C, "Member 'BP_PostProcessManager_C_Update::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function BP_PostProcessManager.BP_PostProcessManager_C.EndPostProcess
// 0x0014 (0x0014 - 0x0000)
struct BP_PostProcessManager_C_EndPostProcess final
{
public:
	int32                                         Handle;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeSeconds;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86BC[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PostProcessManager_C_EndPostProcess) == 0x000004, "Wrong alignment on BP_PostProcessManager_C_EndPostProcess");
static_assert(sizeof(BP_PostProcessManager_C_EndPostProcess) == 0x000014, "Wrong size on BP_PostProcessManager_C_EndPostProcess");
static_assert(offsetof(BP_PostProcessManager_C_EndPostProcess, Handle) == 0x000000, "Member 'BP_PostProcessManager_C_EndPostProcess::Handle' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_EndPostProcess, TimeSeconds) == 0x000004, "Member 'BP_PostProcessManager_C_EndPostProcess::TimeSeconds' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_EndPostProcess, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_PostProcessManager_C_EndPostProcess::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_EndPostProcess, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_PostProcessManager_C_EndPostProcess::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_EndPostProcess, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_PostProcessManager_C_EndPostProcess::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_PostProcessManager.BP_PostProcessManager_C.ResetSequencerPostProcess
// 0x0780 (0x0780 - 0x0000)
struct BP_PostProcessManager_C_ResetSequencerPostProcess final
{
public:
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings;             // 0x0000(0x0780)()
};
static_assert(alignof(BP_PostProcessManager_C_ResetSequencerPostProcess) == 0x000010, "Wrong alignment on BP_PostProcessManager_C_ResetSequencerPostProcess");
static_assert(sizeof(BP_PostProcessManager_C_ResetSequencerPostProcess) == 0x000780, "Wrong size on BP_PostProcessManager_C_ResetSequencerPostProcess");
static_assert(offsetof(BP_PostProcessManager_C_ResetSequencerPostProcess, K2Node_MakeStruct_PostProcessSettings) == 0x000000, "Member 'BP_PostProcessManager_C_ResetSequencerPostProcess::K2Node_MakeStruct_PostProcessSettings' has a wrong offset!");

// Function BP_PostProcessManager.BP_PostProcessManager_C.SetSequencerPostProcessSetting
// 0x0790 (0x0790 - 0x0000)
struct BP_PostProcessManager_C_SetSequencerPostProcessSetting final
{
public:
	struct FPostProcessSettings                   Settings;                                          // 0x0000(0x0780)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         BlendWeight;                                       // 0x0780(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PostProcessManager_C_SetSequencerPostProcessSetting) == 0x000010, "Wrong alignment on BP_PostProcessManager_C_SetSequencerPostProcessSetting");
static_assert(sizeof(BP_PostProcessManager_C_SetSequencerPostProcessSetting) == 0x000790, "Wrong size on BP_PostProcessManager_C_SetSequencerPostProcessSetting");
static_assert(offsetof(BP_PostProcessManager_C_SetSequencerPostProcessSetting, Settings) == 0x000000, "Member 'BP_PostProcessManager_C_SetSequencerPostProcessSetting::Settings' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_SetSequencerPostProcessSetting, BlendWeight) == 0x000780, "Member 'BP_PostProcessManager_C_SetSequencerPostProcessSetting::BlendWeight' has a wrong offset!");

// Function BP_PostProcessManager.BP_PostProcessManager_C.GetPerformPostProcess
// 0x0008 (0x0008 - 0x0000)
struct BP_PostProcessManager_C_GetPerformPostProcess final
{
public:
	class UPostProcessComponent*                  PostProcess;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PostProcessManager_C_GetPerformPostProcess) == 0x000008, "Wrong alignment on BP_PostProcessManager_C_GetPerformPostProcess");
static_assert(sizeof(BP_PostProcessManager_C_GetPerformPostProcess) == 0x000008, "Wrong size on BP_PostProcessManager_C_GetPerformPostProcess");
static_assert(offsetof(BP_PostProcessManager_C_GetPerformPostProcess, PostProcess) == 0x000000, "Member 'BP_PostProcessManager_C_GetPerformPostProcess::PostProcess' has a wrong offset!");

// Function BP_PostProcessManager.BP_PostProcessManager_C.SetupDamagePostProcess
// 0x0018 (0x0018 - 0x0000)
struct BP_PostProcessManager_C_SetupDamagePostProcess final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PostProcessManager_C_SetupDamagePostProcess) == 0x000008, "Wrong alignment on BP_PostProcessManager_C_SetupDamagePostProcess");
static_assert(sizeof(BP_PostProcessManager_C_SetupDamagePostProcess) == 0x000018, "Wrong size on BP_PostProcessManager_C_SetupDamagePostProcess");
static_assert(offsetof(BP_PostProcessManager_C_SetupDamagePostProcess, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_PostProcessManager_C_SetupDamagePostProcess::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_SetupDamagePostProcess, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000008, "Member 'BP_PostProcessManager_C_SetupDamagePostProcess::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");

// Function BP_PostProcessManager.BP_PostProcessManager_C.SetDamagePostProcessPower
// 0x0028 (0x0028 - 0x0000)
struct BP_PostProcessManager_C_SetDamagePostProcessPower final
{
public:
	float                                         Power;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveDamagePostProcess_Active;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86BD[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86BE[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PostProcessManager_C_SetDamagePostProcessPower) == 0x000008, "Wrong alignment on BP_PostProcessManager_C_SetDamagePostProcessPower");
static_assert(sizeof(BP_PostProcessManager_C_SetDamagePostProcessPower) == 0x000028, "Wrong size on BP_PostProcessManager_C_SetDamagePostProcessPower");
static_assert(offsetof(BP_PostProcessManager_C_SetDamagePostProcessPower, Power) == 0x000000, "Member 'BP_PostProcessManager_C_SetDamagePostProcessPower::Power' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_SetDamagePostProcessPower, CallFunc_IsActiveDamagePostProcess_Active) == 0x000004, "Member 'BP_PostProcessManager_C_SetDamagePostProcessPower::CallFunc_IsActiveDamagePostProcess_Active' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_SetDamagePostProcessPower, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000008, "Member 'BP_PostProcessManager_C_SetDamagePostProcessPower::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_SetDamagePostProcessPower, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000010, "Member 'BP_PostProcessManager_C_SetDamagePostProcessPower::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_SetDamagePostProcessPower, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_PostProcessManager_C_SetDamagePostProcessPower::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PostProcessManager.BP_PostProcessManager_C.SetDamagePostProcessPowerFlash
// 0x0028 (0x0028 - 0x0000)
struct BP_PostProcessManager_C_SetDamagePostProcessPowerFlash final
{
public:
	float                                         Power;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveDamagePostProcess_Active;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86BF[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86C0[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PostProcessManager_C_SetDamagePostProcessPowerFlash) == 0x000008, "Wrong alignment on BP_PostProcessManager_C_SetDamagePostProcessPowerFlash");
static_assert(sizeof(BP_PostProcessManager_C_SetDamagePostProcessPowerFlash) == 0x000028, "Wrong size on BP_PostProcessManager_C_SetDamagePostProcessPowerFlash");
static_assert(offsetof(BP_PostProcessManager_C_SetDamagePostProcessPowerFlash, Power) == 0x000000, "Member 'BP_PostProcessManager_C_SetDamagePostProcessPowerFlash::Power' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_SetDamagePostProcessPowerFlash, CallFunc_IsActiveDamagePostProcess_Active) == 0x000004, "Member 'BP_PostProcessManager_C_SetDamagePostProcessPowerFlash::CallFunc_IsActiveDamagePostProcess_Active' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_SetDamagePostProcessPowerFlash, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000008, "Member 'BP_PostProcessManager_C_SetDamagePostProcessPowerFlash::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_SetDamagePostProcessPowerFlash, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000010, "Member 'BP_PostProcessManager_C_SetDamagePostProcessPowerFlash::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_SetDamagePostProcessPowerFlash, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_PostProcessManager_C_SetDamagePostProcessPowerFlash::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PostProcessManager.BP_PostProcessManager_C.SetupAcceleratorPP
// 0x0018 (0x0018 - 0x0000)
struct BP_PostProcessManager_C_SetupAcceleratorPP final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PostProcessManager_C_SetupAcceleratorPP) == 0x000008, "Wrong alignment on BP_PostProcessManager_C_SetupAcceleratorPP");
static_assert(sizeof(BP_PostProcessManager_C_SetupAcceleratorPP) == 0x000018, "Wrong size on BP_PostProcessManager_C_SetupAcceleratorPP");
static_assert(offsetof(BP_PostProcessManager_C_SetupAcceleratorPP, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_PostProcessManager_C_SetupAcceleratorPP::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_SetupAcceleratorPP, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000008, "Member 'BP_PostProcessManager_C_SetupAcceleratorPP::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");

// Function BP_PostProcessManager.BP_PostProcessManager_C.IsActiveDamagePostProcess
// 0x0005 (0x0005 - 0x0000)
struct BP_PostProcessManager_C_IsActiveDamagePostProcess final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PostProcessManager_C_IsActiveDamagePostProcess) == 0x000001, "Wrong alignment on BP_PostProcessManager_C_IsActiveDamagePostProcess");
static_assert(sizeof(BP_PostProcessManager_C_IsActiveDamagePostProcess) == 0x000005, "Wrong size on BP_PostProcessManager_C_IsActiveDamagePostProcess");
static_assert(offsetof(BP_PostProcessManager_C_IsActiveDamagePostProcess, Active) == 0x000000, "Member 'BP_PostProcessManager_C_IsActiveDamagePostProcess::Active' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_IsActiveDamagePostProcess, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000001, "Member 'BP_PostProcessManager_C_IsActiveDamagePostProcess::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_IsActiveDamagePostProcess, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000002, "Member 'BP_PostProcessManager_C_IsActiveDamagePostProcess::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_IsActiveDamagePostProcess, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'BP_PostProcessManager_C_IsActiveDamagePostProcess::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_IsActiveDamagePostProcess, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_PostProcessManager_C_IsActiveDamagePostProcess::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PostProcessManager.BP_PostProcessManager_C.EnableDamagePostProcess
// 0x0018 (0x0018 - 0x0000)
struct BP_PostProcessManager_C_EnableDamagePostProcess final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86C1[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PostProcessManager_C_EnableDamagePostProcess) == 0x000008, "Wrong alignment on BP_PostProcessManager_C_EnableDamagePostProcess");
static_assert(sizeof(BP_PostProcessManager_C_EnableDamagePostProcess) == 0x000018, "Wrong size on BP_PostProcessManager_C_EnableDamagePostProcess");
static_assert(offsetof(BP_PostProcessManager_C_EnableDamagePostProcess, Enable) == 0x000000, "Member 'BP_PostProcessManager_C_EnableDamagePostProcess::Enable' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_EnableDamagePostProcess, CallFunc_SelectFloat_ReturnValue) == 0x000004, "Member 'BP_PostProcessManager_C_EnableDamagePostProcess::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcessManager_C_EnableDamagePostProcess, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000008, "Member 'BP_PostProcessManager_C_EnableDamagePostProcess::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");

// Function BP_PostProcessManager.BP_PostProcessManager_C.LoadAsset
// 0x0200 (0x0200 - 0x0000)
struct BP_PostProcessManager_C_LoadAsset final
{
public:
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue_1;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86C2[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface_1;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86C3[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue_2;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue_3;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface_2;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86C4[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface_3;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86C5[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue_4;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue_5;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface_4;         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86C6[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface_5;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86C7[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue_6;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue_7;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface_6;         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86C8[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface_7;         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86C9[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
