#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerUpperActionStatePsychicAttack

#include "Basic.hpp"

#include "EPlayerAnimMontage_structs.hpp"
#include "Engine_structs.hpp"
#include "EPlayerPsychicActionParam_structs.hpp"
#include "BP_PlayerUpperActionStateBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerUpperActionStatePsychicAttack.BP_PlayerUpperActionStatePsychicAttack_C
// 0x0020 (0x0100 - 0x00E0)
class UBP_PlayerUpperActionStatePsychicAttack_C final : public UBP_PlayerUpperActionStateBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_PlayerUpperActionStatePsychicAttack_C; // 0x00E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	EPlayerPsychicActionParam                     ActionParam;                                       // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D2[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CurrentMontage;                                    // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ClaimantName;                                      // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PlayerUpperActionStatePsychicAttack(int32 EntryPoint);
	void UnbindDispatch();
	void BindDispatch();
	int32 Enter(int32 Param);
	int32 Update();
	int32 Exit(int32 NextStateIndex);
	void SetProcessAttack();
	void SetProcessEnd();
	void OnMontageBlendingOut(class UAnimMontage* Montage, bool bInterrupted);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerUpperActionStatePsychicAttack_C">();
	}
	static class UBP_PlayerUpperActionStatePsychicAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PlayerUpperActionStatePsychicAttack_C>();
	}
};
static_assert(alignof(UBP_PlayerUpperActionStatePsychicAttack_C) == 0x000008, "Wrong alignment on UBP_PlayerUpperActionStatePsychicAttack_C");
static_assert(sizeof(UBP_PlayerUpperActionStatePsychicAttack_C) == 0x000100, "Wrong size on UBP_PlayerUpperActionStatePsychicAttack_C");
static_assert(offsetof(UBP_PlayerUpperActionStatePsychicAttack_C, UberGraphFrame_BP_PlayerUpperActionStatePsychicAttack_C) == 0x0000E0, "Member 'UBP_PlayerUpperActionStatePsychicAttack_C::UberGraphFrame_BP_PlayerUpperActionStatePsychicAttack_C' has a wrong offset!");
static_assert(offsetof(UBP_PlayerUpperActionStatePsychicAttack_C, ActionParam) == 0x0000E8, "Member 'UBP_PlayerUpperActionStatePsychicAttack_C::ActionParam' has a wrong offset!");
static_assert(offsetof(UBP_PlayerUpperActionStatePsychicAttack_C, CurrentMontage) == 0x0000F0, "Member 'UBP_PlayerUpperActionStatePsychicAttack_C::CurrentMontage' has a wrong offset!");
static_assert(offsetof(UBP_PlayerUpperActionStatePsychicAttack_C, ClaimantName) == 0x0000F8, "Member 'UBP_PlayerUpperActionStatePsychicAttack_C::ClaimantName' has a wrong offset!");

}

