#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PhotoModePlayerFacialManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PhotoModePlayerFacialManager.BP_PhotoModePlayerFacialManager_C
// 0x0020 (0x0250 - 0x0230)
class ABP_PhotoModePlayerFacialManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 ManageMesh;                                        // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bReserveMeshRefresh;                               // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bEndPhotoMode;                                     // 0x0249(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_PhotoModePlayerFacialManager(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReserveMeshRefresh();
	void EndPhotoMode();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PhotoModePlayerFacialManager_C">();
	}
	static class ABP_PhotoModePlayerFacialManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PhotoModePlayerFacialManager_C>();
	}
};
static_assert(alignof(ABP_PhotoModePlayerFacialManager_C) == 0x000008, "Wrong alignment on ABP_PhotoModePlayerFacialManager_C");
static_assert(sizeof(ABP_PhotoModePlayerFacialManager_C) == 0x000250, "Wrong size on ABP_PhotoModePlayerFacialManager_C");
static_assert(offsetof(ABP_PhotoModePlayerFacialManager_C, UberGraphFrame) == 0x000230, "Member 'ABP_PhotoModePlayerFacialManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PhotoModePlayerFacialManager_C, DefaultSceneRoot) == 0x000238, "Member 'ABP_PhotoModePlayerFacialManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_PhotoModePlayerFacialManager_C, ManageMesh) == 0x000240, "Member 'ABP_PhotoModePlayerFacialManager_C::ManageMesh' has a wrong offset!");
static_assert(offsetof(ABP_PhotoModePlayerFacialManager_C, bReserveMeshRefresh) == 0x000248, "Member 'ABP_PhotoModePlayerFacialManager_C::bReserveMeshRefresh' has a wrong offset!");
static_assert(offsetof(ABP_PhotoModePlayerFacialManager_C, bEndPhotoMode) == 0x000249, "Member 'ABP_PhotoModePlayerFacialManager_C::bEndPhotoMode' has a wrong offset!");

}

