#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerActionStateAfterEvent

#include "Basic.hpp"

#include "EParamAfterEventAction_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerActionStateAfterEvent.BP_PlayerActionStateAfterEvent_C.Enter
// 0x0048 (0x0048 - 0x0000)
struct BP_PlayerActionStateAfterEvent_C_Enter final
{
public:
	int32                                         Param_Param;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Enter_ReturnValue;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInvalidDamage_Dummy;                   // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8460[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8461[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayAnimMontage_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EParamAfterEventAction                        Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8462[0x5];                                     // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetAnimMontageFromSet_Montage;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateAfterEvent_C_Enter) == 0x000008, "Wrong alignment on BP_PlayerActionStateAfterEvent_C_Enter");
static_assert(sizeof(BP_PlayerActionStateAfterEvent_C_Enter) == 0x000048, "Wrong size on BP_PlayerActionStateAfterEvent_C_Enter");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Enter, Param_Param) == 0x000000, "Member 'BP_PlayerActionStateAfterEvent_C_Enter::Param_Param' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Enter, ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateAfterEvent_C_Enter::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Enter, Temp_object_Variable) == 0x000008, "Member 'BP_PlayerActionStateAfterEvent_C_Enter::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Enter, CallFunc_Enter_ReturnValue) == 0x000010, "Member 'BP_PlayerActionStateAfterEvent_C_Enter::CallFunc_Enter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Enter, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_PlayerActionStateAfterEvent_C_Enter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Enter, CallFunc_SetInvalidDamage_Dummy) == 0x000015, "Member 'BP_PlayerActionStateAfterEvent_C_Enter::CallFunc_SetInvalidDamage_Dummy' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Enter, CallFunc_IsValid_ReturnValue_1) == 0x000016, "Member 'BP_PlayerActionStateAfterEvent_C_Enter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Enter, Temp_object_Variable_1) == 0x000018, "Member 'BP_PlayerActionStateAfterEvent_C_Enter::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Enter, CallFunc_IsValid_ReturnValue_2) == 0x000020, "Member 'BP_PlayerActionStateAfterEvent_C_Enter::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Enter, CallFunc_PlayAnimMontage_ReturnValue) == 0x000024, "Member 'BP_PlayerActionStateAfterEvent_C_Enter::CallFunc_PlayAnimMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Enter, Temp_byte_Variable) == 0x000028, "Member 'BP_PlayerActionStateAfterEvent_C_Enter::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Enter, CallFunc_Conv_IntToByte_ReturnValue) == 0x000029, "Member 'BP_PlayerActionStateAfterEvent_C_Enter::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Enter, CallFunc_GetValidValue_ReturnValue) == 0x00002A, "Member 'BP_PlayerActionStateAfterEvent_C_Enter::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Enter, CallFunc_GetAnimMontageFromSet_Montage) == 0x000030, "Member 'BP_PlayerActionStateAfterEvent_C_Enter::CallFunc_GetAnimMontageFromSet_Montage' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Enter, K2Node_Select_Default) == 0x000038, "Member 'BP_PlayerActionStateAfterEvent_C_Enter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Enter, K2Node_SwitchEnum_CmpSuccess) == 0x000040, "Member 'BP_PlayerActionStateAfterEvent_C_Enter::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_PlayerActionStateAfterEvent.BP_PlayerActionStateAfterEvent_C.Exit
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerActionStateAfterEvent_C_Exit final
{
public:
	int32                                         NextStateIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Exit_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetInvalidDamage_Dummy;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateAfterEvent_C_Exit) == 0x000004, "Wrong alignment on BP_PlayerActionStateAfterEvent_C_Exit");
static_assert(sizeof(BP_PlayerActionStateAfterEvent_C_Exit) == 0x000010, "Wrong size on BP_PlayerActionStateAfterEvent_C_Exit");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Exit, NextStateIndex) == 0x000000, "Member 'BP_PlayerActionStateAfterEvent_C_Exit::NextStateIndex' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Exit, ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateAfterEvent_C_Exit::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Exit, CallFunc_Exit_ReturnValue) == 0x000008, "Member 'BP_PlayerActionStateAfterEvent_C_Exit::CallFunc_Exit_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Exit, CallFunc_SetInvalidDamage_Dummy) == 0x00000C, "Member 'BP_PlayerActionStateAfterEvent_C_Exit::CallFunc_SetInvalidDamage_Dummy' has a wrong offset!");

// Function BP_PlayerActionStateAfterEvent.BP_PlayerActionStateAfterEvent_C.Update
// 0x0030 (0x0030 - 0x0000)
struct BP_PlayerActionStateAfterEvent_C_Update final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Update_ReturnValue;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface;         // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdatePlayerActionAfterEvent_Return;      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8463[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimMontageStoped_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerActionStateAfterEvent_C_Update) == 0x000008, "Wrong alignment on BP_PlayerActionStateAfterEvent_C_Update");
static_assert(sizeof(BP_PlayerActionStateAfterEvent_C_Update) == 0x000030, "Wrong size on BP_PlayerActionStateAfterEvent_C_Update");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Update, ReturnValue) == 0x000000, "Member 'BP_PlayerActionStateAfterEvent_C_Update::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Update, CallFunc_Update_ReturnValue) == 0x000004, "Member 'BP_PlayerActionStateAfterEvent_C_Update::CallFunc_Update_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Update, K2Node_DynamicCast_AsBPI_Player_Interface) == 0x000008, "Member 'BP_PlayerActionStateAfterEvent_C_Update::K2Node_DynamicCast_AsBPI_Player_Interface' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Update, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_PlayerActionStateAfterEvent_C_Update::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Update, CallFunc_UpdatePlayerActionAfterEvent_Return) == 0x000019, "Member 'BP_PlayerActionStateAfterEvent_C_Update::CallFunc_UpdatePlayerActionAfterEvent_Return' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Update, CallFunc_GetAnimInstance_ReturnValue) == 0x000020, "Member 'BP_PlayerActionStateAfterEvent_C_Update::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Update, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_PlayerActionStateAfterEvent_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerActionStateAfterEvent_C_Update, CallFunc_IsAnimMontageStoped_ReturnValue) == 0x000029, "Member 'BP_PlayerActionStateAfterEvent_C_Update::CallFunc_IsAnimMontageStoped_ReturnValue' has a wrong offset!");

}

