#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RenderTargetManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "Engine_structs.hpp"
#include "ERenderTargetType_structs.hpp"


namespace SDK::Params
{

// Function BP_RenderTargetManager.BP_RenderTargetManager_C.ED_ResetRenderTarget__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_RenderTargetManager_C_ED_ResetRenderTarget__DelegateSignature final
{
public:
	ERenderTargetType                             RenderTargetType;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B02[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 NewTarget;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RenderTargetManager_C_ED_ResetRenderTarget__DelegateSignature) == 0x000008, "Wrong alignment on BP_RenderTargetManager_C_ED_ResetRenderTarget__DelegateSignature");
static_assert(sizeof(BP_RenderTargetManager_C_ED_ResetRenderTarget__DelegateSignature) == 0x000010, "Wrong size on BP_RenderTargetManager_C_ED_ResetRenderTarget__DelegateSignature");
static_assert(offsetof(BP_RenderTargetManager_C_ED_ResetRenderTarget__DelegateSignature, RenderTargetType) == 0x000000, "Member 'BP_RenderTargetManager_C_ED_ResetRenderTarget__DelegateSignature::RenderTargetType' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_ED_ResetRenderTarget__DelegateSignature, NewTarget) == 0x000008, "Member 'BP_RenderTargetManager_C_ED_ResetRenderTarget__DelegateSignature::NewTarget' has a wrong offset!");

// Function BP_RenderTargetManager.BP_RenderTargetManager_C.ExecuteUbergraph_BP_RenderTargetManager
// 0x0004 (0x0004 - 0x0000)
struct BP_RenderTargetManager_C_ExecuteUbergraph_BP_RenderTargetManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RenderTargetManager_C_ExecuteUbergraph_BP_RenderTargetManager) == 0x000004, "Wrong alignment on BP_RenderTargetManager_C_ExecuteUbergraph_BP_RenderTargetManager");
static_assert(sizeof(BP_RenderTargetManager_C_ExecuteUbergraph_BP_RenderTargetManager) == 0x000004, "Wrong size on BP_RenderTargetManager_C_ExecuteUbergraph_BP_RenderTargetManager");
static_assert(offsetof(BP_RenderTargetManager_C_ExecuteUbergraph_BP_RenderTargetManager, EntryPoint) == 0x000000, "Member 'BP_RenderTargetManager_C_ExecuteUbergraph_BP_RenderTargetManager::EntryPoint' has a wrong offset!");

// Function BP_RenderTargetManager.BP_RenderTargetManager_C.GetCutSceneFaceRenderTarget
// 0x0078 (0x0078 - 0x0000)
struct BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget final
{
public:
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERenderTargetType                             UsedRenderTargetType;                              // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERenderTargetType                             LocalRenderTargetType;                             // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B03[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B04[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B05[0x1];                                     // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetERenderTargetTypeBitMask_Bitmask;      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnRenderTargetTypeFlag_ReturnValue;     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B06[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_GetRenderTarget_RenderTarget;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0048(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget) == 0x000008, "Wrong alignment on BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget");
static_assert(sizeof(BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget) == 0x000078, "Wrong size on BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget");
static_assert(offsetof(BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget, RenderTarget) == 0x000000, "Member 'BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget::RenderTarget' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget, UsedRenderTargetType) == 0x000008, "Member 'BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget::UsedRenderTargetType' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget, LocalRenderTargetType) == 0x000009, "Member 'BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget::LocalRenderTargetType' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget, Temp_int_Variable) == 0x00000C, "Member 'BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget, Temp_int_Variable_1) == 0x000010, "Member 'BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget, CallFunc_Conv_IntToByte_ReturnValue) == 0x000014, "Member 'BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget, CallFunc_GetValidValue_ReturnValue) == 0x00001C, "Member 'BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x00001D, "Member 'BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x00001E, "Member 'BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget, CallFunc_GetERenderTargetTypeBitMask_Bitmask) == 0x000020, "Member 'BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget::CallFunc_GetERenderTargetTypeBitMask_Bitmask' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000024, "Member 'BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget, CallFunc_IsOnRenderTargetTypeFlag_ReturnValue) == 0x000028, "Member 'BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget::CallFunc_IsOnRenderTargetTypeFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget, K2Node_SwitchEnum_CmpSuccess) == 0x000029, "Member 'BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget, K2Node_MakeArray_Array) == 0x000030, "Member 'BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget, CallFunc_GetRenderTarget_RenderTarget) == 0x000040, "Member 'BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget::CallFunc_GetRenderTarget_RenderTarget' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget, CallFunc_Format_ReturnValue) == 0x000048, "Member 'BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget, CallFunc_Conv_TextToString_ReturnValue) == 0x000060, "Member 'BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget, CallFunc_MakeLiteralInt_ReturnValue) == 0x000070, "Member 'BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'BP_RenderTargetManager_C_GetCutSceneFaceRenderTarget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_RenderTargetManager.BP_RenderTargetManager_C.Initialize
// 0x000C (0x000C - 0x0000)
struct BP_RenderTargetManager_C_Initialize final
{
public:
	int32                                         EventStaticCutSizeY;                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EventStaticCutSizeX;                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RenderTargetManager_C_Initialize) == 0x000004, "Wrong alignment on BP_RenderTargetManager_C_Initialize");
static_assert(sizeof(BP_RenderTargetManager_C_Initialize) == 0x00000C, "Wrong size on BP_RenderTargetManager_C_Initialize");
static_assert(offsetof(BP_RenderTargetManager_C_Initialize, EventStaticCutSizeY) == 0x000000, "Member 'BP_RenderTargetManager_C_Initialize::EventStaticCutSizeY' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_Initialize, EventStaticCutSizeX) == 0x000004, "Member 'BP_RenderTargetManager_C_Initialize::EventStaticCutSizeX' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_Initialize, CallFunc_GetPlatformType_ReturnValue) == 0x000008, "Member 'BP_RenderTargetManager_C_Initialize::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_Initialize, K2Node_SwitchEnum_CmpSuccess) == 0x000009, "Member 'BP_RenderTargetManager_C_Initialize::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_RenderTargetManager.BP_RenderTargetManager_C.OnRendetTargetTypeFlag
// 0x0008 (0x0008 - 0x0000)
struct BP_RenderTargetManager_C_OnRendetTargetTypeFlag final
{
public:
	int32                                         BitMask;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Or_IntInt_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RenderTargetManager_C_OnRendetTargetTypeFlag) == 0x000004, "Wrong alignment on BP_RenderTargetManager_C_OnRendetTargetTypeFlag");
static_assert(sizeof(BP_RenderTargetManager_C_OnRendetTargetTypeFlag) == 0x000008, "Wrong size on BP_RenderTargetManager_C_OnRendetTargetTypeFlag");
static_assert(offsetof(BP_RenderTargetManager_C_OnRendetTargetTypeFlag, BitMask) == 0x000000, "Member 'BP_RenderTargetManager_C_OnRendetTargetTypeFlag::BitMask' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_OnRendetTargetTypeFlag, CallFunc_Or_IntInt_ReturnValue) == 0x000004, "Member 'BP_RenderTargetManager_C_OnRendetTargetTypeFlag::CallFunc_Or_IntInt_ReturnValue' has a wrong offset!");

// Function BP_RenderTargetManager.BP_RenderTargetManager_C.OffRenderTargetTypeFlag
// 0x000C (0x000C - 0x0000)
struct BP_RenderTargetManager_C_OffRenderTargetTypeFlag final
{
public:
	int32                                         BitMask;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Not_Int_ReturnValue;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_And_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RenderTargetManager_C_OffRenderTargetTypeFlag) == 0x000004, "Wrong alignment on BP_RenderTargetManager_C_OffRenderTargetTypeFlag");
static_assert(sizeof(BP_RenderTargetManager_C_OffRenderTargetTypeFlag) == 0x00000C, "Wrong size on BP_RenderTargetManager_C_OffRenderTargetTypeFlag");
static_assert(offsetof(BP_RenderTargetManager_C_OffRenderTargetTypeFlag, BitMask) == 0x000000, "Member 'BP_RenderTargetManager_C_OffRenderTargetTypeFlag::BitMask' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_OffRenderTargetTypeFlag, CallFunc_Not_Int_ReturnValue) == 0x000004, "Member 'BP_RenderTargetManager_C_OffRenderTargetTypeFlag::CallFunc_Not_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_OffRenderTargetTypeFlag, CallFunc_And_IntInt_ReturnValue) == 0x000008, "Member 'BP_RenderTargetManager_C_OffRenderTargetTypeFlag::CallFunc_And_IntInt_ReturnValue' has a wrong offset!");

// Function BP_RenderTargetManager.BP_RenderTargetManager_C.IsOnRenderTargetTypeFlag
// 0x0010 (0x0010 - 0x0000)
struct BP_RenderTargetManager_C_IsOnRenderTargetTypeFlag final
{
public:
	int32                                         BitMask;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B07[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_And_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RenderTargetManager_C_IsOnRenderTargetTypeFlag) == 0x000004, "Wrong alignment on BP_RenderTargetManager_C_IsOnRenderTargetTypeFlag");
static_assert(sizeof(BP_RenderTargetManager_C_IsOnRenderTargetTypeFlag) == 0x000010, "Wrong size on BP_RenderTargetManager_C_IsOnRenderTargetTypeFlag");
static_assert(offsetof(BP_RenderTargetManager_C_IsOnRenderTargetTypeFlag, BitMask) == 0x000000, "Member 'BP_RenderTargetManager_C_IsOnRenderTargetTypeFlag::BitMask' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_IsOnRenderTargetTypeFlag, ReturnValue) == 0x000004, "Member 'BP_RenderTargetManager_C_IsOnRenderTargetTypeFlag::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_IsOnRenderTargetTypeFlag, CallFunc_And_IntInt_ReturnValue) == 0x000008, "Member 'BP_RenderTargetManager_C_IsOnRenderTargetTypeFlag::CallFunc_And_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_IsOnRenderTargetTypeFlag, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'BP_RenderTargetManager_C_IsOnRenderTargetTypeFlag::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_RenderTargetManager.BP_RenderTargetManager_C.GetRenderTarget
// 0x0108 (0x0108 - 0x0000)
struct BP_RenderTargetManager_C_GetRenderTarget final
{
public:
	ERenderTargetType                             RenderTargetType;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B08[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 Ret;                                               // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 Temp_object_Variable_1;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 Temp_object_Variable_2;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 Temp_object_Variable_3;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 Temp_object_Variable_4;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B09[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetERenderTargetTypeBitMask_Bitmask;      // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnRenderTargetTypeFlag_ReturnValue;     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B0A[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 Temp_object_Variable_5;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERenderTargetType                             Temp_byte_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B0B[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ByteToText_ReturnValue;              // 0x0060(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0078(0x0040)(HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2DCustom_ReturnValue;   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 K2Node_Select_Default;                             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RenderTargetManager_C_GetRenderTarget) == 0x000008, "Wrong alignment on BP_RenderTargetManager_C_GetRenderTarget");
static_assert(sizeof(BP_RenderTargetManager_C_GetRenderTarget) == 0x000108, "Wrong size on BP_RenderTargetManager_C_GetRenderTarget");
static_assert(offsetof(BP_RenderTargetManager_C_GetRenderTarget, RenderTargetType) == 0x000000, "Member 'BP_RenderTargetManager_C_GetRenderTarget::RenderTargetType' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetRenderTarget, RenderTarget) == 0x000008, "Member 'BP_RenderTargetManager_C_GetRenderTarget::RenderTarget' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetRenderTarget, Ret) == 0x000010, "Member 'BP_RenderTargetManager_C_GetRenderTarget::Ret' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetRenderTarget, Temp_object_Variable) == 0x000018, "Member 'BP_RenderTargetManager_C_GetRenderTarget::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetRenderTarget, Temp_object_Variable_1) == 0x000020, "Member 'BP_RenderTargetManager_C_GetRenderTarget::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetRenderTarget, Temp_object_Variable_2) == 0x000028, "Member 'BP_RenderTargetManager_C_GetRenderTarget::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetRenderTarget, Temp_object_Variable_3) == 0x000030, "Member 'BP_RenderTargetManager_C_GetRenderTarget::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetRenderTarget, Temp_object_Variable_4) == 0x000038, "Member 'BP_RenderTargetManager_C_GetRenderTarget::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetRenderTarget, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_RenderTargetManager_C_GetRenderTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetRenderTarget, CallFunc_GetERenderTargetTypeBitMask_Bitmask) == 0x000044, "Member 'BP_RenderTargetManager_C_GetRenderTarget::CallFunc_GetERenderTargetTypeBitMask_Bitmask' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetRenderTarget, CallFunc_IsOnRenderTargetTypeFlag_ReturnValue) == 0x000048, "Member 'BP_RenderTargetManager_C_GetRenderTarget::CallFunc_IsOnRenderTargetTypeFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetRenderTarget, Temp_object_Variable_5) == 0x000050, "Member 'BP_RenderTargetManager_C_GetRenderTarget::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetRenderTarget, Temp_byte_Variable) == 0x000058, "Member 'BP_RenderTargetManager_C_GetRenderTarget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetRenderTarget, CallFunc_Conv_ByteToText_ReturnValue) == 0x000060, "Member 'BP_RenderTargetManager_C_GetRenderTarget::CallFunc_Conv_ByteToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetRenderTarget, K2Node_MakeStruct_FormatArgumentData) == 0x000078, "Member 'BP_RenderTargetManager_C_GetRenderTarget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetRenderTarget, CallFunc_CreateRenderTarget2DCustom_ReturnValue) == 0x0000B8, "Member 'BP_RenderTargetManager_C_GetRenderTarget::CallFunc_CreateRenderTarget2DCustom_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetRenderTarget, K2Node_MakeArray_Array) == 0x0000C0, "Member 'BP_RenderTargetManager_C_GetRenderTarget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetRenderTarget, CallFunc_Format_ReturnValue) == 0x0000D0, "Member 'BP_RenderTargetManager_C_GetRenderTarget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetRenderTarget, CallFunc_Conv_TextToString_ReturnValue) == 0x0000E8, "Member 'BP_RenderTargetManager_C_GetRenderTarget::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetRenderTarget, K2Node_Select_Default) == 0x0000F8, "Member 'BP_RenderTargetManager_C_GetRenderTarget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetRenderTarget, CallFunc_IsValid_ReturnValue_1) == 0x000100, "Member 'BP_RenderTargetManager_C_GetRenderTarget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_RenderTargetManager.BP_RenderTargetManager_C.GetERenderTargetTypeBitMask
// 0x0098 (0x0098 - 0x0000)
struct BP_RenderTargetManager_C_GetERenderTargetTypeBitMask final
{
public:
	ERenderTargetType                             ERenderTargetType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B0C[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BitMask;                                           // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERenderTargetType                             Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B0D[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_2;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_3;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_4;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_5;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_6;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_7;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_8;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_9;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_10;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_11;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_12;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_13;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_14;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_15;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_16;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_17;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_18;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_19;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_20;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_21;            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_22;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_23;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_24;            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_25;            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_26;            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask) == 0x000004, "Wrong alignment on BP_RenderTargetManager_C_GetERenderTargetTypeBitMask");
static_assert(sizeof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask) == 0x000098, "Wrong size on BP_RenderTargetManager_C_GetERenderTargetTypeBitMask");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, ERenderTargetType) == 0x000000, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::ERenderTargetType' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, BitMask) == 0x000004, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::BitMask' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, Temp_byte_Variable) == 0x000008, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, Temp_int_Variable) == 0x00000C, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, Temp_int_Variable_1) == 0x000010, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, Temp_int_Variable_2) == 0x000014, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, Temp_int_Variable_3) == 0x000018, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, Temp_int_Variable_4) == 0x00001C, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, Temp_int_Variable_5) == 0x000020, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, Temp_int_Variable_6) == 0x000024, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue) == 0x000028, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_1) == 0x00002C, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_2) == 0x000030, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_3) == 0x000034, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_4) == 0x000038, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_5) == 0x00003C, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_6) == 0x000040, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_7) == 0x000044, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_8) == 0x000048, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_9) == 0x00004C, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_10) == 0x000050, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_11) == 0x000054, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_12) == 0x000058, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_13) == 0x00005C, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_14) == 0x000060, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_15) == 0x000064, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_16) == 0x000068, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_17) == 0x00006C, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_18) == 0x000070, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_19) == 0x000074, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_20) == 0x000078, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_21) == 0x00007C, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_22) == 0x000080, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_23) == 0x000084, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_24) == 0x000088, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_25) == 0x00008C, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, CallFunc_MakeLiteralInt_ReturnValue_26) == 0x000090, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::CallFunc_MakeLiteralInt_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetERenderTargetTypeBitMask, K2Node_Select_Default) == 0x000094, "Member 'BP_RenderTargetManager_C_GetERenderTargetTypeBitMask::K2Node_Select_Default' has a wrong offset!");

// Function BP_RenderTargetManager.BP_RenderTargetManager_C.GetSpecialCutSceneRenderTarget
// 0x0078 (0x0078 - 0x0000)
struct BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget final
{
public:
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERenderTargetType                             UsedRenderTargetType;                              // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERenderTargetType                             LocalRenderTargetType;                             // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B0E[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B0F[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B10[0x1];                                     // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetERenderTargetTypeBitMask_Bitmask;      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnRenderTargetTypeFlag_ReturnValue;     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B11[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_GetRenderTarget_RenderTarget;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0048(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget) == 0x000008, "Wrong alignment on BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget");
static_assert(sizeof(BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget) == 0x000078, "Wrong size on BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget");
static_assert(offsetof(BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget, RenderTarget) == 0x000000, "Member 'BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget::RenderTarget' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget, UsedRenderTargetType) == 0x000008, "Member 'BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget::UsedRenderTargetType' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget, LocalRenderTargetType) == 0x000009, "Member 'BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget::LocalRenderTargetType' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget, Temp_int_Variable) == 0x00000C, "Member 'BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget, Temp_int_Variable_1) == 0x000010, "Member 'BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget, CallFunc_Conv_IntToByte_ReturnValue) == 0x000014, "Member 'BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget, CallFunc_GetValidValue_ReturnValue) == 0x00001C, "Member 'BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x00001D, "Member 'BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x00001E, "Member 'BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget, CallFunc_GetERenderTargetTypeBitMask_Bitmask) == 0x000020, "Member 'BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget::CallFunc_GetERenderTargetTypeBitMask_Bitmask' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000024, "Member 'BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget, CallFunc_IsOnRenderTargetTypeFlag_ReturnValue) == 0x000028, "Member 'BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget::CallFunc_IsOnRenderTargetTypeFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget, K2Node_SwitchEnum_CmpSuccess) == 0x000029, "Member 'BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget, K2Node_MakeArray_Array) == 0x000030, "Member 'BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget, CallFunc_GetRenderTarget_RenderTarget) == 0x000040, "Member 'BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget::CallFunc_GetRenderTarget_RenderTarget' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget, CallFunc_Format_ReturnValue) == 0x000048, "Member 'BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget, CallFunc_Conv_TextToString_ReturnValue) == 0x000060, "Member 'BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget, CallFunc_MakeLiteralInt_ReturnValue) == 0x000070, "Member 'BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'BP_RenderTargetManager_C_GetSpecialCutSceneRenderTarget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_RenderTargetManager.BP_RenderTargetManager_C.BeginDebuggingManager
// 0x0004 (0x0004 - 0x0000)
struct BP_RenderTargetManager_C_BeginDebuggingManager final
{
public:
	int32                                         RestoreFlag;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RenderTargetManager_C_BeginDebuggingManager) == 0x000004, "Wrong alignment on BP_RenderTargetManager_C_BeginDebuggingManager");
static_assert(sizeof(BP_RenderTargetManager_C_BeginDebuggingManager) == 0x000004, "Wrong size on BP_RenderTargetManager_C_BeginDebuggingManager");
static_assert(offsetof(BP_RenderTargetManager_C_BeginDebuggingManager, RestoreFlag) == 0x000000, "Member 'BP_RenderTargetManager_C_BeginDebuggingManager::RestoreFlag' has a wrong offset!");

// Function BP_RenderTargetManager.BP_RenderTargetManager_C.ClearEventRenderTargetFlag
// 0x002C (0x002C - 0x0000)
struct BP_RenderTargetManager_C_ClearEventRenderTargetFlag final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B12[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B13[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetERenderTargetTypeBitMask_Bitmask;      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B14[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B15[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RenderTargetManager_C_ClearEventRenderTargetFlag) == 0x000004, "Wrong alignment on BP_RenderTargetManager_C_ClearEventRenderTargetFlag");
