#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RSCharacterCommonDataComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RSCharacterCommonDataComponent.BP_RSCharacterCommonDataComponent_C
// 0x0028 (0x00E8 - 0x00C0)
class UBP_RSCharacterCommonDataComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         FlameDamageInterval_Player;                        // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FlameDamageInterval_Enemy;                         // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsOwnerPlayer;                                    // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsBoss;                                           // 0x00D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_418F[0x2];                                     // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   FlameSkillParameterName;                           // 0x00D4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CableSkillParameterName;                           // 0x00DC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CableDamageInterval_Player;                        // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_RSCharacterCommonDataComponent(int32 EntryPoint);
	void ReceiveBeginPlay();
	void GetFlameDamageSkill(struct FHCSkillCommonInfo* Skill);
	void GetCableDamageSkill(struct FHCSkillCommonInfo* Skill);

	void GetFlameDamageInterval(float* Interval) const;
	void GetCableDamageInterval(float* Interval) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RSCharacterCommonDataComponent_C">();
	}
	static class UBP_RSCharacterCommonDataComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_RSCharacterCommonDataComponent_C>();
	}
};
static_assert(alignof(UBP_RSCharacterCommonDataComponent_C) == 0x000008, "Wrong alignment on UBP_RSCharacterCommonDataComponent_C");
static_assert(sizeof(UBP_RSCharacterCommonDataComponent_C) == 0x0000E8, "Wrong size on UBP_RSCharacterCommonDataComponent_C");
static_assert(offsetof(UBP_RSCharacterCommonDataComponent_C, UberGraphFrame) == 0x0000C0, "Member 'UBP_RSCharacterCommonDataComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_RSCharacterCommonDataComponent_C, FlameDamageInterval_Player) == 0x0000C8, "Member 'UBP_RSCharacterCommonDataComponent_C::FlameDamageInterval_Player' has a wrong offset!");
static_assert(offsetof(UBP_RSCharacterCommonDataComponent_C, FlameDamageInterval_Enemy) == 0x0000CC, "Member 'UBP_RSCharacterCommonDataComponent_C::FlameDamageInterval_Enemy' has a wrong offset!");
static_assert(offsetof(UBP_RSCharacterCommonDataComponent_C, bIsOwnerPlayer) == 0x0000D0, "Member 'UBP_RSCharacterCommonDataComponent_C::bIsOwnerPlayer' has a wrong offset!");
static_assert(offsetof(UBP_RSCharacterCommonDataComponent_C, bIsBoss) == 0x0000D1, "Member 'UBP_RSCharacterCommonDataComponent_C::bIsBoss' has a wrong offset!");
static_assert(offsetof(UBP_RSCharacterCommonDataComponent_C, FlameSkillParameterName) == 0x0000D4, "Member 'UBP_RSCharacterCommonDataComponent_C::FlameSkillParameterName' has a wrong offset!");
static_assert(offsetof(UBP_RSCharacterCommonDataComponent_C, CableSkillParameterName) == 0x0000DC, "Member 'UBP_RSCharacterCommonDataComponent_C::CableSkillParameterName' has a wrong offset!");
static_assert(offsetof(UBP_RSCharacterCommonDataComponent_C, CableDamageInterval_Player) == 0x0000E4, "Member 'UBP_RSCharacterCommonDataComponent_C::CableDamageInterval_Player' has a wrong offset!");

}

