#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RSParticleSystemComponent

#include "Basic.hpp"

#include "FSASStealthParam_structs.hpp"
#include "FSASCopyParam_structs.hpp"
#include "AcceleratorParam_structs.hpp"
#include "E_SASKind_structs.hpp"
#include "FSASCommand_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FSASPsychicParam_structs.hpp"
#include "FSASTelepoParam_structs.hpp"
#include "Engine_structs.hpp"
#include "FSASElectricParam_structs.hpp"
#include "FSASMetalParam_structs.hpp"
#include "FSASSeeThroughParam_structs.hpp"
#include "FSASFireParam_structs.hpp"


namespace SDK::Params
{

// Function BP_RSParticleSystemComponent.BP_RSParticleSystemComponent_C.ExecuteUbergraph_BP_RSParticleSystemComponent
// 0x0160 (0x0160 - 0x0000)
struct BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASElectricParam                     K2Node_Event_param;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63F5[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAcceleratorParam                      K2Node_Event_Parameter;                            // 0x0014(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Owner_12;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_6;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHologram;                            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFSASStealthParam                      K2Node_Event_param_11;                             // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63F6[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_11;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_5;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASStealthParam                      K2Node_Event_param_10;                             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63F7[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_10;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASTelepoParam                       K2Node_Event_param_9;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63F8[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_9;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_4;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASTelepoParam                       K2Node_Event_param_8;                              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63F9[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_8;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63FA[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ParticleManager_C*                  CallFunc_GetParticleManager_Particle_Manager;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63FB[0x6];                                     // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ParticleManager_C*                  CallFunc_GetParticleManager_Particle_Manager_1;    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFSASElectricParam                     K2Node_Event_param_7;                              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63FC[0x6];                                     // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_7;                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ParentDeltaSeconds;             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsIgnoreAccelerate_Ignore;                // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsIgnoreAccelerate_Ignore_1;              // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFSASPsychicParam                      K2Node_Event_param_14;                             // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63FD[0x1];                                     // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_16;                             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASSeeThroughParam                   K2Node_Event_param_6;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63FE[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_6;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_3;                         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASSeeThroughParam                   K2Node_Event_param_5;                              // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63FF[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_5;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASMetalParam                        K2Node_Event_param_4;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6400[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_4;                              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_2;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASMetalParam                        K2Node_Event_param_3;                              // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6401[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_3;                              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASFireParam                         K2Node_Event_param_2;                              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6402[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_2;                              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_1;                         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAcceleratorParam                      K2Node_Event_Parameter_1;                          // 0x00FC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Owner_13;                             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHologram_1;                          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAutoDestroy_ReturnValue;                // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFSASFireParam                         K2Node_Event_param_1;                              // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6403[0x5];                                     // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_1;                              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LevelManager_C*                     CallFunc_GetLevelManager_LevelManager;             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASPsychicParam                      K2Node_Event_param_15;                             // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6404[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_17;                             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_8;                         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWaitingLoadOrVisible_IsWaiting;         // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFSASCopyParam                         K2Node_Event_param_12;                             // 0x013E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6405[0x1];                                     // 0x013F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_14;                             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASCopyParam                         K2Node_Event_param_13;                             // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6406[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_15;                             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_7;                         // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent) == 0x000008, "Wrong alignment on BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent");
static_assert(sizeof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent) == 0x000160, "Wrong size on BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, EntryPoint) == 0x000000, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_param) == 0x000004, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_param' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_Owner) == 0x000008, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_Owner' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_RemainTime) == 0x000010, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_RemainTime' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_Parameter) == 0x000014, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_Parameter' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_Owner_12) == 0x000020, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_Owner_12' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_RemainTime_6) == 0x000028, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_RemainTime_6' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_bHologram) == 0x00002C, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_bHologram' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_param_11) == 0x00002D, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_param_11' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_Owner_11) == 0x000030, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_Owner_11' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_RemainTime_5) == 0x000038, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_RemainTime_5' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_param_10) == 0x00003C, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_param_10' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_Owner_10) == 0x000040, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_Owner_10' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_param_9) == 0x000048, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_param_9' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_Owner_9) == 0x000050, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_Owner_9' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_RemainTime_4) == 0x000058, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_RemainTime_4' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_param_8) == 0x00005C, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_param_8' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_Owner_8) == 0x000060, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_Owner_8' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_EndPlayReason) == 0x000068, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, CallFunc_GetParticleManager_Particle_Manager) == 0x000070, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::CallFunc_GetParticleManager_Particle_Manager' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_SwitchEnum_CmpSuccess) == 0x000078, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, CallFunc_IsValid_ReturnValue) == 0x000079, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, CallFunc_GetParticleManager_Particle_Manager_1) == 0x000080, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::CallFunc_GetParticleManager_Particle_Manager_1' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, CallFunc_IsValid_ReturnValue_1) == 0x000088, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_param_7) == 0x000089, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_param_7' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_Owner_7) == 0x000090, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_Owner_7' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_CustomEvent_ParentDeltaSeconds) == 0x000098, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_CustomEvent_ParentDeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, CallFunc_IsIgnoreAccelerate_Ignore) == 0x00009C, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::CallFunc_IsIgnoreAccelerate_Ignore' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, CallFunc_IsIgnoreAccelerate_Ignore_1) == 0x00009D, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::CallFunc_IsIgnoreAccelerate_Ignore_1' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_param_14) == 0x00009E, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_param_14' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_Owner_16) == 0x0000A0, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_Owner_16' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_param_6) == 0x0000A8, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_param_6' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_Owner_6) == 0x0000B0, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_Owner_6' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_RemainTime_3) == 0x0000B8, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_RemainTime_3' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_param_5) == 0x0000BC, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_param_5' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_Owner_5) == 0x0000C0, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_Owner_5' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_param_4) == 0x0000C8, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_param_4' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_Owner_4) == 0x0000D0, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_Owner_4' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_RemainTime_2) == 0x0000D8, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_RemainTime_2' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_param_3) == 0x0000DC, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_param_3' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_Owner_3) == 0x0000E0, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_Owner_3' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_param_2) == 0x0000E8, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_param_2' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_Owner_2) == 0x0000F0, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_Owner_2' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_RemainTime_1) == 0x0000F8, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_RemainTime_1' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_Parameter_1) == 0x0000FC, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_Parameter_1' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_Owner_13) == 0x000108, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_Owner_13' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_bHologram_1) == 0x000110, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_bHologram_1' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, CallFunc_IsAutoDestroy_ReturnValue) == 0x000111, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::CallFunc_IsAutoDestroy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_param_1) == 0x000112, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_param_1' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_Owner_1) == 0x000118, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_Owner_1' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, CallFunc_GetLevelManager_LevelManager) == 0x000120, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::CallFunc_GetLevelManager_LevelManager' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_param_15) == 0x000128, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_param_15' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_Owner_17) == 0x000130, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_Owner_17' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_RemainTime_8) == 0x000138, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_RemainTime_8' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, CallFunc_IsValid_ReturnValue_2) == 0x00013C, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, CallFunc_IsWaitingLoadOrVisible_IsWaiting) == 0x00013D, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::CallFunc_IsWaitingLoadOrVisible_IsWaiting' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_param_12) == 0x00013E, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_param_12' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_Owner_14) == 0x000140, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_Owner_14' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_param_13) == 0x000148, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_param_13' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_Owner_15) == 0x000150, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_Owner_15' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent, K2Node_Event_RemainTime_7) == 0x000158, "Member 'BP_RSParticleSystemComponent_C_ExecuteUbergraph_BP_RSParticleSystemComponent::K2Node_Event_RemainTime_7' has a wrong offset!");

// Function BP_RSParticleSystemComponent.BP_RSParticleSystemComponent_C.OnElectricEnd
// 0x0018 (0x0018 - 0x0000)
struct BP_RSParticleSystemComponent_C_OnElectricEnd final
{
public:
	struct FFSASElectricParam                     Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6407[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RSParticleSystemComponent_C_OnElectricEnd) == 0x000008, "Wrong alignment on BP_RSParticleSystemComponent_C_OnElectricEnd");
static_assert(sizeof(BP_RSParticleSystemComponent_C_OnElectricEnd) == 0x000018, "Wrong size on BP_RSParticleSystemComponent_C_OnElectricEnd");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnElectricEnd, Param) == 0x000000, "Member 'BP_RSParticleSystemComponent_C_OnElectricEnd::Param' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnElectricEnd, Owner) == 0x000008, "Member 'BP_RSParticleSystemComponent_C_OnElectricEnd::Owner' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnElectricEnd, RemainTime) == 0x000010, "Member 'BP_RSParticleSystemComponent_C_OnElectricEnd::RemainTime' has a wrong offset!");

// Function BP_RSParticleSystemComponent.BP_RSParticleSystemComponent_C.OnFireStart
// 0x0010 (0x0010 - 0x0000)
struct BP_RSParticleSystemComponent_C_OnFireStart final
{
public:
	struct FFSASFireParam                         Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6408[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RSParticleSystemComponent_C_OnFireStart) == 0x000008, "Wrong alignment on BP_RSParticleSystemComponent_C_OnFireStart");
static_assert(sizeof(BP_RSParticleSystemComponent_C_OnFireStart) == 0x000010, "Wrong size on BP_RSParticleSystemComponent_C_OnFireStart");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnFireStart, Param) == 0x000000, "Member 'BP_RSParticleSystemComponent_C_OnFireStart::Param' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnFireStart, Owner) == 0x000008, "Member 'BP_RSParticleSystemComponent_C_OnFireStart::Owner' has a wrong offset!");

// Function BP_RSParticleSystemComponent.BP_RSParticleSystemComponent_C.OnFireEnd
// 0x0018 (0x0018 - 0x0000)
struct BP_RSParticleSystemComponent_C_OnFireEnd final
{
public:
	struct FFSASFireParam                         Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6409[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RSParticleSystemComponent_C_OnFireEnd) == 0x000008, "Wrong alignment on BP_RSParticleSystemComponent_C_OnFireEnd");
static_assert(sizeof(BP_RSParticleSystemComponent_C_OnFireEnd) == 0x000018, "Wrong size on BP_RSParticleSystemComponent_C_OnFireEnd");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnFireEnd, Param) == 0x000000, "Member 'BP_RSParticleSystemComponent_C_OnFireEnd::Param' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnFireEnd, Owner) == 0x000008, "Member 'BP_RSParticleSystemComponent_C_OnFireEnd::Owner' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnFireEnd, RemainTime) == 0x000010, "Member 'BP_RSParticleSystemComponent_C_OnFireEnd::RemainTime' has a wrong offset!");

// Function BP_RSParticleSystemComponent.BP_RSParticleSystemComponent_C.OnMetalStart
// 0x0010 (0x0010 - 0x0000)
struct BP_RSParticleSystemComponent_C_OnMetalStart final
{
public:
	struct FFSASMetalParam                        Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_640A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RSParticleSystemComponent_C_OnMetalStart) == 0x000008, "Wrong alignment on BP_RSParticleSystemComponent_C_OnMetalStart");
static_assert(sizeof(BP_RSParticleSystemComponent_C_OnMetalStart) == 0x000010, "Wrong size on BP_RSParticleSystemComponent_C_OnMetalStart");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnMetalStart, Param) == 0x000000, "Member 'BP_RSParticleSystemComponent_C_OnMetalStart::Param' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnMetalStart, Owner) == 0x000008, "Member 'BP_RSParticleSystemComponent_C_OnMetalStart::Owner' has a wrong offset!");

// Function BP_RSParticleSystemComponent.BP_RSParticleSystemComponent_C.OnMetalEnd
// 0x0018 (0x0018 - 0x0000)
struct BP_RSParticleSystemComponent_C_OnMetalEnd final
{
public:
	struct FFSASMetalParam                        Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_640B[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RSParticleSystemComponent_C_OnMetalEnd) == 0x000008, "Wrong alignment on BP_RSParticleSystemComponent_C_OnMetalEnd");
static_assert(sizeof(BP_RSParticleSystemComponent_C_OnMetalEnd) == 0x000018, "Wrong size on BP_RSParticleSystemComponent_C_OnMetalEnd");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnMetalEnd, Param) == 0x000000, "Member 'BP_RSParticleSystemComponent_C_OnMetalEnd::Param' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnMetalEnd, Owner) == 0x000008, "Member 'BP_RSParticleSystemComponent_C_OnMetalEnd::Owner' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnMetalEnd, RemainTime) == 0x000010, "Member 'BP_RSParticleSystemComponent_C_OnMetalEnd::RemainTime' has a wrong offset!");

// Function BP_RSParticleSystemComponent.BP_RSParticleSystemComponent_C.OnSeeThroughStart
// 0x0010 (0x0010 - 0x0000)
struct BP_RSParticleSystemComponent_C_OnSeeThroughStart final
{
public:
	struct FFSASSeeThroughParam                   Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_640C[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RSParticleSystemComponent_C_OnSeeThroughStart) == 0x000008, "Wrong alignment on BP_RSParticleSystemComponent_C_OnSeeThroughStart");
static_assert(sizeof(BP_RSParticleSystemComponent_C_OnSeeThroughStart) == 0x000010, "Wrong size on BP_RSParticleSystemComponent_C_OnSeeThroughStart");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnSeeThroughStart, Param) == 0x000000, "Member 'BP_RSParticleSystemComponent_C_OnSeeThroughStart::Param' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnSeeThroughStart, Owner) == 0x000008, "Member 'BP_RSParticleSystemComponent_C_OnSeeThroughStart::Owner' has a wrong offset!");

// Function BP_RSParticleSystemComponent.BP_RSParticleSystemComponent_C.OnSeeThroughEnd
// 0x0018 (0x0018 - 0x0000)
struct BP_RSParticleSystemComponent_C_OnSeeThroughEnd final
{
public:
	struct FFSASSeeThroughParam                   Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_640D[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RSParticleSystemComponent_C_OnSeeThroughEnd) == 0x000008, "Wrong alignment on BP_RSParticleSystemComponent_C_OnSeeThroughEnd");
static_assert(sizeof(BP_RSParticleSystemComponent_C_OnSeeThroughEnd) == 0x000018, "Wrong size on BP_RSParticleSystemComponent_C_OnSeeThroughEnd");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnSeeThroughEnd, Param) == 0x000000, "Member 'BP_RSParticleSystemComponent_C_OnSeeThroughEnd::Param' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnSeeThroughEnd, Owner) == 0x000008, "Member 'BP_RSParticleSystemComponent_C_OnSeeThroughEnd::Owner' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnSeeThroughEnd, RemainTime) == 0x000010, "Member 'BP_RSParticleSystemComponent_C_OnSeeThroughEnd::RemainTime' has a wrong offset!");

// Function BP_RSParticleSystemComponent.BP_RSParticleSystemComponent_C.UserTick
// 0x0004 (0x0004 - 0x0000)
struct BP_RSParticleSystemComponent_C_UserTick final
{
public:
	float                                         ParentDeltaSeconds;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RSParticleSystemComponent_C_UserTick) == 0x000004, "Wrong alignment on BP_RSParticleSystemComponent_C_UserTick");
static_assert(sizeof(BP_RSParticleSystemComponent_C_UserTick) == 0x000004, "Wrong size on BP_RSParticleSystemComponent_C_UserTick");
static_assert(offsetof(BP_RSParticleSystemComponent_C_UserTick, ParentDeltaSeconds) == 0x000000, "Member 'BP_RSParticleSystemComponent_C_UserTick::ParentDeltaSeconds' has a wrong offset!");

// Function BP_RSParticleSystemComponent.BP_RSParticleSystemComponent_C.OnElectricStart
// 0x0010 (0x0010 - 0x0000)
struct BP_RSParticleSystemComponent_C_OnElectricStart final
{
public:
	struct FFSASElectricParam                     Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_640E[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RSParticleSystemComponent_C_OnElectricStart) == 0x000008, "Wrong alignment on BP_RSParticleSystemComponent_C_OnElectricStart");
static_assert(sizeof(BP_RSParticleSystemComponent_C_OnElectricStart) == 0x000010, "Wrong size on BP_RSParticleSystemComponent_C_OnElectricStart");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnElectricStart, Param) == 0x000000, "Member 'BP_RSParticleSystemComponent_C_OnElectricStart::Param' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnElectricStart, Owner) == 0x000008, "Member 'BP_RSParticleSystemComponent_C_OnElectricStart::Owner' has a wrong offset!");

// Function BP_RSParticleSystemComponent.BP_RSParticleSystemComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_RSParticleSystemComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RSParticleSystemComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_RSParticleSystemComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_RSParticleSystemComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_RSParticleSystemComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_RSParticleSystemComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_RSParticleSystemComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_RSParticleSystemComponent.BP_RSParticleSystemComponent_C.OnTelepoStart
// 0x0010 (0x0010 - 0x0000)
struct BP_RSParticleSystemComponent_C_OnTelepoStart final
{
public:
	struct FFSASTelepoParam                       Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_640F[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RSParticleSystemComponent_C_OnTelepoStart) == 0x000008, "Wrong alignment on BP_RSParticleSystemComponent_C_OnTelepoStart");
static_assert(sizeof(BP_RSParticleSystemComponent_C_OnTelepoStart) == 0x000010, "Wrong size on BP_RSParticleSystemComponent_C_OnTelepoStart");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnTelepoStart, Param) == 0x000000, "Member 'BP_RSParticleSystemComponent_C_OnTelepoStart::Param' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnTelepoStart, Owner) == 0x000008, "Member 'BP_RSParticleSystemComponent_C_OnTelepoStart::Owner' has a wrong offset!");

// Function BP_RSParticleSystemComponent.BP_RSParticleSystemComponent_C.OnTelepoEnd
// 0x0018 (0x0018 - 0x0000)
struct BP_RSParticleSystemComponent_C_OnTelepoEnd final
{
public:
	struct FFSASTelepoParam                       Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6410[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RSParticleSystemComponent_C_OnTelepoEnd) == 0x000008, "Wrong alignment on BP_RSParticleSystemComponent_C_OnTelepoEnd");
static_assert(sizeof(BP_RSParticleSystemComponent_C_OnTelepoEnd) == 0x000018, "Wrong size on BP_RSParticleSystemComponent_C_OnTelepoEnd");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnTelepoEnd, Param) == 0x000000, "Member 'BP_RSParticleSystemComponent_C_OnTelepoEnd::Param' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnTelepoEnd, Owner) == 0x000008, "Member 'BP_RSParticleSystemComponent_C_OnTelepoEnd::Owner' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnTelepoEnd, RemainTime) == 0x000010, "Member 'BP_RSParticleSystemComponent_C_OnTelepoEnd::RemainTime' has a wrong offset!");

// Function BP_RSParticleSystemComponent.BP_RSParticleSystemComponent_C.OnStealthStart
// 0x0010 (0x0010 - 0x0000)
struct BP_RSParticleSystemComponent_C_OnStealthStart final
{
public:
	struct FFSASStealthParam                      Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6411[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RSParticleSystemComponent_C_OnStealthStart) == 0x000008, "Wrong alignment on BP_RSParticleSystemComponent_C_OnStealthStart");
static_assert(sizeof(BP_RSParticleSystemComponent_C_OnStealthStart) == 0x000010, "Wrong size on BP_RSParticleSystemComponent_C_OnStealthStart");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnStealthStart, Param) == 0x000000, "Member 'BP_RSParticleSystemComponent_C_OnStealthStart::Param' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnStealthStart, Owner) == 0x000008, "Member 'BP_RSParticleSystemComponent_C_OnStealthStart::Owner' has a wrong offset!");

// Function BP_RSParticleSystemComponent.BP_RSParticleSystemComponent_C.OnStealthEnd
// 0x0018 (0x0018 - 0x0000)
struct BP_RSParticleSystemComponent_C_OnStealthEnd final
{
public:
	struct FFSASStealthParam                      Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6412[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RSParticleSystemComponent_C_OnStealthEnd) == 0x000008, "Wrong alignment on BP_RSParticleSystemComponent_C_OnStealthEnd");
static_assert(sizeof(BP_RSParticleSystemComponent_C_OnStealthEnd) == 0x000018, "Wrong size on BP_RSParticleSystemComponent_C_OnStealthEnd");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnStealthEnd, Param) == 0x000000, "Member 'BP_RSParticleSystemComponent_C_OnStealthEnd::Param' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnStealthEnd, Owner) == 0x000008, "Member 'BP_RSParticleSystemComponent_C_OnStealthEnd::Owner' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnStealthEnd, RemainTime) == 0x000010, "Member 'BP_RSParticleSystemComponent_C_OnStealthEnd::RemainTime' has a wrong offset!");

// Function BP_RSParticleSystemComponent.BP_RSParticleSystemComponent_C.OnAcceleratorEnd
// 0x0020 (0x0020 - 0x0000)
struct BP_RSParticleSystemComponent_C_OnAcceleratorEnd final
{
public:
	struct FAcceleratorParam                      Parameter;                                         // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6413[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHologram;                                         // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RSParticleSystemComponent_C_OnAcceleratorEnd) == 0x000008, "Wrong alignment on BP_RSParticleSystemComponent_C_OnAcceleratorEnd");
static_assert(sizeof(BP_RSParticleSystemComponent_C_OnAcceleratorEnd) == 0x000020, "Wrong size on BP_RSParticleSystemComponent_C_OnAcceleratorEnd");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnAcceleratorEnd, Parameter) == 0x000000, "Member 'BP_RSParticleSystemComponent_C_OnAcceleratorEnd::Parameter' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnAcceleratorEnd, Owner) == 0x000010, "Member 'BP_RSParticleSystemComponent_C_OnAcceleratorEnd::Owner' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnAcceleratorEnd, RemainTime) == 0x000018, "Member 'BP_RSParticleSystemComponent_C_OnAcceleratorEnd::RemainTime' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnAcceleratorEnd, bHologram) == 0x00001C, "Member 'BP_RSParticleSystemComponent_C_OnAcceleratorEnd::bHologram' has a wrong offset!");

// Function BP_RSParticleSystemComponent.BP_RSParticleSystemComponent_C.OnAcceleratorStart
// 0x0020 (0x0020 - 0x0000)
struct BP_RSParticleSystemComponent_C_OnAcceleratorStart final
{
public:
	struct FAcceleratorParam                      Parameter;                                         // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6414[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHologram;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RSParticleSystemComponent_C_OnAcceleratorStart) == 0x000008, "Wrong alignment on BP_RSParticleSystemComponent_C_OnAcceleratorStart");
static_assert(sizeof(BP_RSParticleSystemComponent_C_OnAcceleratorStart) == 0x000020, "Wrong size on BP_RSParticleSystemComponent_C_OnAcceleratorStart");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnAcceleratorStart, Parameter) == 0x000000, "Member 'BP_RSParticleSystemComponent_C_OnAcceleratorStart::Parameter' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnAcceleratorStart, Owner) == 0x000010, "Member 'BP_RSParticleSystemComponent_C_OnAcceleratorStart::Owner' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnAcceleratorStart, bHologram) == 0x000018, "Member 'BP_RSParticleSystemComponent_C_OnAcceleratorStart::bHologram' has a wrong offset!");

// Function BP_RSParticleSystemComponent.BP_RSParticleSystemComponent_C.OnCopyStart
// 0x0010 (0x0010 - 0x0000)
struct BP_RSParticleSystemComponent_C_OnCopyStart final
{
public:
	struct FFSASCopyParam                         Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6415[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RSParticleSystemComponent_C_OnCopyStart) == 0x000008, "Wrong alignment on BP_RSParticleSystemComponent_C_OnCopyStart");
static_assert(sizeof(BP_RSParticleSystemComponent_C_OnCopyStart) == 0x000010, "Wrong size on BP_RSParticleSystemComponent_C_OnCopyStart");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnCopyStart, Param) == 0x000000, "Member 'BP_RSParticleSystemComponent_C_OnCopyStart::Param' has a wrong offset!");
static_assert(offsetof(BP_RSParticleSystemComponent_C_OnCopyStart, Owner) == 0x000008, "Member 'BP_RSParticleSystemComponent_C_OnCopyStart::Owner' has a wrong offset!");

// Function BP_RSParticleSystemComponent.BP_RSParticleSystemComponent_C.OnCopyEnd
// 0x0018 (0x0018 - 0x0000)
struct BP_RSParticleSystemComponent_C_OnCopyEnd final
{
public:
	struct FFSASCopyParam                         Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6416[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
