#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RedStringMeshSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_RedStringMeshSpawner.BP_RedStringMeshSpawner_C.ExecuteUbergraph_BP_RedStringMeshSpawner
// 0x0260 (0x0260 - 0x0000)
struct BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E12[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E13[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetInstanceCount_ReturnValue;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E14[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetInstanceTransform_OutInstanceTransform; // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetInstanceTransform_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E15[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E16[0xB];                                     // 0x00A5(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateInstanceTransform_ReturnValue;      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E17[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0148(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E18[0x3];                                     // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x01D4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner) == 0x000010, "Wrong alignment on BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner");
static_assert(sizeof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner) == 0x000260, "Wrong size on BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, EntryPoint) == 0x000000, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_GetEventManager_EventManager) == 0x000008, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_GetInstanceCount_ReturnValue) == 0x00001C, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_GetInstanceCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000020, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000024, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_MakeVector_ReturnValue) == 0x000028, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, Temp_int_Variable) == 0x000034, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_GetInstanceTransform_OutInstanceTransform) == 0x000040, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_GetInstanceTransform_OutInstanceTransform' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_GetInstanceTransform_ReturnValue) == 0x000070, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_GetInstanceTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_BreakTransform_Location) == 0x000074, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_BreakTransform_Rotation) == 0x000080, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_BreakTransform_Scale) == 0x00008C, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_Add_VectorVector_ReturnValue) == 0x000098, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000A4, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_MakeTransform_ReturnValue) == 0x0000B0, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_UpdateInstanceTransform_ReturnValue) == 0x0000E0, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_UpdateInstanceTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_Add_IntInt_ReturnValue) == 0x0000E4, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000E8, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_BreakVector_X) == 0x0000F4, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_BreakVector_Y) == 0x0000F8, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_BreakVector_Z) == 0x0000FC, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000100, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00010C, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_BreakVector_X_1) == 0x000118, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_BreakVector_Y_1) == 0x00011C, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_BreakVector_Z_1) == 0x000120, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_BreakVector_X_2) == 0x000124, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_BreakVector_Y_2) == 0x000128, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_BreakVector_Z_2) == 0x00012C, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_MakeVector_ReturnValue_1) == 0x000130, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_MakeVector_ReturnValue_2) == 0x00013C, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000148, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0001D0, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_K2_SetActorLocation_SweepHitResult_1) == 0x0001D4, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_K2_SetActorLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner, CallFunc_K2_SetActorLocation_ReturnValue_1) == 0x00025C, "Member 'BP_RedStringMeshSpawner_C_ExecuteUbergraph_BP_RedStringMeshSpawner::CallFunc_K2_SetActorLocation_ReturnValue_1' has a wrong offset!");

// Function BP_RedStringMeshSpawner.BP_RedStringMeshSpawner_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_RedStringMeshSpawner_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RedStringMeshSpawner_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_RedStringMeshSpawner_C_ReceiveTick");
static_assert(sizeof(BP_RedStringMeshSpawner_C_ReceiveTick) == 0x000004, "Wrong size on BP_RedStringMeshSpawner_C_ReceiveTick");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_RedStringMeshSpawner_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_RedStringMeshSpawner.BP_RedStringMeshSpawner_C.ResetTransformInstanceCheck
// 0x00F0 (0x00F0 - 0x0000)
struct BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck final
{
public:
	int32                                         Cnt;                                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCheck;                                           // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E19[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1A[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1B[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1C[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_RandomTransform_ReturnValue;              // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateInstanceTransform_ReturnValue;      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1D[0xE];                                     // 0x0062(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetInstanceTransform_OutInstanceTransform; // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetInstanceTransform_ReturnValue;         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1E[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetInstanceCount_ReturnValue;             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1F[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck) == 0x000010, "Wrong alignment on BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck");
static_assert(sizeof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck) == 0x0000F0, "Wrong size on BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck, Cnt) == 0x000000, "Member 'BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck::Cnt' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck, IsCheck) == 0x000004, "Member 'BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck::IsCheck' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck, Temp_int_Variable) == 0x000008, "Member 'BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck, CallFunc_GetEventManager_EventManager) == 0x000010, "Member 'BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck, CallFunc_RandomTransform_ReturnValue) == 0x000030, "Member 'BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck::CallFunc_RandomTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck, CallFunc_UpdateInstanceTransform_ReturnValue) == 0x000061, "Member 'BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck::CallFunc_UpdateInstanceTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck, CallFunc_GetInstanceTransform_OutInstanceTransform) == 0x000070, "Member 'BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck::CallFunc_GetInstanceTransform_OutInstanceTransform' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck, CallFunc_GetInstanceTransform_ReturnValue) == 0x0000A0, "Member 'BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck::CallFunc_GetInstanceTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck, CallFunc_GetInstanceCount_ReturnValue) == 0x0000A4, "Member 'BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck::CallFunc_GetInstanceCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck, CallFunc_BreakTransform_Location) == 0x0000A8, "Member 'BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck, CallFunc_BreakTransform_Rotation) == 0x0000B4, "Member 'BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck, CallFunc_BreakTransform_Scale) == 0x0000C0, "Member 'BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000CC, "Member 'BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000D0, "Member 'BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000DC, "Member 'BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck, CallFunc_VSize_ReturnValue) == 0x0000E0, "Member 'BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck, CallFunc_FTrunc_ReturnValue) == 0x0000E4, "Member 'BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck, CallFunc_Greater_IntInt_ReturnValue) == 0x0000E8, "Member 'BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000E9, "Member 'BP_RedStringMeshSpawner_C_ResetTransformInstanceCheck::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_RedStringMeshSpawner.BP_RedStringMeshSpawner_C.RandomAddInstances
// 0x0050 (0x0050 - 0x0000)
struct BP_RedStringMeshSpawner_C_RandomAddInstances final
{
public:
	int32                                         InstanceNum;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E20[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInstancedStaticMeshComponent*          InstancedMesh;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_RandomTransform_ReturnValue;              // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E21[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RedStringMeshSpawner_C_RandomAddInstances) == 0x000010, "Wrong alignment on BP_RedStringMeshSpawner_C_RandomAddInstances");
static_assert(sizeof(BP_RedStringMeshSpawner_C_RandomAddInstances) == 0x000050, "Wrong size on BP_RedStringMeshSpawner_C_RandomAddInstances");
static_assert(offsetof(BP_RedStringMeshSpawner_C_RandomAddInstances, InstanceNum) == 0x000000, "Member 'BP_RedStringMeshSpawner_C_RandomAddInstances::InstanceNum' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_RandomAddInstances, InstancedMesh) == 0x000008, "Member 'BP_RedStringMeshSpawner_C_RandomAddInstances::InstancedMesh' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_RandomAddInstances, CallFunc_RandomTransform_ReturnValue) == 0x000010, "Member 'BP_RedStringMeshSpawner_C_RandomAddInstances::CallFunc_RandomTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_RandomAddInstances, Temp_int_Variable) == 0x000040, "Member 'BP_RedStringMeshSpawner_C_RandomAddInstances::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_RandomAddInstances, CallFunc_AddInstance_ReturnValue) == 0x000044, "Member 'BP_RedStringMeshSpawner_C_RandomAddInstances::CallFunc_AddInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_RandomAddInstances, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000048, "Member 'BP_RedStringMeshSpawner_C_RandomAddInstances::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_RandomAddInstances, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'BP_RedStringMeshSpawner_C_RandomAddInstances::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_RedStringMeshSpawner.BP_RedStringMeshSpawner_C.RandomTransform
// 0x00A0 (0x00A0 - 0x0000)
struct BP_RedStringMeshSpawner_C_RandomTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RandomRotator_ReturnValue;                // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVectorFromStream_ReturnValue;   // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RedStringMeshSpawner_C_RandomTransform) == 0x000010, "Wrong alignment on BP_RedStringMeshSpawner_C_RandomTransform");
static_assert(sizeof(BP_RedStringMeshSpawner_C_RandomTransform) == 0x0000A0, "Wrong size on BP_RedStringMeshSpawner_C_RandomTransform");
static_assert(offsetof(BP_RedStringMeshSpawner_C_RandomTransform, ReturnValue) == 0x000000, "Member 'BP_RedStringMeshSpawner_C_RandomTransform::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_RandomTransform, CallFunc_RandomRotator_ReturnValue) == 0x000030, "Member 'BP_RedStringMeshSpawner_C_RandomTransform::CallFunc_RandomRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_RandomTransform, CallFunc_Conv_FloatToVector_ReturnValue) == 0x00003C, "Member 'BP_RedStringMeshSpawner_C_RandomTransform::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_RandomTransform, CallFunc_RandomUnitVectorFromStream_ReturnValue) == 0x000048, "Member 'BP_RedStringMeshSpawner_C_RandomTransform::CallFunc_RandomUnitVectorFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_RandomTransform, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x000054, "Member 'BP_RedStringMeshSpawner_C_RandomTransform::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_RandomTransform, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000058, "Member 'BP_RedStringMeshSpawner_C_RandomTransform::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_RandomTransform, CallFunc_Add_VectorVector_ReturnValue) == 0x000064, "Member 'BP_RedStringMeshSpawner_C_RandomTransform::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_RandomTransform, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'BP_RedStringMeshSpawner_C_RandomTransform::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

// Function BP_RedStringMeshSpawner.BP_RedStringMeshSpawner_C.ResetTransform
// 0x0050 (0x0050 - 0x0000)
struct BP_RedStringMeshSpawner_C_ResetTransform final
{
public:
	struct FTransform                             CallFunc_RandomTransform_ReturnValue;              // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateInstanceTransform_ReturnValue;      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E22[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RedStringMeshSpawner_C_ResetTransform) == 0x000010, "Wrong alignment on BP_RedStringMeshSpawner_C_ResetTransform");
static_assert(sizeof(BP_RedStringMeshSpawner_C_ResetTransform) == 0x000050, "Wrong size on BP_RedStringMeshSpawner_C_ResetTransform");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransform, CallFunc_RandomTransform_ReturnValue) == 0x000000, "Member 'BP_RedStringMeshSpawner_C_ResetTransform::CallFunc_RandomTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RedStringMeshSpawner_C_ResetTransform, Temp_int_Variable) == 0x000030, "Member 'BP_RedStringMeshSpawner_C_ResetTransform::Temp_int_Variable' has a wrong offset!");
