#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResourceManager

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "FPlayerWeaponLoadData_structs.hpp"
#include "FAttachmentEquipData_structs.hpp"
#include "FPlayerCostumeData_structs.hpp"
#include "S_AssetList_structs.hpp"
#include "FAttachmentData_structs.hpp"


namespace SDK::Params
{

// Function BP_ResourceManager.BP_ResourceManager_C.ExecuteUbergraph_BP_ResourceManager
// 0x0008 (0x0008 - 0x0000)
struct BP_ResourceManager_C_ExecuteUbergraph_BP_ResourceManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourceManager_C_ExecuteUbergraph_BP_ResourceManager) == 0x000004, "Wrong alignment on BP_ResourceManager_C_ExecuteUbergraph_BP_ResourceManager");
static_assert(sizeof(BP_ResourceManager_C_ExecuteUbergraph_BP_ResourceManager) == 0x000008, "Wrong size on BP_ResourceManager_C_ExecuteUbergraph_BP_ResourceManager");
static_assert(offsetof(BP_ResourceManager_C_ExecuteUbergraph_BP_ResourceManager, EntryPoint) == 0x000000, "Member 'BP_ResourceManager_C_ExecuteUbergraph_BP_ResourceManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_ExecuteUbergraph_BP_ResourceManager, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_ResourceManager_C_ExecuteUbergraph_BP_ResourceManager::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_ResourceManager.BP_ResourceManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ResourceManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourceManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ResourceManager_C_ReceiveTick");
static_assert(sizeof(BP_ResourceManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_ResourceManager_C_ReceiveTick");
static_assert(offsetof(BP_ResourceManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ResourceManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ResourceManager.BP_ResourceManager_C.RegisterLoadAsset
// 0x0038 (0x0038 - 0x0000)
struct BP_ResourceManager_C_RegisterLoadAsset final
{
public:
	class FName                                   AssetList;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 AssetSoftRef;                                      // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                AssetRef;                                          // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourceManager_C_RegisterLoadAsset) == 0x000008, "Wrong alignment on BP_ResourceManager_C_RegisterLoadAsset");
static_assert(sizeof(BP_ResourceManager_C_RegisterLoadAsset) == 0x000038, "Wrong size on BP_ResourceManager_C_RegisterLoadAsset");
static_assert(offsetof(BP_ResourceManager_C_RegisterLoadAsset, AssetList) == 0x000000, "Member 'BP_ResourceManager_C_RegisterLoadAsset::AssetList' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_RegisterLoadAsset, AssetSoftRef) == 0x000008, "Member 'BP_ResourceManager_C_RegisterLoadAsset::AssetSoftRef' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_RegisterLoadAsset, AssetRef) == 0x000030, "Member 'BP_ResourceManager_C_RegisterLoadAsset::AssetRef' has a wrong offset!");

// Function BP_ResourceManager.BP_ResourceManager_C.UnregisterLoadAsset
// 0x0040 (0x0040 - 0x0000)
struct BP_ResourceManager_C_UnregisterLoadAsset final
{
public:
	TSoftObjectPtr<class UObject>                 AssetSoftRef;                                      // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6421[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Map_Find_Value;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ResourceManager_C_UnregisterLoadAsset) == 0x000008, "Wrong alignment on BP_ResourceManager_C_UnregisterLoadAsset");
static_assert(sizeof(BP_ResourceManager_C_UnregisterLoadAsset) == 0x000040, "Wrong size on BP_ResourceManager_C_UnregisterLoadAsset");
static_assert(offsetof(BP_ResourceManager_C_UnregisterLoadAsset, AssetSoftRef) == 0x000000, "Member 'BP_ResourceManager_C_UnregisterLoadAsset::AssetSoftRef' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_UnregisterLoadAsset, CallFunc_Map_Remove_ReturnValue) == 0x000028, "Member 'BP_ResourceManager_C_UnregisterLoadAsset::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_UnregisterLoadAsset, CallFunc_Map_Find_Value) == 0x000030, "Member 'BP_ResourceManager_C_UnregisterLoadAsset::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_UnregisterLoadAsset, CallFunc_Map_Find_ReturnValue) == 0x000038, "Member 'BP_ResourceManager_C_UnregisterLoadAsset::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function BP_ResourceManager.BP_ResourceManager_C.RegisterAssetList
// 0x000C (0x000C - 0x0000)
struct BP_ResourceManager_C_RegisterAssetList final
{
public:
	class FName                                   AssetList;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourceManager_C_RegisterAssetList) == 0x000004, "Wrong alignment on BP_ResourceManager_C_RegisterAssetList");
static_assert(sizeof(BP_ResourceManager_C_RegisterAssetList) == 0x00000C, "Wrong size on BP_ResourceManager_C_RegisterAssetList");
static_assert(offsetof(BP_ResourceManager_C_RegisterAssetList, AssetList) == 0x000000, "Member 'BP_ResourceManager_C_RegisterAssetList::AssetList' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_RegisterAssetList, CallFunc_Array_AddUnique_ReturnValue) == 0x000008, "Member 'BP_ResourceManager_C_RegisterAssetList::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function BP_ResourceManager.BP_ResourceManager_C.UnregisterAssetList
// 0x0088 (0x0088 - 0x0000)
struct BP_ResourceManager_C_UnregisterAssetList final
{
public:
	class FName                                   AssetList;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Error;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6422[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UObject>>         AssetsInOtherAssetList;                            // 0x0010(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_AssetList                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6423[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UObject>>         CallFunc_MakeLoadedAssetListAssets_Assets;         // 0x0038(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_Array_Get_Item;                           // 0x0050(0x0028)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6424[0x2];                                     // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ResourceManager_C_UnregisterAssetList) == 0x000008, "Wrong alignment on BP_ResourceManager_C_UnregisterAssetList");
static_assert(sizeof(BP_ResourceManager_C_UnregisterAssetList) == 0x000088, "Wrong size on BP_ResourceManager_C_UnregisterAssetList");
static_assert(offsetof(BP_ResourceManager_C_UnregisterAssetList, AssetList) == 0x000000, "Member 'BP_ResourceManager_C_UnregisterAssetList::AssetList' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_UnregisterAssetList, Error) == 0x000008, "Member 'BP_ResourceManager_C_UnregisterAssetList::Error' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_UnregisterAssetList, AssetsInOtherAssetList) == 0x000010, "Member 'BP_ResourceManager_C_UnregisterAssetList::AssetsInOtherAssetList' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_UnregisterAssetList, CallFunc_GetDataTableRowFromName_OutRow) == 0x000020, "Member 'BP_ResourceManager_C_UnregisterAssetList::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_UnregisterAssetList, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000030, "Member 'BP_ResourceManager_C_UnregisterAssetList::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_UnregisterAssetList, CallFunc_MakeLoadedAssetListAssets_Assets) == 0x000038, "Member 'BP_ResourceManager_C_UnregisterAssetList::CallFunc_MakeLoadedAssetListAssets_Assets' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_UnregisterAssetList, Temp_int_Array_Index_Variable) == 0x000048, "Member 'BP_ResourceManager_C_UnregisterAssetList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_UnregisterAssetList, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'BP_ResourceManager_C_UnregisterAssetList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_UnregisterAssetList, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_ResourceManager_C_UnregisterAssetList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_UnregisterAssetList, Temp_int_Loop_Counter_Variable) == 0x000078, "Member 'BP_ResourceManager_C_UnregisterAssetList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_UnregisterAssetList, CallFunc_Map_Remove_ReturnValue) == 0x00007C, "Member 'BP_ResourceManager_C_UnregisterAssetList::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_UnregisterAssetList, CallFunc_Less_IntInt_ReturnValue) == 0x00007D, "Member 'BP_ResourceManager_C_UnregisterAssetList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_UnregisterAssetList, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'BP_ResourceManager_C_UnregisterAssetList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_UnregisterAssetList, CallFunc_Array_Contains_ReturnValue) == 0x000084, "Member 'BP_ResourceManager_C_UnregisterAssetList::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function BP_ResourceManager.BP_ResourceManager_C.MakeLoadedAssetListAssets
// 0x0060 (0x0060 - 0x0000)
struct BP_ResourceManager_C_MakeLoadedAssetListAssets final
{
public:
	class FName                                   ExcludeAssetList;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UObject>>         Assets;                                            // 0x0008(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UObject>>         CurLoadedAssets;                                   // 0x0018(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6425[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_AssetList                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0048(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ResourceManager_C_MakeLoadedAssetListAssets) == 0x000008, "Wrong alignment on BP_ResourceManager_C_MakeLoadedAssetListAssets");
static_assert(sizeof(BP_ResourceManager_C_MakeLoadedAssetListAssets) == 0x000060, "Wrong size on BP_ResourceManager_C_MakeLoadedAssetListAssets");
static_assert(offsetof(BP_ResourceManager_C_MakeLoadedAssetListAssets, ExcludeAssetList) == 0x000000, "Member 'BP_ResourceManager_C_MakeLoadedAssetListAssets::ExcludeAssetList' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_MakeLoadedAssetListAssets, Assets) == 0x000008, "Member 'BP_ResourceManager_C_MakeLoadedAssetListAssets::Assets' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_MakeLoadedAssetListAssets, CurLoadedAssets) == 0x000018, "Member 'BP_ResourceManager_C_MakeLoadedAssetListAssets::CurLoadedAssets' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_MakeLoadedAssetListAssets, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_ResourceManager_C_MakeLoadedAssetListAssets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_MakeLoadedAssetListAssets, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BP_ResourceManager_C_MakeLoadedAssetListAssets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_MakeLoadedAssetListAssets, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_ResourceManager_C_MakeLoadedAssetListAssets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_MakeLoadedAssetListAssets, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'BP_ResourceManager_C_MakeLoadedAssetListAssets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_MakeLoadedAssetListAssets, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_ResourceManager_C_MakeLoadedAssetListAssets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_MakeLoadedAssetListAssets, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_ResourceManager_C_MakeLoadedAssetListAssets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_MakeLoadedAssetListAssets, CallFunc_GetDataTableRowFromName_OutRow) == 0x000048, "Member 'BP_ResourceManager_C_MakeLoadedAssetListAssets::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_MakeLoadedAssetListAssets, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000058, "Member 'BP_ResourceManager_C_MakeLoadedAssetListAssets::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_MakeLoadedAssetListAssets, CallFunc_NotEqual_NameName_ReturnValue) == 0x000059, "Member 'BP_ResourceManager_C_MakeLoadedAssetListAssets::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");

// Function BP_ResourceManager.BP_ResourceManager_C.IsContainAssetInAssetList
// 0x0068 (0x0068 - 0x0000)
struct BP_ResourceManager_C_IsContainAssetInAssetList final
{
public:
	TSoftObjectPtr<class UObject>                 Asset;                                             // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FName                                   ExcludeAssetList;                                  // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Found;                                             // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6426[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6427[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_AssetList                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0050(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ResourceManager_C_IsContainAssetInAssetList) == 0x000008, "Wrong alignment on BP_ResourceManager_C_IsContainAssetInAssetList");
static_assert(sizeof(BP_ResourceManager_C_IsContainAssetInAssetList) == 0x000068, "Wrong size on BP_ResourceManager_C_IsContainAssetInAssetList");
static_assert(offsetof(BP_ResourceManager_C_IsContainAssetInAssetList, Asset) == 0x000000, "Member 'BP_ResourceManager_C_IsContainAssetInAssetList::Asset' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_IsContainAssetInAssetList, ExcludeAssetList) == 0x000028, "Member 'BP_ResourceManager_C_IsContainAssetInAssetList::ExcludeAssetList' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_IsContainAssetInAssetList, Found) == 0x000030, "Member 'BP_ResourceManager_C_IsContainAssetInAssetList::Found' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_IsContainAssetInAssetList, Temp_int_Array_Index_Variable) == 0x000034, "Member 'BP_ResourceManager_C_IsContainAssetInAssetList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_IsContainAssetInAssetList, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'BP_ResourceManager_C_IsContainAssetInAssetList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_IsContainAssetInAssetList, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_ResourceManager_C_IsContainAssetInAssetList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_IsContainAssetInAssetList, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_ResourceManager_C_IsContainAssetInAssetList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_IsContainAssetInAssetList, CallFunc_Array_Get_Item) == 0x000044, "Member 'BP_ResourceManager_C_IsContainAssetInAssetList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_IsContainAssetInAssetList, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'BP_ResourceManager_C_IsContainAssetInAssetList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_IsContainAssetInAssetList, CallFunc_GetDataTableRowFromName_OutRow) == 0x000050, "Member 'BP_ResourceManager_C_IsContainAssetInAssetList::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_IsContainAssetInAssetList, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000060, "Member 'BP_ResourceManager_C_IsContainAssetInAssetList::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_IsContainAssetInAssetList, CallFunc_NotEqual_NameName_ReturnValue) == 0x000061, "Member 'BP_ResourceManager_C_IsContainAssetInAssetList::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_IsContainAssetInAssetList, CallFunc_Array_Contains_ReturnValue) == 0x000062, "Member 'BP_ResourceManager_C_IsContainAssetInAssetList::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function BP_ResourceManager.BP_ResourceManager_C.RequestLoadAssetList
// 0x0080 (0x0080 - 0x0000)
struct BP_ResourceManager_C_RequestLoadAssetList final
{
public:
	class FName                                   AssetList;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UObject>>         AssetsToLoad;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_AssetList                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0018(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6428[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_Array_Get_Item;                           // 0x0038(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Map_Find_Value;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6429[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_642A[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LevelManager_C*                     CallFunc_GetLevelManager_LevelManager;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResourceManager_C_RequestLoadAssetList) == 0x000008, "Wrong alignment on BP_ResourceManager_C_RequestLoadAssetList");
static_assert(sizeof(BP_ResourceManager_C_RequestLoadAssetList) == 0x000080, "Wrong size on BP_ResourceManager_C_RequestLoadAssetList");
static_assert(offsetof(BP_ResourceManager_C_RequestLoadAssetList, AssetList) == 0x000000, "Member 'BP_ResourceManager_C_RequestLoadAssetList::AssetList' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_RequestLoadAssetList, AssetsToLoad) == 0x000008, "Member 'BP_ResourceManager_C_RequestLoadAssetList::AssetsToLoad' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_RequestLoadAssetList, CallFunc_GetDataTableRowFromName_OutRow) == 0x000018, "Member 'BP_ResourceManager_C_RequestLoadAssetList::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_RequestLoadAssetList, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000028, "Member 'BP_ResourceManager_C_RequestLoadAssetList::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_RequestLoadAssetList, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_ResourceManager_C_RequestLoadAssetList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_RequestLoadAssetList, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_ResourceManager_C_RequestLoadAssetList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_RequestLoadAssetList, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'BP_ResourceManager_C_RequestLoadAssetList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_RequestLoadAssetList, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_ResourceManager_C_RequestLoadAssetList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_RequestLoadAssetList, CallFunc_Map_Find_Value) == 0x000060, "Member 'BP_ResourceManager_C_RequestLoadAssetList::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_RequestLoadAssetList, CallFunc_Map_Find_ReturnValue) == 0x000068, "Member 'BP_ResourceManager_C_RequestLoadAssetList::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_RequestLoadAssetList, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'BP_ResourceManager_C_RequestLoadAssetList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_RequestLoadAssetList, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'BP_ResourceManager_C_RequestLoadAssetList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_RequestLoadAssetList, CallFunc_IsValid_ReturnValue) == 0x000071, "Member 'BP_ResourceManager_C_RequestLoadAssetList::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_RequestLoadAssetList, CallFunc_GetLevelManager_LevelManager) == 0x000078, "Member 'BP_ResourceManager_C_RequestLoadAssetList::CallFunc_GetLevelManager_LevelManager' has a wrong offset!");

// Function BP_ResourceManager.BP_ResourceManager_C.RequestUnloadAssetList
// 0x0028 (0x0028 - 0x0000)
struct BP_ResourceManager_C_RequestUnloadAssetList final
{
public:
	class FName                                   AssetList;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Error;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_642B[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UObject>>         AssetsToLoad;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterAssetList_Error;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ResourceManager_C_RequestUnloadAssetList) == 0x000008, "Wrong alignment on BP_ResourceManager_C_RequestUnloadAssetList");
static_assert(sizeof(BP_ResourceManager_C_RequestUnloadAssetList) == 0x000028, "Wrong size on BP_ResourceManager_C_RequestUnloadAssetList");
static_assert(offsetof(BP_ResourceManager_C_RequestUnloadAssetList, AssetList) == 0x000000, "Member 'BP_ResourceManager_C_RequestUnloadAssetList::AssetList' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_RequestUnloadAssetList, Error) == 0x000008, "Member 'BP_ResourceManager_C_RequestUnloadAssetList::Error' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_RequestUnloadAssetList, AssetsToLoad) == 0x000010, "Member 'BP_ResourceManager_C_RequestUnloadAssetList::AssetsToLoad' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_RequestUnloadAssetList, CallFunc_UnregisterAssetList_Error) == 0x000020, "Member 'BP_ResourceManager_C_RequestUnloadAssetList::CallFunc_UnregisterAssetList_Error' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_RequestUnloadAssetList, CallFunc_Array_RemoveItem_ReturnValue) == 0x000021, "Member 'BP_ResourceManager_C_RequestUnloadAssetList::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_RequestUnloadAssetList, CallFunc_Array_Contains_ReturnValue) == 0x000022, "Member 'BP_ResourceManager_C_RequestUnloadAssetList::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function BP_ResourceManager.BP_ResourceManager_C.ProtectedGetMipPrestreamPlayerMeshes
// 0x0268 (0x0268 - 0x0000)
struct BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes final
{
public:
	TArray<class USkeletalMesh*>                  SkeletalMeshes;                                    // 0x0000(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    StaticMeshes;                                      // 0x0010(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	EPlayerID                                     PlayerId;                                          // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLoad;                                             // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_642C[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMesh*>                    RetStaticMeshes;                                   // 0x0028(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class USkeletalMesh*>                  RetSkelMeshes;                                     // 0x0038(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USkeletalMesh>           CostueMesh;                                        // 0x0048(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FPlayerInfo                            Info;                                              // 0x0070(0x00D0)(Edit, BlueprintVisible, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_642D[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue;               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_642E[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_642F[0x2];                                     // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_1;              // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6430[0x3];                                     // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6431[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager;           // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayerInfo                            CallFunc_GetPartyMemberInfo_ReturnValue;           // 0x0190(0x00D0)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes) == 0x000008, "Wrong alignment on BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes");
static_assert(sizeof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes) == 0x000268, "Wrong size on BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes");
static_assert(offsetof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes, SkeletalMeshes) == 0x000000, "Member 'BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes::SkeletalMeshes' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes, StaticMeshes) == 0x000010, "Member 'BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes::StaticMeshes' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes, PlayerId) == 0x000020, "Member 'BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes::PlayerId' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes, bLoad) == 0x000021, "Member 'BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes::bLoad' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes, RetStaticMeshes) == 0x000028, "Member 'BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes::RetStaticMeshes' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes, RetSkelMeshes) == 0x000038, "Member 'BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes::RetSkelMeshes' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes, CostueMesh) == 0x000048, "Member 'BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes::CostueMesh' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes, Info) == 0x000070, "Member 'BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes::Info' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes, K2Node_SwitchEnum_CmpSuccess) == 0x000140, "Member 'BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes, CallFunc_LoadSoftObject_ReturnValue) == 0x000148, "Member 'BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes::CallFunc_LoadSoftObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000150, "Member 'BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes, CallFunc_IsValid_ReturnValue) == 0x000158, "Member 'BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes, K2Node_DynamicCast_AsSkeletal_Mesh) == 0x000160, "Member 'BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes::K2Node_DynamicCast_AsSkeletal_Mesh' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes, CallFunc_IsValid_ReturnValue_1) == 0x000169, "Member 'BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes, CallFunc_Array_Add_ReturnValue) == 0x00016C, "Member 'BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes, K2Node_DynamicCast_AsSkeletal_Mesh_1) == 0x000170, "Member 'BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes::K2Node_DynamicCast_AsSkeletal_Mesh_1' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes, K2Node_DynamicCast_bSuccess_1) == 0x000178, "Member 'BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes, CallFunc_Array_Add_ReturnValue_1) == 0x00017C, "Member 'BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000180, "Member 'BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes, CallFunc_GetPlayerManager_PlayerManager) == 0x000188, "Member 'BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes, CallFunc_GetPartyMemberInfo_ReturnValue) == 0x000190, "Member 'BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes::CallFunc_GetPartyMemberInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes, CallFunc_IsValid_ReturnValue_2) == 0x000260, "Member 'BP_ResourceManager_C_ProtectedGetMipPrestreamPlayerMeshes::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function BP_ResourceManager.BP_ResourceManager_C.LoadWeaponMesh
// 0x0B60 (0x0B60 - 0x0000)
struct BP_ResourceManager_C_LoadWeaponMesh final
{
public:
	int32                                         InWeaponID;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6432[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 InMeshComp;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         InExtraMeshComp;                                   // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          bDisableYuitoString;                               // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LbDisableYuitoString;                              // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6433[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 LExtraMesh;                                        // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LTableIndex;                                       // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6434[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFPlayerWeaponLoadData                 LMeshData;                                         // 0x0038(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         LWeaponID;                                         // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LbSuccess;                                         // 0x009C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6435[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             LEquipDataTable;                                   // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable;                              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_1;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_2;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_3;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_4;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_5;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6436[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6437[0x3];                                     // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_6;                            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMeshMaterialOverrideParameters        CallFunc_GetMeshMaterialOverrideParameters_OutParam; // 0x0100(0x0460)()
	class UDataTable*                             Temp_object_Variable_7;                            // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0568(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0571(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6438[0x2];                                     // 0x0572(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMeshMaterialOverrideParameters        CallFunc_GetMeshMaterialOverrideParameters_OutParam_1; // 0x0578(0x0460)()
	class UDataTable*                             Temp_object_Variable_8;                            // 0x09D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue;               // 0x09E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x09E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6439[0x7];                                     // 0x09E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x09F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x09F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_643A[0x3];                                     // 0x09F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x09FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0A00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue_1;             // 0x0A08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x0A10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_643B[0x7];                                     // 0x0A11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_1;              // 0x0A18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0A20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_643C[0x3];                                     // 0x0A21(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0A24(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0A28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0A30(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_643D[0x4];                                     // 0x0A34(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             Temp_object_Variable_9;                            // 0x0A38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0A40(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0A50(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0A60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFPlayerWeaponLoadData                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0A68(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0AC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0AC9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_643E[0x6];                                     // 0x0ACA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             Temp_object_Variable_10;                           // 0x0AD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemCategoryID_ReturnValue;            // 0x0AD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_643F[0x4];                                     // 0x0ADC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             K2Node_Select_Default;                             // 0x0AE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0AE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6440[0x4];                                     // 0x0AEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFPlayerWeaponLoadData                 CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0AF0(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0B50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0B51(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6441[0x2];                                     // 0x0B52(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0B54(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0B58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ResourceManager_C_LoadWeaponMesh) == 0x000008, "Wrong alignment on BP_ResourceManager_C_LoadWeaponMesh");
static_assert(sizeof(BP_ResourceManager_C_LoadWeaponMesh) == 0x000B60, "Wrong size on BP_ResourceManager_C_LoadWeaponMesh");
