#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SASTelepoComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SASTelepoComponent.BP_SASTelepoComponent_C
// 0x0068 (0x0128 - 0x00C0)
class UBP_SASTelepoComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bExecTelepo;                                       // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bReserveLocationTelepo;                            // 0x00C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81D3[0x2];                                     // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TelepoTargetDistance;                              // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        TelepoParticle;                                    // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TelepoParticleSocketName;                          // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTelepoOnlyWeapon;                                 // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81D4[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PrevTelepoSocketLocation;                          // 0x00E4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      OwnerPlayer;                                       // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameTimer                             MaterialTimer_Telepo;                              // 0x00F8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bBeginMaterialTelepo;                              // 0x0104(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCompleteDisappear;                                // 0x0105(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81D5[0x2];                                     // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   HideOutlineClaimantName;                           // 0x0108(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLocationTargetHeight;                             // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81D6[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BeginActorLocation;                                // 0x0114(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bStoreProfile;                                     // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_SASTelepoComponent(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void Begin(bool LocationTelepo, float TargetDistance, float DisappearTime, class UParticleSystem* DisappearParticle, class FName SocketName, class UParticleSystem* DisappearParticleSecond, class FName SocketNameSecond, class UParticleSystem* Param_TelepoParticle, class FName SocketNameTelepo, bool bOnlyWeapon, bool bNoCollision, bool Param_bLocationTargetHeight, bool* bBegin);
	void End(float AppearTime, class UParticleSystem* AppearParticle, class FName SocketName, class UParticleSystem* AppearParticleSecond, class FName SocketNameSecond, bool bNoDirection, class UParticleSystem* TelepoParticleIn, class FName SocketNameTelepo, bool* bEnd);
	void Complete();
	void Update();
	void Interrupt();
	void CheckTelepoWall();

	void IsDisappear(bool* bDisappear) const;
	void IsTelepo(bool* bTelepo) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SASTelepoComponent_C">();
	}
	static class UBP_SASTelepoComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SASTelepoComponent_C>();
	}
};
static_assert(alignof(UBP_SASTelepoComponent_C) == 0x000008, "Wrong alignment on UBP_SASTelepoComponent_C");
static_assert(sizeof(UBP_SASTelepoComponent_C) == 0x000128, "Wrong size on UBP_SASTelepoComponent_C");
static_assert(offsetof(UBP_SASTelepoComponent_C, UberGraphFrame) == 0x0000C0, "Member 'UBP_SASTelepoComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SASTelepoComponent_C, bExecTelepo) == 0x0000C8, "Member 'UBP_SASTelepoComponent_C::bExecTelepo' has a wrong offset!");
static_assert(offsetof(UBP_SASTelepoComponent_C, bReserveLocationTelepo) == 0x0000C9, "Member 'UBP_SASTelepoComponent_C::bReserveLocationTelepo' has a wrong offset!");
static_assert(offsetof(UBP_SASTelepoComponent_C, TelepoTargetDistance) == 0x0000CC, "Member 'UBP_SASTelepoComponent_C::TelepoTargetDistance' has a wrong offset!");
static_assert(offsetof(UBP_SASTelepoComponent_C, TelepoParticle) == 0x0000D0, "Member 'UBP_SASTelepoComponent_C::TelepoParticle' has a wrong offset!");
static_assert(offsetof(UBP_SASTelepoComponent_C, TelepoParticleSocketName) == 0x0000D8, "Member 'UBP_SASTelepoComponent_C::TelepoParticleSocketName' has a wrong offset!");
static_assert(offsetof(UBP_SASTelepoComponent_C, bTelepoOnlyWeapon) == 0x0000E0, "Member 'UBP_SASTelepoComponent_C::bTelepoOnlyWeapon' has a wrong offset!");
static_assert(offsetof(UBP_SASTelepoComponent_C, PrevTelepoSocketLocation) == 0x0000E4, "Member 'UBP_SASTelepoComponent_C::PrevTelepoSocketLocation' has a wrong offset!");
static_assert(offsetof(UBP_SASTelepoComponent_C, OwnerPlayer) == 0x0000F0, "Member 'UBP_SASTelepoComponent_C::OwnerPlayer' has a wrong offset!");
static_assert(offsetof(UBP_SASTelepoComponent_C, MaterialTimer_Telepo) == 0x0000F8, "Member 'UBP_SASTelepoComponent_C::MaterialTimer_Telepo' has a wrong offset!");
static_assert(offsetof(UBP_SASTelepoComponent_C, bBeginMaterialTelepo) == 0x000104, "Member 'UBP_SASTelepoComponent_C::bBeginMaterialTelepo' has a wrong offset!");
static_assert(offsetof(UBP_SASTelepoComponent_C, bCompleteDisappear) == 0x000105, "Member 'UBP_SASTelepoComponent_C::bCompleteDisappear' has a wrong offset!");
static_assert(offsetof(UBP_SASTelepoComponent_C, HideOutlineClaimantName) == 0x000108, "Member 'UBP_SASTelepoComponent_C::HideOutlineClaimantName' has a wrong offset!");
static_assert(offsetof(UBP_SASTelepoComponent_C, bLocationTargetHeight) == 0x000110, "Member 'UBP_SASTelepoComponent_C::bLocationTargetHeight' has a wrong offset!");
static_assert(offsetof(UBP_SASTelepoComponent_C, BeginActorLocation) == 0x000114, "Member 'UBP_SASTelepoComponent_C::BeginActorLocation' has a wrong offset!");
static_assert(offsetof(UBP_SASTelepoComponent_C, bStoreProfile) == 0x000120, "Member 'UBP_SASTelepoComponent_C::bStoreProfile' has a wrong offset!");

}

