#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SimpleAttackActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BP_SimpleAttackActor.BP_SimpleAttackActor_C.ExecuteUbergraph_BP_SimpleAttackActor
// 0x01E0 (0x01E0 - 0x0000)
struct BP_SimpleAttackActor_C_ExecuteUbergraph_BP_SimpleAttackActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A3B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHCHitResult                           K2Node_ComponentBoundEvent_Result;                 // 0x0008(0x01C0)(ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PrevCheckOnAttackActorHit_bOK;            // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A3C[0x6];                                     // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnAttackActorHit_Dummy;                   // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A3D[0x2];                                     // 0x01DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SimpleAttackActor_C_ExecuteUbergraph_BP_SimpleAttackActor) == 0x000008, "Wrong alignment on BP_SimpleAttackActor_C_ExecuteUbergraph_BP_SimpleAttackActor");
static_assert(sizeof(BP_SimpleAttackActor_C_ExecuteUbergraph_BP_SimpleAttackActor) == 0x0001E0, "Wrong size on BP_SimpleAttackActor_C_ExecuteUbergraph_BP_SimpleAttackActor");
static_assert(offsetof(BP_SimpleAttackActor_C_ExecuteUbergraph_BP_SimpleAttackActor, EntryPoint) == 0x000000, "Member 'BP_SimpleAttackActor_C_ExecuteUbergraph_BP_SimpleAttackActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_ExecuteUbergraph_BP_SimpleAttackActor, K2Node_ComponentBoundEvent_Result) == 0x000008, "Member 'BP_SimpleAttackActor_C_ExecuteUbergraph_BP_SimpleAttackActor::K2Node_ComponentBoundEvent_Result' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_ExecuteUbergraph_BP_SimpleAttackActor, CallFunc_IsValid_ReturnValue) == 0x0001C8, "Member 'BP_SimpleAttackActor_C_ExecuteUbergraph_BP_SimpleAttackActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_ExecuteUbergraph_BP_SimpleAttackActor, CallFunc_PrevCheckOnAttackActorHit_bOK) == 0x0001C9, "Member 'BP_SimpleAttackActor_C_ExecuteUbergraph_BP_SimpleAttackActor::CallFunc_PrevCheckOnAttackActorHit_bOK' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_ExecuteUbergraph_BP_SimpleAttackActor, K2Node_DynamicCast_AsRSBattle_Player) == 0x0001D0, "Member 'BP_SimpleAttackActor_C_ExecuteUbergraph_BP_SimpleAttackActor::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_ExecuteUbergraph_BP_SimpleAttackActor, K2Node_DynamicCast_bSuccess) == 0x0001D8, "Member 'BP_SimpleAttackActor_C_ExecuteUbergraph_BP_SimpleAttackActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_ExecuteUbergraph_BP_SimpleAttackActor, CallFunc_OnAttackActorHit_Dummy) == 0x0001D9, "Member 'BP_SimpleAttackActor_C_ExecuteUbergraph_BP_SimpleAttackActor::CallFunc_OnAttackActorHit_Dummy' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_ExecuteUbergraph_BP_SimpleAttackActor, K2Node_Event_DeltaSeconds) == 0x0001DC, "Member 'BP_SimpleAttackActor_C_ExecuteUbergraph_BP_SimpleAttackActor::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_SimpleAttackActor.BP_SimpleAttackActor_C.BndEvt__HitCheckReceiver_K2Node_ComponentBoundEvent_0_HitResultDelegate__DelegateSignature
// 0x01C0 (0x01C0 - 0x0000)
struct BP_SimpleAttackActor_C_BndEvt__HitCheckReceiver_K2Node_ComponentBoundEvent_0_HitResultDelegate__DelegateSignature final
{
public:
	struct FHCHitResult                           Result;                                            // 0x0000(0x01C0)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_SimpleAttackActor_C_BndEvt__HitCheckReceiver_K2Node_ComponentBoundEvent_0_HitResultDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_SimpleAttackActor_C_BndEvt__HitCheckReceiver_K2Node_ComponentBoundEvent_0_HitResultDelegate__DelegateSignature");
static_assert(sizeof(BP_SimpleAttackActor_C_BndEvt__HitCheckReceiver_K2Node_ComponentBoundEvent_0_HitResultDelegate__DelegateSignature) == 0x0001C0, "Wrong size on BP_SimpleAttackActor_C_BndEvt__HitCheckReceiver_K2Node_ComponentBoundEvent_0_HitResultDelegate__DelegateSignature");
static_assert(offsetof(BP_SimpleAttackActor_C_BndEvt__HitCheckReceiver_K2Node_ComponentBoundEvent_0_HitResultDelegate__DelegateSignature, Result) == 0x000000, "Member 'BP_SimpleAttackActor_C_BndEvt__HitCheckReceiver_K2Node_ComponentBoundEvent_0_HitResultDelegate__DelegateSignature::Result' has a wrong offset!");

// Function BP_SimpleAttackActor.BP_SimpleAttackActor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SimpleAttackActor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SimpleAttackActor_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SimpleAttackActor_C_ReceiveTick");
static_assert(sizeof(BP_SimpleAttackActor_C_ReceiveTick) == 0x000004, "Wrong size on BP_SimpleAttackActor_C_ReceiveTick");
static_assert(offsetof(BP_SimpleAttackActor_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SimpleAttackActor_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_SimpleAttackActor.BP_SimpleAttackActor_C.StartAttack
// 0x0008 (0x0008 - 0x0000)
struct BP_SimpleAttackActor_C_StartAttack final
{
public:
	class AActor*                                 Param_AttackOwner;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SimpleAttackActor_C_StartAttack) == 0x000008, "Wrong alignment on BP_SimpleAttackActor_C_StartAttack");
static_assert(sizeof(BP_SimpleAttackActor_C_StartAttack) == 0x000008, "Wrong size on BP_SimpleAttackActor_C_StartAttack");
static_assert(offsetof(BP_SimpleAttackActor_C_StartAttack, Param_AttackOwner) == 0x000000, "Member 'BP_SimpleAttackActor_C_StartAttack::Param_AttackOwner' has a wrong offset!");

// Function BP_SimpleAttackActor.BP_SimpleAttackActor_C.EndAttackCollision
// 0x0018 (0x0018 - 0x0000)
struct BP_SimpleAttackActor_C_EndAttackCollision final
{
public:
	class AHitManager_C*                          CallFunc_GetHitManager_Manager;                    // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_GetPrimitive_Primitive;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnable_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SimpleAttackActor_C_EndAttackCollision) == 0x000008, "Wrong alignment on BP_SimpleAttackActor_C_EndAttackCollision");
static_assert(sizeof(BP_SimpleAttackActor_C_EndAttackCollision) == 0x000018, "Wrong size on BP_SimpleAttackActor_C_EndAttackCollision");
static_assert(offsetof(BP_SimpleAttackActor_C_EndAttackCollision, CallFunc_GetHitManager_Manager) == 0x000000, "Member 'BP_SimpleAttackActor_C_EndAttackCollision::CallFunc_GetHitManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_EndAttackCollision, CallFunc_GetPrimitive_Primitive) == 0x000008, "Member 'BP_SimpleAttackActor_C_EndAttackCollision::CallFunc_GetPrimitive_Primitive' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_EndAttackCollision, CallFunc_IsEnable_ReturnValue) == 0x000010, "Member 'BP_SimpleAttackActor_C_EndAttackCollision::CallFunc_IsEnable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_EndAttackCollision, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_SimpleAttackActor_C_EndAttackCollision::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_SimpleAttackActor.BP_SimpleAttackActor_C.GetPrimitive
// 0x0008 (0x0008 - 0x0000)
struct BP_SimpleAttackActor_C_GetPrimitive final
{
public:
	class UPrimitiveComponent*                    Primitive;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SimpleAttackActor_C_GetPrimitive) == 0x000008, "Wrong alignment on BP_SimpleAttackActor_C_GetPrimitive");
static_assert(sizeof(BP_SimpleAttackActor_C_GetPrimitive) == 0x000008, "Wrong size on BP_SimpleAttackActor_C_GetPrimitive");
static_assert(offsetof(BP_SimpleAttackActor_C_GetPrimitive, Primitive) == 0x000000, "Member 'BP_SimpleAttackActor_C_GetPrimitive::Primitive' has a wrong offset!");

// Function BP_SimpleAttackActor.BP_SimpleAttackActor_C.PrevCheckOnAttackActorHit
// 0x01E0 (0x01E0 - 0x0000)
struct BP_SimpleAttackActor_C_PrevCheckOnAttackActorHit final
{
public:
	struct FHCHitResult                           HCHitResult;                                       // 0x0000(0x01C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          bOK;                                               // 0x01C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A3E[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 HitActor;                                          // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SimpleAttackActor_C_PrevCheckOnAttackActorHit) == 0x000008, "Wrong alignment on BP_SimpleAttackActor_C_PrevCheckOnAttackActorHit");
static_assert(sizeof(BP_SimpleAttackActor_C_PrevCheckOnAttackActorHit) == 0x0001E0, "Wrong size on BP_SimpleAttackActor_C_PrevCheckOnAttackActorHit");
static_assert(offsetof(BP_SimpleAttackActor_C_PrevCheckOnAttackActorHit, HCHitResult) == 0x000000, "Member 'BP_SimpleAttackActor_C_PrevCheckOnAttackActorHit::HCHitResult' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_PrevCheckOnAttackActorHit, bOK) == 0x0001C0, "Member 'BP_SimpleAttackActor_C_PrevCheckOnAttackActorHit::bOK' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_PrevCheckOnAttackActorHit, HitActor) == 0x0001C8, "Member 'BP_SimpleAttackActor_C_PrevCheckOnAttackActorHit::HitActor' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_PrevCheckOnAttackActorHit, CallFunc_Array_Add_ReturnValue) == 0x0001D0, "Member 'BP_SimpleAttackActor_C_PrevCheckOnAttackActorHit::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_PrevCheckOnAttackActorHit, CallFunc_Array_Find_ReturnValue) == 0x0001D4, "Member 'BP_SimpleAttackActor_C_PrevCheckOnAttackActorHit::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_PrevCheckOnAttackActorHit, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0001D8, "Member 'BP_SimpleAttackActor_C_PrevCheckOnAttackActorHit::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_SimpleAttackActor.BP_SimpleAttackActor_C.UpdateAttackStep
// 0x02D8 (0x02D8 - 0x0000)
struct BP_SimpleAttackActor_C_UpdateAttackStep final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A3F[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_GetPrimitive_Primitive;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A40[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFinish_bEnd;                            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOver_ReturnValue;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnable_ReturnValue;                     // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A41[0x5];                                     // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AHitManager_C*                          CallFunc_GetHitManager_Manager;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A42[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHCAttackCollisionInfo                 CallFunc_AttackCollisionInfoToC_Out;               // 0x0040(0x0280)()
	class URSAtomComponentBase*                   CallFunc_PlaySoundAttachedRS_ReturnValue;          // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_GetPrimitive_Primitive_1;                 // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOver_ReturnValue_1;                     // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableParticle_bEnable;                 // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SimpleAttackActor_C_UpdateAttackStep) == 0x000008, "Wrong alignment on BP_SimpleAttackActor_C_UpdateAttackStep");
static_assert(sizeof(BP_SimpleAttackActor_C_UpdateAttackStep) == 0x0002D8, "Wrong size on BP_SimpleAttackActor_C_UpdateAttackStep");
static_assert(offsetof(BP_SimpleAttackActor_C_UpdateAttackStep, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'BP_SimpleAttackActor_C_UpdateAttackStep::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_UpdateAttackStep, CallFunc_GetPrimitive_Primitive) == 0x000010, "Member 'BP_SimpleAttackActor_C_UpdateAttackStep::CallFunc_GetPrimitive_Primitive' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_UpdateAttackStep, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_SimpleAttackActor_C_UpdateAttackStep::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_UpdateAttackStep, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'BP_SimpleAttackActor_C_UpdateAttackStep::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_UpdateAttackStep, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000020, "Member 'BP_SimpleAttackActor_C_UpdateAttackStep::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_UpdateAttackStep, CallFunc_IsFinish_bEnd) == 0x000028, "Member 'BP_SimpleAttackActor_C_UpdateAttackStep::CallFunc_IsFinish_bEnd' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_UpdateAttackStep, CallFunc_IsOver_ReturnValue) == 0x000029, "Member 'BP_SimpleAttackActor_C_UpdateAttackStep::CallFunc_IsOver_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_UpdateAttackStep, CallFunc_IsEnable_ReturnValue) == 0x00002A, "Member 'BP_SimpleAttackActor_C_UpdateAttackStep::CallFunc_IsEnable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_UpdateAttackStep, CallFunc_GetHitManager_Manager) == 0x000030, "Member 'BP_SimpleAttackActor_C_UpdateAttackStep::CallFunc_GetHitManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_UpdateAttackStep, CallFunc_IsValid_ReturnValue_2) == 0x000038, "Member 'BP_SimpleAttackActor_C_UpdateAttackStep::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_UpdateAttackStep, CallFunc_AttackCollisionInfoToC_Out) == 0x000040, "Member 'BP_SimpleAttackActor_C_UpdateAttackStep::CallFunc_AttackCollisionInfoToC_Out' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_UpdateAttackStep, CallFunc_PlaySoundAttachedRS_ReturnValue) == 0x0002C0, "Member 'BP_SimpleAttackActor_C_UpdateAttackStep::CallFunc_PlaySoundAttachedRS_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_UpdateAttackStep, CallFunc_GetPrimitive_Primitive_1) == 0x0002C8, "Member 'BP_SimpleAttackActor_C_UpdateAttackStep::CallFunc_GetPrimitive_Primitive_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_UpdateAttackStep, K2Node_SwitchInteger_CmpSuccess) == 0x0002D0, "Member 'BP_SimpleAttackActor_C_UpdateAttackStep::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_UpdateAttackStep, CallFunc_IsOver_ReturnValue_1) == 0x0002D1, "Member 'BP_SimpleAttackActor_C_UpdateAttackStep::CallFunc_IsOver_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_UpdateAttackStep, CallFunc_IsEnableParticle_bEnable) == 0x0002D2, "Member 'BP_SimpleAttackActor_C_UpdateAttackStep::CallFunc_IsEnableParticle_bEnable' has a wrong offset!");

// Function BP_SimpleAttackActor.BP_SimpleAttackActor_C.UpdateCustomTimeDilation
// 0x0008 (0x0008 - 0x0000)
struct BP_SimpleAttackActor_C_UpdateCustomTimeDilation final
{
public:
	float                                         TimeDilation;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SimpleAttackActor_C_UpdateCustomTimeDilation) == 0x000004, "Wrong alignment on BP_SimpleAttackActor_C_UpdateCustomTimeDilation");
static_assert(sizeof(BP_SimpleAttackActor_C_UpdateCustomTimeDilation) == 0x000008, "Wrong size on BP_SimpleAttackActor_C_UpdateCustomTimeDilation");
static_assert(offsetof(BP_SimpleAttackActor_C_UpdateCustomTimeDilation, TimeDilation) == 0x000000, "Member 'BP_SimpleAttackActor_C_UpdateCustomTimeDilation::TimeDilation' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_UpdateCustomTimeDilation, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_SimpleAttackActor_C_UpdateCustomTimeDilation::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_SimpleAttackActor.BP_SimpleAttackActor_C.Finish
// 0x0001 (0x0001 - 0x0000)
struct BP_SimpleAttackActor_C_Finish final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SimpleAttackActor_C_Finish) == 0x000001, "Wrong alignment on BP_SimpleAttackActor_C_Finish");
static_assert(sizeof(BP_SimpleAttackActor_C_Finish) == 0x000001, "Wrong size on BP_SimpleAttackActor_C_Finish");
static_assert(offsetof(BP_SimpleAttackActor_C_Finish, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_SimpleAttackActor_C_Finish::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_SimpleAttackActor.BP_SimpleAttackActor_C.IsEnableParticle
// 0x0001 (0x0001 - 0x0000)
struct BP_SimpleAttackActor_C_IsEnableParticle final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SimpleAttackActor_C_IsEnableParticle) == 0x000001, "Wrong alignment on BP_SimpleAttackActor_C_IsEnableParticle");
static_assert(sizeof(BP_SimpleAttackActor_C_IsEnableParticle) == 0x000001, "Wrong size on BP_SimpleAttackActor_C_IsEnableParticle");
static_assert(offsetof(BP_SimpleAttackActor_C_IsEnableParticle, bEnable) == 0x000000, "Member 'BP_SimpleAttackActor_C_IsEnableParticle::bEnable' has a wrong offset!");

// Function BP_SimpleAttackActor.BP_SimpleAttackActor_C.IsFinish
// 0x0007 (0x0007 - 0x0000)
struct BP_SimpleAttackActor_C_IsFinish final
{
public:
	bool                                          bEnd;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnable_ReturnValue;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOver_ReturnValue;                       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SimpleAttackActor_C_IsFinish) == 0x000001, "Wrong alignment on BP_SimpleAttackActor_C_IsFinish");
static_assert(sizeof(BP_SimpleAttackActor_C_IsFinish) == 0x000007, "Wrong size on BP_SimpleAttackActor_C_IsFinish");
static_assert(offsetof(BP_SimpleAttackActor_C_IsFinish, bEnd) == 0x000000, "Member 'BP_SimpleAttackActor_C_IsFinish::bEnd' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_IsFinish, CallFunc_IsEnable_ReturnValue) == 0x000001, "Member 'BP_SimpleAttackActor_C_IsFinish::CallFunc_IsEnable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_IsFinish, CallFunc_IsOver_ReturnValue) == 0x000002, "Member 'BP_SimpleAttackActor_C_IsFinish::CallFunc_IsOver_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_IsFinish, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'BP_SimpleAttackActor_C_IsFinish::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_IsFinish, CallFunc_IsActive_ReturnValue) == 0x000004, "Member 'BP_SimpleAttackActor_C_IsFinish::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_IsFinish, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BP_SimpleAttackActor_C_IsFinish::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleAttackActor_C_IsFinish, CallFunc_Not_PreBool_ReturnValue_1) == 0x000006, "Member 'BP_SimpleAttackActor_C_IsFinish::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

}

