#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StageManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_StageManager.BP_StageManager_C.ExecuteUbergraph_BP_StageManager
// 0x0004 (0x0004 - 0x0000)
struct BP_StageManager_C_ExecuteUbergraph_BP_StageManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StageManager_C_ExecuteUbergraph_BP_StageManager) == 0x000004, "Wrong alignment on BP_StageManager_C_ExecuteUbergraph_BP_StageManager");
static_assert(sizeof(BP_StageManager_C_ExecuteUbergraph_BP_StageManager) == 0x000004, "Wrong size on BP_StageManager_C_ExecuteUbergraph_BP_StageManager");
static_assert(offsetof(BP_StageManager_C_ExecuteUbergraph_BP_StageManager, EntryPoint) == 0x000000, "Member 'BP_StageManager_C_ExecuteUbergraph_BP_StageManager::EntryPoint' has a wrong offset!");

// Function BP_StageManager.BP_StageManager_C.AreaStart
// 0x0010 (0x0010 - 0x0000)
struct BP_StageManager_C_AreaStart final
{
public:
	class ABP_BrainCrashManager_C*                CallFunc_GetBrainCrashManager_Manager;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StageManager_C_AreaStart) == 0x000008, "Wrong alignment on BP_StageManager_C_AreaStart");
static_assert(sizeof(BP_StageManager_C_AreaStart) == 0x000010, "Wrong size on BP_StageManager_C_AreaStart");
static_assert(offsetof(BP_StageManager_C_AreaStart, CallFunc_GetBrainCrashManager_Manager) == 0x000000, "Member 'BP_StageManager_C_AreaStart::CallFunc_GetBrainCrashManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_AreaStart, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_StageManager_C_AreaStart::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_StageManager.BP_StageManager_C.InitializeLight
// 0x0038 (0x0038 - 0x0000)
struct BP_StageManager_C_InitializeLight final
{
public:
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E24[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ADirectionalLight*>              CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E25[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADirectionalLight*                      CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E26[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StageManager_C_InitializeLight) == 0x000008, "Wrong alignment on BP_StageManager_C_InitializeLight");
static_assert(sizeof(BP_StageManager_C_InitializeLight) == 0x000038, "Wrong size on BP_StageManager_C_InitializeLight");
static_assert(offsetof(BP_StageManager_C_InitializeLight, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x000000, "Member 'BP_StageManager_C_InitializeLight::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_InitializeLight, CallFunc_GetAllActorsOfClass_OutActors) == 0x000008, "Member 'BP_StageManager_C_InitializeLight::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_InitializeLight, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_StageManager_C_InitializeLight::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_InitializeLight, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_StageManager_C_InitializeLight::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_InitializeLight, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'BP_StageManager_C_InitializeLight::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_InitializeLight, CallFunc_GetActorForwardVector_ReturnValue) == 0x00002C, "Member 'BP_StageManager_C_InitializeLight::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");

// Function BP_StageManager.BP_StageManager_C.SetupSceneLight
// 0x00C0 (0x00C0 - 0x0000)
struct BP_StageManager_C_SetupSceneLight final
{
public:
	class ADirectionalLight*                      TargetLight;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelStreaming*                        TmpLevel;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UObject>>         TmpLevels;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class ABP_LevelManager_C*                     LevelManager;                                      // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E27[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E28[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E29[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E2A[0x5];                                     // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_StageParameterSettingVolumeManager_C* CallFunc_GetStageParameterSettingManager_SettingManager; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LevelManager_C*                     CallFunc_GetLevelManager_LevelManager;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E2B[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetActorsFromLevelStreaming_ReturnValue;  // 0x0068(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E2C[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADirectionalLight*                      K2Node_DynamicCast_AsDirectional_Light;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E2D[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_ObjectSoftRefToName_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StageManager_C_SetupSceneLight) == 0x000008, "Wrong alignment on BP_StageManager_C_SetupSceneLight");
static_assert(sizeof(BP_StageManager_C_SetupSceneLight) == 0x0000C0, "Wrong size on BP_StageManager_C_SetupSceneLight");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, TargetLight) == 0x000000, "Member 'BP_StageManager_C_SetupSceneLight::TargetLight' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, TmpLevel) == 0x000008, "Member 'BP_StageManager_C_SetupSceneLight::TmpLevel' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, TmpLevels) == 0x000010, "Member 'BP_StageManager_C_SetupSceneLight::TmpLevels' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, LevelManager) == 0x000020, "Member 'BP_StageManager_C_SetupSceneLight::LevelManager' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_StageManager_C_SetupSceneLight::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, Temp_bool_True_if_break_was_hit_Variable) == 0x00002C, "Member 'BP_StageManager_C_SetupSceneLight::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, CallFunc_Not_PreBool_ReturnValue) == 0x00002D, "Member 'BP_StageManager_C_SetupSceneLight::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_StageManager_C_SetupSceneLight::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'BP_StageManager_C_SetupSceneLight::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, Temp_bool_True_if_break_was_hit_Variable_1) == 0x000038, "Member 'BP_StageManager_C_SetupSceneLight::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, Temp_int_Array_Index_Variable_1) == 0x00003C, "Member 'BP_StageManager_C_SetupSceneLight::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, CallFunc_Not_PreBool_ReturnValue_1) == 0x000040, "Member 'BP_StageManager_C_SetupSceneLight::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, Temp_int_Loop_Num_Variable) == 0x000044, "Member 'BP_StageManager_C_SetupSceneLight::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BP_StageManager_C_SetupSceneLight::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'BP_StageManager_C_SetupSceneLight::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, CallFunc_BooleanAND_ReturnValue) == 0x00004A, "Member 'BP_StageManager_C_SetupSceneLight::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, CallFunc_GetStageParameterSettingManager_SettingManager) == 0x000050, "Member 'BP_StageManager_C_SetupSceneLight::CallFunc_GetStageParameterSettingManager_SettingManager' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, CallFunc_GetLevelManager_LevelManager) == 0x000058, "Member 'BP_StageManager_C_SetupSceneLight::CallFunc_GetLevelManager_LevelManager' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'BP_StageManager_C_SetupSceneLight::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, CallFunc_GetActorsFromLevelStreaming_ReturnValue) == 0x000068, "Member 'BP_StageManager_C_SetupSceneLight::CallFunc_GetActorsFromLevelStreaming_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, Temp_int_Loop_Counter_Variable_1) == 0x000078, "Member 'BP_StageManager_C_SetupSceneLight::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, K2Node_DynamicCast_AsDirectional_Light) == 0x000080, "Member 'BP_StageManager_C_SetupSceneLight::K2Node_DynamicCast_AsDirectional_Light' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BP_StageManager_C_SetupSceneLight::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, CallFunc_Add_IntInt_ReturnValue_1) == 0x00008C, "Member 'BP_StageManager_C_SetupSceneLight::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'BP_StageManager_C_SetupSceneLight::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, CallFunc_GetActorForwardVector_ReturnValue) == 0x000094, "Member 'BP_StageManager_C_SetupSceneLight::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, Temp_int_Loop_Num_Variable_1) == 0x0000A0, "Member 'BP_StageManager_C_SetupSceneLight::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A4, "Member 'BP_StageManager_C_SetupSceneLight::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, CallFunc_BooleanAND_ReturnValue_1) == 0x0000A5, "Member 'BP_StageManager_C_SetupSceneLight::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, CallFunc_IsValid_ReturnValue_2) == 0x0000A6, "Member 'BP_StageManager_C_SetupSceneLight::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, CallFunc_IsValid_ReturnValue_3) == 0x0000A7, "Member 'BP_StageManager_C_SetupSceneLight::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, CallFunc_ObjectSoftRefToName_ReturnValue) == 0x0000A8, "Member 'BP_StageManager_C_SetupSceneLight::CallFunc_ObjectSoftRefToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, CallFunc_GetStreamingLevel_ReturnValue) == 0x0000B0, "Member 'BP_StageManager_C_SetupSceneLight::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StageManager_C_SetupSceneLight, CallFunc_Array_Length_ReturnValue_1) == 0x0000B8, "Member 'BP_StageManager_C_SetupSceneLight::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");

}

