#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SASCopyPlayerActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "FNotifyAttackData_structs.hpp"
#include "ECharaExecuteNotifyKind_structs.hpp"
#include "ESASCopyStatus_structs.hpp"
#include "Engine_structs.hpp"
#include "ESASCopyAttachType_structs.hpp"


namespace SDK::Params
{

// Function BP_SASCopyPlayerActor.BP_SASCopyPlayerActor_C.ExecuteUbergraph_BP_SASCopyPlayerActor
// 0x0410 (0x0410 - 0x0000)
struct BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D58[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class INexusDriveInterface>  K2Node_DynamicCast_AsNexus_Drive_Interface;        // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D59[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHCHitResult                           K2Node_Event_HitResult;                            // 0x0020(0x01C0)(ConstParm, ContainsInstancedReference)
	bool                                          K2Node_Event_bCopyPlayer;                          // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     K2Node_Event_PlayerID_3;                           // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     K2Node_Event_PlayerID_2;                           // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     K2Node_Event_PlayerID_1;                           // 0x01E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     K2Node_Event_PlayerID;                             // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_wait_on_in;                           // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D5A[0x2];                                     // 0x01E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D5B[0x4];                                     // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHCHitResult                           K2Node_ComponentBoundEvent_Result;                 // 0x01F0(0x01C0)(ContainsInstancedReference)
	bool                                          CallFunc_PrevCheckOnAttackActorHit_bOK;            // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D5C[0x7];                                     // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleCharacterInterface_C> K2Node_DynamicCast_AsBPI_Battle_Character_Interface; // 0x03B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemy_bEnemy;                           // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D5D[0x5];                                     // 0x03CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PlayerFixParamater_C*               CallFunc_GetPlayerFixParam_Param;                  // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UActorComponent*>                K2Node_MakeArray_Array;                            // 0x03D8(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D5E[0x3];                                     // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSParticleSystemComponentBase*         K2Node_Event_Particle_1;                           // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSParticleSystemComponentBase*         K2Node_Event_Particle;                             // 0x0400(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsControlAI_bAI;                          // 0x040A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor) == 0x000008, "Wrong alignment on BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor");
static_assert(sizeof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor) == 0x000410, "Wrong size on BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, EntryPoint) == 0x000000, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, K2Node_DynamicCast_AsNexus_Drive_Interface) == 0x000008, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::K2Node_DynamicCast_AsNexus_Drive_Interface' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, K2Node_Event_HitResult) == 0x000020, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::K2Node_Event_HitResult' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, K2Node_Event_bCopyPlayer) == 0x0001E0, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::K2Node_Event_bCopyPlayer' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, K2Node_Event_PlayerID_3) == 0x0001E1, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::K2Node_Event_PlayerID_3' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, K2Node_Event_PlayerID_2) == 0x0001E2, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::K2Node_Event_PlayerID_2' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, K2Node_Event_PlayerID_1) == 0x0001E3, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::K2Node_Event_PlayerID_1' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, K2Node_Event_PlayerID) == 0x0001E4, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::K2Node_Event_PlayerID' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, K2Node_Event_wait_on_in) == 0x0001E5, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::K2Node_Event_wait_on_in' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, K2Node_Event_DeltaSeconds) == 0x0001E8, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, K2Node_ComponentBoundEvent_Result) == 0x0001F0, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::K2Node_ComponentBoundEvent_Result' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, CallFunc_PrevCheckOnAttackActorHit_bOK) == 0x0003B0, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::CallFunc_PrevCheckOnAttackActorHit_bOK' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, K2Node_DynamicCast_AsBPI_Battle_Character_Interface) == 0x0003B8, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::K2Node_DynamicCast_AsBPI_Battle_Character_Interface' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, K2Node_DynamicCast_bSuccess_1) == 0x0003C8, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, CallFunc_IsEnemy_bEnemy) == 0x0003C9, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::CallFunc_IsEnemy_bEnemy' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, CallFunc_IsValid_ReturnValue) == 0x0003CA, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, CallFunc_GetPlayerFixParam_Param) == 0x0003D0, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::CallFunc_GetPlayerFixParam_Param' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, K2Node_MakeArray_Array) == 0x0003D8, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, CallFunc_IsValid_ReturnValue_1) == 0x0003E8, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, CallFunc_BreakVector_X) == 0x0003EC, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, CallFunc_BreakVector_Y) == 0x0003F0, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, CallFunc_BreakVector_Z) == 0x0003F4, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, K2Node_Event_Particle_1) == 0x0003F8, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::K2Node_Event_Particle_1' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, K2Node_Event_Particle) == 0x000400, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::K2Node_Event_Particle' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, CallFunc_IsValid_ReturnValue_2) == 0x000408, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, CallFunc_IsValid_ReturnValue_3) == 0x000409, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor, CallFunc_IsControlAI_bAI) == 0x00040A, "Member 'BP_SASCopyPlayerActor_C_ExecuteUbergraph_BP_SASCopyPlayerActor::CallFunc_IsControlAI_bAI' has a wrong offset!");

// Function BP_SASCopyPlayerActor.BP_SASCopyPlayerActor_C.RegisterEffectInterface
// 0x0008 (0x0008 - 0x0000)
struct BP_SASCopyPlayerActor_C_RegisterEffectInterface final
{
public:
	class URSParticleSystemComponentBase*         Particle;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASCopyPlayerActor_C_RegisterEffectInterface) == 0x000008, "Wrong alignment on BP_SASCopyPlayerActor_C_RegisterEffectInterface");
static_assert(sizeof(BP_SASCopyPlayerActor_C_RegisterEffectInterface) == 0x000008, "Wrong size on BP_SASCopyPlayerActor_C_RegisterEffectInterface");
static_assert(offsetof(BP_SASCopyPlayerActor_C_RegisterEffectInterface, Particle) == 0x000000, "Member 'BP_SASCopyPlayerActor_C_RegisterEffectInterface::Particle' has a wrong offset!");

// Function BP_SASCopyPlayerActor.BP_SASCopyPlayerActor_C.RegisterInterruptTelepoEffectInterface
// 0x0008 (0x0008 - 0x0000)
struct BP_SASCopyPlayerActor_C_RegisterInterruptTelepoEffectInterface final
{
public:
	class URSParticleSystemComponentBase*         Particle;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASCopyPlayerActor_C_RegisterInterruptTelepoEffectInterface) == 0x000008, "Wrong alignment on BP_SASCopyPlayerActor_C_RegisterInterruptTelepoEffectInterface");
static_assert(sizeof(BP_SASCopyPlayerActor_C_RegisterInterruptTelepoEffectInterface) == 0x000008, "Wrong size on BP_SASCopyPlayerActor_C_RegisterInterruptTelepoEffectInterface");
static_assert(offsetof(BP_SASCopyPlayerActor_C_RegisterInterruptTelepoEffectInterface, Particle) == 0x000000, "Member 'BP_SASCopyPlayerActor_C_RegisterInterruptTelepoEffectInterface::Particle' has a wrong offset!");

// Function BP_SASCopyPlayerActor.BP_SASCopyPlayerActor_C.BndEvt__HitCheckReceiver_K2Node_ComponentBoundEvent_0_HitResultDelegate__DelegateSignature
// 0x01C0 (0x01C0 - 0x0000)
struct BP_SASCopyPlayerActor_C_BndEvt__HitCheckReceiver_K2Node_ComponentBoundEvent_0_HitResultDelegate__DelegateSignature final
{
public:
	struct FHCHitResult                           Result;                                            // 0x0000(0x01C0)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_SASCopyPlayerActor_C_BndEvt__HitCheckReceiver_K2Node_ComponentBoundEvent_0_HitResultDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_SASCopyPlayerActor_C_BndEvt__HitCheckReceiver_K2Node_ComponentBoundEvent_0_HitResultDelegate__DelegateSignature");
static_assert(sizeof(BP_SASCopyPlayerActor_C_BndEvt__HitCheckReceiver_K2Node_ComponentBoundEvent_0_HitResultDelegate__DelegateSignature) == 0x0001C0, "Wrong size on BP_SASCopyPlayerActor_C_BndEvt__HitCheckReceiver_K2Node_ComponentBoundEvent_0_HitResultDelegate__DelegateSignature");
static_assert(offsetof(BP_SASCopyPlayerActor_C_BndEvt__HitCheckReceiver_K2Node_ComponentBoundEvent_0_HitResultDelegate__DelegateSignature, Result) == 0x000000, "Member 'BP_SASCopyPlayerActor_C_BndEvt__HitCheckReceiver_K2Node_ComponentBoundEvent_0_HitResultDelegate__DelegateSignature::Result' has a wrong offset!");

// Function BP_SASCopyPlayerActor.BP_SASCopyPlayerActor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SASCopyPlayerActor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASCopyPlayerActor_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SASCopyPlayerActor_C_ReceiveTick");
static_assert(sizeof(BP_SASCopyPlayerActor_C_ReceiveTick) == 0x000004, "Wrong size on BP_SASCopyPlayerActor_C_ReceiveTick");
static_assert(offsetof(BP_SASCopyPlayerActor_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SASCopyPlayerActor_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_SASCopyPlayerActor.BP_SASCopyPlayerActor_C.SetCounterWait
// 0x0001 (0x0001 - 0x0000)
struct BP_SASCopyPlayerActor_C_SetCounterWait final
{
public:
	bool                                          Wait_on_in;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SASCopyPlayerActor_C_SetCounterWait) == 0x000001, "Wrong alignment on BP_SASCopyPlayerActor_C_SetCounterWait");
static_assert(sizeof(BP_SASCopyPlayerActor_C_SetCounterWait) == 0x000001, "Wrong size on BP_SASCopyPlayerActor_C_SetCounterWait");
static_assert(offsetof(BP_SASCopyPlayerActor_C_SetCounterWait, Wait_on_in) == 0x000000, "Member 'BP_SASCopyPlayerActor_C_SetCounterWait::Wait_on_in' has a wrong offset!");

// Function BP_SASCopyPlayerActor.BP_SASCopyPlayerActor_C.UnregisterNpcDriveForNexusDrive
// 0x0001 (0x0001 - 0x0000)
struct BP_SASCopyPlayerActor_C_UnregisterNpcDriveForNexusDrive final
{
public:
	EPlayerID                                     PlayerId;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASCopyPlayerActor_C_UnregisterNpcDriveForNexusDrive) == 0x000001, "Wrong alignment on BP_SASCopyPlayerActor_C_UnregisterNpcDriveForNexusDrive");
static_assert(sizeof(BP_SASCopyPlayerActor_C_UnregisterNpcDriveForNexusDrive) == 0x000001, "Wrong size on BP_SASCopyPlayerActor_C_UnregisterNpcDriveForNexusDrive");
static_assert(offsetof(BP_SASCopyPlayerActor_C_UnregisterNpcDriveForNexusDrive, PlayerId) == 0x000000, "Member 'BP_SASCopyPlayerActor_C_UnregisterNpcDriveForNexusDrive::PlayerId' has a wrong offset!");

// Function BP_SASCopyPlayerActor.BP_SASCopyPlayerActor_C.UnregisterDelayDriveEnd
// 0x0001 (0x0001 - 0x0000)
struct BP_SASCopyPlayerActor_C_UnregisterDelayDriveEnd final
{
public:
	EPlayerID                                     PlayerId;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASCopyPlayerActor_C_UnregisterDelayDriveEnd) == 0x000001, "Wrong alignment on BP_SASCopyPlayerActor_C_UnregisterDelayDriveEnd");
static_assert(sizeof(BP_SASCopyPlayerActor_C_UnregisterDelayDriveEnd) == 0x000001, "Wrong size on BP_SASCopyPlayerActor_C_UnregisterDelayDriveEnd");
static_assert(offsetof(BP_SASCopyPlayerActor_C_UnregisterDelayDriveEnd, PlayerId) == 0x000000, "Member 'BP_SASCopyPlayerActor_C_UnregisterDelayDriveEnd::PlayerId' has a wrong offset!");

// Function BP_SASCopyPlayerActor.BP_SASCopyPlayerActor_C.RegisterNpcDriveForNexusDrive
// 0x0001 (0x0001 - 0x0000)
struct BP_SASCopyPlayerActor_C_RegisterNpcDriveForNexusDrive final
{
public:
	EPlayerID                                     PlayerId;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASCopyPlayerActor_C_RegisterNpcDriveForNexusDrive) == 0x000001, "Wrong alignment on BP_SASCopyPlayerActor_C_RegisterNpcDriveForNexusDrive");
static_assert(sizeof(BP_SASCopyPlayerActor_C_RegisterNpcDriveForNexusDrive) == 0x000001, "Wrong size on BP_SASCopyPlayerActor_C_RegisterNpcDriveForNexusDrive");
static_assert(offsetof(BP_SASCopyPlayerActor_C_RegisterNpcDriveForNexusDrive, PlayerId) == 0x000000, "Member 'BP_SASCopyPlayerActor_C_RegisterNpcDriveForNexusDrive::PlayerId' has a wrong offset!");

// Function BP_SASCopyPlayerActor.BP_SASCopyPlayerActor_C.RegisterDelayDriveEnd
// 0x0001 (0x0001 - 0x0000)
struct BP_SASCopyPlayerActor_C_RegisterDelayDriveEnd final
{
public:
	EPlayerID                                     PlayerId;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASCopyPlayerActor_C_RegisterDelayDriveEnd) == 0x000001, "Wrong alignment on BP_SASCopyPlayerActor_C_RegisterDelayDriveEnd");
static_assert(sizeof(BP_SASCopyPlayerActor_C_RegisterDelayDriveEnd) == 0x000001, "Wrong size on BP_SASCopyPlayerActor_C_RegisterDelayDriveEnd");
static_assert(offsetof(BP_SASCopyPlayerActor_C_RegisterDelayDriveEnd, PlayerId) == 0x000000, "Member 'BP_SASCopyPlayerActor_C_RegisterDelayDriveEnd::PlayerId' has a wrong offset!");

// Function BP_SASCopyPlayerActor.BP_SASCopyPlayerActor_C.NexusDriveAttackHitRecovery
// 0x01C8 (0x01C8 - 0x0000)
struct BP_SASCopyPlayerActor_C_NexusDriveAttackHitRecovery final
{
public:
	struct FHCHitResult                           HitResult;                                         // 0x0000(0x01C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          bCopyPlayer;                                       // 0x01C0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SASCopyPlayerActor_C_NexusDriveAttackHitRecovery) == 0x000008, "Wrong alignment on BP_SASCopyPlayerActor_C_NexusDriveAttackHitRecovery");
static_assert(sizeof(BP_SASCopyPlayerActor_C_NexusDriveAttackHitRecovery) == 0x0001C8, "Wrong size on BP_SASCopyPlayerActor_C_NexusDriveAttackHitRecovery");
static_assert(offsetof(BP_SASCopyPlayerActor_C_NexusDriveAttackHitRecovery, HitResult) == 0x000000, "Member 'BP_SASCopyPlayerActor_C_NexusDriveAttackHitRecovery::HitResult' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_NexusDriveAttackHitRecovery, bCopyPlayer) == 0x0001C0, "Member 'BP_SASCopyPlayerActor_C_NexusDriveAttackHitRecovery::bCopyPlayer' has a wrong offset!");

// Function BP_SASCopyPlayerActor.BP_SASCopyPlayerActor_C.Setting
// 0x0138 (0x0138 - 0x0000)
struct BP_SASCopyPlayerActor_C_Setting final
{
public:
	class ARSBattlePlayer_C*                      OriginalPlayer;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 AnimBP;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESASCopyAttachType                            AttachType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D5F[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_IsEnemyPlayer_self_CastInput;             // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemyPlayer_bEnemyPlayer;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D60[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      CallFunc_GetPlayerID_self_CastInput;               // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D61[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerInfo                            CallFunc_GetPartyMemberInfo_ReturnValue;           // 0x0044(0x00D0)(NoDestructor)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetWalkableFloorAngle_ReturnValue;     // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D62[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCopyPlayerAnimInstance*                K2Node_DynamicCast_AsCopy_Player_Anim_Instance;    // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SASCopyPlayerActor_C_Setting) == 0x000008, "Wrong alignment on BP_SASCopyPlayerActor_C_Setting");
static_assert(sizeof(BP_SASCopyPlayerActor_C_Setting) == 0x000138, "Wrong size on BP_SASCopyPlayerActor_C_Setting");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Setting, OriginalPlayer) == 0x000000, "Member 'BP_SASCopyPlayerActor_C_Setting::OriginalPlayer' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Setting, AnimBP) == 0x000008, "Member 'BP_SASCopyPlayerActor_C_Setting::AnimBP' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Setting, AttachType) == 0x000010, "Member 'BP_SASCopyPlayerActor_C_Setting::AttachType' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Setting, CallFunc_IsEnemyPlayer_self_CastInput) == 0x000018, "Member 'BP_SASCopyPlayerActor_C_Setting::CallFunc_IsEnemyPlayer_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Setting, CallFunc_IsEnemyPlayer_bEnemyPlayer) == 0x000028, "Member 'BP_SASCopyPlayerActor_C_Setting::CallFunc_IsEnemyPlayer_bEnemyPlayer' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Setting, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BP_SASCopyPlayerActor_C_Setting::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Setting, CallFunc_GetPlayerID_self_CastInput) == 0x000030, "Member 'BP_SASCopyPlayerActor_C_Setting::CallFunc_GetPlayerID_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Setting, CallFunc_GetPlayerID_ReturnValue) == 0x000040, "Member 'BP_SASCopyPlayerActor_C_Setting::CallFunc_GetPlayerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Setting, CallFunc_GetPartyMemberInfo_ReturnValue) == 0x000044, "Member 'BP_SASCopyPlayerActor_C_Setting::CallFunc_GetPartyMemberInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Setting, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x000114, "Member 'BP_SASCopyPlayerActor_C_Setting::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Setting, CallFunc_K2_GetWalkableFloorAngle_ReturnValue) == 0x000118, "Member 'BP_SASCopyPlayerActor_C_Setting::CallFunc_K2_GetWalkableFloorAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Setting, CallFunc_GetAnimInstance_ReturnValue) == 0x000120, "Member 'BP_SASCopyPlayerActor_C_Setting::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Setting, K2Node_DynamicCast_AsCopy_Player_Anim_Instance) == 0x000128, "Member 'BP_SASCopyPlayerActor_C_Setting::K2Node_DynamicCast_AsCopy_Player_Anim_Instance' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Setting, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'BP_SASCopyPlayerActor_C_Setting::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_SASCopyPlayerActor.BP_SASCopyPlayerActor_C.CopyOn
// 0x0108 (0x0108 - 0x0000)
struct BP_SASCopyPlayerActor_C_CopyOn final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWithSubWeapon;                                    // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LEnpc;                                             // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D63[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D64[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorRelativeLocation_SweepHitResult; // 0x0024(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Array_Get_Item;                           // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D65[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D66[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_WeaponBase_C*>               CallFunc_GetWeaponList_WeaponList;                 // 0x00B8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	float                                         CallFunc_GetWeaponEmissiveValue_Emmisive;          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D67[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D68[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface;         // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemyPlayer_bEnemyPlayer;               // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDriveMode_ReturnValue;                  // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D69[0x5];                                     // 0x00F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InBranField_InBrainDield;                 // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUserIsPlayer_IsPlayer;                  // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SASCopyPlayerActor_C_CopyOn) == 0x000008, "Wrong alignment on BP_SASCopyPlayerActor_C_CopyOn");
static_assert(sizeof(BP_SASCopyPlayerActor_C_CopyOn) == 0x000108, "Wrong size on BP_SASCopyPlayerActor_C_CopyOn");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, Time) == 0x000000, "Member 'BP_SASCopyPlayerActor_C_CopyOn::Time' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, bWithSubWeapon) == 0x000004, "Member 'BP_SASCopyPlayerActor_C_CopyOn::bWithSubWeapon' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, LEnpc) == 0x000005, "Member 'BP_SASCopyPlayerActor_C_CopyOn::LEnpc' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, Temp_int_Loop_Num_Variable) == 0x000008, "Member 'BP_SASCopyPlayerActor_C_CopyOn::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_SASCopyPlayerActor_C_CopyOn::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_SASCopyPlayerActor_C_CopyOn::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_SASCopyPlayerActor_C_CopyOn::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'BP_SASCopyPlayerActor_C_CopyOn::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, Temp_int_Loop_Num_Variable_1) == 0x00001C, "Member 'BP_SASCopyPlayerActor_C_CopyOn::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'BP_SASCopyPlayerActor_C_CopyOn::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, Temp_bool_Variable) == 0x000021, "Member 'BP_SASCopyPlayerActor_C_CopyOn::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, CallFunc_K2_SetActorRelativeLocation_SweepHitResult) == 0x000024, "Member 'BP_SASCopyPlayerActor_C_CopyOn::CallFunc_K2_SetActorRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, CallFunc_Array_Get_Item) == 0x0000AC, "Member 'BP_SASCopyPlayerActor_C_CopyOn::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'BP_SASCopyPlayerActor_C_CopyOn::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, CallFunc_GetWeaponList_WeaponList) == 0x0000B8, "Member 'BP_SASCopyPlayerActor_C_CopyOn::CallFunc_GetWeaponList_WeaponList' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, CallFunc_GetWeaponEmissiveValue_Emmisive) == 0x0000C8, "Member 'BP_SASCopyPlayerActor_C_CopyOn::CallFunc_GetWeaponEmissiveValue_Emmisive' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, CallFunc_Array_Length_ReturnValue_1) == 0x0000CC, "Member 'BP_SASCopyPlayerActor_C_CopyOn::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, Temp_int_Loop_Counter_Variable_1) == 0x0000D0, "Member 'BP_SASCopyPlayerActor_C_CopyOn::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000D4, "Member 'BP_SASCopyPlayerActor_C_CopyOn::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000D8, "Member 'BP_SASCopyPlayerActor_C_CopyOn::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, K2Node_DynamicCast_AsBPI_Player_Interface) == 0x0000E0, "Member 'BP_SASCopyPlayerActor_C_CopyOn::K2Node_DynamicCast_AsBPI_Player_Interface' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'BP_SASCopyPlayerActor_C_CopyOn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, CallFunc_IsEnemyPlayer_bEnemyPlayer) == 0x0000F1, "Member 'BP_SASCopyPlayerActor_C_CopyOn::CallFunc_IsEnemyPlayer_bEnemyPlayer' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, CallFunc_IsDriveMode_ReturnValue) == 0x0000F2, "Member 'BP_SASCopyPlayerActor_C_CopyOn::CallFunc_IsDriveMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, CallFunc_GetBrainFieldManager_Manager) == 0x0000F8, "Member 'BP_SASCopyPlayerActor_C_CopyOn::CallFunc_GetBrainFieldManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, CallFunc_InBranField_InBrainDield) == 0x000100, "Member 'BP_SASCopyPlayerActor_C_CopyOn::CallFunc_InBranField_InBrainDield' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, CallFunc_IsUserIsPlayer_IsPlayer) == 0x000101, "Member 'BP_SASCopyPlayerActor_C_CopyOn::CallFunc_IsUserIsPlayer_IsPlayer' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, CallFunc_Not_PreBool_ReturnValue) == 0x000102, "Member 'BP_SASCopyPlayerActor_C_CopyOn::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, K2Node_Select_Default) == 0x000103, "Member 'BP_SASCopyPlayerActor_C_CopyOn::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOn, K2Node_SwitchEnum_CmpSuccess) == 0x000104, "Member 'BP_SASCopyPlayerActor_C_CopyOn::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_SASCopyPlayerActor.BP_SASCopyPlayerActor_C.CopyOff
// 0x0020 (0x0020 - 0x0000)
struct BP_SASCopyPlayerActor_C_CopyOff final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRate_ReturnValue;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D6A[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SASCopyPlayerActor_C_CopyOff) == 0x000008, "Wrong alignment on BP_SASCopyPlayerActor_C_CopyOff");
static_assert(sizeof(BP_SASCopyPlayerActor_C_CopyOff) == 0x000020, "Wrong size on BP_SASCopyPlayerActor_C_CopyOff");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOff, Time) == 0x000000, "Member 'BP_SASCopyPlayerActor_C_CopyOff::Time' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOff, CallFunc_GetRate_ReturnValue) == 0x000004, "Member 'BP_SASCopyPlayerActor_C_CopyOff::CallFunc_GetRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOff, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_SASCopyPlayerActor_C_CopyOff::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOff, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'BP_SASCopyPlayerActor_C_CopyOff::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOff, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000010, "Member 'BP_SASCopyPlayerActor_C_CopyOff::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_CopyOff, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'BP_SASCopyPlayerActor_C_CopyOff::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_SASCopyPlayerActor.BP_SASCopyPlayerActor_C.Update
// 0x0030 (0x0030 - 0x0000)
struct BP_SASCopyPlayerActor_C_Update final
{
public:
	float                                         LRate;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D6B[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOver_ReturnValue;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D6C[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRate_ReturnValue;                      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOver_ReturnValue_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D6D[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRate_ReturnValue_1;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SASCopyPlayerActor_C_Update) == 0x000008, "Wrong alignment on BP_SASCopyPlayerActor_C_Update");
static_assert(sizeof(BP_SASCopyPlayerActor_C_Update) == 0x000030, "Wrong size on BP_SASCopyPlayerActor_C_Update");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Update, LRate) == 0x000000, "Member 'BP_SASCopyPlayerActor_C_Update::LRate' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Update, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_SASCopyPlayerActor_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Update, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000005, "Member 'BP_SASCopyPlayerActor_C_Update::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Update, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'BP_SASCopyPlayerActor_C_Update::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Update, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000008, "Member 'BP_SASCopyPlayerActor_C_Update::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Update, CallFunc_IsOver_ReturnValue) == 0x000010, "Member 'BP_SASCopyPlayerActor_C_Update::CallFunc_IsOver_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Update, CallFunc_GetRate_ReturnValue) == 0x000014, "Member 'BP_SASCopyPlayerActor_C_Update::CallFunc_GetRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Update, CallFunc_Lerp_ReturnValue) == 0x000018, "Member 'BP_SASCopyPlayerActor_C_Update::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Update, CallFunc_Lerp_ReturnValue_1) == 0x00001C, "Member 'BP_SASCopyPlayerActor_C_Update::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Update, CallFunc_IsOver_ReturnValue_1) == 0x000020, "Member 'BP_SASCopyPlayerActor_C_Update::CallFunc_IsOver_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Update, CallFunc_GetRate_ReturnValue_1) == 0x000024, "Member 'BP_SASCopyPlayerActor_C_Update::CallFunc_GetRate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_Update, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'BP_SASCopyPlayerActor_C_Update::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_SASCopyPlayerActor.BP_SASCopyPlayerActor_C.SetVisibility
// 0x0030 (0x0030 - 0x0000)
struct BP_SASCopyPlayerActor_C_SetVisibility final
{
public:
	bool                                          bVisibility;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWithSubWeapon;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D6E[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_WeaponBase_C*>               CallFunc_GetWeaponList_WeaponList;                 // 0x0010(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D6F[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerStatus_Result;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SASCopyPlayerActor_C_SetVisibility) == 0x000008, "Wrong alignment on BP_SASCopyPlayerActor_C_SetVisibility");
static_assert(sizeof(BP_SASCopyPlayerActor_C_SetVisibility) == 0x000030, "Wrong size on BP_SASCopyPlayerActor_C_SetVisibility");
static_assert(offsetof(BP_SASCopyPlayerActor_C_SetVisibility, bVisibility) == 0x000000, "Member 'BP_SASCopyPlayerActor_C_SetVisibility::bVisibility' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_SetVisibility, bWithSubWeapon) == 0x000001, "Member 'BP_SASCopyPlayerActor_C_SetVisibility::bWithSubWeapon' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_SetVisibility, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_SASCopyPlayerActor_C_SetVisibility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_SetVisibility, Temp_int_Loop_Num_Variable) == 0x000008, "Member 'BP_SASCopyPlayerActor_C_SetVisibility::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_SetVisibility, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_SASCopyPlayerActor_C_SetVisibility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_SetVisibility, CallFunc_GetWeaponList_WeaponList) == 0x000010, "Member 'BP_SASCopyPlayerActor_C_SetVisibility::CallFunc_GetWeaponList_WeaponList' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_SetVisibility, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'BP_SASCopyPlayerActor_C_SetVisibility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_SetVisibility, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_SASCopyPlayerActor_C_SetVisibility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_SetVisibility, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_SASCopyPlayerActor_C_SetVisibility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_SetVisibility, CallFunc_IsPlayerStatus_Result) == 0x00002C, "Member 'BP_SASCopyPlayerActor_C_SetVisibility::CallFunc_IsPlayerStatus_Result' has a wrong offset!");

// Function BP_SASCopyPlayerActor.BP_SASCopyPlayerActor_C.SetCopyMaterialValue
// 0x0004 (0x0004 - 0x0000)
struct BP_SASCopyPlayerActor_C_SetCopyMaterialValue final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASCopyPlayerActor_C_SetCopyMaterialValue) == 0x000004, "Wrong alignment on BP_SASCopyPlayerActor_C_SetCopyMaterialValue");
static_assert(sizeof(BP_SASCopyPlayerActor_C_SetCopyMaterialValue) == 0x000004, "Wrong size on BP_SASCopyPlayerActor_C_SetCopyMaterialValue");
static_assert(offsetof(BP_SASCopyPlayerActor_C_SetCopyMaterialValue, Rate) == 0x000000, "Member 'BP_SASCopyPlayerActor_C_SetCopyMaterialValue::Rate' has a wrong offset!");

// Function BP_SASCopyPlayerActor.BP_SASCopyPlayerActor_C.PlayMontage
// 0x0030 (0x0030 - 0x0000)
struct BP_SASCopyPlayerActor_C_PlayMontage final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlayRate;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SectionName;                                       // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D70[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCopyPlayerAnimInstance*                K2Node_DynamicCast_AsCopy_Player_Anim_Instance;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D71[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASCopyPlayerActor_C_PlayMontage) == 0x000008, "Wrong alignment on BP_SASCopyPlayerActor_C_PlayMontage");
static_assert(sizeof(BP_SASCopyPlayerActor_C_PlayMontage) == 0x000030, "Wrong size on BP_SASCopyPlayerActor_C_PlayMontage");
static_assert(offsetof(BP_SASCopyPlayerActor_C_PlayMontage, Montage) == 0x000000, "Member 'BP_SASCopyPlayerActor_C_PlayMontage::Montage' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_PlayMontage, PlayRate) == 0x000008, "Member 'BP_SASCopyPlayerActor_C_PlayMontage::PlayRate' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_PlayMontage, SectionName) == 0x00000C, "Member 'BP_SASCopyPlayerActor_C_PlayMontage::SectionName' has a wrong offset!");
static_assert(offsetof(BP_SASCopyPlayerActor_C_PlayMontage, CallFunc_NotEqual_NameName_ReturnValue) == 0x000014, "Member 'BP_SASCopyPlayerActor_C_PlayMontage::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
