#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SeeThroughJustDodgeCutin

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SeeThroughJustDodgeCutin.BP_SeeThroughJustDodgeCutin_C.ExecuteUbergraph_BP_SeeThroughJustDodgeCutin
// 0x0158 (0x0158 - 0x0000)
struct BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125E[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125F[0x1];                                     // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1260[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1261[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1262[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_1;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1263[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue;                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IPlayerInterface>      K2Node_DynamicCast_AsPlayer_Interface;             // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1264[0x6];                                     // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface;         // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNexusDriveSeeThroughBestJustDodge_bBestJustDodge; // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1265[0x1];                                     // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x00A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1266[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameSystemManager_C*                CallFunc_GetGameSystemManager_Manager;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1267[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentCustomTimeDilation_CustomTimeDilation; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1268[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameSystemManager_C*                CallFunc_GetGameSystemManager_Manater;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1269[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentCustomTimeDilation_CustomTimeDilation_1; // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_126A[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     Temp_byte_Variable_1;                              // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_126B[0x2];                                     // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager_1;         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_126C[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_GetBattleMemberActorFromKind_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IPlayerInterface>      K2Node_DynamicCast_AsPlayer_Interface_1;           // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue_1;                // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_126D[0x2];                                     // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_1;                           // 0x0134(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_2;                           // 0x013C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_126E[0x3];                                     // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin) == 0x000008, "Wrong alignment on BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin");
static_assert(sizeof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin) == 0x000158, "Wrong size on BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, EntryPoint) == 0x000000, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, Temp_byte_Variable) == 0x000004, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000006, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, Temp_object_Variable) == 0x000010, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, K2Node_DynamicCast_AsSkeletal_Mesh) == 0x000018, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::K2Node_DynamicCast_AsSkeletal_Mesh' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, Temp_bool_Variable) == 0x000021, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, Temp_bool_Variable_1) == 0x000022, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, Temp_name_Variable) == 0x000024, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, Temp_name_Variable_1) == 0x00002C, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, Temp_bool_Variable_2) == 0x000034, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, K2Node_Event_DeltaSeconds) == 0x000038, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_IsValid_ReturnValue_1) == 0x00003C, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_IsValid_ReturnValue_2) == 0x00003D, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_GetPlayerManager_PlayerManager) == 0x000040, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, Temp_object_Variable_1) == 0x000048, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_IsValid_ReturnValue_3) == 0x000050, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, K2Node_DynamicCast_AsSkeletal_Mesh_1) == 0x000058, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::K2Node_DynamicCast_AsSkeletal_Mesh_1' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_GetPlayer_ReturnValue) == 0x000068, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_GetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, K2Node_CustomEvent_Loaded_1) == 0x000070, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, K2Node_DynamicCast_AsPlayer_Interface) == 0x000078, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::K2Node_DynamicCast_AsPlayer_Interface' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, K2Node_DynamicCast_bSuccess_2) == 0x000088, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_GetPlayerID_ReturnValue) == 0x000089, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_GetPlayerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, K2Node_DynamicCast_AsBPI_Player_Interface) == 0x000090, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::K2Node_DynamicCast_AsBPI_Player_Interface' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, K2Node_DynamicCast_bSuccess_3) == 0x0000A0, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_IsValid_ReturnValue_4) == 0x0000A1, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_IsNexusDriveSeeThroughBestJustDodge_bBestJustDodge) == 0x0000A2, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_IsNexusDriveSeeThroughBestJustDodge_bBestJustDodge' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, Temp_name_Variable_2) == 0x0000A4, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_GetGameSystemManager_Manager) == 0x0000B0, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_GetGameSystemManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_IsValid_ReturnValue_5) == 0x0000B8, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_GetCurrentCustomTimeDilation_CustomTimeDilation) == 0x0000BC, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_GetCurrentCustomTimeDilation_CustomTimeDilation' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000C0, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_IsValid_ReturnValue_6) == 0x0000C4, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_GetGameSystemManager_Manater) == 0x0000C8, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_GetGameSystemManager_Manater' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_IsValid_ReturnValue_7) == 0x0000D0, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_GetCurrentCustomTimeDilation_CustomTimeDilation_1) == 0x0000D4, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_GetCurrentCustomTimeDilation_CustomTimeDilation_1' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, K2Node_Event_EndPlayReason) == 0x0000D8, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0000DC, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_IsValid_ReturnValue_8) == 0x0000E0, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_IsValid_ReturnValue_9) == 0x0000E1, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, Temp_byte_Variable_1) == 0x0000E2, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_IsValid_ReturnValue_10) == 0x0000E3, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_IsValid_ReturnValue_11) == 0x0000E4, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000E5, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, K2Node_Select_Default) == 0x0000E8, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_GetPlayerManager_PlayerManager_1) == 0x0000F0, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_GetPlayerManager_PlayerManager_1' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, K2Node_CreateDelegate_OutputDelegate) == 0x0000F8, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_IsValid_ReturnValue_12) == 0x000108, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_GetBattleMemberActorFromKind_ReturnValue) == 0x000110, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_GetBattleMemberActorFromKind_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, Temp_name_Variable_3) == 0x000118, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, K2Node_DynamicCast_AsPlayer_Interface_1) == 0x000120, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::K2Node_DynamicCast_AsPlayer_Interface_1' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, K2Node_DynamicCast_bSuccess_4) == 0x000130, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_GetPlayerID_ReturnValue_1) == 0x000131, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_GetPlayerID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, K2Node_Select_Default_1) == 0x000134, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, K2Node_Select_Default_2) == 0x00013C, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, CallFunc_IsValid_ReturnValue_13) == 0x000144, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin, K2Node_CreateDelegate_OutputDelegate_1) == 0x000148, "Member 'BP_SeeThroughJustDodgeCutin_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutin::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function BP_SeeThroughJustDodgeCutin.BP_SeeThroughJustDodgeCutin_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_SeeThroughJustDodgeCutin_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SeeThroughJustDodgeCutin_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_SeeThroughJustDodgeCutin_C_ReceiveEndPlay");
static_assert(sizeof(BP_SeeThroughJustDodgeCutin_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_SeeThroughJustDodgeCutin_C_ReceiveEndPlay");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_SeeThroughJustDodgeCutin_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_SeeThroughJustDodgeCutin.BP_SeeThroughJustDodgeCutin_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SeeThroughJustDodgeCutin_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SeeThroughJustDodgeCutin_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SeeThroughJustDodgeCutin_C_ReceiveTick");
static_assert(sizeof(BP_SeeThroughJustDodgeCutin_C_ReceiveTick) == 0x000004, "Wrong size on BP_SeeThroughJustDodgeCutin_C_ReceiveTick");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SeeThroughJustDodgeCutin_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_SeeThroughJustDodgeCutin.BP_SeeThroughJustDodgeCutin_C.OnLoaded_72457A974DB0B931466E24B19E36270D
// 0x0008 (0x0008 - 0x0000)
struct BP_SeeThroughJustDodgeCutin_C_OnLoaded_72457A974DB0B931466E24B19E36270D final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SeeThroughJustDodgeCutin_C_OnLoaded_72457A974DB0B931466E24B19E36270D) == 0x000008, "Wrong alignment on BP_SeeThroughJustDodgeCutin_C_OnLoaded_72457A974DB0B931466E24B19E36270D");
static_assert(sizeof(BP_SeeThroughJustDodgeCutin_C_OnLoaded_72457A974DB0B931466E24B19E36270D) == 0x000008, "Wrong size on BP_SeeThroughJustDodgeCutin_C_OnLoaded_72457A974DB0B931466E24B19E36270D");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_OnLoaded_72457A974DB0B931466E24B19E36270D, Loaded) == 0x000000, "Member 'BP_SeeThroughJustDodgeCutin_C_OnLoaded_72457A974DB0B931466E24B19E36270D::Loaded' has a wrong offset!");

// Function BP_SeeThroughJustDodgeCutin.BP_SeeThroughJustDodgeCutin_C.OnLoaded_E65E3FAD42EFFA57EA2FD3B977AF3D96
// 0x0008 (0x0008 - 0x0000)
struct BP_SeeThroughJustDodgeCutin_C_OnLoaded_E65E3FAD42EFFA57EA2FD3B977AF3D96 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SeeThroughJustDodgeCutin_C_OnLoaded_E65E3FAD42EFFA57EA2FD3B977AF3D96) == 0x000008, "Wrong alignment on BP_SeeThroughJustDodgeCutin_C_OnLoaded_E65E3FAD42EFFA57EA2FD3B977AF3D96");
static_assert(sizeof(BP_SeeThroughJustDodgeCutin_C_OnLoaded_E65E3FAD42EFFA57EA2FD3B977AF3D96) == 0x000008, "Wrong size on BP_SeeThroughJustDodgeCutin_C_OnLoaded_E65E3FAD42EFFA57EA2FD3B977AF3D96");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_OnLoaded_E65E3FAD42EFFA57EA2FD3B977AF3D96, Loaded) == 0x000000, "Member 'BP_SeeThroughJustDodgeCutin_C_OnLoaded_E65E3FAD42EFFA57EA2FD3B977AF3D96::Loaded' has a wrong offset!");

// Function BP_SeeThroughJustDodgeCutin.BP_SeeThroughJustDodgeCutin_C.LoadAsset
// 0x0008 (0x0008 - 0x0000)
struct BP_SeeThroughJustDodgeCutin_C_LoadAsset final
{
public:
	class UClass*                                 CallFunc_LoadSoftClassActor_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SeeThroughJustDodgeCutin_C_LoadAsset) == 0x000008, "Wrong alignment on BP_SeeThroughJustDodgeCutin_C_LoadAsset");
static_assert(sizeof(BP_SeeThroughJustDodgeCutin_C_LoadAsset) == 0x000008, "Wrong size on BP_SeeThroughJustDodgeCutin_C_LoadAsset");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_LoadAsset, CallFunc_LoadSoftClassActor_ReturnValue) == 0x000000, "Member 'BP_SeeThroughJustDodgeCutin_C_LoadAsset::CallFunc_LoadSoftClassActor_ReturnValue' has a wrong offset!");

// Function BP_SeeThroughJustDodgeCutin.BP_SeeThroughJustDodgeCutin_C.PrivateInitialize
// 0x00C0 (0x00C0 - 0x0000)
struct BP_SeeThroughJustDodgeCutin_C_PrivateInitialize final
{
public:
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_126F[0xF];                                     // 0x0031(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CutinManager_C*                     CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1270[0x5];                                     // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SeeThroughJustDodgeCutinCharacter_C* K2Node_DynamicCast_AsBP_See_Through_Just_Dodge_Cutin_Character; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SeeThroughJustDodgeCutin_C_PrivateInitialize) == 0x000010, "Wrong alignment on BP_SeeThroughJustDodgeCutin_C_PrivateInitialize");
static_assert(sizeof(BP_SeeThroughJustDodgeCutin_C_PrivateInitialize) == 0x0000C0, "Wrong size on BP_SeeThroughJustDodgeCutin_C_PrivateInitialize");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_PrivateInitialize, CallFunc_MakeTransform_ReturnValue) == 0x000000, "Member 'BP_SeeThroughJustDodgeCutin_C_PrivateInitialize::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_PrivateInitialize, CallFunc_MakeLiteralByte_ReturnValue) == 0x000030, "Member 'BP_SeeThroughJustDodgeCutin_C_PrivateInitialize::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_PrivateInitialize, CallFunc_MakeTransform_ReturnValue_1) == 0x000040, "Member 'BP_SeeThroughJustDodgeCutin_C_PrivateInitialize::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_PrivateInitialize, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'BP_SeeThroughJustDodgeCutin_C_PrivateInitialize::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_PrivateInitialize, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'BP_SeeThroughJustDodgeCutin_C_PrivateInitialize::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_PrivateInitialize, K2Node_CreateDelegate_OutputDelegate) == 0x000080, "Member 'BP_SeeThroughJustDodgeCutin_C_PrivateInitialize::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_PrivateInitialize, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000090, "Member 'BP_SeeThroughJustDodgeCutin_C_PrivateInitialize::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_PrivateInitialize, CallFunc_IsValid_ReturnValue) == 0x000091, "Member 'BP_SeeThroughJustDodgeCutin_C_PrivateInitialize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_PrivateInitialize, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000092, "Member 'BP_SeeThroughJustDodgeCutin_C_PrivateInitialize::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_PrivateInitialize, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000098, "Member 'BP_SeeThroughJustDodgeCutin_C_PrivateInitialize::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_PrivateInitialize, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0000A0, "Member 'BP_SeeThroughJustDodgeCutin_C_PrivateInitialize::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_PrivateInitialize, K2Node_DynamicCast_AsBP_See_Through_Just_Dodge_Cutin_Character) == 0x0000A8, "Member 'BP_SeeThroughJustDodgeCutin_C_PrivateInitialize::K2Node_DynamicCast_AsBP_See_Through_Just_Dodge_Cutin_Character' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_PrivateInitialize, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'BP_SeeThroughJustDodgeCutin_C_PrivateInitialize::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_SeeThroughJustDodgeCutin.BP_SeeThroughJustDodgeCutin_C.Set Active Cutin Actor
// 0x0002 (0x0002 - 0x0000)
struct BP_SeeThroughJustDodgeCutin_C_Set_Active_Cutin_Actor final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SeeThroughJustDodgeCutin_C_Set_Active_Cutin_Actor) == 0x000001, "Wrong alignment on BP_SeeThroughJustDodgeCutin_C_Set_Active_Cutin_Actor");
static_assert(sizeof(BP_SeeThroughJustDodgeCutin_C_Set_Active_Cutin_Actor) == 0x000002, "Wrong size on BP_SeeThroughJustDodgeCutin_C_Set_Active_Cutin_Actor");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_Set_Active_Cutin_Actor, Active) == 0x000000, "Member 'BP_SeeThroughJustDodgeCutin_C_Set_Active_Cutin_Actor::Active' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_Set_Active_Cutin_Actor, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'BP_SeeThroughJustDodgeCutin_C_Set_Active_Cutin_Actor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_SeeThroughJustDodgeCutin.BP_SeeThroughJustDodgeCutin_C.IsPlayingCutin
// 0x0003 (0x0003 - 0x0000)
struct BP_SeeThroughJustDodgeCutin_C_IsPlayingCutin final
{
public:
	bool                                          bPlaying;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingCurrentSequence_IsPlaying;       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SeeThroughJustDodgeCutin_C_IsPlayingCutin) == 0x000001, "Wrong alignment on BP_SeeThroughJustDodgeCutin_C_IsPlayingCutin");
static_assert(sizeof(BP_SeeThroughJustDodgeCutin_C_IsPlayingCutin) == 0x000003, "Wrong size on BP_SeeThroughJustDodgeCutin_C_IsPlayingCutin");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_IsPlayingCutin, bPlaying) == 0x000000, "Member 'BP_SeeThroughJustDodgeCutin_C_IsPlayingCutin::bPlaying' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutin_C_IsPlayingCutin, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_SeeThroughJustDodgeCutin_C_IsPlayingCutin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
