#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_static_sky

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_static_sky.BP_static_sky_C.UserConstructionScript
// 0x0068 (0x0068 - 0x0000)
struct BP_static_sky_C_UserConstructionScript final
{
public:
	TArray<class UPrimitiveComponent*>            Primitives;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A4D[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A4E[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item_2;                         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A4F[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_static_sky_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_static_sky_C_UserConstructionScript");
static_assert(sizeof(BP_static_sky_C_UserConstructionScript) == 0x000068, "Wrong size on BP_static_sky_C_UserConstructionScript");
static_assert(offsetof(BP_static_sky_C_UserConstructionScript, Primitives) == 0x000000, "Member 'BP_static_sky_C_UserConstructionScript::Primitives' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_UserConstructionScript, Temp_int_Variable) == 0x000010, "Member 'BP_static_sky_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_UserConstructionScript, Temp_int_Variable_1) == 0x000014, "Member 'BP_static_sky_C_UserConstructionScript::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_static_sky_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'BP_static_sky_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_UserConstructionScript, Temp_int_Variable_2) == 0x000020, "Member 'BP_static_sky_C_UserConstructionScript::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_2) == 0x000024, "Member 'BP_static_sky_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_static_sky_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_static_sky_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_static_sky_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_UserConstructionScript, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'BP_static_sky_C_UserConstructionScript::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_1) == 0x000040, "Member 'BP_static_sky_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue_1) == 0x000044, "Member 'BP_static_sky_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_UserConstructionScript, CallFunc_Array_Get_Item_2) == 0x000048, "Member 'BP_static_sky_C_UserConstructionScript::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_2) == 0x000050, "Member 'BP_static_sky_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue_2) == 0x000054, "Member 'BP_static_sky_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_UserConstructionScript, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000058, "Member 'BP_static_sky_C_UserConstructionScript::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");

// Function BP_static_sky.BP_static_sky_C.PauseSkyParticle
// 0x0040 (0x0040 - 0x0000)
struct BP_static_sky_C_PauseSkyParticle final
{
public:
	bool                                          Pause;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A50[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetScalarParameterIndex_OutParameterIndex; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetScalarParameterIndex_ReturnValue;      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A51[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterByIndex_OutValue;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetScalarParameterByIndex_ReturnValue;    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A52[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetScalarParameterIndex_OutParameterIndex_1; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetScalarParameterIndex_ReturnValue_1;    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A53[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterByIndex_OutValue_1;     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetScalarParameterByIndex_ReturnValue_1;  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_static_sky_C_PauseSkyParticle) == 0x000008, "Wrong alignment on BP_static_sky_C_PauseSkyParticle");
static_assert(sizeof(BP_static_sky_C_PauseSkyParticle) == 0x000040, "Wrong size on BP_static_sky_C_PauseSkyParticle");
static_assert(offsetof(BP_static_sky_C_PauseSkyParticle, Pause) == 0x000000, "Member 'BP_static_sky_C_PauseSkyParticle::Pause' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_PauseSkyParticle, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_static_sky_C_PauseSkyParticle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_PauseSkyParticle, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'BP_static_sky_C_PauseSkyParticle::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_PauseSkyParticle, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_static_sky_C_PauseSkyParticle::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_PauseSkyParticle, CallFunc_MakeLiteralName_ReturnValue) == 0x000010, "Member 'BP_static_sky_C_PauseSkyParticle::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_PauseSkyParticle, CallFunc_GetScalarParameterIndex_OutParameterIndex) == 0x000018, "Member 'BP_static_sky_C_PauseSkyParticle::CallFunc_GetScalarParameterIndex_OutParameterIndex' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_PauseSkyParticle, CallFunc_GetScalarParameterIndex_ReturnValue) == 0x00001C, "Member 'BP_static_sky_C_PauseSkyParticle::CallFunc_GetScalarParameterIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_PauseSkyParticle, CallFunc_GetScalarParameterByIndex_OutValue) == 0x000020, "Member 'BP_static_sky_C_PauseSkyParticle::CallFunc_GetScalarParameterByIndex_OutValue' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_PauseSkyParticle, CallFunc_GetScalarParameterByIndex_ReturnValue) == 0x000024, "Member 'BP_static_sky_C_PauseSkyParticle::CallFunc_GetScalarParameterByIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_PauseSkyParticle, CallFunc_MakeLiteralName_ReturnValue_1) == 0x000028, "Member 'BP_static_sky_C_PauseSkyParticle::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_PauseSkyParticle, CallFunc_GetScalarParameterIndex_OutParameterIndex_1) == 0x000030, "Member 'BP_static_sky_C_PauseSkyParticle::CallFunc_GetScalarParameterIndex_OutParameterIndex_1' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_PauseSkyParticle, CallFunc_GetScalarParameterIndex_ReturnValue_1) == 0x000034, "Member 'BP_static_sky_C_PauseSkyParticle::CallFunc_GetScalarParameterIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_PauseSkyParticle, CallFunc_GetScalarParameterByIndex_OutValue_1) == 0x000038, "Member 'BP_static_sky_C_PauseSkyParticle::CallFunc_GetScalarParameterByIndex_OutValue_1' has a wrong offset!");
static_assert(offsetof(BP_static_sky_C_PauseSkyParticle, CallFunc_GetScalarParameterByIndex_ReturnValue_1) == 0x00003C, "Member 'BP_static_sky_C_PauseSkyParticle::CallFunc_GetScalarParameterByIndex_ReturnValue_1' has a wrong offset!");

// Function BP_static_sky.BP_static_sky_C.GetStaticMesh
// 0x0008 (0x0008 - 0x0000)
struct BP_static_sky_C_GetStaticMesh final
{
public:
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_static_sky_C_GetStaticMesh) == 0x000008, "Wrong alignment on BP_static_sky_C_GetStaticMesh");
static_assert(sizeof(BP_static_sky_C_GetStaticMesh) == 0x000008, "Wrong size on BP_static_sky_C_GetStaticMesh");
static_assert(offsetof(BP_static_sky_C_GetStaticMesh, StaticMesh) == 0x000000, "Member 'BP_static_sky_C_GetStaticMesh::StaticMesh' has a wrong offset!");

// Function BP_static_sky.BP_static_sky_C.GetSkeletalMesh
// 0x0008 (0x0008 - 0x0000)
struct BP_static_sky_C_GetSkeletalMesh final
{
public:
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_static_sky_C_GetSkeletalMesh) == 0x000008, "Wrong alignment on BP_static_sky_C_GetSkeletalMesh");
static_assert(sizeof(BP_static_sky_C_GetSkeletalMesh) == 0x000008, "Wrong size on BP_static_sky_C_GetSkeletalMesh");
static_assert(offsetof(BP_static_sky_C_GetSkeletalMesh, SkeletalMesh) == 0x000000, "Member 'BP_static_sky_C_GetSkeletalMesh::SkeletalMesh' has a wrong offset!");

}

