#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SequencerParticle

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SequencerParticle.BP_SequencerParticle_C.ExecuteUbergraph_BP_SequencerParticle
// 0x0030 (0x0030 - 0x0000)
struct BP_SequencerParticle_C_ExecuteUbergraph_BP_SequencerParticle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_452E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AActor*                                 CallFunc_SetupAttachParentWithSub_Parent;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_452F[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SequencerParticle_C_ExecuteUbergraph_BP_SequencerParticle) == 0x000008, "Wrong alignment on BP_SequencerParticle_C_ExecuteUbergraph_BP_SequencerParticle");
static_assert(sizeof(BP_SequencerParticle_C_ExecuteUbergraph_BP_SequencerParticle) == 0x000030, "Wrong size on BP_SequencerParticle_C_ExecuteUbergraph_BP_SequencerParticle");
static_assert(offsetof(BP_SequencerParticle_C_ExecuteUbergraph_BP_SequencerParticle, EntryPoint) == 0x000000, "Member 'BP_SequencerParticle_C_ExecuteUbergraph_BP_SequencerParticle::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_ExecuteUbergraph_BP_SequencerParticle, K2Node_MakeArray_Array) == 0x000008, "Member 'BP_SequencerParticle_C_ExecuteUbergraph_BP_SequencerParticle::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_ExecuteUbergraph_BP_SequencerParticle, CallFunc_SetupAttachParentWithSub_Parent) == 0x000018, "Member 'BP_SequencerParticle_C_ExecuteUbergraph_BP_SequencerParticle::CallFunc_SetupAttachParentWithSub_Parent' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_ExecuteUbergraph_BP_SequencerParticle, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_SequencerParticle_C_ExecuteUbergraph_BP_SequencerParticle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_ExecuteUbergraph_BP_SequencerParticle, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'BP_SequencerParticle_C_ExecuteUbergraph_BP_SequencerParticle::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_ExecuteUbergraph_BP_SequencerParticle, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'BP_SequencerParticle_C_ExecuteUbergraph_BP_SequencerParticle::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_ExecuteUbergraph_BP_SequencerParticle, CallFunc_IsValid_ReturnValue_2) == 0x000028, "Member 'BP_SequencerParticle_C_ExecuteUbergraph_BP_SequencerParticle::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function BP_SequencerParticle.BP_SequencerParticle_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SequencerParticle_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SequencerParticle_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SequencerParticle_C_ReceiveTick");
static_assert(sizeof(BP_SequencerParticle_C_ReceiveTick) == 0x000004, "Wrong size on BP_SequencerParticle_C_ReceiveTick");
static_assert(offsetof(BP_SequencerParticle_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SequencerParticle_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_SequencerParticle.BP_SequencerParticle_C.UpdateDilation
// 0x0050 (0x0050 - 0x0000)
struct BP_SequencerParticle_C_UpdateDilation final
{
public:
	class ARSCharacterBase*                       Player;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BaseDilation;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue_1;      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4530[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4531[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetActorTimeDilation_ReturnValue;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4532[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetActorTimeDilation_ReturnValue_1;       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SequencerParticle_C_UpdateDilation) == 0x000008, "Wrong alignment on BP_SequencerParticle_C_UpdateDilation");
static_assert(sizeof(BP_SequencerParticle_C_UpdateDilation) == 0x000050, "Wrong size on BP_SequencerParticle_C_UpdateDilation");
static_assert(offsetof(BP_SequencerParticle_C_UpdateDilation, Player) == 0x000000, "Member 'BP_SequencerParticle_C_UpdateDilation::Player' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_UpdateDilation, BaseDilation) == 0x000008, "Member 'BP_SequencerParticle_C_UpdateDilation::BaseDilation' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_UpdateDilation, CallFunc_GetGlobalTimeDilation_ReturnValue) == 0x00000C, "Member 'BP_SequencerParticle_C_UpdateDilation::CallFunc_GetGlobalTimeDilation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_UpdateDilation, CallFunc_GetGlobalTimeDilation_ReturnValue_1) == 0x000010, "Member 'BP_SequencerParticle_C_UpdateDilation::CallFunc_GetGlobalTimeDilation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_UpdateDilation, CallFunc_GetAttachParentActor_ReturnValue) == 0x000018, "Member 'BP_SequencerParticle_C_UpdateDilation::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_UpdateDilation, CallFunc_GetPlayerManager_PlayerManager) == 0x000020, "Member 'BP_SequencerParticle_C_UpdateDilation::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_UpdateDilation, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_SequencerParticle_C_UpdateDilation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_UpdateDilation, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'BP_SequencerParticle_C_UpdateDilation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_UpdateDilation, CallFunc_GetPlayer_ReturnValue) == 0x000030, "Member 'BP_SequencerParticle_C_UpdateDilation::CallFunc_GetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_UpdateDilation, CallFunc_GetActorTimeDilation_ReturnValue) == 0x000038, "Member 'BP_SequencerParticle_C_UpdateDilation::CallFunc_GetActorTimeDilation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_UpdateDilation, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00003C, "Member 'BP_SequencerParticle_C_UpdateDilation::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_UpdateDilation, K2Node_SwitchEnum_CmpSuccess) == 0x000040, "Member 'BP_SequencerParticle_C_UpdateDilation::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_UpdateDilation, CallFunc_IsValid_ReturnValue_2) == 0x000041, "Member 'BP_SequencerParticle_C_UpdateDilation::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_UpdateDilation, CallFunc_GetActorTimeDilation_ReturnValue_1) == 0x000044, "Member 'BP_SequencerParticle_C_UpdateDilation::CallFunc_GetActorTimeDilation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_UpdateDilation, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000048, "Member 'BP_SequencerParticle_C_UpdateDilation::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_UpdateDilation, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00004C, "Member 'BP_SequencerParticle_C_UpdateDilation::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_SequencerParticle.BP_SequencerParticle_C.UpdateStageParam
// 0x0020 (0x0020 - 0x0000)
struct BP_SequencerParticle_C_UpdateStageParam final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4533[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ParticleManager_C*                  CallFunc_GetParticleManager_Particle_Manager;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseStageSetting_Native_ReturnValue;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetupStageParam_IsSetup;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SequencerParticle_C_UpdateStageParam) == 0x000008, "Wrong alignment on BP_SequencerParticle_C_UpdateStageParam");
static_assert(sizeof(BP_SequencerParticle_C_UpdateStageParam) == 0x000020, "Wrong size on BP_SequencerParticle_C_UpdateStageParam");
static_assert(offsetof(BP_SequencerParticle_C_UpdateStageParam, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'BP_SequencerParticle_C_UpdateStageParam::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_UpdateStageParam, CallFunc_IsActive_ReturnValue) == 0x00000C, "Member 'BP_SequencerParticle_C_UpdateStageParam::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_UpdateStageParam, CallFunc_GetParticleManager_Particle_Manager) == 0x000010, "Member 'BP_SequencerParticle_C_UpdateStageParam::CallFunc_GetParticleManager_Particle_Manager' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_UpdateStageParam, CallFunc_UseStageSetting_Native_ReturnValue) == 0x000018, "Member 'BP_SequencerParticle_C_UpdateStageParam::CallFunc_UseStageSetting_Native_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_UpdateStageParam, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BP_SequencerParticle_C_UpdateStageParam::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerParticle_C_UpdateStageParam, CallFunc_SetupStageParam_IsSetup) == 0x00001A, "Member 'BP_SequencerParticle_C_UpdateStageParam::CallFunc_SetupStageParam_IsSetup' has a wrong offset!");

}

