#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SequencerMovieManagerController

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SequencerMovieManagerController.BP_SequencerMovieManagerController_C.ExecuteUbergraph_BP_SequencerMovieManagerController
// 0x0070 (0x0070 - 0x0000)
struct BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31F3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UManaTexture*                           CallFunc_GetMovieTexture_MovieTexture;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31F4[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_MovieTextureIndex;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MovieManager_C*                     CallFunc_GetMovieManager_AsBP_Movie_Manager;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31F5[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UManaTexture*                           CallFunc_GetMovieTexture_MovieTexture_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31F6[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MovieManager_C*                     CallFunc_GetMovieManager_AsBP_Movie_Manager_1;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31F7[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MovieManager_C*                     CallFunc_GetMovieManager_AsBP_Movie_Manager_2;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31F8[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31F9[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UManaTexture*                           CallFunc_GetManaTextureNative_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController) == 0x000008, "Wrong alignment on BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController");
static_assert(sizeof(BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController) == 0x000070, "Wrong size on BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController");
static_assert(offsetof(BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController, EntryPoint) == 0x000000, "Member 'BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController, CallFunc_GetMovieTexture_MovieTexture) == 0x000008, "Member 'BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController::CallFunc_GetMovieTexture_MovieTexture' has a wrong offset!");
static_assert(offsetof(BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController, K2Node_CustomEvent_MovieTextureIndex) == 0x000014, "Member 'BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController::K2Node_CustomEvent_MovieTextureIndex' has a wrong offset!");
static_assert(offsetof(BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController, CallFunc_GetMovieManager_AsBP_Movie_Manager) == 0x000018, "Member 'BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController::CallFunc_GetMovieManager_AsBP_Movie_Manager' has a wrong offset!");
static_assert(offsetof(BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000020, "Member 'BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController, CallFunc_GetMovieTexture_MovieTexture_1) == 0x000028, "Member 'BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController::CallFunc_GetMovieTexture_MovieTexture_1' has a wrong offset!");
static_assert(offsetof(BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController, CallFunc_IsValid_ReturnValue_2) == 0x000030, "Member 'BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController, CallFunc_GetMovieManager_AsBP_Movie_Manager_1) == 0x000038, "Member 'BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController::CallFunc_GetMovieManager_AsBP_Movie_Manager_1' has a wrong offset!");
static_assert(offsetof(BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController, CallFunc_IsValid_ReturnValue_3) == 0x000040, "Member 'BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController, CallFunc_GetMovieManager_AsBP_Movie_Manager_2) == 0x000048, "Member 'BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController::CallFunc_GetMovieManager_AsBP_Movie_Manager_2' has a wrong offset!");
static_assert(offsetof(BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController, CallFunc_IsValid_ReturnValue_4) == 0x000050, "Member 'BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController, K2Node_Event_EndPlayReason) == 0x000051, "Member 'BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController, K2Node_Event_DeltaSeconds) == 0x000054, "Member 'BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController, CallFunc_IsValid_ReturnValue_5) == 0x000058, "Member 'BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController, CallFunc_GetManaTextureNative_ReturnValue) == 0x000060, "Member 'BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController::CallFunc_GetManaTextureNative_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000068, "Member 'BP_SequencerMovieManagerController_C_ExecuteUbergraph_BP_SequencerMovieManagerController::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_SequencerMovieManagerController.BP_SequencerMovieManagerController_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SequencerMovieManagerController_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SequencerMovieManagerController_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SequencerMovieManagerController_C_ReceiveTick");
static_assert(sizeof(BP_SequencerMovieManagerController_C_ReceiveTick) == 0x000004, "Wrong size on BP_SequencerMovieManagerController_C_ReceiveTick");
static_assert(offsetof(BP_SequencerMovieManagerController_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SequencerMovieManagerController_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_SequencerMovieManagerController.BP_SequencerMovieManagerController_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_SequencerMovieManagerController_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SequencerMovieManagerController_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_SequencerMovieManagerController_C_ReceiveEndPlay");
static_assert(sizeof(BP_SequencerMovieManagerController_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_SequencerMovieManagerController_C_ReceiveEndPlay");
static_assert(offsetof(BP_SequencerMovieManagerController_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_SequencerMovieManagerController_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_SequencerMovieManagerController.BP_SequencerMovieManagerController_C.EventPlayMovie
// 0x0004 (0x0004 - 0x0000)
struct BP_SequencerMovieManagerController_C_EventPlayMovie final
{
public:
	int32                                         MovieTextureIndex;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SequencerMovieManagerController_C_EventPlayMovie) == 0x000004, "Wrong alignment on BP_SequencerMovieManagerController_C_EventPlayMovie");
static_assert(sizeof(BP_SequencerMovieManagerController_C_EventPlayMovie) == 0x000004, "Wrong size on BP_SequencerMovieManagerController_C_EventPlayMovie");
static_assert(offsetof(BP_SequencerMovieManagerController_C_EventPlayMovie, MovieTextureIndex) == 0x000000, "Member 'BP_SequencerMovieManagerController_C_EventPlayMovie::MovieTextureIndex' has a wrong offset!");

// Function BP_SequencerMovieManagerController.BP_SequencerMovieManagerController_C.GetMovieTexture
// 0x0020 (0x0020 - 0x0000)
struct BP_SequencerMovieManagerController_C_GetMovieTexture final
{
public:
	int32                                         MovieTextureIndex;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31FA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UManaTexture*                           MovieTexture;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManaTexture*                           CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SequencerMovieManagerController_C_GetMovieTexture) == 0x000008, "Wrong alignment on BP_SequencerMovieManagerController_C_GetMovieTexture");
static_assert(sizeof(BP_SequencerMovieManagerController_C_GetMovieTexture) == 0x000020, "Wrong size on BP_SequencerMovieManagerController_C_GetMovieTexture");
static_assert(offsetof(BP_SequencerMovieManagerController_C_GetMovieTexture, MovieTextureIndex) == 0x000000, "Member 'BP_SequencerMovieManagerController_C_GetMovieTexture::MovieTextureIndex' has a wrong offset!");
static_assert(offsetof(BP_SequencerMovieManagerController_C_GetMovieTexture, MovieTexture) == 0x000008, "Member 'BP_SequencerMovieManagerController_C_GetMovieTexture::MovieTexture' has a wrong offset!");
static_assert(offsetof(BP_SequencerMovieManagerController_C_GetMovieTexture, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_SequencerMovieManagerController_C_GetMovieTexture::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SequencerMovieManagerController_C_GetMovieTexture, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_SequencerMovieManagerController_C_GetMovieTexture::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerMovieManagerController_C_GetMovieTexture, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'BP_SequencerMovieManagerController_C_GetMovieTexture::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

