#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SplineMesh

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SplineMesh.BP_SplineMesh_C.ExecuteUbergraph_BP_SplineMesh
// 0x0004 (0x0004 - 0x0000)
struct BP_SplineMesh_C_ExecuteUbergraph_BP_SplineMesh final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineMesh_C_ExecuteUbergraph_BP_SplineMesh) == 0x000004, "Wrong alignment on BP_SplineMesh_C_ExecuteUbergraph_BP_SplineMesh");
static_assert(sizeof(BP_SplineMesh_C_ExecuteUbergraph_BP_SplineMesh) == 0x000004, "Wrong size on BP_SplineMesh_C_ExecuteUbergraph_BP_SplineMesh");
static_assert(offsetof(BP_SplineMesh_C_ExecuteUbergraph_BP_SplineMesh, EntryPoint) == 0x000000, "Member 'BP_SplineMesh_C_ExecuteUbergraph_BP_SplineMesh::EntryPoint' has a wrong offset!");

// Function BP_SplineMesh.BP_SplineMesh_C.UserConstructionScript
// 0x03F0 (0x03F0 - 0x0000)
struct BP_SplineMesh_C_UserConstructionScript final
{
public:
	int32                                         SplinePoints;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8785[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        RestoreSplinePointsLocation;                       // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FRotator>                       TmpSplinePointsRotation;                           // 0x0018(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class ABP_SplineMesh_Simple_C*                TargetSplineComponent;                             // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             MaterialArray;                                     // 0x0030(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class USplineComponent*                       TargetSpline;                                      // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LoopLastIndex;                                     // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8786[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8787[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8788[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplineMeshAxis                               Temp_byte_Variable;                                // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8789[0x2];                                     // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_1;                              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_878A[0x2];                                     // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_878B[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_878C[0xC];                                     // 0x00D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x00E0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class URSSplineMeshComponent*                 CallFunc_AddComponent_ReturnValue;                 // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_1;   // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_2;   // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_878D[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             K2Node_MakeArray_Array;                            // 0x0178(0x0010)(ReferenceParm, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_878E[0x4];                                     // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineComponent*                       CallFunc_GetTargetSplineComponent_TargetComponent; // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTargetSplineComponent_UseParentSpline; // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_878F[0x3];                                     // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_3;   // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8790[0x3];                                     // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CalcSplineBound_BoxCenter;                // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CalcSplineBound_BoxExtent;                // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CalcSplineBound_BoxMin;                   // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CalcSplineBound_BoxMax;                   // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8791[0x3];                                     // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x01EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8792[0x3];                                     // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x01FC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0284(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMod_Remainder;                           // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FMod_ReturnValue;                         // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRollAtDistanceAlongSpline_ReturnValue; // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegreesToRadians_ReturnValue;             // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue; // 0x0324(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0334(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRollAtDistanceAlongSpline_ReturnValue_1; // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue_1; // 0x0344(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegreesToRadians_ReturnValue_1;           // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0354(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0360(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1; // 0x036C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0378(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0384(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8793[0x3];                                     // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_1;                           // 0x0394(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_2;                      // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8794[0x3];                                     // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBoxSphereBounds                       CallFunc_GetBounds_ReturnValue;                    // 0x03A8(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x03C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineMesh_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_SplineMesh_C_UserConstructionScript");
static_assert(sizeof(BP_SplineMesh_C_UserConstructionScript) == 0x0003F0, "Wrong size on BP_SplineMesh_C_UserConstructionScript");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, SplinePoints) == 0x000000, "Member 'BP_SplineMesh_C_UserConstructionScript::SplinePoints' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, RestoreSplinePointsLocation) == 0x000008, "Member 'BP_SplineMesh_C_UserConstructionScript::RestoreSplinePointsLocation' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, TmpSplinePointsRotation) == 0x000018, "Member 'BP_SplineMesh_C_UserConstructionScript::TmpSplinePointsRotation' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, TargetSplineComponent) == 0x000028, "Member 'BP_SplineMesh_C_UserConstructionScript::TargetSplineComponent' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, MaterialArray) == 0x000030, "Member 'BP_SplineMesh_C_UserConstructionScript::MaterialArray' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, TargetSpline) == 0x000040, "Member 'BP_SplineMesh_C_UserConstructionScript::TargetSpline' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, LoopLastIndex) == 0x000048, "Member 'BP_SplineMesh_C_UserConstructionScript::LoopLastIndex' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, Size) == 0x00004C, "Member 'BP_SplineMesh_C_UserConstructionScript::Size' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, Temp_int_Loop_Num_Variable) == 0x000050, "Member 'BP_SplineMesh_C_UserConstructionScript::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, Temp_int_Variable) == 0x000054, "Member 'BP_SplineMesh_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x000058, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000060, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x000064, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, Temp_name_Variable) == 0x000068, "Member 'BP_SplineMesh_C_UserConstructionScript::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000070, "Member 'BP_SplineMesh_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000074, "Member 'BP_SplineMesh_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_2) == 0x000078, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, Temp_int_Array_Index_Variable_1) == 0x00007C, "Member 'BP_SplineMesh_C_UserConstructionScript::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, Temp_int_Loop_Num_Variable_1) == 0x000080, "Member 'BP_SplineMesh_C_UserConstructionScript::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, Temp_int_Variable_1) == 0x000088, "Member 'BP_SplineMesh_C_UserConstructionScript::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_3) == 0x00008C, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Greater_IntInt_ReturnValue) == 0x000094, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_4) == 0x000098, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, Temp_byte_Variable) == 0x00009C, "Member 'BP_SplineMesh_C_UserConstructionScript::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x00009D, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, Temp_name_Variable_1) == 0x0000A0, "Member 'BP_SplineMesh_C_UserConstructionScript::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, Temp_bool_Variable) == 0x0000A8, "Member 'BP_SplineMesh_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000A9, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Conv_BoolToInt_ReturnValue) == 0x0000AC, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, Temp_int_Loop_Counter_Variable_1) == 0x0000B0, "Member 'BP_SplineMesh_C_UserConstructionScript::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B4, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_5) == 0x0000B8, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, Temp_int_Loop_Counter_Variable_2) == 0x0000BC, "Member 'BP_SplineMesh_C_UserConstructionScript::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_6) == 0x0000C0, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_1) == 0x0000C4, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, Temp_name_Variable_2) == 0x0000C8, "Member 'BP_SplineMesh_C_UserConstructionScript::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000D0, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, Temp_struct_Variable) == 0x0000E0, "Member 'BP_SplineMesh_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000110, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Array_LastIndex_ReturnValue) == 0x000118, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue) == 0x00011C, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000120, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_GetLocationAtSplinePoint_ReturnValue_1) == 0x00012C, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_GetLocationAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_FindLookAtRotation_ReturnValue) == 0x000138, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue_1) == 0x000144, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x000148, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_2) == 0x000154, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_GetLocationAtSplinePoint_ReturnValue_2) == 0x000158, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_GetLocationAtSplinePoint_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue) == 0x000164, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000170, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000178, "Member 'BP_SplineMesh_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_GetSplineLength_ReturnValue) == 0x000188, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_GetTargetSplineComponent_TargetComponent) == 0x000190, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_GetTargetSplineComponent_TargetComponent' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_GetTargetSplineComponent_UseParentSpline) == 0x000198, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_GetTargetSplineComponent_UseParentSpline' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, Temp_int_Variable_2) == 0x00019C, "Member 'BP_SplineMesh_C_UserConstructionScript::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_GetLocationAtSplinePoint_ReturnValue_3) == 0x0001A0, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_GetLocationAtSplinePoint_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue_2) == 0x0001AC, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x0001B0, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_7) == 0x0001B4, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_CalcSplineBound_BoxCenter) == 0x0001B8, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_CalcSplineBound_BoxCenter' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_CalcSplineBound_BoxExtent) == 0x0001C4, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_CalcSplineBound_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_CalcSplineBound_BoxMin) == 0x0001D0, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_CalcSplineBound_BoxMin' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_CalcSplineBound_BoxMax) == 0x0001DC, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_CalcSplineBound_BoxMax' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, Temp_bool_Variable_1) == 0x0001E8, "Member 'BP_SplineMesh_C_UserConstructionScript::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, K2Node_Select_Default) == 0x0001EC, "Member 'BP_SplineMesh_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0001F4, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_3) == 0x0001F8, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0001FC, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000284, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00030C, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_FMod_Remainder) == 0x000310, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_FMod_Remainder' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_FMod_ReturnValue) == 0x000314, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_FMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_GetRollAtDistanceAlongSpline_ReturnValue) == 0x000318, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_GetRollAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x00031C, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_DegreesToRadians_ReturnValue) == 0x000320, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_DegreesToRadians_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue) == 0x000324, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue) == 0x000330, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000334, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_GetRollAtDistanceAlongSpline_ReturnValue_1) == 0x000340, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_GetRollAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue_1) == 0x000344, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_DegreesToRadians_ReturnValue_1) == 0x000350, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_DegreesToRadians_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000354, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000360, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1) == 0x00036C, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000378, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000384, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000390, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, K2Node_Select_Default_1) == 0x000394, "Member 'BP_SplineMesh_C_UserConstructionScript::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, Temp_int_Loop_Num_Variable_2) == 0x00039C, "Member 'BP_SplineMesh_C_UserConstructionScript::Temp_int_Loop_Num_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue_2) == 0x0003A0, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, Temp_int_Array_Index_Variable_2) == 0x0003A4, "Member 'BP_SplineMesh_C_UserConstructionScript::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_GetBounds_ReturnValue) == 0x0003A8, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_GetBounds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0003C4, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x0003D0, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x0003D4, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x0003D8, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, K2Node_Select_Default_2) == 0x0003DC, "Member 'BP_SplineMesh_C_UserConstructionScript::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0003E0, "Member 'BP_SplineMesh_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function BP_SplineMesh.BP_SplineMesh_C.SetCollisionEnable
// 0x0060 (0x0060 - 0x0000)
struct BP_SplineMesh_C_SetCollisionEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8795[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8796[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8797[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_3;                              // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_1;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_2;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SplineMesh_C_SetCollisionEnable) == 0x000008, "Wrong alignment on BP_SplineMesh_C_SetCollisionEnable");
static_assert(sizeof(BP_SplineMesh_C_SetCollisionEnable) == 0x000060, "Wrong size on BP_SplineMesh_C_SetCollisionEnable");
static_assert(offsetof(BP_SplineMesh_C_SetCollisionEnable, Enable) == 0x000000, "Member 'BP_SplineMesh_C_SetCollisionEnable::Enable' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_SetCollisionEnable, Temp_bool_Variable) == 0x000001, "Member 'BP_SplineMesh_C_SetCollisionEnable::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMesh_C_SetCollisionEnable, Temp_name_Variable) == 0x000004, "Member 'BP_SplineMesh_C_SetCollisionEnable::Temp_name_Variable' has a wrong offset!");
