#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SASCableEnergyMesh

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SASCableEnergyMesh.BP_SASCableEnergyMesh_C
// 0x0070 (0x02A0 - 0x0230)
class ABP_SASCableEnergyMesh_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_RSParticleSystemComponent_C*        BP_RSParticleSystemComponent;                      // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartLocation;                                     // 0x0250(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dissolve;                                          // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          StartMesh;                                         // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          GetStartLocation;                                  // 0x0261(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48B3[0x2];                                     // 0x0262(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ParentCalbeSize;                                   // 0x0264(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EnergyCalbeSize;                                   // 0x0268(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   CableParentSocket;                                 // 0x026C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48B4[0x4];                                     // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CableBase_C*                        ParentCable;                                       // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ParentDissolve;                                    // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	int32                                         DelayedVisible;                                    // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RequestParticleEmit;                               // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          RequestMeshDisp;                                   // 0x0289(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48B5[0x2];                                     // 0x028A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               StartRotation;                                     // 0x028C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ParentAnimationOffset;                             // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SASCableEnergyMesh(int32 EntryPoint);
	void SetStopDilation(float Dilation);
	void ReceiveTick(float DeltaSeconds);
	void StartEnergy(class ABP_CableBase_C* TargetCable);
	void PrivateUpdate();
	void DetachEnergy();
	void SetVisible();
	void SetErase();
	void EmitParticle();
	void SetDissolve(float Param_Dissolve);
	void SetParentDissolve(float Param_Dissolve);
	void SetVisibleDelayed();
	void PrivateUpdateDelayedVisible();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SASCableEnergyMesh_C">();
	}
	static class ABP_SASCableEnergyMesh_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SASCableEnergyMesh_C>();
	}
};
static_assert(alignof(ABP_SASCableEnergyMesh_C) == 0x000008, "Wrong alignment on ABP_SASCableEnergyMesh_C");
static_assert(sizeof(ABP_SASCableEnergyMesh_C) == 0x0002A0, "Wrong size on ABP_SASCableEnergyMesh_C");
static_assert(offsetof(ABP_SASCableEnergyMesh_C, UberGraphFrame) == 0x000230, "Member 'ABP_SASCableEnergyMesh_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SASCableEnergyMesh_C, BP_RSParticleSystemComponent) == 0x000238, "Member 'ABP_SASCableEnergyMesh_C::BP_RSParticleSystemComponent' has a wrong offset!");
static_assert(offsetof(ABP_SASCableEnergyMesh_C, StaticMesh) == 0x000240, "Member 'ABP_SASCableEnergyMesh_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_SASCableEnergyMesh_C, DefaultSceneRoot) == 0x000248, "Member 'ABP_SASCableEnergyMesh_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_SASCableEnergyMesh_C, StartLocation) == 0x000250, "Member 'ABP_SASCableEnergyMesh_C::StartLocation' has a wrong offset!");
static_assert(offsetof(ABP_SASCableEnergyMesh_C, Dissolve) == 0x00025C, "Member 'ABP_SASCableEnergyMesh_C::Dissolve' has a wrong offset!");
static_assert(offsetof(ABP_SASCableEnergyMesh_C, StartMesh) == 0x000260, "Member 'ABP_SASCableEnergyMesh_C::StartMesh' has a wrong offset!");
static_assert(offsetof(ABP_SASCableEnergyMesh_C, GetStartLocation) == 0x000261, "Member 'ABP_SASCableEnergyMesh_C::GetStartLocation' has a wrong offset!");
static_assert(offsetof(ABP_SASCableEnergyMesh_C, ParentCalbeSize) == 0x000264, "Member 'ABP_SASCableEnergyMesh_C::ParentCalbeSize' has a wrong offset!");
static_assert(offsetof(ABP_SASCableEnergyMesh_C, EnergyCalbeSize) == 0x000268, "Member 'ABP_SASCableEnergyMesh_C::EnergyCalbeSize' has a wrong offset!");
static_assert(offsetof(ABP_SASCableEnergyMesh_C, CableParentSocket) == 0x00026C, "Member 'ABP_SASCableEnergyMesh_C::CableParentSocket' has a wrong offset!");
static_assert(offsetof(ABP_SASCableEnergyMesh_C, ParentCable) == 0x000278, "Member 'ABP_SASCableEnergyMesh_C::ParentCable' has a wrong offset!");
static_assert(offsetof(ABP_SASCableEnergyMesh_C, ParentDissolve) == 0x000280, "Member 'ABP_SASCableEnergyMesh_C::ParentDissolve' has a wrong offset!");
static_assert(offsetof(ABP_SASCableEnergyMesh_C, DelayedVisible) == 0x000284, "Member 'ABP_SASCableEnergyMesh_C::DelayedVisible' has a wrong offset!");
static_assert(offsetof(ABP_SASCableEnergyMesh_C, RequestParticleEmit) == 0x000288, "Member 'ABP_SASCableEnergyMesh_C::RequestParticleEmit' has a wrong offset!");
static_assert(offsetof(ABP_SASCableEnergyMesh_C, RequestMeshDisp) == 0x000289, "Member 'ABP_SASCableEnergyMesh_C::RequestMeshDisp' has a wrong offset!");
static_assert(offsetof(ABP_SASCableEnergyMesh_C, StartRotation) == 0x00028C, "Member 'ABP_SASCableEnergyMesh_C::StartRotation' has a wrong offset!");
static_assert(offsetof(ABP_SASCableEnergyMesh_C, ParentAnimationOffset) == 0x000298, "Member 'ABP_SASCableEnergyMesh_C::ParentAnimationOffset' has a wrong offset!");

}

