#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SASTelepoComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SASTelepoComponent.BP_SASTelepoComponent_C.ExecuteUbergraph_BP_SASTelepoComponent
// 0x0028 (0x0028 - 0x0000)
struct BP_SASTelepoComponent_C_ExecuteUbergraph_BP_SASTelepoComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81D7[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81D8[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SASTelepoComponent_C_ExecuteUbergraph_BP_SASTelepoComponent) == 0x000008, "Wrong alignment on BP_SASTelepoComponent_C_ExecuteUbergraph_BP_SASTelepoComponent");
static_assert(sizeof(BP_SASTelepoComponent_C_ExecuteUbergraph_BP_SASTelepoComponent) == 0x000028, "Wrong size on BP_SASTelepoComponent_C_ExecuteUbergraph_BP_SASTelepoComponent");
static_assert(offsetof(BP_SASTelepoComponent_C_ExecuteUbergraph_BP_SASTelepoComponent, EntryPoint) == 0x000000, "Member 'BP_SASTelepoComponent_C_ExecuteUbergraph_BP_SASTelepoComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_ExecuteUbergraph_BP_SASTelepoComponent, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_SASTelepoComponent_C_ExecuteUbergraph_BP_SASTelepoComponent::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_ExecuteUbergraph_BP_SASTelepoComponent, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'BP_SASTelepoComponent_C_ExecuteUbergraph_BP_SASTelepoComponent::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_ExecuteUbergraph_BP_SASTelepoComponent, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_SASTelepoComponent_C_ExecuteUbergraph_BP_SASTelepoComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_ExecuteUbergraph_BP_SASTelepoComponent, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_SASTelepoComponent_C_ExecuteUbergraph_BP_SASTelepoComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_ExecuteUbergraph_BP_SASTelepoComponent, K2Node_DynamicCast_AsRSBattle_Player) == 0x000018, "Member 'BP_SASTelepoComponent_C_ExecuteUbergraph_BP_SASTelepoComponent::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_ExecuteUbergraph_BP_SASTelepoComponent, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_SASTelepoComponent_C_ExecuteUbergraph_BP_SASTelepoComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_SASTelepoComponent.BP_SASTelepoComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SASTelepoComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASTelepoComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SASTelepoComponent_C_ReceiveTick");
static_assert(sizeof(BP_SASTelepoComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_SASTelepoComponent_C_ReceiveTick");
static_assert(offsetof(BP_SASTelepoComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SASTelepoComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_SASTelepoComponent.BP_SASTelepoComponent_C.Begin
// 0x00A0 (0x00A0 - 0x0000)
struct BP_SASTelepoComponent_C_Begin final
{
public:
	bool                                          LocationTelepo;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81D9[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TargetDistance;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DisappearTime;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81DA[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        DisappearParticle;                                 // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        DisappearParticleSecond;                           // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketNameSecond;                                  // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Param_TelepoParticle;                              // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketNameTelepo;                                  // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOnlyWeapon;                                       // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bNoCollision;                                      // 0x0041(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Param_bLocationTargetHeight;                       // 0x0042(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bBegin;                                            // 0x0043(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LbBegin;                                           // 0x0044(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81DB[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetHideSASOutline_bDummy;                 // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsControlAI_bAI;                          // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInvalidDamage_Dummy;                   // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetShadowEnable_bDummy;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81DC[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81DD[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSParticleSystemComponentBase*         CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81DE[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsControlAI_bAI_1;                        // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SASTelepoComponent_C_Begin) == 0x000008, "Wrong alignment on BP_SASTelepoComponent_C_Begin");
static_assert(sizeof(BP_SASTelepoComponent_C_Begin) == 0x0000A0, "Wrong size on BP_SASTelepoComponent_C_Begin");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, LocationTelepo) == 0x000000, "Member 'BP_SASTelepoComponent_C_Begin::LocationTelepo' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, TargetDistance) == 0x000004, "Member 'BP_SASTelepoComponent_C_Begin::TargetDistance' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, DisappearTime) == 0x000008, "Member 'BP_SASTelepoComponent_C_Begin::DisappearTime' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, DisappearParticle) == 0x000010, "Member 'BP_SASTelepoComponent_C_Begin::DisappearParticle' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, SocketName) == 0x000018, "Member 'BP_SASTelepoComponent_C_Begin::SocketName' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, DisappearParticleSecond) == 0x000020, "Member 'BP_SASTelepoComponent_C_Begin::DisappearParticleSecond' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, SocketNameSecond) == 0x000028, "Member 'BP_SASTelepoComponent_C_Begin::SocketNameSecond' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, Param_TelepoParticle) == 0x000030, "Member 'BP_SASTelepoComponent_C_Begin::Param_TelepoParticle' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, SocketNameTelepo) == 0x000038, "Member 'BP_SASTelepoComponent_C_Begin::SocketNameTelepo' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, bOnlyWeapon) == 0x000040, "Member 'BP_SASTelepoComponent_C_Begin::bOnlyWeapon' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, bNoCollision) == 0x000041, "Member 'BP_SASTelepoComponent_C_Begin::bNoCollision' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, Param_bLocationTargetHeight) == 0x000042, "Member 'BP_SASTelepoComponent_C_Begin::Param_bLocationTargetHeight' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, bBegin) == 0x000043, "Member 'BP_SASTelepoComponent_C_Begin::bBegin' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, LbBegin) == 0x000044, "Member 'BP_SASTelepoComponent_C_Begin::LbBegin' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'BP_SASTelepoComponent_C_Begin::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, CallFunc_SetHideSASOutline_bDummy) == 0x000054, "Member 'BP_SASTelepoComponent_C_Begin::CallFunc_SetHideSASOutline_bDummy' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, CallFunc_IsControlAI_bAI) == 0x000055, "Member 'BP_SASTelepoComponent_C_Begin::CallFunc_IsControlAI_bAI' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, CallFunc_BooleanOR_ReturnValue) == 0x000056, "Member 'BP_SASTelepoComponent_C_Begin::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, CallFunc_SetInvalidDamage_Dummy) == 0x000057, "Member 'BP_SASTelepoComponent_C_Begin::CallFunc_SetInvalidDamage_Dummy' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, CallFunc_SetShadowEnable_bDummy) == 0x000058, "Member 'BP_SASTelepoComponent_C_Begin::CallFunc_SetShadowEnable_bDummy' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, CallFunc_GetSocketLocation_ReturnValue) == 0x00005C, "Member 'BP_SASTelepoComponent_C_Begin::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'BP_SASTelepoComponent_C_Begin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, CallFunc_GetSocketLocation_ReturnValue_1) == 0x00006C, "Member 'BP_SASTelepoComponent_C_Begin::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000078, "Member 'BP_SASTelepoComponent_C_Begin::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'BP_SASTelepoComponent_C_Begin::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, CallFunc_SpawnEmitterAtLocation_ReturnValue_1) == 0x000088, "Member 'BP_SASTelepoComponent_C_Begin::CallFunc_SpawnEmitterAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, CallFunc_GetSocketLocation_ReturnValue_2) == 0x000090, "Member 'BP_SASTelepoComponent_C_Begin::CallFunc_GetSocketLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Begin, CallFunc_IsControlAI_bAI_1) == 0x00009C, "Member 'BP_SASTelepoComponent_C_Begin::CallFunc_IsControlAI_bAI_1' has a wrong offset!");

// Function BP_SASTelepoComponent.BP_SASTelepoComponent_C.End
// 0x0120 (0x0120 - 0x0000)
struct BP_SASTelepoComponent_C_End final
{
public:
	float                                         AppearTime;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81DF[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        AppearParticle;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        AppearParticleSecond;                              // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketNameSecond;                                  // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNoDirection;                                      // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81E0[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        TelepoParticleIn;                                  // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketNameTelepo;                                  // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnd;                                              // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81E1[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 LTelepoAngle;                                      // 0x0048(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          LbEnd;                                             // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetShadowEnable_bDummy;                   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81E2[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_IsEnemyPlayer_self_CastInput;             // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemyPlayer_bEnemyPlayer;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStealth_return;                         // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81E3[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array_1;                          // 0x0088(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsControlAI_bAI;                          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetHideSASOutline_bDummy;                 // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81E4[0x1];                                     // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81E5[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81E6[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81E7[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetInvalidDamage_Dummy;                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81E8[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IEventInterface>       CallFunc_EventPhysicsIdling_self_CastInput;        // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsControlAI_bAI_1;                        // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81E9[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetCurrentTargetActor_TargetActor;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetPlayerHidden_bDummy;                   // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnable_ReturnValue;                     // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81EA[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         CallFunc_SpawnEmitterAtLocation_ReturnValue_2;     // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WarpToTargetActor_bSuccess;               // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SASTelepoComponent_C_End) == 0x000008, "Wrong alignment on BP_SASTelepoComponent_C_End");
static_assert(sizeof(BP_SASTelepoComponent_C_End) == 0x000120, "Wrong size on BP_SASTelepoComponent_C_End");
static_assert(offsetof(BP_SASTelepoComponent_C_End, AppearTime) == 0x000000, "Member 'BP_SASTelepoComponent_C_End::AppearTime' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, AppearParticle) == 0x000008, "Member 'BP_SASTelepoComponent_C_End::AppearParticle' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, SocketName) == 0x000010, "Member 'BP_SASTelepoComponent_C_End::SocketName' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, AppearParticleSecond) == 0x000018, "Member 'BP_SASTelepoComponent_C_End::AppearParticleSecond' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, SocketNameSecond) == 0x000020, "Member 'BP_SASTelepoComponent_C_End::SocketNameSecond' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, bNoDirection) == 0x000028, "Member 'BP_SASTelepoComponent_C_End::bNoDirection' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, TelepoParticleIn) == 0x000030, "Member 'BP_SASTelepoComponent_C_End::TelepoParticleIn' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, SocketNameTelepo) == 0x000038, "Member 'BP_SASTelepoComponent_C_End::SocketNameTelepo' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, bEnd) == 0x000040, "Member 'BP_SASTelepoComponent_C_End::bEnd' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, LTelepoAngle) == 0x000048, "Member 'BP_SASTelepoComponent_C_End::LTelepoAngle' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, LbEnd) == 0x000058, "Member 'BP_SASTelepoComponent_C_End::LbEnd' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, CallFunc_SetShadowEnable_bDummy) == 0x000059, "Member 'BP_SASTelepoComponent_C_End::CallFunc_SetShadowEnable_bDummy' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, CallFunc_IsEnemyPlayer_self_CastInput) == 0x000060, "Member 'BP_SASTelepoComponent_C_End::CallFunc_IsEnemyPlayer_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, CallFunc_IsEnemyPlayer_bEnemyPlayer) == 0x000070, "Member 'BP_SASTelepoComponent_C_End::CallFunc_IsEnemyPlayer_bEnemyPlayer' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, CallFunc_IsStealth_return) == 0x000071, "Member 'BP_SASTelepoComponent_C_End::CallFunc_IsStealth_return' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, K2Node_MakeArray_Array) == 0x000078, "Member 'BP_SASTelepoComponent_C_End::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, K2Node_MakeArray_Array_1) == 0x000088, "Member 'BP_SASTelepoComponent_C_End::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, CallFunc_IsControlAI_bAI) == 0x000098, "Member 'BP_SASTelepoComponent_C_End::CallFunc_IsControlAI_bAI' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, CallFunc_Not_PreBool_ReturnValue) == 0x000099, "Member 'BP_SASTelepoComponent_C_End::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, CallFunc_SetHideSASOutline_bDummy) == 0x00009A, "Member 'BP_SASTelepoComponent_C_End::CallFunc_SetHideSASOutline_bDummy' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, CallFunc_GetSocketLocation_ReturnValue) == 0x00009C, "Member 'BP_SASTelepoComponent_C_End::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, CallFunc_GetSocketLocation_ReturnValue_1) == 0x0000A8, "Member 'BP_SASTelepoComponent_C_End::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, CallFunc_IsValid_ReturnValue) == 0x0000B4, "Member 'BP_SASTelepoComponent_C_End::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, CallFunc_GetSocketLocation_ReturnValue_2) == 0x0000B8, "Member 'BP_SASTelepoComponent_C_End::CallFunc_GetSocketLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000C8, "Member 'BP_SASTelepoComponent_C_End::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, CallFunc_IsValid_ReturnValue_1) == 0x0000D0, "Member 'BP_SASTelepoComponent_C_End::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, CallFunc_SpawnEmitterAtLocation_ReturnValue_1) == 0x0000D8, "Member 'BP_SASTelepoComponent_C_End::CallFunc_SpawnEmitterAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, CallFunc_SetInvalidDamage_Dummy) == 0x0000E0, "Member 'BP_SASTelepoComponent_C_End::CallFunc_SetInvalidDamage_Dummy' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, CallFunc_EventPhysicsIdling_self_CastInput) == 0x0000E8, "Member 'BP_SASTelepoComponent_C_End::CallFunc_EventPhysicsIdling_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, CallFunc_IsControlAI_bAI_1) == 0x0000F8, "Member 'BP_SASTelepoComponent_C_End::CallFunc_IsControlAI_bAI_1' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, CallFunc_GetCurrentTargetActor_TargetActor) == 0x000100, "Member 'BP_SASTelepoComponent_C_End::CallFunc_GetCurrentTargetActor_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, CallFunc_IsValid_ReturnValue_2) == 0x000108, "Member 'BP_SASTelepoComponent_C_End::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, CallFunc_SetPlayerHidden_bDummy) == 0x000109, "Member 'BP_SASTelepoComponent_C_End::CallFunc_SetPlayerHidden_bDummy' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, CallFunc_IsEnable_ReturnValue) == 0x00010A, "Member 'BP_SASTelepoComponent_C_End::CallFunc_IsEnable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, CallFunc_IsValid_ReturnValue_3) == 0x00010B, "Member 'BP_SASTelepoComponent_C_End::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, CallFunc_SpawnEmitterAtLocation_ReturnValue_2) == 0x000110, "Member 'BP_SASTelepoComponent_C_End::CallFunc_SpawnEmitterAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_End, CallFunc_WarpToTargetActor_bSuccess) == 0x000118, "Member 'BP_SASTelepoComponent_C_End::CallFunc_WarpToTargetActor_bSuccess' has a wrong offset!");

// Function BP_SASTelepoComponent.BP_SASTelepoComponent_C.Complete
// 0x0010 (0x0010 - 0x0000)
struct BP_SASTelepoComponent_C_Complete final
{
public:
	bool                                          CallFunc_SetPlayerHidden_bDummy;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInvalidDamage_Dummy;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStealth_return;                         // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetShadowEnable_bDummy;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetPlayerHidden_bDummy_1;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetHideSASOutline_bDummy;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81EB[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASTelepoComponent_C_Complete) == 0x000008, "Wrong alignment on BP_SASTelepoComponent_C_Complete");
static_assert(sizeof(BP_SASTelepoComponent_C_Complete) == 0x000010, "Wrong size on BP_SASTelepoComponent_C_Complete");
static_assert(offsetof(BP_SASTelepoComponent_C_Complete, CallFunc_SetPlayerHidden_bDummy) == 0x000000, "Member 'BP_SASTelepoComponent_C_Complete::CallFunc_SetPlayerHidden_bDummy' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Complete, CallFunc_SetInvalidDamage_Dummy) == 0x000001, "Member 'BP_SASTelepoComponent_C_Complete::CallFunc_SetInvalidDamage_Dummy' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Complete, CallFunc_IsStealth_return) == 0x000002, "Member 'BP_SASTelepoComponent_C_Complete::CallFunc_IsStealth_return' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Complete, CallFunc_SetShadowEnable_bDummy) == 0x000003, "Member 'BP_SASTelepoComponent_C_Complete::CallFunc_SetShadowEnable_bDummy' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Complete, CallFunc_SetPlayerHidden_bDummy_1) == 0x000004, "Member 'BP_SASTelepoComponent_C_Complete::CallFunc_SetPlayerHidden_bDummy_1' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Complete, CallFunc_SetHideSASOutline_bDummy) == 0x000005, "Member 'BP_SASTelepoComponent_C_Complete::CallFunc_SetHideSASOutline_bDummy' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Complete, CallFunc_IsValid_ReturnValue) == 0x000006, "Member 'BP_SASTelepoComponent_C_Complete::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Complete, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000008, "Member 'BP_SASTelepoComponent_C_Complete::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

// Function BP_SASTelepoComponent.BP_SASTelepoComponent_C.Update
// 0x0018 (0x0018 - 0x0000)
struct BP_SASTelepoComponent_C_Update final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOver_ReturnValue;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81EC[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRate_ReturnValue;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnable_ReturnValue;                     // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SASTelepoComponent_C_Update) == 0x000004, "Wrong alignment on BP_SASTelepoComponent_C_Update");
static_assert(sizeof(BP_SASTelepoComponent_C_Update) == 0x000018, "Wrong size on BP_SASTelepoComponent_C_Update");
static_assert(offsetof(BP_SASTelepoComponent_C_Update, Temp_bool_Variable) == 0x000000, "Member 'BP_SASTelepoComponent_C_Update::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Update, Temp_bool_Variable_1) == 0x000001, "Member 'BP_SASTelepoComponent_C_Update::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Update, Temp_bool_Variable_2) == 0x000002, "Member 'BP_SASTelepoComponent_C_Update::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Update, Temp_bool_Variable_3) == 0x000003, "Member 'BP_SASTelepoComponent_C_Update::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Update, K2Node_Select_Default) == 0x000004, "Member 'BP_SASTelepoComponent_C_Update::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Update, CallFunc_IsOver_ReturnValue) == 0x000005, "Member 'BP_SASTelepoComponent_C_Update::CallFunc_IsOver_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Update, CallFunc_GetRate_ReturnValue) == 0x000008, "Member 'BP_SASTelepoComponent_C_Update::CallFunc_GetRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Update, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_SASTelepoComponent_C_Update::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Update, K2Node_Select_Default_1) == 0x000010, "Member 'BP_SASTelepoComponent_C_Update::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_Update, CallFunc_IsEnable_ReturnValue) == 0x000014, "Member 'BP_SASTelepoComponent_C_Update::CallFunc_IsEnable_ReturnValue' has a wrong offset!");

// Function BP_SASTelepoComponent.BP_SASTelepoComponent_C.Interrupt
// 0x0001 (0x0001 - 0x0000)
struct BP_SASTelepoComponent_C_Interrupt final
{
public:
	bool                                          CallFunc_End_bEnd;                                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SASTelepoComponent_C_Interrupt) == 0x000001, "Wrong alignment on BP_SASTelepoComponent_C_Interrupt");
static_assert(sizeof(BP_SASTelepoComponent_C_Interrupt) == 0x000001, "Wrong size on BP_SASTelepoComponent_C_Interrupt");
static_assert(offsetof(BP_SASTelepoComponent_C_Interrupt, CallFunc_End_bEnd) == 0x000000, "Member 'BP_SASTelepoComponent_C_Interrupt::CallFunc_End_bEnd' has a wrong offset!");

// Function BP_SASTelepoComponent.BP_SASTelepoComponent_C.CheckTelepoWall
// 0x00C0 (0x00C0 - 0x0000)
struct BP_SASTelepoComponent_C_CheckTelepoWall final
{
public:
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0000(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0034(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SASTelepoComponent_C_CheckTelepoWall) == 0x000008, "Wrong alignment on BP_SASTelepoComponent_C_CheckTelepoWall");
static_assert(sizeof(BP_SASTelepoComponent_C_CheckTelepoWall) == 0x0000C0, "Wrong size on BP_SASTelepoComponent_C_CheckTelepoWall");
static_assert(offsetof(BP_SASTelepoComponent_C_CheckTelepoWall, Temp_object_Variable) == 0x000000, "Member 'BP_SASTelepoComponent_C_CheckTelepoWall::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_CheckTelepoWall, CallFunc_GetPlayerManager_PlayerManager) == 0x000010, "Member 'BP_SASTelepoComponent_C_CheckTelepoWall::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_CheckTelepoWall, K2Node_MakeArray_Array) == 0x000018, "Member 'BP_SASTelepoComponent_C_CheckTelepoWall::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_CheckTelepoWall, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'BP_SASTelepoComponent_C_CheckTelepoWall::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_CheckTelepoWall, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000034, "Member 'BP_SASTelepoComponent_C_CheckTelepoWall::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BP_SASTelepoComponent_C_CheckTelepoWall, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0000BC, "Member 'BP_SASTelepoComponent_C_CheckTelepoWall::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");

// Function BP_SASTelepoComponent.BP_SASTelepoComponent_C.IsDisappear
// 0x0001 (0x0001 - 0x0000)
struct BP_SASTelepoComponent_C_IsDisappear final
{
public:
	bool                                          bDisappear;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SASTelepoComponent_C_IsDisappear) == 0x000001, "Wrong alignment on BP_SASTelepoComponent_C_IsDisappear");
static_assert(sizeof(BP_SASTelepoComponent_C_IsDisappear) == 0x000001, "Wrong size on BP_SASTelepoComponent_C_IsDisappear");
static_assert(offsetof(BP_SASTelepoComponent_C_IsDisappear, bDisappear) == 0x000000, "Member 'BP_SASTelepoComponent_C_IsDisappear::bDisappear' has a wrong offset!");

// Function BP_SASTelepoComponent.BP_SASTelepoComponent_C.IsTelepo
// 0x0001 (0x0001 - 0x0000)
struct BP_SASTelepoComponent_C_IsTelepo final
{
public:
	bool                                          bTelepo;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SASTelepoComponent_C_IsTelepo) == 0x000001, "Wrong alignment on BP_SASTelepoComponent_C_IsTelepo");
static_assert(sizeof(BP_SASTelepoComponent_C_IsTelepo) == 0x000001, "Wrong size on BP_SASTelepoComponent_C_IsTelepo");
static_assert(offsetof(BP_SASTelepoComponent_C_IsTelepo, bTelepo) == 0x000000, "Member 'BP_SASTelepoComponent_C_IsTelepo::bTelepo' has a wrong offset!");

}

