#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SceneManager

#include "Basic.hpp"

#include "E_SceneManagerStatus_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "S_BattleSimulatorData_structs.hpp"
#include "FEventTriggerCommand_structs.hpp"
#include "S_AreaInfo_structs.hpp"
#include "E_SceneType_structs.hpp"
#include "Engine_structs.hpp"
#include "S_ScenarioJump_structs.hpp"


namespace SDK::Params
{

// Function BP_SceneManager.BP_SceneManager_C.ExecuteUbergraph_BP_SceneManager
// 0x0308 (0x0308 - 0x0000)
struct BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_828D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_SceneManagerStatus                          K2Node_Event_CurrentStatus;                        // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_828E[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAchievementManager*                    CallFunc_GetAchievementManager_AchievementManager; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_828F[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPPlayerManagerInterface_C> K2Node_DynamicCast_AsBPPlayer_Manager_Interface;   // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8290[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStreamingTextureNum_ReturnValue;       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8291[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IRSGameModeBPInterface_C> K2Node_DynamicCast_AsRSGame_Mode_BPInterface;      // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8292[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0070(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_StreamingTextureBlockTillAllRequestsFinished_ReturnValue; // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8293[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LevelManager_C*                     CallFunc_GetLevelManager_LevelManager;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C0(0x0040)(HasGetValueTypeHash)
	class ABP_SoundManager_C*                     CallFunc_GetSoundManager_SoundManager;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0118(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class Ubp_ui_map_icon_manager_C*              CallFunc_SpawnObject_ReturnValue;                  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_BattleSimulatorRowName;               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleSimulatorManager*                CallFunc_GetBattleSimulatorManager_BattleSimulatorManager; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetAreaName_ReturnValue;                  // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_AreaInfo                            CallFunc_GetAreaInfo_AreaInfo;                     // 0x0160(0x0068)(HasGetValueTypeHash)
	bool                                          CallFunc_GetAreaInfo_Found;                        // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8294[0x6];                                     // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table;                   // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8295[0x6];                                     // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_BattleSimulatorData                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x01F0(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8296[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameMainManager_C*                  CallFunc_GetGameMainManager_GameMainManager;       // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadSoftClass_ReturnValue;                // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveRetryDataExec_ReturnValue;            // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8297[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsMake_Event_Actor;        // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8298[0x6];                                     // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFEventTriggerCommand                  K2Node_MakeStruct_FEventTriggerCommand;            // 0x0268(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_AddEventTriggerCommand_self_CastInput;    // 0x02D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class FName>                           K2Node_MakeArray_Array_1;                          // 0x02E0(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	class URSGameInstanceBP_C*                    CallFunc_GetRSGameInstance_AsRSGame_Instance_BP;   // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestChangeScene_Error;                 // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8299[0x3];                                     // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x02FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckScenarioFlag_FlagValue;              // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager) == 0x000008, "Wrong alignment on BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager");
static_assert(sizeof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager) == 0x000308, "Wrong size on BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, EntryPoint) == 0x000000, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000008, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, K2Node_SwitchEnum_CmpSuccess) == 0x000014, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, K2Node_Event_CurrentStatus) == 0x000015, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::K2Node_Event_CurrentStatus' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_GetAchievementManager_AchievementManager) == 0x000018, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_GetAchievementManager_AchievementManager' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_GetPlayerManager_PlayerManager) == 0x000020, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, K2Node_DynamicCast_AsBPPlayer_Manager_Interface) == 0x000030, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::K2Node_DynamicCast_AsBPPlayer_Manager_Interface' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_GetGameMode_ReturnValue) == 0x000048, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_GetStreamingTextureNum_ReturnValue) == 0x000050, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_GetStreamingTextureNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, K2Node_DynamicCast_AsRSGame_Mode_BPInterface) == 0x000058, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::K2Node_DynamicCast_AsRSGame_Mode_BPInterface' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, K2Node_MakeStruct_FormatArgumentData) == 0x000070, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_StreamingTextureBlockTillAllRequestsFinished_ReturnValue) == 0x0000B0, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_StreamingTextureBlockTillAllRequestsFinished_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_GetLevelManager_LevelManager) == 0x0000B8, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_GetLevelManager_LevelManager' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C0, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_GetSoundManager_SoundManager) == 0x000100, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_GetSoundManager_SoundManager' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, K2Node_MakeArray_Array) == 0x000108, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_Format_ReturnValue) == 0x000118, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_Conv_TextToString_ReturnValue) == 0x000130, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_SpawnObject_ReturnValue) == 0x000140, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, K2Node_Event_BattleSimulatorRowName) == 0x000148, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::K2Node_Event_BattleSimulatorRowName' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_GetBattleSimulatorManager_BattleSimulatorManager) == 0x000150, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_GetBattleSimulatorManager_BattleSimulatorManager' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_GetAreaName_ReturnValue) == 0x000158, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_GetAreaName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_GetAreaInfo_AreaInfo) == 0x000160, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_GetAreaInfo_AreaInfo' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_GetAreaInfo_Found) == 0x0001C8, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_GetAreaInfo_Found' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_IsValid_ReturnValue_1) == 0x0001C9, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_LoadSoftObject_ReturnValue) == 0x0001D0, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_LoadSoftObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_GetEventManager_EventManager) == 0x0001D8, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, K2Node_DynamicCast_AsData_Table) == 0x0001E0, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::K2Node_DynamicCast_AsData_Table' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, K2Node_DynamicCast_bSuccess_2) == 0x0001E8, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_IsValid_ReturnValue_2) == 0x0001E9, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_GetDataTableRowFromName_OutRow) == 0x0001F0, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000238, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_GetGameMainManager_GameMainManager) == 0x000240, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_GetGameMainManager_GameMainManager' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_LoadSoftClass_ReturnValue) == 0x000248, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_LoadSoftClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_SaveRetryDataExec_ReturnValue) == 0x000250, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_SaveRetryDataExec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, K2Node_ClassDynamicCast_AsMake_Event_Actor) == 0x000258, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::K2Node_ClassDynamicCast_AsMake_Event_Actor' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, K2Node_ClassDynamicCast_bSuccess) == 0x000260, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x000261, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, K2Node_MakeStruct_FEventTriggerCommand) == 0x000268, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::K2Node_MakeStruct_FEventTriggerCommand' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_AddEventTriggerCommand_self_CastInput) == 0x0002D0, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_AddEventTriggerCommand_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, K2Node_MakeArray_Array_1) == 0x0002E0, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_GetRSGameInstance_AsRSGame_Instance_BP) == 0x0002F0, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_GetRSGameInstance_AsRSGame_Instance_BP' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_RequestChangeScene_Error) == 0x0002F8, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_RequestChangeScene_Error' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_MakeLiteralName_ReturnValue) == 0x0002FC, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager, CallFunc_CheckScenarioFlag_FlagValue) == 0x000304, "Member 'BP_SceneManager_C_ExecuteUbergraph_BP_SceneManager::CallFunc_CheckScenarioFlag_FlagValue' has a wrong offset!");

// Function BP_SceneManager.BP_SceneManager_C.RequestChangeSceneBattleSimulator
// 0x0008 (0x0008 - 0x0000)
struct BP_SceneManager_C_RequestChangeSceneBattleSimulator final
{
public:
	class FName                                   BattleSimulatorRowName;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SceneManager_C_RequestChangeSceneBattleSimulator) == 0x000004, "Wrong alignment on BP_SceneManager_C_RequestChangeSceneBattleSimulator");
static_assert(sizeof(BP_SceneManager_C_RequestChangeSceneBattleSimulator) == 0x000008, "Wrong size on BP_SceneManager_C_RequestChangeSceneBattleSimulator");
static_assert(offsetof(BP_SceneManager_C_RequestChangeSceneBattleSimulator, BattleSimulatorRowName) == 0x000000, "Member 'BP_SceneManager_C_RequestChangeSceneBattleSimulator::BattleSimulatorRowName' has a wrong offset!");

// Function BP_SceneManager.BP_SceneManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SceneManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SceneManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SceneManager_C_ReceiveTick");
static_assert(sizeof(BP_SceneManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_SceneManager_C_ReceiveTick");
static_assert(offsetof(BP_SceneManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SceneManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_SceneManager.BP_SceneManager_C.Debug Set Current Status
// 0x0001 (0x0001 - 0x0000)
struct BP_SceneManager_C_Debug_Set_Current_Status final
{
public:
	E_SceneManagerStatus                          Param_CurrentStatus;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SceneManager_C_Debug_Set_Current_Status) == 0x000001, "Wrong alignment on BP_SceneManager_C_Debug_Set_Current_Status");
static_assert(sizeof(BP_SceneManager_C_Debug_Set_Current_Status) == 0x000001, "Wrong size on BP_SceneManager_C_Debug_Set_Current_Status");
static_assert(offsetof(BP_SceneManager_C_Debug_Set_Current_Status, Param_CurrentStatus) == 0x000000, "Member 'BP_SceneManager_C_Debug_Set_Current_Status::Param_CurrentStatus' has a wrong offset!");

// Function BP_SceneManager.BP_SceneManager_C.ChangeSceneManagerStatus
// 0x0070 (0x0070 - 0x0000)
struct BP_SceneManager_C_ChangeSceneManagerStatus final
{
public:
	E_SceneManagerStatus                          Status;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChangeAreaStatus                             ChangeAreaStatus;                                  // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChangeAreaStatus                             Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_829A[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EChangeAreaStatus                             Temp_byte_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChangeAreaStatus                             Temp_byte_Variable_2;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChangeAreaStatus                             Temp_byte_Variable_3;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChangeAreaStatus                             Temp_byte_Variable_4;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChangeAreaStatus                             Temp_byte_Variable_5;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChangeAreaStatus                             Temp_byte_Variable_6;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChangeAreaStatus                             Temp_byte_Variable_7;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChangeAreaStatus                             Temp_byte_Variable_8;                              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChangeAreaStatus                             Temp_byte_Variable_9;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChangeAreaStatus                             Temp_byte_Variable_10;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChangeAreaStatus                             Temp_byte_Variable_11;                             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChangeAreaStatus                             Temp_byte_Variable_12;                             // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChangeAreaStatus                             Temp_byte_Variable_13;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SceneManagerStatus                          Temp_byte_Variable_14;                             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_829B[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EChangeAreaStatus                             K2Node_Select_Default;                             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_829C[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SceneManager_C_ChangeSceneManagerStatus) == 0x000008, "Wrong alignment on BP_SceneManager_C_ChangeSceneManagerStatus");
static_assert(sizeof(BP_SceneManager_C_ChangeSceneManagerStatus) == 0x000070, "Wrong size on BP_SceneManager_C_ChangeSceneManagerStatus");
static_assert(offsetof(BP_SceneManager_C_ChangeSceneManagerStatus, Status) == 0x000000, "Member 'BP_SceneManager_C_ChangeSceneManagerStatus::Status' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ChangeSceneManagerStatus, ChangeAreaStatus) == 0x000001, "Member 'BP_SceneManager_C_ChangeSceneManagerStatus::ChangeAreaStatus' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ChangeSceneManagerStatus, Temp_byte_Variable) == 0x000002, "Member 'BP_SceneManager_C_ChangeSceneManagerStatus::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ChangeSceneManagerStatus, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'BP_SceneManager_C_ChangeSceneManagerStatus::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ChangeSceneManagerStatus, Temp_byte_Variable_1) == 0x000018, "Member 'BP_SceneManager_C_ChangeSceneManagerStatus::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ChangeSceneManagerStatus, Temp_byte_Variable_2) == 0x000019, "Member 'BP_SceneManager_C_ChangeSceneManagerStatus::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ChangeSceneManagerStatus, Temp_byte_Variable_3) == 0x00001A, "Member 'BP_SceneManager_C_ChangeSceneManagerStatus::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ChangeSceneManagerStatus, Temp_byte_Variable_4) == 0x00001B, "Member 'BP_SceneManager_C_ChangeSceneManagerStatus::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ChangeSceneManagerStatus, Temp_byte_Variable_5) == 0x00001C, "Member 'BP_SceneManager_C_ChangeSceneManagerStatus::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ChangeSceneManagerStatus, Temp_byte_Variable_6) == 0x00001D, "Member 'BP_SceneManager_C_ChangeSceneManagerStatus::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ChangeSceneManagerStatus, Temp_byte_Variable_7) == 0x00001E, "Member 'BP_SceneManager_C_ChangeSceneManagerStatus::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ChangeSceneManagerStatus, Temp_byte_Variable_8) == 0x00001F, "Member 'BP_SceneManager_C_ChangeSceneManagerStatus::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ChangeSceneManagerStatus, Temp_byte_Variable_9) == 0x000020, "Member 'BP_SceneManager_C_ChangeSceneManagerStatus::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ChangeSceneManagerStatus, Temp_byte_Variable_10) == 0x000021, "Member 'BP_SceneManager_C_ChangeSceneManagerStatus::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ChangeSceneManagerStatus, Temp_byte_Variable_11) == 0x000022, "Member 'BP_SceneManager_C_ChangeSceneManagerStatus::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ChangeSceneManagerStatus, Temp_byte_Variable_12) == 0x000023, "Member 'BP_SceneManager_C_ChangeSceneManagerStatus::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ChangeSceneManagerStatus, Temp_byte_Variable_13) == 0x000024, "Member 'BP_SceneManager_C_ChangeSceneManagerStatus::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ChangeSceneManagerStatus, Temp_byte_Variable_14) == 0x000025, "Member 'BP_SceneManager_C_ChangeSceneManagerStatus::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ChangeSceneManagerStatus, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000028, "Member 'BP_SceneManager_C_ChangeSceneManagerStatus::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ChangeSceneManagerStatus, K2Node_Select_Default) == 0x000038, "Member 'BP_SceneManager_C_ChangeSceneManagerStatus::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ChangeSceneManagerStatus, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'BP_SceneManager_C_ChangeSceneManagerStatus::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ChangeSceneManagerStatus, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000050, "Member 'BP_SceneManager_C_ChangeSceneManagerStatus::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_ChangeSceneManagerStatus, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000060, "Member 'BP_SceneManager_C_ChangeSceneManagerStatus::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");

// Function BP_SceneManager.BP_SceneManager_C.TickWaitAreaLoading
// 0x0088 (0x0088 - 0x0000)
struct BP_SceneManager_C_TickWaitAreaLoading final
{
public:
	class FName                                   _curAreaName;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetAreaName_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AArrangeItemManager*                    CallFunc_GetArrangeItemManager_ArrangeItemManager; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAreaLevelsLoaded_IsLoaded;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAreaLevelsLoaded_IsError;               // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_829D[0x5];                                     // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_AreaInfo                            CallFunc_IsAreaLevelsLoaded_Area_Info;             // 0x0020(0x0068)(HasGetValueTypeHash)
};
static_assert(alignof(BP_SceneManager_C_TickWaitAreaLoading) == 0x000008, "Wrong alignment on BP_SceneManager_C_TickWaitAreaLoading");
static_assert(sizeof(BP_SceneManager_C_TickWaitAreaLoading) == 0x000088, "Wrong size on BP_SceneManager_C_TickWaitAreaLoading");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaLoading, _curAreaName) == 0x000000, "Member 'BP_SceneManager_C_TickWaitAreaLoading::_curAreaName' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaLoading, CallFunc_GetAreaName_ReturnValue) == 0x000008, "Member 'BP_SceneManager_C_TickWaitAreaLoading::CallFunc_GetAreaName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaLoading, CallFunc_GetArrangeItemManager_ArrangeItemManager) == 0x000010, "Member 'BP_SceneManager_C_TickWaitAreaLoading::CallFunc_GetArrangeItemManager_ArrangeItemManager' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaLoading, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_SceneManager_C_TickWaitAreaLoading::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaLoading, CallFunc_IsAreaLevelsLoaded_IsLoaded) == 0x000019, "Member 'BP_SceneManager_C_TickWaitAreaLoading::CallFunc_IsAreaLevelsLoaded_IsLoaded' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaLoading, CallFunc_IsAreaLevelsLoaded_IsError) == 0x00001A, "Member 'BP_SceneManager_C_TickWaitAreaLoading::CallFunc_IsAreaLevelsLoaded_IsError' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaLoading, CallFunc_IsAreaLevelsLoaded_Area_Info) == 0x000020, "Member 'BP_SceneManager_C_TickWaitAreaLoading::CallFunc_IsAreaLevelsLoaded_Area_Info' has a wrong offset!");

// Function BP_SceneManager.BP_SceneManager_C.TickWaitAreaVisible
// 0x00C8 (0x00C8 - 0x0000)
struct BP_SceneManager_C_TickWaitAreaVisible final
{
public:
	int32                                         CallFunc_StreamingTextureBlockTillAllRequestsFinished_ReturnValue; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_829E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_829F[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocationRestaurant_InAjito;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82A0[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    K2Node_DynamicCast_AsBP_Player_Manager;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82A1[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerStart*>                   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0050(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class APsychicObjectManager_C*                CallFunc_GetPsychicObjectManager_PsyObjManager;    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82A2[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82A3[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CosmosWebManager_C*                 CallFunc_GetCosmosWebManager_CosmosWebMaanger;     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_CrossSave_Updating_C*            CallFunc_Create_ReturnValue;                       // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestAddNotificationBrainMessage_ReturnValue; // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82A4[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetAreaName_ReturnValue;                  // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82A5[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_LevelManager_C>   CallFunc_AreaNameToID_self_CastInput;              // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_AreaNameToID_LocationID;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AreaNameToID_AreaID;                      // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AreaNameToID_VariationID;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CallAreaPostLoadFunction_Initialized;     // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CallAreaPostLoadFunction_ReturnValue;     // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAreaReadyForStart_IsReady;              // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SceneManager_C_TickWaitAreaVisible) == 0x000008, "Wrong alignment on BP_SceneManager_C_TickWaitAreaVisible");
static_assert(sizeof(BP_SceneManager_C_TickWaitAreaVisible) == 0x0000C8, "Wrong size on BP_SceneManager_C_TickWaitAreaVisible");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, CallFunc_StreamingTextureBlockTillAllRequestsFinished_ReturnValue) == 0x000000, "Member 'BP_SceneManager_C_TickWaitAreaVisible::CallFunc_StreamingTextureBlockTillAllRequestsFinished_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, CallFunc_Conv_IntToString_ReturnValue) == 0x000008, "Member 'BP_SceneManager_C_TickWaitAreaVisible::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'BP_SceneManager_C_TickWaitAreaVisible::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'BP_SceneManager_C_TickWaitAreaVisible::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, CallFunc_GetPlayerManager_PlayerManager) == 0x000030, "Member 'BP_SceneManager_C_TickWaitAreaVisible::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, CallFunc_IsLocationRestaurant_InAjito) == 0x000038, "Member 'BP_SceneManager_C_TickWaitAreaVisible::CallFunc_IsLocationRestaurant_InAjito' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, K2Node_DynamicCast_AsBP_Player_Manager) == 0x000040, "Member 'BP_SceneManager_C_TickWaitAreaVisible::K2Node_DynamicCast_AsBP_Player_Manager' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_SceneManager_C_TickWaitAreaVisible::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, CallFunc_GetAllActorsOfClass_OutActors) == 0x000050, "Member 'BP_SceneManager_C_TickWaitAreaVisible::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, CallFunc_GetPsychicObjectManager_PsyObjManager) == 0x000060, "Member 'BP_SceneManager_C_TickWaitAreaVisible::CallFunc_GetPsychicObjectManager_PsyObjManager' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'BP_SceneManager_C_TickWaitAreaVisible::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, CallFunc_GetEventManager_EventManager) == 0x000070, "Member 'BP_SceneManager_C_TickWaitAreaVisible::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'BP_SceneManager_C_TickWaitAreaVisible::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, CallFunc_GetPlayerController_ReturnValue) == 0x000080, "Member 'BP_SceneManager_C_TickWaitAreaVisible::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, CallFunc_GetCosmosWebManager_CosmosWebMaanger) == 0x000088, "Member 'BP_SceneManager_C_TickWaitAreaVisible::CallFunc_GetCosmosWebManager_CosmosWebMaanger' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, CallFunc_Create_ReturnValue) == 0x000090, "Member 'BP_SceneManager_C_TickWaitAreaVisible::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, CallFunc_RequestAddNotificationBrainMessage_ReturnValue) == 0x000098, "Member 'BP_SceneManager_C_TickWaitAreaVisible::CallFunc_RequestAddNotificationBrainMessage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, CallFunc_GetAreaName_ReturnValue) == 0x00009C, "Member 'BP_SceneManager_C_TickWaitAreaVisible::CallFunc_GetAreaName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, CallFunc_AreaNameToID_self_CastInput) == 0x0000A8, "Member 'BP_SceneManager_C_TickWaitAreaVisible::CallFunc_AreaNameToID_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, CallFunc_AreaNameToID_LocationID) == 0x0000B8, "Member 'BP_SceneManager_C_TickWaitAreaVisible::CallFunc_AreaNameToID_LocationID' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, CallFunc_AreaNameToID_AreaID) == 0x0000BC, "Member 'BP_SceneManager_C_TickWaitAreaVisible::CallFunc_AreaNameToID_AreaID' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, CallFunc_AreaNameToID_VariationID) == 0x0000C0, "Member 'BP_SceneManager_C_TickWaitAreaVisible::CallFunc_AreaNameToID_VariationID' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, CallFunc_CallAreaPostLoadFunction_Initialized) == 0x0000C4, "Member 'BP_SceneManager_C_TickWaitAreaVisible::CallFunc_CallAreaPostLoadFunction_Initialized' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, CallFunc_CallAreaPostLoadFunction_ReturnValue) == 0x0000C5, "Member 'BP_SceneManager_C_TickWaitAreaVisible::CallFunc_CallAreaPostLoadFunction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneManager_C_TickWaitAreaVisible, CallFunc_IsAreaReadyForStart_IsReady) == 0x0000C6, "Member 'BP_SceneManager_C_TickWaitAreaVisible::CallFunc_IsAreaReadyForStart_IsReady' has a wrong offset!");

// Function BP_SceneManager.BP_SceneManager_C.TickSceneStarting
// 0x03C0 (0x03C0 - 0x0000)
struct BP_SceneManager_C_TickSceneStarting final
{
public:
	TArray<class AActor*>                         LEnemyList;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	TArray<class ARSCharacterBase*>               LPlayerList;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadSoftClass_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsMake_Event_Actor;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNotAppliedDLCAndReceiveBrainMessage_ReturnValue; // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82A6[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFEventTriggerCommand                  K2Node_MakeStruct_FEventTriggerCommand;            // 0x0038(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82A7[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AIntroTutorialManager*                  CallFunc_GetIntroTutorialManager_ReturnValue;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82A8[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidChangeLevelAfterEventComand_ReturnValue; // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82A9[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMapGimmickManager*                     CallFunc_GetMapGimmickManager_MapGimmickManager;   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMapGimmickManager*                     CallFunc_GetMapGimmickManager_MapGimmickManager_1; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MapGimmickManager_C*                K2Node_DynamicCast_AsBP_Map_Gimmick_Manager;       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82AA[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_1;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PostProcessManager_C*               CallFunc_GetPostProcessManager_Manager;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82AB[0x6];                                     // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_AddEventTriggerCommand_self_CastInput;    // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Right_ReturnValue;                        // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Right_ReturnValue_1;                      // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ADropItemManager*                       CallFunc_GetDropItemManager_Drop_Item_Manager;     // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidCurrentSimulatorLevelInfosName_ReturnValue; // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82AC[0x2];                                     // 0x01AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SoundManager_C*                     CallFunc_GetSoundManager_SoundManager;             // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BattlefieldManager_C*               CallFunc_GetBattlefieldManager_BP_BattlefieldManager; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidCurrentSimulatorLevelInfosName_ReturnValue_1; // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82AD[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserParamManager*                      CallFunc_GetUserParamManager_UserParamManager;     // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
