#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SASRecastGauge

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "E_SASKind_structs.hpp"


namespace SDK::Params
{

// Function BP_SASRecastGauge.BP_SASRecastGauge_C.ExecuteUbergraph_BP_SASRecastGauge
// 0x0028 (0x0028 - 0x0000)
struct BP_SASRecastGauge_C_ExecuteUbergraph_BP_SASRecastGauge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16CA[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateTimer_bAllOver;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16CB[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASRecastGauge_C_ExecuteUbergraph_BP_SASRecastGauge) == 0x000008, "Wrong alignment on BP_SASRecastGauge_C_ExecuteUbergraph_BP_SASRecastGauge");
static_assert(sizeof(BP_SASRecastGauge_C_ExecuteUbergraph_BP_SASRecastGauge) == 0x000028, "Wrong size on BP_SASRecastGauge_C_ExecuteUbergraph_BP_SASRecastGauge");
static_assert(offsetof(BP_SASRecastGauge_C_ExecuteUbergraph_BP_SASRecastGauge, EntryPoint) == 0x000000, "Member 'BP_SASRecastGauge_C_ExecuteUbergraph_BP_SASRecastGauge::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_ExecuteUbergraph_BP_SASRecastGauge, CallFunc_MakeLiteralInt_ReturnValue) == 0x000004, "Member 'BP_SASRecastGauge_C_ExecuteUbergraph_BP_SASRecastGauge::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_ExecuteUbergraph_BP_SASRecastGauge, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_SASRecastGauge_C_ExecuteUbergraph_BP_SASRecastGauge::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_ExecuteUbergraph_BP_SASRecastGauge, K2Node_DynamicCast_AsRSBattle_Player) == 0x000010, "Member 'BP_SASRecastGauge_C_ExecuteUbergraph_BP_SASRecastGauge::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_ExecuteUbergraph_BP_SASRecastGauge, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_SASRecastGauge_C_ExecuteUbergraph_BP_SASRecastGauge::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_ExecuteUbergraph_BP_SASRecastGauge, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'BP_SASRecastGauge_C_ExecuteUbergraph_BP_SASRecastGauge::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_ExecuteUbergraph_BP_SASRecastGauge, CallFunc_UpdateTimer_bAllOver) == 0x000020, "Member 'BP_SASRecastGauge_C_ExecuteUbergraph_BP_SASRecastGauge::CallFunc_UpdateTimer_bAllOver' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_ExecuteUbergraph_BP_SASRecastGauge, CallFunc_MakeLiteralInt_ReturnValue_1) == 0x000024, "Member 'BP_SASRecastGauge_C_ExecuteUbergraph_BP_SASRecastGauge::CallFunc_MakeLiteralInt_ReturnValue_1' has a wrong offset!");

// Function BP_SASRecastGauge.BP_SASRecastGauge_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SASRecastGauge_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASRecastGauge_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SASRecastGauge_C_ReceiveTick");
static_assert(sizeof(BP_SASRecastGauge_C_ReceiveTick) == 0x000004, "Wrong size on BP_SASRecastGauge_C_ReceiveTick");
static_assert(offsetof(BP_SASRecastGauge_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SASRecastGauge_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_SASRecastGauge.BP_SASRecastGauge_C.BeginRecastGauge
// 0x0048 (0x0048 - 0x0000)
struct BP_SASRecastGauge_C_BeginRecastGauge final
{
public:
	E_SASButton                                   SASButton;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16CC[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RemainTime;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDelayRecast;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16CD[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LRecastElapsedTime;                                // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SASKind                                     LSASKind;                                          // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16CE[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SASKind                                     CallFunc_GetSASFromButton_Kind;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16CF[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSASTimeParameter_RecastSec;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSASTimeParameter_ActivationSec;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D0[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetDebuggingManager_Manager;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDebugPlayerSASInfinity_bInfinity;       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SASRecastGauge_C_BeginRecastGauge) == 0x000008, "Wrong alignment on BP_SASRecastGauge_C_BeginRecastGauge");
static_assert(sizeof(BP_SASRecastGauge_C_BeginRecastGauge) == 0x000048, "Wrong size on BP_SASRecastGauge_C_BeginRecastGauge");
static_assert(offsetof(BP_SASRecastGauge_C_BeginRecastGauge, SASButton) == 0x000000, "Member 'BP_SASRecastGauge_C_BeginRecastGauge::SASButton' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_BeginRecastGauge, RemainTime) == 0x000004, "Member 'BP_SASRecastGauge_C_BeginRecastGauge::RemainTime' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_BeginRecastGauge, bDelayRecast) == 0x000008, "Member 'BP_SASRecastGauge_C_BeginRecastGauge::bDelayRecast' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_BeginRecastGauge, LRecastElapsedTime) == 0x00000C, "Member 'BP_SASRecastGauge_C_BeginRecastGauge::LRecastElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_BeginRecastGauge, LSASKind) == 0x000010, "Member 'BP_SASRecastGauge_C_BeginRecastGauge::LSASKind' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_BeginRecastGauge, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000014, "Member 'BP_SASRecastGauge_C_BeginRecastGauge::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_BeginRecastGauge, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000018, "Member 'BP_SASRecastGauge_C_BeginRecastGauge::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_BeginRecastGauge, CallFunc_GetSASFromButton_Kind) == 0x00001C, "Member 'BP_SASRecastGauge_C_BeginRecastGauge::CallFunc_GetSASFromButton_Kind' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_BeginRecastGauge, CallFunc_GetSASTimeParameter_RecastSec) == 0x000020, "Member 'BP_SASRecastGauge_C_BeginRecastGauge::CallFunc_GetSASTimeParameter_RecastSec' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_BeginRecastGauge, CallFunc_GetSASTimeParameter_ActivationSec) == 0x000024, "Member 'BP_SASRecastGauge_C_BeginRecastGauge::CallFunc_GetSASTimeParameter_ActivationSec' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_BeginRecastGauge, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000028, "Member 'BP_SASRecastGauge_C_BeginRecastGauge::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_BeginRecastGauge, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00002C, "Member 'BP_SASRecastGauge_C_BeginRecastGauge::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_BeginRecastGauge, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000030, "Member 'BP_SASRecastGauge_C_BeginRecastGauge::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_BeginRecastGauge, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000031, "Member 'BP_SASRecastGauge_C_BeginRecastGauge::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_BeginRecastGauge, CallFunc_GetDebuggingManager_Manager) == 0x000038, "Member 'BP_SASRecastGauge_C_BeginRecastGauge::CallFunc_GetDebuggingManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_BeginRecastGauge, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_SASRecastGauge_C_BeginRecastGauge::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_BeginRecastGauge, CallFunc_IsDebugPlayerSASInfinity_bInfinity) == 0x000041, "Member 'BP_SASRecastGauge_C_BeginRecastGauge::CallFunc_IsDebugPlayerSASInfinity_bInfinity' has a wrong offset!");

// Function BP_SASRecastGauge.BP_SASRecastGauge_C.SetSas
// 0x000C (0x000C - 0x0000)
struct BP_SASRecastGauge_C_SetSas final
{
public:
	E_SASButton                                   Button;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SASKind                                     Kind;                                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCheckValidSet;                                    // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D1[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSet_bValid;                        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SASRecastGauge_C_SetSas) == 0x000004, "Wrong alignment on BP_SASRecastGauge_C_SetSas");
static_assert(sizeof(BP_SASRecastGauge_C_SetSas) == 0x00000C, "Wrong size on BP_SASRecastGauge_C_SetSas");
static_assert(offsetof(BP_SASRecastGauge_C_SetSas, Button) == 0x000000, "Member 'BP_SASRecastGauge_C_SetSas::Button' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_SetSas, Kind) == 0x000001, "Member 'BP_SASRecastGauge_C_SetSas::Kind' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_SetSas, bCheckValidSet) == 0x000002, "Member 'BP_SASRecastGauge_C_SetSas::bCheckValidSet' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_SetSas, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'BP_SASRecastGauge_C_SetSas::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_SetSas, CallFunc_IsValidSet_bValid) == 0x000008, "Member 'BP_SASRecastGauge_C_SetSas::CallFunc_IsValidSet_bValid' has a wrong offset!");

// Function BP_SASRecastGauge.BP_SASRecastGauge_C.ClearGauge
// 0x0008 (0x0008 - 0x0000)
struct BP_SASRecastGauge_C_ClearGauge final
{
public:
	E_SASButton                                   button_kind_in;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SASKind                                     CallFunc_GetSASFromButton_Kind;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D2[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASRecastGauge_C_ClearGauge) == 0x000004, "Wrong alignment on BP_SASRecastGauge_C_ClearGauge");
static_assert(sizeof(BP_SASRecastGauge_C_ClearGauge) == 0x000008, "Wrong size on BP_SASRecastGauge_C_ClearGauge");
static_assert(offsetof(BP_SASRecastGauge_C_ClearGauge, button_kind_in) == 0x000000, "Member 'BP_SASRecastGauge_C_ClearGauge::button_kind_in' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_ClearGauge, CallFunc_GetSASFromButton_Kind) == 0x000001, "Member 'BP_SASRecastGauge_C_ClearGauge::CallFunc_GetSASFromButton_Kind' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_ClearGauge, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'BP_SASRecastGauge_C_ClearGauge::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function BP_SASRecastGauge.BP_SASRecastGauge_C.UpdateTimer
// 0x0070 (0x0070 - 0x0000)
struct BP_SASRecastGauge_C_UpdateTimer final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAllOver;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D3[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LAccessoryRate;                                    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LRecastDeltaTime;                                  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LbOver;                                            // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D4[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlayerAccessoryEffect_bEquip;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D5[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayerAccessoryEffect_Param;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D6[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_MathExpression_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BattleManager_C*                    CallFunc_GetBattleManager_BattleManager;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBattleMode_ReturnValue;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetPlayerAccessoryEffect_bEquip_1;        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D7[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayerAccessoryEffect_Param_1;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveSASNum_Num;                      // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOver_ReturnValue;                       // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnable_ReturnValue;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D8[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPause_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnable_ReturnValue_1;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOver_ReturnValue_1;                     // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SASRecastGauge_C_UpdateTimer) == 0x000008, "Wrong alignment on BP_SASRecastGauge_C_UpdateTimer");
static_assert(sizeof(BP_SASRecastGauge_C_UpdateTimer) == 0x000070, "Wrong size on BP_SASRecastGauge_C_UpdateTimer");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, Delta) == 0x000000, "Member 'BP_SASRecastGauge_C_UpdateTimer::Delta' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, bAllOver) == 0x000004, "Member 'BP_SASRecastGauge_C_UpdateTimer::bAllOver' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, LAccessoryRate) == 0x000008, "Member 'BP_SASRecastGauge_C_UpdateTimer::LAccessoryRate' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, LRecastDeltaTime) == 0x00000C, "Member 'BP_SASRecastGauge_C_UpdateTimer::LRecastDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, LbOver) == 0x000010, "Member 'BP_SASRecastGauge_C_UpdateTimer::LbOver' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, Temp_int_Loop_Num_Variable) == 0x000014, "Member 'BP_SASRecastGauge_C_UpdateTimer::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_SASRecastGauge_C_UpdateTimer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, CallFunc_GetPlayerAccessoryEffect_bEquip) == 0x00001C, "Member 'BP_SASRecastGauge_C_UpdateTimer::CallFunc_GetPlayerAccessoryEffect_bEquip' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, CallFunc_GetPlayerAccessoryEffect_Param) == 0x000020, "Member 'BP_SASRecastGauge_C_UpdateTimer::CallFunc_GetPlayerAccessoryEffect_Param' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'BP_SASRecastGauge_C_UpdateTimer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, K2Node_MathExpression_ReturnValue) == 0x000028, "Member 'BP_SASRecastGauge_C_UpdateTimer::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BP_SASRecastGauge_C_UpdateTimer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, CallFunc_GetBattleManager_BattleManager) == 0x000030, "Member 'BP_SASRecastGauge_C_UpdateTimer::CallFunc_GetBattleManager_BattleManager' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, CallFunc_IsBattleMode_ReturnValue) == 0x000038, "Member 'BP_SASRecastGauge_C_UpdateTimer::CallFunc_IsBattleMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, CallFunc_GetPlayerAccessoryEffect_bEquip_1) == 0x000039, "Member 'BP_SASRecastGauge_C_UpdateTimer::CallFunc_GetPlayerAccessoryEffect_bEquip_1' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, CallFunc_GetPlayerAccessoryEffect_Param_1) == 0x00003C, "Member 'BP_SASRecastGauge_C_UpdateTimer::CallFunc_GetPlayerAccessoryEffect_Param_1' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, K2Node_MathExpression_ReturnValue_1) == 0x000040, "Member 'BP_SASRecastGauge_C_UpdateTimer::K2Node_MathExpression_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, Temp_int_Array_Index_Variable) == 0x000044, "Member 'BP_SASRecastGauge_C_UpdateTimer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000048, "Member 'BP_SASRecastGauge_C_UpdateTimer::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x00004C, "Member 'BP_SASRecastGauge_C_UpdateTimer::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000050, "Member 'BP_SASRecastGauge_C_UpdateTimer::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x000054, "Member 'BP_SASRecastGauge_C_UpdateTimer::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, CallFunc_GetActiveSASNum_Num) == 0x000058, "Member 'BP_SASRecastGauge_C_UpdateTimer::CallFunc_GetActiveSASNum_Num' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, K2Node_SwitchInteger_CmpSuccess) == 0x00005C, "Member 'BP_SASRecastGauge_C_UpdateTimer::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00005D, "Member 'BP_SASRecastGauge_C_UpdateTimer::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, CallFunc_Not_PreBool_ReturnValue) == 0x00005E, "Member 'BP_SASRecastGauge_C_UpdateTimer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, CallFunc_IsOver_ReturnValue) == 0x00005F, "Member 'BP_SASRecastGauge_C_UpdateTimer::CallFunc_IsOver_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, CallFunc_IsEnable_ReturnValue) == 0x000060, "Member 'BP_SASRecastGauge_C_UpdateTimer::CallFunc_IsEnable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, CallFunc_Not_PreBool_ReturnValue_1) == 0x000061, "Member 'BP_SASRecastGauge_C_UpdateTimer::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'BP_SASRecastGauge_C_UpdateTimer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, CallFunc_IsPause_ReturnValue) == 0x000068, "Member 'BP_SASRecastGauge_C_UpdateTimer::CallFunc_IsPause_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, CallFunc_IsEnable_ReturnValue_1) == 0x000069, "Member 'BP_SASRecastGauge_C_UpdateTimer::CallFunc_IsEnable_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, CallFunc_Not_PreBool_ReturnValue_2) == 0x00006A, "Member 'BP_SASRecastGauge_C_UpdateTimer::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_UpdateTimer, CallFunc_IsOver_ReturnValue_1) == 0x00006B, "Member 'BP_SASRecastGauge_C_UpdateTimer::CallFunc_IsOver_ReturnValue_1' has a wrong offset!");

// Function BP_SASRecastGauge.BP_SASRecastGauge_C.ClearGaugeAll
// 0x0014 (0x0014 - 0x0000)
struct BP_SASRecastGauge_C_ClearGaugeAll final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SASRecastGauge_C_ClearGaugeAll) == 0x000004, "Wrong alignment on BP_SASRecastGauge_C_ClearGaugeAll");
static_assert(sizeof(BP_SASRecastGauge_C_ClearGaugeAll) == 0x000014, "Wrong size on BP_SASRecastGauge_C_ClearGaugeAll");
static_assert(offsetof(BP_SASRecastGauge_C_ClearGaugeAll, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_SASRecastGauge_C_ClearGaugeAll::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_ClearGaugeAll, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_SASRecastGauge_C_ClearGaugeAll::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_ClearGaugeAll, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_SASRecastGauge_C_ClearGaugeAll::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_ClearGaugeAll, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_SASRecastGauge_C_ClearGaugeAll::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_ClearGaugeAll, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'BP_SASRecastGauge_C_ClearGaugeAll::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_SASRecastGauge.BP_SASRecastGauge_C.ChangeSASSet
// 0x0028 (0x0028 - 0x0000)
struct BP_SASRecastGauge_C_ChangeSASSet final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LPrevIndex;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D9[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASRecastGauge_C_ChangeSASSet) == 0x000008, "Wrong alignment on BP_SASRecastGauge_C_ChangeSASSet");
static_assert(sizeof(BP_SASRecastGauge_C_ChangeSASSet) == 0x000028, "Wrong size on BP_SASRecastGauge_C_ChangeSASSet");
static_assert(offsetof(BP_SASRecastGauge_C_ChangeSASSet, Param_Index) == 0x000000, "Member 'BP_SASRecastGauge_C_ChangeSASSet::Param_Index' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_ChangeSASSet, LPrevIndex) == 0x000004, "Member 'BP_SASRecastGauge_C_ChangeSASSet::LPrevIndex' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_ChangeSASSet, CallFunc_MakeLiteralInt_ReturnValue) == 0x000008, "Member 'BP_SASRecastGauge_C_ChangeSASSet::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_ChangeSASSet, CallFunc_Divide_IntInt_ReturnValue) == 0x00000C, "Member 'BP_SASRecastGauge_C_ChangeSASSet::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_ChangeSASSet, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000010, "Member 'BP_SASRecastGauge_C_ChangeSASSet::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_ChangeSASSet, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'BP_SASRecastGauge_C_ChangeSASSet::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_ChangeSASSet, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00001C, "Member 'BP_SASRecastGauge_C_ChangeSASSet::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_ChangeSASSet, CallFunc_Clamp_ReturnValue) == 0x000020, "Member 'BP_SASRecastGauge_C_ChangeSASSet::CallFunc_Clamp_ReturnValue' has a wrong offset!");

// Function BP_SASRecastGauge.BP_SASRecastGauge_C.NextSASSset
// 0x0028 (0x0028 - 0x0000)
struct BP_SASRecastGauge_C_NextSASSset final
{
public:
	int32                                         LIndex;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16DA[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserParamManager*                      CallFunc_GetUserParamManager_UserParamManager;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSet_bValid;                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsExtendEquipSAS_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16DB[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16DC[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASRecastGauge_C_NextSASSset) == 0x000008, "Wrong alignment on BP_SASRecastGauge_C_NextSASSset");
static_assert(sizeof(BP_SASRecastGauge_C_NextSASSset) == 0x000028, "Wrong size on BP_SASRecastGauge_C_NextSASSset");
static_assert(offsetof(BP_SASRecastGauge_C_NextSASSset, LIndex) == 0x000000, "Member 'BP_SASRecastGauge_C_NextSASSset::LIndex' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_NextSASSset, Temp_bool_Variable) == 0x000004, "Member 'BP_SASRecastGauge_C_NextSASSset::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_NextSASSset, Temp_int_Variable) == 0x000008, "Member 'BP_SASRecastGauge_C_NextSASSset::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_NextSASSset, Temp_int_Variable_1) == 0x00000C, "Member 'BP_SASRecastGauge_C_NextSASSset::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_NextSASSset, CallFunc_GetUserParamManager_UserParamManager) == 0x000010, "Member 'BP_SASRecastGauge_C_NextSASSset::CallFunc_GetUserParamManager_UserParamManager' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_NextSASSset, CallFunc_IsValidSet_bValid) == 0x000018, "Member 'BP_SASRecastGauge_C_NextSASSset::CallFunc_IsValidSet_bValid' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_NextSASSset, CallFunc_IsExtendEquipSAS_ReturnValue) == 0x000019, "Member 'BP_SASRecastGauge_C_NextSASSset::CallFunc_IsExtendEquipSAS_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_NextSASSset, K2Node_Select_Default) == 0x00001C, "Member 'BP_SASRecastGauge_C_NextSASSset::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_NextSASSset, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000020, "Member 'BP_SASRecastGauge_C_NextSASSset::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_NextSASSset, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_SASRecastGauge_C_NextSASSset::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_SASRecastGauge.BP_SASRecastGauge_C.GetButtonRight
// 0x0010 (0x0010 - 0x0000)
struct BP_SASRecastGauge_C_GetButtonRight final
{
public:
	E_SASButton                                   Button;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16DD[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASRecastGauge_C_GetButtonRight) == 0x000004, "Wrong alignment on BP_SASRecastGauge_C_GetButtonRight");
static_assert(sizeof(BP_SASRecastGauge_C_GetButtonRight) == 0x000010, "Wrong size on BP_SASRecastGauge_C_GetButtonRight");
static_assert(offsetof(BP_SASRecastGauge_C_GetButtonRight, Button) == 0x000000, "Member 'BP_SASRecastGauge_C_GetButtonRight::Button' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_GetButtonRight, CallFunc_Multiply_IntInt_ReturnValue) == 0x000004, "Member 'BP_SASRecastGauge_C_GetButtonRight::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_GetButtonRight, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_SASRecastGauge_C_GetButtonRight::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_GetButtonRight, CallFunc_Conv_IntToByte_ReturnValue) == 0x00000C, "Member 'BP_SASRecastGauge_C_GetButtonRight::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_GetButtonRight, CallFunc_GetValidValue_ReturnValue) == 0x00000D, "Member 'BP_SASRecastGauge_C_GetButtonRight::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");

// Function BP_SASRecastGauge.BP_SASRecastGauge_C.GetButtonUp
// 0x0010 (0x0010 - 0x0000)
struct BP_SASRecastGauge_C_GetButtonUp final
{
public:
	E_SASButton                                   Button;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16DE[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASRecastGauge_C_GetButtonUp) == 0x000004, "Wrong alignment on BP_SASRecastGauge_C_GetButtonUp");
static_assert(sizeof(BP_SASRecastGauge_C_GetButtonUp) == 0x000010, "Wrong size on BP_SASRecastGauge_C_GetButtonUp");
static_assert(offsetof(BP_SASRecastGauge_C_GetButtonUp, Button) == 0x000000, "Member 'BP_SASRecastGauge_C_GetButtonUp::Button' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_GetButtonUp, CallFunc_Multiply_IntInt_ReturnValue) == 0x000004, "Member 'BP_SASRecastGauge_C_GetButtonUp::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_GetButtonUp, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_SASRecastGauge_C_GetButtonUp::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_GetButtonUp, CallFunc_Conv_IntToByte_ReturnValue) == 0x00000C, "Member 'BP_SASRecastGauge_C_GetButtonUp::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_GetButtonUp, CallFunc_GetValidValue_ReturnValue) == 0x00000D, "Member 'BP_SASRecastGauge_C_GetButtonUp::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");

// Function BP_SASRecastGauge.BP_SASRecastGauge_C.GetButtonDown
// 0x0010 (0x0010 - 0x0000)
struct BP_SASRecastGauge_C_GetButtonDown final
{
public:
	E_SASButton                                   Button;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16DF[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASRecastGauge_C_GetButtonDown) == 0x000004, "Wrong alignment on BP_SASRecastGauge_C_GetButtonDown");
static_assert(sizeof(BP_SASRecastGauge_C_GetButtonDown) == 0x000010, "Wrong size on BP_SASRecastGauge_C_GetButtonDown");
static_assert(offsetof(BP_SASRecastGauge_C_GetButtonDown, Button) == 0x000000, "Member 'BP_SASRecastGauge_C_GetButtonDown::Button' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_GetButtonDown, CallFunc_Multiply_IntInt_ReturnValue) == 0x000004, "Member 'BP_SASRecastGauge_C_GetButtonDown::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_GetButtonDown, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_SASRecastGauge_C_GetButtonDown::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_GetButtonDown, CallFunc_Conv_IntToByte_ReturnValue) == 0x00000C, "Member 'BP_SASRecastGauge_C_GetButtonDown::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_GetButtonDown, CallFunc_GetValidValue_ReturnValue) == 0x00000D, "Member 'BP_SASRecastGauge_C_GetButtonDown::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");

// Function BP_SASRecastGauge.BP_SASRecastGauge_C.AddPercentRecastGauge
// 0x0018 (0x0018 - 0x0000)
struct BP_SASRecastGauge_C_AddPercentRecastGauge final
{
public:
	E_SASButton                                   ButtonKindIn;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16E0[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RecastPecent;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SASKind                                     CallFunc_GetSASFromButton_Kind;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16E1[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16E2[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASRecastGauge_C_AddPercentRecastGauge) == 0x000004, "Wrong alignment on BP_SASRecastGauge_C_AddPercentRecastGauge");
static_assert(sizeof(BP_SASRecastGauge_C_AddPercentRecastGauge) == 0x000018, "Wrong size on BP_SASRecastGauge_C_AddPercentRecastGauge");
static_assert(offsetof(BP_SASRecastGauge_C_AddPercentRecastGauge, ButtonKindIn) == 0x000000, "Member 'BP_SASRecastGauge_C_AddPercentRecastGauge::ButtonKindIn' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_AddPercentRecastGauge, RecastPecent) == 0x000004, "Member 'BP_SASRecastGauge_C_AddPercentRecastGauge::RecastPecent' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_AddPercentRecastGauge, CallFunc_GetSASFromButton_Kind) == 0x000008, "Member 'BP_SASRecastGauge_C_AddPercentRecastGauge::CallFunc_GetSASFromButton_Kind' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_AddPercentRecastGauge, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00000C, "Member 'BP_SASRecastGauge_C_AddPercentRecastGauge::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_AddPercentRecastGauge, CallFunc_Less_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_SASRecastGauge_C_AddPercentRecastGauge::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_AddPercentRecastGauge, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_SASRecastGauge_C_AddPercentRecastGauge::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_SASRecastGauge.BP_SASRecastGauge_C.OnBeginSAS
// 0x0008 (0x0008 - 0x0000)
struct BP_SASRecastGauge_C_OnBeginSAS final
{
public:
	E_SASButton                                   ButtonKindIn;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SASKind                                     CallFunc_GetSASFromButton_Kind;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16E3[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASRecastGauge_C_OnBeginSAS) == 0x000004, "Wrong alignment on BP_SASRecastGauge_C_OnBeginSAS");
static_assert(sizeof(BP_SASRecastGauge_C_OnBeginSAS) == 0x000008, "Wrong size on BP_SASRecastGauge_C_OnBeginSAS");
static_assert(offsetof(BP_SASRecastGauge_C_OnBeginSAS, ButtonKindIn) == 0x000000, "Member 'BP_SASRecastGauge_C_OnBeginSAS::ButtonKindIn' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_OnBeginSAS, CallFunc_GetSASFromButton_Kind) == 0x000001, "Member 'BP_SASRecastGauge_C_OnBeginSAS::CallFunc_GetSASFromButton_Kind' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_OnBeginSAS, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'BP_SASRecastGauge_C_OnBeginSAS::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function BP_SASRecastGauge.BP_SASRecastGauge_C.SetPauseRecastGauge
// 0x0014 (0x0014 - 0x0000)
struct BP_SASRecastGauge_C_SetPauseRecastGauge final
{
public:
	bool                                          bPause;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16E4[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ClaimantName;                                      // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16E5[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASRecastGauge_C_SetPauseRecastGauge) == 0x000004, "Wrong alignment on BP_SASRecastGauge_C_SetPauseRecastGauge");
static_assert(sizeof(BP_SASRecastGauge_C_SetPauseRecastGauge) == 0x000014, "Wrong size on BP_SASRecastGauge_C_SetPauseRecastGauge");
static_assert(offsetof(BP_SASRecastGauge_C_SetPauseRecastGauge, bPause) == 0x000000, "Member 'BP_SASRecastGauge_C_SetPauseRecastGauge::bPause' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_SetPauseRecastGauge, ClaimantName) == 0x000004, "Member 'BP_SASRecastGauge_C_SetPauseRecastGauge::ClaimantName' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_SetPauseRecastGauge, CallFunc_Array_RemoveItem_ReturnValue) == 0x00000C, "Member 'BP_SASRecastGauge_C_SetPauseRecastGauge::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_SetPauseRecastGauge, CallFunc_Array_AddUnique_ReturnValue) == 0x000010, "Member 'BP_SASRecastGauge_C_SetPauseRecastGauge::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function BP_SASRecastGauge.BP_SASRecastGauge_C.GetButtonFromSAS
// 0x0010 (0x0010 - 0x0000)
struct BP_SASRecastGauge_C_GetButtonFromSAS final
{
public:
	E_SASKind                                     Kind;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFind;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_SASButton                                   Button;                                            // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16E6[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LButton;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16E7[0x1];                                     // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASRecastGauge_C_GetButtonFromSAS) == 0x000004, "Wrong alignment on BP_SASRecastGauge_C_GetButtonFromSAS");
static_assert(sizeof(BP_SASRecastGauge_C_GetButtonFromSAS) == 0x000010, "Wrong size on BP_SASRecastGauge_C_GetButtonFromSAS");
static_assert(offsetof(BP_SASRecastGauge_C_GetButtonFromSAS, Kind) == 0x000000, "Member 'BP_SASRecastGauge_C_GetButtonFromSAS::Kind' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_GetButtonFromSAS, bFind) == 0x000001, "Member 'BP_SASRecastGauge_C_GetButtonFromSAS::bFind' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_GetButtonFromSAS, Button) == 0x000002, "Member 'BP_SASRecastGauge_C_GetButtonFromSAS::Button' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_GetButtonFromSAS, LButton) == 0x000004, "Member 'BP_SASRecastGauge_C_GetButtonFromSAS::LButton' has a wrong offset!");
static_assert(offsetof(BP_SASRecastGauge_C_GetButtonFromSAS, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_SASRecastGauge_C_GetButtonFromSAS::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
