#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SeeThroughJustDodgeCutinCharacter

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BP_SeeThroughJustDodgeCutinCharacter.BP_SeeThroughJustDodgeCutinCharacter_C.ExecuteUbergraph_BP_SeeThroughJustDodgeCutinCharacter
// 0x0008 (0x0008 - 0x0000)
struct BP_SeeThroughJustDodgeCutinCharacter_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutinCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaySimulate_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SeeThroughJustDodgeCutinCharacter_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutinCharacter) == 0x000004, "Wrong alignment on BP_SeeThroughJustDodgeCutinCharacter_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutinCharacter");
static_assert(sizeof(BP_SeeThroughJustDodgeCutinCharacter_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutinCharacter) == 0x000008, "Wrong size on BP_SeeThroughJustDodgeCutinCharacter_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutinCharacter");
static_assert(offsetof(BP_SeeThroughJustDodgeCutinCharacter_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutinCharacter, EntryPoint) == 0x000000, "Member 'BP_SeeThroughJustDodgeCutinCharacter_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutinCharacter::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutinCharacter_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutinCharacter, CallFunc_IsPlaySimulate_ReturnValue) == 0x000004, "Member 'BP_SeeThroughJustDodgeCutinCharacter_C_ExecuteUbergraph_BP_SeeThroughJustDodgeCutinCharacter::CallFunc_IsPlaySimulate_ReturnValue' has a wrong offset!");

// Function BP_SeeThroughJustDodgeCutinCharacter.BP_SeeThroughJustDodgeCutinCharacter_C.SetupMesh
// 0x0010 (0x0010 - 0x0000)
struct BP_SeeThroughJustDodgeCutinCharacter_C_SetupMesh final
{
public:
	class USkeletalMesh*                          Param_SetupMesh;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     PlayerId;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SeeThroughJustDodgeCutinCharacter_C_SetupMesh) == 0x000008, "Wrong alignment on BP_SeeThroughJustDodgeCutinCharacter_C_SetupMesh");
static_assert(sizeof(BP_SeeThroughJustDodgeCutinCharacter_C_SetupMesh) == 0x000010, "Wrong size on BP_SeeThroughJustDodgeCutinCharacter_C_SetupMesh");
static_assert(offsetof(BP_SeeThroughJustDodgeCutinCharacter_C_SetupMesh, Param_SetupMesh) == 0x000000, "Member 'BP_SeeThroughJustDodgeCutinCharacter_C_SetupMesh::Param_SetupMesh' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutinCharacter_C_SetupMesh, PlayerId) == 0x000008, "Member 'BP_SeeThroughJustDodgeCutinCharacter_C_SetupMesh::PlayerId' has a wrong offset!");
static_assert(offsetof(BP_SeeThroughJustDodgeCutinCharacter_C_SetupMesh, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000009, "Member 'BP_SeeThroughJustDodgeCutinCharacter_C_SetupMesh::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

}

