#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SASCableEnergyMesh

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SASCableEnergyMesh.BP_SASCableEnergyMesh_C.ExecuteUbergraph_BP_SASCableEnergyMesh
// 0x000C (0x000C - 0x0000)
struct BP_SASCableEnergyMesh_C_ExecuteUbergraph_BP_SASCableEnergyMesh final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Dilation;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASCableEnergyMesh_C_ExecuteUbergraph_BP_SASCableEnergyMesh) == 0x000004, "Wrong alignment on BP_SASCableEnergyMesh_C_ExecuteUbergraph_BP_SASCableEnergyMesh");
static_assert(sizeof(BP_SASCableEnergyMesh_C_ExecuteUbergraph_BP_SASCableEnergyMesh) == 0x00000C, "Wrong size on BP_SASCableEnergyMesh_C_ExecuteUbergraph_BP_SASCableEnergyMesh");
static_assert(offsetof(BP_SASCableEnergyMesh_C_ExecuteUbergraph_BP_SASCableEnergyMesh, EntryPoint) == 0x000000, "Member 'BP_SASCableEnergyMesh_C_ExecuteUbergraph_BP_SASCableEnergyMesh::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_ExecuteUbergraph_BP_SASCableEnergyMesh, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_SASCableEnergyMesh_C_ExecuteUbergraph_BP_SASCableEnergyMesh::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_ExecuteUbergraph_BP_SASCableEnergyMesh, K2Node_CustomEvent_Dilation) == 0x000008, "Member 'BP_SASCableEnergyMesh_C_ExecuteUbergraph_BP_SASCableEnergyMesh::K2Node_CustomEvent_Dilation' has a wrong offset!");

// Function BP_SASCableEnergyMesh.BP_SASCableEnergyMesh_C.SetStopDilation
// 0x0004 (0x0004 - 0x0000)
struct BP_SASCableEnergyMesh_C_SetStopDilation final
{
public:
	float                                         Dilation;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASCableEnergyMesh_C_SetStopDilation) == 0x000004, "Wrong alignment on BP_SASCableEnergyMesh_C_SetStopDilation");
static_assert(sizeof(BP_SASCableEnergyMesh_C_SetStopDilation) == 0x000004, "Wrong size on BP_SASCableEnergyMesh_C_SetStopDilation");
static_assert(offsetof(BP_SASCableEnergyMesh_C_SetStopDilation, Dilation) == 0x000000, "Member 'BP_SASCableEnergyMesh_C_SetStopDilation::Dilation' has a wrong offset!");

// Function BP_SASCableEnergyMesh.BP_SASCableEnergyMesh_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SASCableEnergyMesh_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASCableEnergyMesh_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SASCableEnergyMesh_C_ReceiveTick");
static_assert(sizeof(BP_SASCableEnergyMesh_C_ReceiveTick) == 0x000004, "Wrong size on BP_SASCableEnergyMesh_C_ReceiveTick");
static_assert(offsetof(BP_SASCableEnergyMesh_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SASCableEnergyMesh_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_SASCableEnergyMesh.BP_SASCableEnergyMesh_C.StartEnergy
// 0x0008 (0x0008 - 0x0000)
struct BP_SASCableEnergyMesh_C_StartEnergy final
{
public:
	class ABP_CableBase_C*                        TargetCable;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASCableEnergyMesh_C_StartEnergy) == 0x000008, "Wrong alignment on BP_SASCableEnergyMesh_C_StartEnergy");
static_assert(sizeof(BP_SASCableEnergyMesh_C_StartEnergy) == 0x000008, "Wrong size on BP_SASCableEnergyMesh_C_StartEnergy");
static_assert(offsetof(BP_SASCableEnergyMesh_C_StartEnergy, TargetCable) == 0x000000, "Member 'BP_SASCableEnergyMesh_C_StartEnergy::TargetCable' has a wrong offset!");

// Function BP_SASCableEnergyMesh.BP_SASCableEnergyMesh_C.PrivateUpdate
// 0x0440 (0x0440 - 0x0000)
struct BP_SASCableEnergyMesh_C_PrivateUpdate final
{
public:
	struct FRotator                               AnimationRotation;                                 // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48B6[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             AnimationTransform;                                // 0x0010(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	float                                         CableSize;                                         // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48B7[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_GetSASStartAnimSequence_AnimSequence;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48B8[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetAttachParentSocketName_ReturnValue;    // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48B9[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBoneIndex_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetBoneTransformForAnimSequence_ReturnValue; // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x00E4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FName                                   CallFunc_GetAttachParentSocketName_ReturnValue_1;  // 0x016C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48BA[0x3];                                     // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_2;                     // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetMaterialScalarParameter_bDummy;        // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48BB[0x2];                                     // 0x0192(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48BC[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48BD[0x3];                                     // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattleCharacter_C*                   K2Node_DynamicCast_AsRSBattle_Character;           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48BE[0xE];                                     // 0x01D2(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x01E0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48BF[0x3];                                     // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x022C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_1;            // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0274(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0280(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x02B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48C0[0x6];                                     // 0x033A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameSystemManager_C*                CallFunc_GetGameSystemManager_Manater;             // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48C1[0x3];                                     // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentCustomTimeDilation_CustomTimeDilation; // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48C2[0x3];                                     // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0364(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0370(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x03AC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASCableEnergyMesh_C_PrivateUpdate) == 0x000010, "Wrong alignment on BP_SASCableEnergyMesh_C_PrivateUpdate");
static_assert(sizeof(BP_SASCableEnergyMesh_C_PrivateUpdate) == 0x000440, "Wrong size on BP_SASCableEnergyMesh_C_PrivateUpdate");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, AnimationRotation) == 0x000000, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::AnimationRotation' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, AnimationTransform) == 0x000010, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::AnimationTransform' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CableSize) == 0x000040, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CableSize' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_GetSASStartAnimSequence_AnimSequence) == 0x000048, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_GetSASStartAnimSequence_AnimSequence' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_GetAttachParentSocketName_ReturnValue) == 0x000054, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_GetAttachParentSocketName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_IsValid_ReturnValue_1) == 0x00005C, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000060, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, K2Node_MathExpression_ReturnValue) == 0x000064, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_GetBoneIndex_ReturnValue) == 0x000068, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_GetBoneIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_Add_FloatFloat_ReturnValue) == 0x00006C, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_GetBoneTransformForAnimSequence_ReturnValue) == 0x000070, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_GetBoneTransformForAnimSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_FClamp_ReturnValue) == 0x0000A0, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_BreakTransform_Location) == 0x0000A4, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_BreakTransform_Rotation) == 0x0000B0, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_BreakTransform_Scale) == 0x0000BC, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000C8, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_ComposeRotators_ReturnValue) == 0x0000CC, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_MakeVector_ReturnValue) == 0x0000D8, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0000E4, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_GetAttachParentSocketName_ReturnValue_1) == 0x00016C, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_GetAttachParentSocketName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000174, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000178, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_FClamp_ReturnValue_1) == 0x00017C, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000180, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_FClamp_ReturnValue_2) == 0x000184, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000188, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x00018C, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_SetMaterialScalarParameter_bDummy) == 0x000190, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_SetMaterialScalarParameter_bDummy' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_IsValid_ReturnValue_2) == 0x000191, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_GetSocketRotation_ReturnValue) == 0x000194, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_GetSocketRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_GetForwardVector_ReturnValue) == 0x0001A0, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_GetAttachParentActor_ReturnValue) == 0x0001B0, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001B8, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_IsValid_ReturnValue_3) == 0x0001C4, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, K2Node_DynamicCast_AsRSBattle_Character) == 0x0001C8, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::K2Node_DynamicCast_AsRSBattle_Character' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, K2Node_DynamicCast_bSuccess) == 0x0001D0, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_IsValid_ReturnValue_4) == 0x0001D1, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_GetSocketTransform_ReturnValue) == 0x0001E0, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_IsValid_ReturnValue_5) == 0x000210, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_BreakTransform_Location_1) == 0x000214, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_BreakTransform_Rotation_1) == 0x000220, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_BreakTransform_Scale_1) == 0x00022C, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_ComposeRotators_ReturnValue_1) == 0x000238, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_ComposeRotators_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_GetSocketLocation_ReturnValue) == 0x000244, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_GetForwardVector_ReturnValue_1) == 0x000250, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_Add_VectorVector_ReturnValue) == 0x00025C, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000268, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000274, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_MakeTransform_ReturnValue) == 0x000280, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x0002B0, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000338, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000339, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_GetGameSystemManager_Manater) == 0x000340, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_GetGameSystemManager_Manater' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_BooleanOR_ReturnValue) == 0x000348, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_GetCurrentCustomTimeDilation_CustomTimeDilation) == 0x00034C, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_GetCurrentCustomTimeDilation_CustomTimeDilation' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_Divide_FloatFloat_ReturnValue_4) == 0x000350, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_Divide_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000354, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_BreakVector_X) == 0x000358, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_BreakVector_Y) == 0x00035C, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_BreakVector_Z) == 0x000360, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_MakeVector_ReturnValue_1) == 0x000364, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_MakeTransform_ReturnValue_1) == 0x000370, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0003A0, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x0003AC, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdate, CallFunc_Vector_Distance_ReturnValue) == 0x000434, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdate::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");

// Function BP_SASCableEnergyMesh.BP_SASCableEnergyMesh_C.SetErase
// 0x0002 (0x0002 - 0x0000)
struct BP_SASCableEnergyMesh_C_SetErase final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetMaterialScalarParameter_bDummy;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SASCableEnergyMesh_C_SetErase) == 0x000001, "Wrong alignment on BP_SASCableEnergyMesh_C_SetErase");
static_assert(sizeof(BP_SASCableEnergyMesh_C_SetErase) == 0x000002, "Wrong size on BP_SASCableEnergyMesh_C_SetErase");
static_assert(offsetof(BP_SASCableEnergyMesh_C_SetErase, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_SASCableEnergyMesh_C_SetErase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_SetErase, CallFunc_SetMaterialScalarParameter_bDummy) == 0x000001, "Member 'BP_SASCableEnergyMesh_C_SetErase::CallFunc_SetMaterialScalarParameter_bDummy' has a wrong offset!");

// Function BP_SASCableEnergyMesh.BP_SASCableEnergyMesh_C.SetDissolve
// 0x0004 (0x0004 - 0x0000)
struct BP_SASCableEnergyMesh_C_SetDissolve final
{
public:
	float                                         Param_Dissolve;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASCableEnergyMesh_C_SetDissolve) == 0x000004, "Wrong alignment on BP_SASCableEnergyMesh_C_SetDissolve");
static_assert(sizeof(BP_SASCableEnergyMesh_C_SetDissolve) == 0x000004, "Wrong size on BP_SASCableEnergyMesh_C_SetDissolve");
static_assert(offsetof(BP_SASCableEnergyMesh_C_SetDissolve, Param_Dissolve) == 0x000000, "Member 'BP_SASCableEnergyMesh_C_SetDissolve::Param_Dissolve' has a wrong offset!");

// Function BP_SASCableEnergyMesh.BP_SASCableEnergyMesh_C.SetParentDissolve
// 0x0004 (0x0004 - 0x0000)
struct BP_SASCableEnergyMesh_C_SetParentDissolve final
{
public:
	float                                         Param_Dissolve;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASCableEnergyMesh_C_SetParentDissolve) == 0x000004, "Wrong alignment on BP_SASCableEnergyMesh_C_SetParentDissolve");
static_assert(sizeof(BP_SASCableEnergyMesh_C_SetParentDissolve) == 0x000004, "Wrong size on BP_SASCableEnergyMesh_C_SetParentDissolve");
static_assert(offsetof(BP_SASCableEnergyMesh_C_SetParentDissolve, Param_Dissolve) == 0x000000, "Member 'BP_SASCableEnergyMesh_C_SetParentDissolve::Param_Dissolve' has a wrong offset!");

// Function BP_SASCableEnergyMesh.BP_SASCableEnergyMesh_C.PrivateUpdateDelayedVisible
// 0x0010 (0x0010 - 0x0000)
struct BP_SASCableEnergyMesh_C_PrivateUpdateDelayedVisible final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48C3[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SASCableEnergyMesh_C_PrivateUpdateDelayedVisible) == 0x000004, "Wrong alignment on BP_SASCableEnergyMesh_C_PrivateUpdateDelayedVisible");
static_assert(sizeof(BP_SASCableEnergyMesh_C_PrivateUpdateDelayedVisible) == 0x000010, "Wrong size on BP_SASCableEnergyMesh_C_PrivateUpdateDelayedVisible");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdateDelayedVisible, Temp_int_Variable) == 0x000000, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdateDelayedVisible::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_SASCableEnergyMesh_C_PrivateUpdateDelayedVisible, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000004, "Member 'BP_SASCableEnergyMesh_C_PrivateUpdateDelayedVisible::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
