#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SeeThroughJustDodgeCutinCharacter

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_CutinCharacterBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SeeThroughJustDodgeCutinCharacter.BP_SeeThroughJustDodgeCutinCharacter_C
// 0x0018 (0x0290 - 0x0278)
class ABP_SeeThroughJustDodgeCutinCharacter_C final : public ABP_CutinCharacterBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_SeeThroughJustDodgeCutinCharacter_C; // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_PlayerMaterialAccessorComponent_C*  BP_PlayerMaterialAccessorComponent;                // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     SetupPlayerID;                                     // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SeeThroughJustDodgeCutinCharacter(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SetupMesh(class USkeletalMesh* Param_SetupMesh, EPlayerID PlayerId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SeeThroughJustDodgeCutinCharacter_C">();
	}
	static class ABP_SeeThroughJustDodgeCutinCharacter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SeeThroughJustDodgeCutinCharacter_C>();
	}
};
static_assert(alignof(ABP_SeeThroughJustDodgeCutinCharacter_C) == 0x000008, "Wrong alignment on ABP_SeeThroughJustDodgeCutinCharacter_C");
static_assert(sizeof(ABP_SeeThroughJustDodgeCutinCharacter_C) == 0x000290, "Wrong size on ABP_SeeThroughJustDodgeCutinCharacter_C");
static_assert(offsetof(ABP_SeeThroughJustDodgeCutinCharacter_C, UberGraphFrame_BP_SeeThroughJustDodgeCutinCharacter_C) == 0x000278, "Member 'ABP_SeeThroughJustDodgeCutinCharacter_C::UberGraphFrame_BP_SeeThroughJustDodgeCutinCharacter_C' has a wrong offset!");
static_assert(offsetof(ABP_SeeThroughJustDodgeCutinCharacter_C, BP_PlayerMaterialAccessorComponent) == 0x000280, "Member 'ABP_SeeThroughJustDodgeCutinCharacter_C::BP_PlayerMaterialAccessorComponent' has a wrong offset!");
static_assert(offsetof(ABP_SeeThroughJustDodgeCutinCharacter_C, SetupPlayerID) == 0x000288, "Member 'ABP_SeeThroughJustDodgeCutinCharacter_C::SetupPlayerID' has a wrong offset!");

}

