#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SequencerPartyMemberPosition

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SequencerPartyMemberPosition.BP_SequencerPartyMemberPosition_C
// 0x0018 (0x0248 - 0x0230)
class ABP_SequencerPartyMemberPosition_C final : public AActor
{
public:
	class UArrowComponent*                        Arrow;                                             // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERSPartyPlayerKind                            PartyPlayerKind;                                   // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SequencerPartyMemberPosition_C">();
	}
	static class ABP_SequencerPartyMemberPosition_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SequencerPartyMemberPosition_C>();
	}
};
static_assert(alignof(ABP_SequencerPartyMemberPosition_C) == 0x000008, "Wrong alignment on ABP_SequencerPartyMemberPosition_C");
static_assert(sizeof(ABP_SequencerPartyMemberPosition_C) == 0x000248, "Wrong size on ABP_SequencerPartyMemberPosition_C");
static_assert(offsetof(ABP_SequencerPartyMemberPosition_C, Arrow) == 0x000230, "Member 'ABP_SequencerPartyMemberPosition_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_SequencerPartyMemberPosition_C, DefaultSceneRoot) == 0x000238, "Member 'ABP_SequencerPartyMemberPosition_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_SequencerPartyMemberPosition_C, PartyPlayerKind) == 0x000240, "Member 'ABP_SequencerPartyMemberPosition_C::PartyPlayerKind' has a wrong offset!");

}

