#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SASCutinExtra

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SASCutinExtra.BP_SASCutinExtra_C
// 0x0028 (0x0258 - 0x0230)
class ABP_SASCutinExtra_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             SASTable;                                          // 0x0240(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CutinManager_C*                     CutinManager;                                      // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CutinPaused;                                       // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_SASCutinExtra(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void Initialize();
	void StartCutin(ESASCutinExtraID SASExtraID);
	void IsPlaying(bool* Playing);
	void SetDilation(float Dilation);
	void UpdateGlobalDilation();
	void Finalize();
	void PauseCutin(bool IsPause);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SASCutinExtra_C">();
	}
	static class ABP_SASCutinExtra_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SASCutinExtra_C>();
	}
};
static_assert(alignof(ABP_SASCutinExtra_C) == 0x000008, "Wrong alignment on ABP_SASCutinExtra_C");
static_assert(sizeof(ABP_SASCutinExtra_C) == 0x000258, "Wrong size on ABP_SASCutinExtra_C");
static_assert(offsetof(ABP_SASCutinExtra_C, UberGraphFrame) == 0x000230, "Member 'ABP_SASCutinExtra_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SASCutinExtra_C, DefaultSceneRoot) == 0x000238, "Member 'ABP_SASCutinExtra_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_SASCutinExtra_C, SASTable) == 0x000240, "Member 'ABP_SASCutinExtra_C::SASTable' has a wrong offset!");
static_assert(offsetof(ABP_SASCutinExtra_C, CutinManager) == 0x000248, "Member 'ABP_SASCutinExtra_C::CutinManager' has a wrong offset!");
static_assert(offsetof(ABP_SASCutinExtra_C, CutinPaused) == 0x000250, "Member 'ABP_SASCutinExtra_C::CutinPaused' has a wrong offset!");

}

