#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SequencerParticle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SequencerParticle.BP_SequencerParticle_C
// 0x0038 (0x02A0 - 0x0268)
class ABP_SequencerParticle_C final : public ASequencerParticle
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         UserCustomTimeDilation;                            // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_452C[0x4];                                     // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SubAttachActor;                                    // 0x0278(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 SubAttachActor2;                                   // 0x0280(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	class FName                                   SubAttachSocketName;                               // 0x0288(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BeginPlayBinding;                                  // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          Binding;                                           // 0x0291(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SetupStageParam;                                   // 0x0292(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UseStageParam;                                     // 0x0293(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_452D[0x4];                                     // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SubAttachActor3;                                   // 0x0298(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SequencerParticle(int32 EntryPoint);
	void ActiveWork();
	void ClearWork();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UpdateDilation();
	void UpdateStageParam();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SequencerParticle_C">();
	}
	static class ABP_SequencerParticle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SequencerParticle_C>();
	}
};
static_assert(alignof(ABP_SequencerParticle_C) == 0x000008, "Wrong alignment on ABP_SequencerParticle_C");
static_assert(sizeof(ABP_SequencerParticle_C) == 0x0002A0, "Wrong size on ABP_SequencerParticle_C");
static_assert(offsetof(ABP_SequencerParticle_C, UberGraphFrame) == 0x000268, "Member 'ABP_SequencerParticle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SequencerParticle_C, UserCustomTimeDilation) == 0x000270, "Member 'ABP_SequencerParticle_C::UserCustomTimeDilation' has a wrong offset!");
static_assert(offsetof(ABP_SequencerParticle_C, SubAttachActor) == 0x000278, "Member 'ABP_SequencerParticle_C::SubAttachActor' has a wrong offset!");
static_assert(offsetof(ABP_SequencerParticle_C, SubAttachActor2) == 0x000280, "Member 'ABP_SequencerParticle_C::SubAttachActor2' has a wrong offset!");
static_assert(offsetof(ABP_SequencerParticle_C, SubAttachSocketName) == 0x000288, "Member 'ABP_SequencerParticle_C::SubAttachSocketName' has a wrong offset!");
static_assert(offsetof(ABP_SequencerParticle_C, BeginPlayBinding) == 0x000290, "Member 'ABP_SequencerParticle_C::BeginPlayBinding' has a wrong offset!");
static_assert(offsetof(ABP_SequencerParticle_C, Binding) == 0x000291, "Member 'ABP_SequencerParticle_C::Binding' has a wrong offset!");
static_assert(offsetof(ABP_SequencerParticle_C, SetupStageParam) == 0x000292, "Member 'ABP_SequencerParticle_C::SetupStageParam' has a wrong offset!");
static_assert(offsetof(ABP_SequencerParticle_C, UseStageParam) == 0x000293, "Member 'ABP_SequencerParticle_C::UseStageParam' has a wrong offset!");
static_assert(offsetof(ABP_SequencerParticle_C, SubAttachActor3) == 0x000298, "Member 'ABP_SequencerParticle_C::SubAttachActor3' has a wrong offset!");

}

