#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StageManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_StageManager.BP_StageManager_C
// 0x0020 (0x0278 - 0x0258)
class ABP_StageManager_C final : public AStageManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StageCelLookLightDirection;                        // 0x0268(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_StageManager(int32 EntryPoint);
	void ReceiveBeginPlay();
	void AreaStart();
	void ResetCelLookLight();
	void InitializeLight();
	void SetupSceneLight();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_StageManager_C">();
	}
	static class ABP_StageManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_StageManager_C>();
	}
};
static_assert(alignof(ABP_StageManager_C) == 0x000008, "Wrong alignment on ABP_StageManager_C");
static_assert(sizeof(ABP_StageManager_C) == 0x000278, "Wrong size on ABP_StageManager_C");
static_assert(offsetof(ABP_StageManager_C, UberGraphFrame) == 0x000258, "Member 'ABP_StageManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_StageManager_C, DefaultSceneRoot) == 0x000260, "Member 'ABP_StageManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_StageManager_C, StageCelLookLightDirection) == 0x000268, "Member 'ABP_StageManager_C::StageCelLookLightDirection' has a wrong offset!");

}

