#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SC_BG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SC_BG.BP_SC_BG_C
// 0x0040 (0x0270 - 0x0230)
class ABP_SC_BG_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   ChildActor;                                        // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ParentActor;                                       // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                beforeLocation;                                    // 0x0250(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               BeforeRotation;                                    // 0x025C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         NewVar_0;                                          // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SC_BG(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SC_BG_C">();
	}
	static class ABP_SC_BG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SC_BG_C>();
	}
};
static_assert(alignof(ABP_SC_BG_C) == 0x000008, "Wrong alignment on ABP_SC_BG_C");
static_assert(sizeof(ABP_SC_BG_C) == 0x000270, "Wrong size on ABP_SC_BG_C");
static_assert(offsetof(ABP_SC_BG_C, UberGraphFrame) == 0x000230, "Member 'ABP_SC_BG_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SC_BG_C, ChildActor) == 0x000238, "Member 'ABP_SC_BG_C::ChildActor' has a wrong offset!");
static_assert(offsetof(ABP_SC_BG_C, DefaultSceneRoot) == 0x000240, "Member 'ABP_SC_BG_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_SC_BG_C, ParentActor) == 0x000248, "Member 'ABP_SC_BG_C::ParentActor' has a wrong offset!");
static_assert(offsetof(ABP_SC_BG_C, beforeLocation) == 0x000250, "Member 'ABP_SC_BG_C::beforeLocation' has a wrong offset!");
static_assert(offsetof(ABP_SC_BG_C, BeforeRotation) == 0x00025C, "Member 'ABP_SC_BG_C::BeforeRotation' has a wrong offset!");
static_assert(offsetof(ABP_SC_BG_C, NewVar_0) == 0x000268, "Member 'ABP_SC_BG_C::NewVar_0' has a wrong offset!");

}

