#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SASCutIn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SASCutIn.BP_SASCutIn_C
// 0x0010 (0x00D0 - 0x00C0)
class UBP_SASCutIn_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         SASCordDelaySeconds;                               // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCutInStart;                                      // 0x00CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_SASCutIn(int32 EntryPoint);
	void BeginSASCutIn();
	void ReceiveTick(float DeltaSeconds);
	void BeginCutIn();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SASCutIn_C">();
	}
	static class UBP_SASCutIn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SASCutIn_C>();
	}
};
static_assert(alignof(UBP_SASCutIn_C) == 0x000008, "Wrong alignment on UBP_SASCutIn_C");
static_assert(sizeof(UBP_SASCutIn_C) == 0x0000D0, "Wrong size on UBP_SASCutIn_C");
static_assert(offsetof(UBP_SASCutIn_C, UberGraphFrame) == 0x0000C0, "Member 'UBP_SASCutIn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SASCutIn_C, SASCordDelaySeconds) == 0x0000C8, "Member 'UBP_SASCutIn_C::SASCordDelaySeconds' has a wrong offset!");
static_assert(offsetof(UBP_SASCutIn_C, IsCutInStart) == 0x0000CC, "Member 'UBP_SASCutIn_C::IsCutInStart' has a wrong offset!");

}

