#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_static_pl

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_static_pl.BP_static_pl_C
// 0x0050 (0x0520 - 0x04D0)
class ABP_static_pl_C final : public ACharacter
{
public:
	uint8                                         Pad_5A88[0x8];                                     // 0x04C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         ShaderAnimMontageWeightTimeLine_Track_4968E95C444F065F9FBD9DBDD7CC82E4; // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ShaderAnimMontageWeightTimeLine__Direction_4968E95C444F065F9FBD9DBDD7CC82E4; // 0x04DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A89[0x3];                                     // 0x04DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ShaderAnimMontageWeightTimeLine;                   // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AttachCaptureActorNum;                             // 0x04E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ParentCaptureActorNum;                             // 0x04EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGeneralStatic;                                   // 0x04F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A8A[0x7];                                     // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPCaptureActor_C*                      ParentCaptureActor;                                // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         DestroyList;                                       // 0x0500(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	class ABP_MatchIDWidgetActor_C*               MatchIDWidgetActor;                                // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_static_pl(int32 EntryPoint);
	void CreateMatchIDWidget();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void StartShaderAnimMontageWeightTimeLine(class UCurveFloat* Curve);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void PlayBoardAnimation(class UAnimMontage* AnimMontage, bool IsLoop);
	void SetTicks(bool Enabled);
	void ShaderAnimMontageWeightTimeLine__UpdateFunc();
	void ShaderAnimMontageWeightTimeLine__FinishedFunc();
	void StopMoveTransform();
	void PrivateSetTicks(bool Enabled);
	void PrivatePlayBoardAnimation(class UAnimMontage* AnimMontage, bool InIsLoop);
	void SetIsGeneralStaticFlag(bool Param_IsGeneralStatic);
	void SetPauseTimerHandle(bool IsPause);
	void StartMatchIDWidget(const class FName CharaID, const class FName ArmyCodeMessageID, const struct FVector& Scale);
	void EndMatchIDWidget();
	void SetHiddenInGameMatchIDWidget(bool NewHidden);
	void SetToneMapCounter(float Value);
	void ClearAttachEventAsset();
	void SetAlphaAttachEventAsset(float FloatParam);
	void SetMaterialUseCrossFadeAlpha(bool Enable);
	void EventEnd();
	void IsAnimationPlay(bool* IsPlay);
	void IsAnimationPlayToggle(bool* PlayToggle);
	void IsPlayBeforeAnimation(bool* IsPlay);
	void StopBoadAnimation(bool* NewParam);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_static_pl_C">();
	}
	static class ABP_static_pl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_static_pl_C>();
	}
};
static_assert(alignof(ABP_static_pl_C) == 0x000010, "Wrong alignment on ABP_static_pl_C");
static_assert(sizeof(ABP_static_pl_C) == 0x000520, "Wrong size on ABP_static_pl_C");
static_assert(offsetof(ABP_static_pl_C, UberGraphFrame) == 0x0004D0, "Member 'ABP_static_pl_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_static_pl_C, ShaderAnimMontageWeightTimeLine_Track_4968E95C444F065F9FBD9DBDD7CC82E4) == 0x0004D8, "Member 'ABP_static_pl_C::ShaderAnimMontageWeightTimeLine_Track_4968E95C444F065F9FBD9DBDD7CC82E4' has a wrong offset!");
static_assert(offsetof(ABP_static_pl_C, ShaderAnimMontageWeightTimeLine__Direction_4968E95C444F065F9FBD9DBDD7CC82E4) == 0x0004DC, "Member 'ABP_static_pl_C::ShaderAnimMontageWeightTimeLine__Direction_4968E95C444F065F9FBD9DBDD7CC82E4' has a wrong offset!");
static_assert(offsetof(ABP_static_pl_C, ShaderAnimMontageWeightTimeLine) == 0x0004E0, "Member 'ABP_static_pl_C::ShaderAnimMontageWeightTimeLine' has a wrong offset!");
static_assert(offsetof(ABP_static_pl_C, AttachCaptureActorNum) == 0x0004E8, "Member 'ABP_static_pl_C::AttachCaptureActorNum' has a wrong offset!");
static_assert(offsetof(ABP_static_pl_C, ParentCaptureActorNum) == 0x0004EC, "Member 'ABP_static_pl_C::ParentCaptureActorNum' has a wrong offset!");
static_assert(offsetof(ABP_static_pl_C, IsGeneralStatic) == 0x0004F0, "Member 'ABP_static_pl_C::IsGeneralStatic' has a wrong offset!");
static_assert(offsetof(ABP_static_pl_C, ParentCaptureActor) == 0x0004F8, "Member 'ABP_static_pl_C::ParentCaptureActor' has a wrong offset!");
static_assert(offsetof(ABP_static_pl_C, DestroyList) == 0x000500, "Member 'ABP_static_pl_C::DestroyList' has a wrong offset!");
static_assert(offsetof(ABP_static_pl_C, MatchIDWidgetActor) == 0x000510, "Member 'ABP_static_pl_C::MatchIDWidgetActor' has a wrong offset!");

}

