#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SC_BG

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SC_BG.BP_SC_BG_C.ExecuteUbergraph_BP_SC_BG
// 0x0280 (0x0280 - 0x0000)
struct BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_666C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_666D[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_666E[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_2;        // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_666F[0xC];                                     // 0x00D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_3;        // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x011C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6670[0x3];                                     // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6671[0xC];                                     // 0x01B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x01C0(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult_1;    // 0x01F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue_1;       // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG) == 0x000010, "Wrong alignment on BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG");
static_assert(sizeof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG) == 0x000280, "Wrong size on BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, EntryPoint) == 0x000000, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_GetEventManager_EventManager) == 0x000008, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, K2Node_SwitchEnum_CmpSuccess) == 0x000015, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_IsValid_ReturnValue_1) == 0x000024, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_BreakVector_X) == 0x000028, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_BreakVector_Y) == 0x00002C, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_BreakVector_Z) == 0x000030, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000034, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000040, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00004C, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000058, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_BreakVector_X_1) == 0x000064, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_BreakVector_Y_1) == 0x000068, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_BreakVector_Z_1) == 0x00006C, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_Add_FloatFloat_ReturnValue) == 0x000070, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000074, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_MakeVector_ReturnValue) == 0x000080, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x00008C, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000098, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x0000A4, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B0, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_K2_GetActorRotation_ReturnValue_2) == 0x0000BC, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_K2_GetActorRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x0000C8, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_MakeTransform_ReturnValue) == 0x0000E0, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_K2_GetActorRotation_ReturnValue_3) == 0x000110, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_K2_GetActorRotation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x00011C, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0001A4, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_ComposeRotators_ReturnValue) == 0x0001A8, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_MakeTransform_ReturnValue_1) == 0x0001C0, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_K2_SetActorTransform_SweepHitResult_1) == 0x0001F0, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_K2_SetActorTransform_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG, CallFunc_K2_SetActorTransform_ReturnValue_1) == 0x000278, "Member 'BP_SC_BG_C_ExecuteUbergraph_BP_SC_BG::CallFunc_K2_SetActorTransform_ReturnValue_1' has a wrong offset!");

// Function BP_SC_BG.BP_SC_BG_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SC_BG_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SC_BG_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SC_BG_C_ReceiveTick");
static_assert(sizeof(BP_SC_BG_C_ReceiveTick) == 0x000004, "Wrong size on BP_SC_BG_C_ReceiveTick");
static_assert(offsetof(BP_SC_BG_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SC_BG_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

