#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpecialStaticNodeActor

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SpecialStaticNodeActor.BP_SpecialStaticNodeActor_C.ExecuteUbergraph_BP_SpecialStaticNodeActor
// 0x0128 (0x0128 - 0x0000)
struct BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UAnimMontage* Montage)>  K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57D5[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57D6[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_SpecialNodeAnimNamePath_1;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsLoop_2;                             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsAddMotion;                          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57D7[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_SpecialNodeAnimNamePath;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsLoop_1;                             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57D8[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_SpecialNodeAnimPath_1;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsLoop;                               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57D9[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_CustomEvent_AnimMontage;                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_montageLength;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57DA[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAnimMontage* Montage, bool bInterrupted)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	EAnimationMode                                CallFunc_GetAnimationMode_ReturnValue;             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57DB[0x6];                                     // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationMode                                CallFunc_GetAnimationMode_ReturnValue_1;           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57DC[0x5];                                     // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_CustomEvent_Montage_1;                      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInterrupted;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57DD[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_CustomEvent_Montage;                        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57DE[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_SpecialNodeAnimPath;                  // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57DF[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            K2Node_CustomEvent_Curve;                          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57E0[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimationMode                                CallFunc_GetAnimationMode_ReturnValue_2;           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57E1[0x5];                                     // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_co0300_C*                          K2Node_DynamicCast_AsABP_Co_0300;                  // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor) == 0x000008, "Wrong alignment on BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor");
static_assert(sizeof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor) == 0x000128, "Wrong size on BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, EntryPoint) == 0x000000, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, CallFunc_Greater_IntInt_ReturnValue) == 0x000030, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, CallFunc_IsPlaying_ReturnValue) == 0x000031, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, K2Node_Event_SpecialNodeAnimNamePath_1) == 0x000038, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::K2Node_Event_SpecialNodeAnimNamePath_1' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, K2Node_Event_IsLoop_2) == 0x000048, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::K2Node_Event_IsLoop_2' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, K2Node_Event_IsAddMotion) == 0x000049, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::K2Node_Event_IsAddMotion' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, K2Node_Event_SpecialNodeAnimNamePath) == 0x000050, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::K2Node_Event_SpecialNodeAnimNamePath' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, K2Node_Event_IsLoop_1) == 0x000060, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::K2Node_Event_IsLoop_1' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, K2Node_Event_SpecialNodeAnimPath_1) == 0x000068, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::K2Node_Event_SpecialNodeAnimPath_1' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, K2Node_Event_IsLoop) == 0x000078, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::K2Node_Event_IsLoop' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, K2Node_CustomEvent_AnimMontage) == 0x000080, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::K2Node_CustomEvent_AnimMontage' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, K2Node_CustomEvent_montageLength) == 0x000088, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::K2Node_CustomEvent_montageLength' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, CallFunc_GetAnimInstance_ReturnValue) == 0x000090, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, K2Node_CreateDelegate_OutputDelegate_2) == 0x000098, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, CallFunc_GetAnimationMode_ReturnValue) == 0x0000A8, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::CallFunc_GetAnimationMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000A9, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, CallFunc_GetAnimInstance_ReturnValue_1) == 0x0000B0, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, CallFunc_GetAnimationMode_ReturnValue_1) == 0x0000B8, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::CallFunc_GetAnimationMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, CallFunc_IsValid_ReturnValue) == 0x0000B9, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000BA, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, K2Node_CustomEvent_Montage_1) == 0x0000C0, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::K2Node_CustomEvent_Montage_1' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, K2Node_CustomEvent_bInterrupted) == 0x0000C8, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::K2Node_CustomEvent_bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, K2Node_CustomEvent_Montage) == 0x0000D0, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::K2Node_CustomEvent_Montage' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, CallFunc_Montage_Play_ReturnValue) == 0x0000D8, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, K2Node_Event_SpecialNodeAnimPath) == 0x0000E0, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::K2Node_Event_SpecialNodeAnimPath' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000F0, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, K2Node_CustomEvent_Curve) == 0x0000F8, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::K2Node_CustomEvent_Curve' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, CallFunc_IsValid_ReturnValue_1) == 0x000100, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, CallFunc_GetAnimInstance_ReturnValue_2) == 0x000108, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::CallFunc_GetAnimInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, CallFunc_GetAnimationMode_ReturnValue_2) == 0x000110, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::CallFunc_GetAnimationMode_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, CallFunc_IsValid_ReturnValue_2) == 0x000111, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000112, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, K2Node_DynamicCast_AsABP_Co_0300) == 0x000118, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::K2Node_DynamicCast_AsABP_Co_0300' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'BP_SpecialStaticNodeActor_C_ExecuteUbergraph_BP_SpecialStaticNodeActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_SpecialStaticNodeActor.BP_SpecialStaticNodeActor_C.SetNodeAddAnimWeightCurve
// 0x0008 (0x0008 - 0x0000)
struct BP_SpecialStaticNodeActor_C_SetNodeAddAnimWeightCurve final
{
public:
	class UCurveFloat*                            Curve;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpecialStaticNodeActor_C_SetNodeAddAnimWeightCurve) == 0x000008, "Wrong alignment on BP_SpecialStaticNodeActor_C_SetNodeAddAnimWeightCurve");
static_assert(sizeof(BP_SpecialStaticNodeActor_C_SetNodeAddAnimWeightCurve) == 0x000008, "Wrong size on BP_SpecialStaticNodeActor_C_SetNodeAddAnimWeightCurve");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_SetNodeAddAnimWeightCurve, Curve) == 0x000000, "Member 'BP_SpecialStaticNodeActor_C_SetNodeAddAnimWeightCurve::Curve' has a wrong offset!");

// Function BP_SpecialStaticNodeActor.BP_SpecialStaticNodeActor_C.PlayAddSpecialNodeAnimMontage
// 0x0010 (0x0010 - 0x0000)
struct BP_SpecialStaticNodeActor_C_PlayAddSpecialNodeAnimMontage final
{
public:
	class FString                                 SpecialNodeAnimPath;                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpecialStaticNodeActor_C_PlayAddSpecialNodeAnimMontage) == 0x000008, "Wrong alignment on BP_SpecialStaticNodeActor_C_PlayAddSpecialNodeAnimMontage");
static_assert(sizeof(BP_SpecialStaticNodeActor_C_PlayAddSpecialNodeAnimMontage) == 0x000010, "Wrong size on BP_SpecialStaticNodeActor_C_PlayAddSpecialNodeAnimMontage");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PlayAddSpecialNodeAnimMontage, SpecialNodeAnimPath) == 0x000000, "Member 'BP_SpecialStaticNodeActor_C_PlayAddSpecialNodeAnimMontage::SpecialNodeAnimPath' has a wrong offset!");

// Function BP_SpecialStaticNodeActor.BP_SpecialStaticNodeActor_C.«¹¿à¤ÙóÈ_0
// 0x0008 (0x0008 - 0x0000)
struct BP_SpecialStaticNodeActor_C__________0 final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpecialStaticNodeActor_C__________0) == 0x000008, "Wrong alignment on BP_SpecialStaticNodeActor_C__________0");
static_assert(sizeof(BP_SpecialStaticNodeActor_C__________0) == 0x000008, "Wrong size on BP_SpecialStaticNodeActor_C__________0");
static_assert(offsetof(BP_SpecialStaticNodeActor_C__________0, Montage) == 0x000000, "Member 'BP_SpecialStaticNodeActor_C__________0::Montage' has a wrong offset!");

// Function BP_SpecialStaticNodeActor.BP_SpecialStaticNodeActor_C.OnStaticNodeMontageEnd
// 0x0010 (0x0010 - 0x0000)
struct BP_SpecialStaticNodeActor_C_OnStaticNodeMontageEnd final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SpecialStaticNodeActor_C_OnStaticNodeMontageEnd) == 0x000008, "Wrong alignment on BP_SpecialStaticNodeActor_C_OnStaticNodeMontageEnd");
static_assert(sizeof(BP_SpecialStaticNodeActor_C_OnStaticNodeMontageEnd) == 0x000010, "Wrong size on BP_SpecialStaticNodeActor_C_OnStaticNodeMontageEnd");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_OnStaticNodeMontageEnd, Montage) == 0x000000, "Member 'BP_SpecialStaticNodeActor_C_OnStaticNodeMontageEnd::Montage' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_OnStaticNodeMontageEnd, bInterrupted) == 0x000008, "Member 'BP_SpecialStaticNodeActor_C_OnStaticNodeMontageEnd::bInterrupted' has a wrong offset!");

// Function BP_SpecialStaticNodeActor.BP_SpecialStaticNodeActor_C.WaitMontageEnd
// 0x0010 (0x0010 - 0x0000)
struct BP_SpecialStaticNodeActor_C_WaitMontageEnd final
{
public:
	class UAnimMontage*                           AnimMontage;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MontageLength;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpecialStaticNodeActor_C_WaitMontageEnd) == 0x000008, "Wrong alignment on BP_SpecialStaticNodeActor_C_WaitMontageEnd");
static_assert(sizeof(BP_SpecialStaticNodeActor_C_WaitMontageEnd) == 0x000010, "Wrong size on BP_SpecialStaticNodeActor_C_WaitMontageEnd");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_WaitMontageEnd, AnimMontage) == 0x000000, "Member 'BP_SpecialStaticNodeActor_C_WaitMontageEnd::AnimMontage' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_WaitMontageEnd, MontageLength) == 0x000008, "Member 'BP_SpecialStaticNodeActor_C_WaitMontageEnd::MontageLength' has a wrong offset!");

// Function BP_SpecialStaticNodeActor.BP_SpecialStaticNodeActor_C.PlaySpecialNodeAnimMontage
// 0x0018 (0x0018 - 0x0000)
struct BP_SpecialStaticNodeActor_C_PlaySpecialNodeAnimMontage final
{
public:
	class FString                                 SpecialNodeAnimPath;                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsLoop;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SpecialStaticNodeActor_C_PlaySpecialNodeAnimMontage) == 0x000008, "Wrong alignment on BP_SpecialStaticNodeActor_C_PlaySpecialNodeAnimMontage");
static_assert(sizeof(BP_SpecialStaticNodeActor_C_PlaySpecialNodeAnimMontage) == 0x000018, "Wrong size on BP_SpecialStaticNodeActor_C_PlaySpecialNodeAnimMontage");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PlaySpecialNodeAnimMontage, SpecialNodeAnimPath) == 0x000000, "Member 'BP_SpecialStaticNodeActor_C_PlaySpecialNodeAnimMontage::SpecialNodeAnimPath' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PlaySpecialNodeAnimMontage, IsLoop) == 0x000010, "Member 'BP_SpecialStaticNodeActor_C_PlaySpecialNodeAnimMontage::IsLoop' has a wrong offset!");

// Function BP_SpecialStaticNodeActor.BP_SpecialStaticNodeActor_C.AddSpecialNodeAnimation
// 0x0018 (0x0018 - 0x0000)
struct BP_SpecialStaticNodeActor_C_AddSpecialNodeAnimation final
{
public:
	class FString                                 SpecialNodeAnimNamePath;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsLoop;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SpecialStaticNodeActor_C_AddSpecialNodeAnimation) == 0x000008, "Wrong alignment on BP_SpecialStaticNodeActor_C_AddSpecialNodeAnimation");
static_assert(sizeof(BP_SpecialStaticNodeActor_C_AddSpecialNodeAnimation) == 0x000018, "Wrong size on BP_SpecialStaticNodeActor_C_AddSpecialNodeAnimation");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_AddSpecialNodeAnimation, SpecialNodeAnimNamePath) == 0x000000, "Member 'BP_SpecialStaticNodeActor_C_AddSpecialNodeAnimation::SpecialNodeAnimNamePath' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_AddSpecialNodeAnimation, IsLoop) == 0x000010, "Member 'BP_SpecialStaticNodeActor_C_AddSpecialNodeAnimation::IsLoop' has a wrong offset!");

// Function BP_SpecialStaticNodeActor.BP_SpecialStaticNodeActor_C.PlaySpecialNodeAnimation
// 0x0018 (0x0018 - 0x0000)
struct BP_SpecialStaticNodeActor_C_PlaySpecialNodeAnimation final
{
public:
	class FString                                 SpecialNodeAnimNamePath;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsLoop;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsAddMotion;                                       // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SpecialStaticNodeActor_C_PlaySpecialNodeAnimation) == 0x000008, "Wrong alignment on BP_SpecialStaticNodeActor_C_PlaySpecialNodeAnimation");
static_assert(sizeof(BP_SpecialStaticNodeActor_C_PlaySpecialNodeAnimation) == 0x000018, "Wrong size on BP_SpecialStaticNodeActor_C_PlaySpecialNodeAnimation");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PlaySpecialNodeAnimation, SpecialNodeAnimNamePath) == 0x000000, "Member 'BP_SpecialStaticNodeActor_C_PlaySpecialNodeAnimation::SpecialNodeAnimNamePath' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PlaySpecialNodeAnimation, IsLoop) == 0x000010, "Member 'BP_SpecialStaticNodeActor_C_PlaySpecialNodeAnimation::IsLoop' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PlaySpecialNodeAnimation, IsAddMotion) == 0x000011, "Member 'BP_SpecialStaticNodeActor_C_PlaySpecialNodeAnimation::IsAddMotion' has a wrong offset!");

// Function BP_SpecialStaticNodeActor.BP_SpecialStaticNodeActor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SpecialStaticNodeActor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpecialStaticNodeActor_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SpecialStaticNodeActor_C_ReceiveTick");
static_assert(sizeof(BP_SpecialStaticNodeActor_C_ReceiveTick) == 0x000004, "Wrong size on BP_SpecialStaticNodeActor_C_ReceiveTick");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SpecialStaticNodeActor_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_SpecialStaticNodeActor.BP_SpecialStaticNodeActor_C.PrivateAddSpecialNodeAnimation
// 0x0030 (0x0030 - 0x0000)
struct BP_SpecialStaticNodeActor_C_PrivateAddSpecialNodeAnimation final
{
public:
	class FString                                 SpecialNodeAnimNamePath;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsLoop;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57E2[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DefaultPath;                                       // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpecialStaticNodeActor_C_PrivateAddSpecialNodeAnimation) == 0x000008, "Wrong alignment on BP_SpecialStaticNodeActor_C_PrivateAddSpecialNodeAnimation");
static_assert(sizeof(BP_SpecialStaticNodeActor_C_PrivateAddSpecialNodeAnimation) == 0x000030, "Wrong size on BP_SpecialStaticNodeActor_C_PrivateAddSpecialNodeAnimation");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivateAddSpecialNodeAnimation, SpecialNodeAnimNamePath) == 0x000000, "Member 'BP_SpecialStaticNodeActor_C_PrivateAddSpecialNodeAnimation::SpecialNodeAnimNamePath' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivateAddSpecialNodeAnimation, IsLoop) == 0x000010, "Member 'BP_SpecialStaticNodeActor_C_PrivateAddSpecialNodeAnimation::IsLoop' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivateAddSpecialNodeAnimation, DefaultPath) == 0x000018, "Member 'BP_SpecialStaticNodeActor_C_PrivateAddSpecialNodeAnimation::DefaultPath' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivateAddSpecialNodeAnimation, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'BP_SpecialStaticNodeActor_C_PrivateAddSpecialNodeAnimation::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivateAddSpecialNodeAnimation, CallFunc_Array_Add_ReturnValue_1) == 0x00002C, "Member 'BP_SpecialStaticNodeActor_C_PrivateAddSpecialNodeAnimation::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function BP_SpecialStaticNodeActor.BP_SpecialStaticNodeActor_C.PrivatePlaySpecialNodeAnimation
// 0x0030 (0x0030 - 0x0000)
struct BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimation final
{
public:
	class FString                                 SpecialNodeAnimNamePath;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsLoop;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsAddMotion;                                       // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57E3[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DefaultPath;                                       // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UAnimationAsset*                        CallFunc_GetAnimSequenceFromPath_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimation) == 0x000008, "Wrong alignment on BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimation");
static_assert(sizeof(BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimation) == 0x000030, "Wrong size on BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimation");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimation, SpecialNodeAnimNamePath) == 0x000000, "Member 'BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimation::SpecialNodeAnimNamePath' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimation, IsLoop) == 0x000010, "Member 'BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimation::IsLoop' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimation, IsAddMotion) == 0x000011, "Member 'BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimation::IsAddMotion' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimation, DefaultPath) == 0x000018, "Member 'BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimation::DefaultPath' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimation, CallFunc_GetAnimSequenceFromPath_ReturnValue) == 0x000028, "Member 'BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimation::CallFunc_GetAnimSequenceFromPath_ReturnValue' has a wrong offset!");

// Function BP_SpecialStaticNodeActor.BP_SpecialStaticNodeActor_C.IsEndMotion
// 0x000C (0x000C - 0x0000)
struct BP_SpecialStaticNodeActor_C_IsEndMotion final
{
public:
	bool                                          Param_IsEndMotion;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57E4[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SpecialStaticNodeActor_C_IsEndMotion) == 0x000004, "Wrong alignment on BP_SpecialStaticNodeActor_C_IsEndMotion");
static_assert(sizeof(BP_SpecialStaticNodeActor_C_IsEndMotion) == 0x00000C, "Wrong size on BP_SpecialStaticNodeActor_C_IsEndMotion");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_IsEndMotion, Param_IsEndMotion) == 0x000000, "Member 'BP_SpecialStaticNodeActor_C_IsEndMotion::Param_IsEndMotion' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_IsEndMotion, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_SpecialStaticNodeActor_C_IsEndMotion::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_IsEndMotion, CallFunc_IsPlaying_ReturnValue) == 0x000008, "Member 'BP_SpecialStaticNodeActor_C_IsEndMotion::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_IsEndMotion, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000009, "Member 'BP_SpecialStaticNodeActor_C_IsEndMotion::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_IsEndMotion, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x00000A, "Member 'BP_SpecialStaticNodeActor_C_IsEndMotion::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_IsEndMotion, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'BP_SpecialStaticNodeActor_C_IsEndMotion::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_SpecialStaticNodeActor.BP_SpecialStaticNodeActor_C.PrivatePlaySpecialNodeAnimMontage
// 0x0050 (0x0050 - 0x0000)
struct BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage final
{
public:
	class FString                                 SpecialNodeAnimNamePath;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsLoop;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsAdd;                                             // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57E5[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DefaultPath;                                       // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UAnimationAsset*                        CallFunc_GetAnimSequenceFromPath_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAnimationMode                                CallFunc_GetAnimationMode_ReturnValue;             // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E6[0x5];                                     // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57E7[0x2];                                     // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage) == 0x000008, "Wrong alignment on BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage");
static_assert(sizeof(BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage) == 0x000050, "Wrong size on BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage, SpecialNodeAnimNamePath) == 0x000000, "Member 'BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage::SpecialNodeAnimNamePath' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage, IsLoop) == 0x000010, "Member 'BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage::IsLoop' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage, IsAdd) == 0x000011, "Member 'BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage::IsAdd' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage, DefaultPath) == 0x000018, "Member 'BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage::DefaultPath' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage, CallFunc_GetAnimSequenceFromPath_ReturnValue) == 0x000028, "Member 'BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage::CallFunc_GetAnimSequenceFromPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage, K2Node_DynamicCast_AsAnim_Montage) == 0x000030, "Member 'BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000039, "Member 'BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage, CallFunc_GetAnimationMode_ReturnValue) == 0x00003A, "Member 'BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage::CallFunc_GetAnimationMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage, CallFunc_GetAnimInstance_ReturnValue) == 0x000040, "Member 'BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000048, "Member 'BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage, CallFunc_Montage_Play_ReturnValue) == 0x00004C, "Member 'BP_SpecialStaticNodeActor_C_PrivatePlaySpecialNodeAnimMontage::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");

// Function BP_SpecialStaticNodeActor.BP_SpecialStaticNodeActor_C.OnAnimMontageEnded
// 0x0020 (0x0020 - 0x0000)
struct BP_SpecialStaticNodeActor_C_OnAnimMontageEnded final
{
public:
	class UAnimMontage*                           AnimMontage;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Interrupted;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EAnimationMode                                CallFunc_GetAnimationMode_ReturnValue;             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E8[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SpecialStaticNodeActor_C_OnAnimMontageEnded) == 0x000008, "Wrong alignment on BP_SpecialStaticNodeActor_C_OnAnimMontageEnded");
static_assert(sizeof(BP_SpecialStaticNodeActor_C_OnAnimMontageEnded) == 0x000020, "Wrong size on BP_SpecialStaticNodeActor_C_OnAnimMontageEnded");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_OnAnimMontageEnded, AnimMontage) == 0x000000, "Member 'BP_SpecialStaticNodeActor_C_OnAnimMontageEnded::AnimMontage' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_OnAnimMontageEnded, Interrupted) == 0x000008, "Member 'BP_SpecialStaticNodeActor_C_OnAnimMontageEnded::Interrupted' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_OnAnimMontageEnded, CallFunc_GetAnimationMode_ReturnValue) == 0x000009, "Member 'BP_SpecialStaticNodeActor_C_OnAnimMontageEnded::CallFunc_GetAnimationMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_OnAnimMontageEnded, CallFunc_GetAnimInstance_ReturnValue) == 0x000010, "Member 'BP_SpecialStaticNodeActor_C_OnAnimMontageEnded::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_OnAnimMontageEnded, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000018, "Member 'BP_SpecialStaticNodeActor_C_OnAnimMontageEnded::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_SpecialStaticNodeActor.BP_SpecialStaticNodeActor_C.PrivateStopAddSpecialNodeAnimMontage
// 0x0028 (0x0028 - 0x0000)
struct BP_SpecialStaticNodeActor_C_PrivateStopAddSpecialNodeAnimMontage final
{
public:
	class FString                                 DefaultPath;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57E9[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SpecialStaticNodeActor_C_PrivateStopAddSpecialNodeAnimMontage) == 0x000008, "Wrong alignment on BP_SpecialStaticNodeActor_C_PrivateStopAddSpecialNodeAnimMontage");
static_assert(sizeof(BP_SpecialStaticNodeActor_C_PrivateStopAddSpecialNodeAnimMontage) == 0x000028, "Wrong size on BP_SpecialStaticNodeActor_C_PrivateStopAddSpecialNodeAnimMontage");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivateStopAddSpecialNodeAnimMontage, DefaultPath) == 0x000000, "Member 'BP_SpecialStaticNodeActor_C_PrivateStopAddSpecialNodeAnimMontage::DefaultPath' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivateStopAddSpecialNodeAnimMontage, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_SpecialStaticNodeActor_C_PrivateStopAddSpecialNodeAnimMontage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivateStopAddSpecialNodeAnimMontage, CallFunc_GetAnimInstance_ReturnValue) == 0x000018, "Member 'BP_SpecialStaticNodeActor_C_PrivateStopAddSpecialNodeAnimMontage::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_PrivateStopAddSpecialNodeAnimMontage, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'BP_SpecialStaticNodeActor_C_PrivateStopAddSpecialNodeAnimMontage::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_SpecialStaticNodeActor.BP_SpecialStaticNodeActor_C.GetSkeletalMesh
// 0x0008 (0x0008 - 0x0000)
struct BP_SpecialStaticNodeActor_C_GetSkeletalMesh final
{
public:
	class USkeletalMeshComponent*                 Param_SkeletalMesh;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpecialStaticNodeActor_C_GetSkeletalMesh) == 0x000008, "Wrong alignment on BP_SpecialStaticNodeActor_C_GetSkeletalMesh");
static_assert(sizeof(BP_SpecialStaticNodeActor_C_GetSkeletalMesh) == 0x000008, "Wrong size on BP_SpecialStaticNodeActor_C_GetSkeletalMesh");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_GetSkeletalMesh, Param_SkeletalMesh) == 0x000000, "Member 'BP_SpecialStaticNodeActor_C_GetSkeletalMesh::Param_SkeletalMesh' has a wrong offset!");

// Function BP_SpecialStaticNodeActor.BP_SpecialStaticNodeActor_C.GetStaticMesh
// 0x0008 (0x0008 - 0x0000)
struct BP_SpecialStaticNodeActor_C_GetStaticMesh final
{
public:
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpecialStaticNodeActor_C_GetStaticMesh) == 0x000008, "Wrong alignment on BP_SpecialStaticNodeActor_C_GetStaticMesh");
static_assert(sizeof(BP_SpecialStaticNodeActor_C_GetStaticMesh) == 0x000008, "Wrong size on BP_SpecialStaticNodeActor_C_GetStaticMesh");
static_assert(offsetof(BP_SpecialStaticNodeActor_C_GetStaticMesh, StaticMesh) == 0x000000, "Member 'BP_SpecialStaticNodeActor_C_GetStaticMesh::StaticMesh' has a wrong offset!");

}

