#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SASManager

#include "Basic.hpp"

#include "AcceleratorParam_structs.hpp"
#include "Engine_structs.hpp"
#include "E_SASKind_structs.hpp"
#include "FSASCommand_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FSASCommandInternal_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "F_SASParam_structs.hpp"
#include "FSASSequencerData_structs.hpp"
#include "FSASElectricParam_structs.hpp"
#include "FSASFireParam_structs.hpp"
#include "FSASSeeThroughParam_structs.hpp"
#include "FSASMetalParam_structs.hpp"
#include "FSASTelepoParam_structs.hpp"
#include "FSASStealthParam_structs.hpp"
#include "FSASCopyParam_structs.hpp"
#include "FSASPsychicParam_structs.hpp"


namespace SDK::Params
{

// Function BP_SASManager.BP_SASManager_C.ExecuteUbergraph_BP_SASManager
// 0x01D0 (0x01D0 - 0x0000)
struct BP_SASManager_C_ExecuteUbergraph_BP_SASManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41CE[0xA];                                     // 0x0006(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CutinManager_C*                     CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAcceleratorParam                      K2Node_Event_Parameter_1;                          // 0x0050(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41CF[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_17;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHologram_1;                          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41D0[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAcceleratorParam                      K2Node_Event_Parameter;                            // 0x006C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Owner_16;                             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_8;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHologram;                            // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFSASElectricParam                     K2Node_Event_param_15;                             // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D1[0x2];                                     // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_15;                             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASElectricParam                     K2Node_Event_param_14;                             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D2[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_14;                             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_7;                         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASFireParam                         K2Node_Event_param_13;                             // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D3[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_13;                             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASFireParam                         K2Node_Event_param_12;                             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D4[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_12;                             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_6;                         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASMetalParam                        K2Node_Event_param_11;                             // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D5[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_11;                             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASMetalParam                        K2Node_Event_param_10;                             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D6[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_10;                             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_5;                         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASSeeThroughParam                   K2Node_Event_param_9;                              // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D7[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_9;                              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASSeeThroughParam                   K2Node_Event_param_8;                              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D8[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_8;                              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_4;                         // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASTelepoParam                       K2Node_Event_param_7;                              // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D9[0x3];                                     // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_7;                              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASTelepoParam                       K2Node_Event_param_6;                              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41DA[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_6;                              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_3;                         // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASStealthParam                      K2Node_Event_param_5;                              // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41DB[0x3];                                     // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_5;                              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASStealthParam                      K2Node_Event_param_4;                              // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41DC[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_4;                              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_2;                         // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASCopyParam                         K2Node_Event_param_3;                              // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41DD[0x3];                                     // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_3;                              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASCopyParam                         K2Node_Event_param_2;                              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41DE[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_2;                              // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_1;                         // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASPsychicParam                      K2Node_Event_param_1;                              // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41DF[0x3];                                     // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_1;                              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASPsychicParam                      K2Node_Event_param;                                // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41E0[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner;                                // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime;                           // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41E1[0x6];                                     // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CutinManager_C*                     CallFunc_GetCutinManager_CutinManager;             // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41E2[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameSystemManager_C*                CallFunc_GetGameSystemManager_Manater;             // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41E3[0x3];                                     // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentCustomTimeDilation_CustomTimeDilation; // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01B4(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager) == 0x000010, "Wrong alignment on BP_SASManager_C_ExecuteUbergraph_BP_SASManager");
static_assert(sizeof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager) == 0x0001D0, "Wrong size on BP_SASManager_C_ExecuteUbergraph_BP_SASManager");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, EntryPoint) == 0x000000, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, CallFunc_FinishSpawningActor_ReturnValue) == 0x000048, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_Parameter_1) == 0x000050, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_Parameter_1' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_Owner_17) == 0x000060, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_Owner_17' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_bHologram_1) == 0x000068, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_bHologram_1' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_Parameter) == 0x00006C, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_Parameter' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_Owner_16) == 0x000078, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_Owner_16' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_RemainTime_8) == 0x000080, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_RemainTime_8' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_bHologram) == 0x000084, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_bHologram' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_param_15) == 0x000085, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_param_15' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_Owner_15) == 0x000088, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_Owner_15' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_param_14) == 0x000090, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_param_14' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_Owner_14) == 0x000098, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_Owner_14' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_RemainTime_7) == 0x0000A0, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_RemainTime_7' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_param_13) == 0x0000A4, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_param_13' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_Owner_13) == 0x0000A8, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_Owner_13' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_param_12) == 0x0000B0, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_param_12' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_Owner_12) == 0x0000B8, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_Owner_12' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_RemainTime_6) == 0x0000C0, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_RemainTime_6' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_param_11) == 0x0000C4, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_param_11' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_Owner_11) == 0x0000C8, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_Owner_11' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_param_10) == 0x0000D0, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_param_10' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_Owner_10) == 0x0000D8, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_Owner_10' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_RemainTime_5) == 0x0000E0, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_RemainTime_5' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_param_9) == 0x0000E4, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_param_9' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_Owner_9) == 0x0000E8, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_Owner_9' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_param_8) == 0x0000F0, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_param_8' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_Owner_8) == 0x0000F8, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_Owner_8' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_RemainTime_4) == 0x000100, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_RemainTime_4' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_param_7) == 0x000104, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_param_7' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_Owner_7) == 0x000108, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_Owner_7' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_param_6) == 0x000110, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_param_6' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_Owner_6) == 0x000118, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_Owner_6' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_RemainTime_3) == 0x000120, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_RemainTime_3' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_param_5) == 0x000124, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_param_5' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_Owner_5) == 0x000128, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_Owner_5' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_param_4) == 0x000130, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_param_4' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_Owner_4) == 0x000138, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_Owner_4' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_RemainTime_2) == 0x000140, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_RemainTime_2' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_param_3) == 0x000144, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_param_3' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_Owner_3) == 0x000148, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_Owner_3' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_param_2) == 0x000150, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_param_2' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_Owner_2) == 0x000158, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_Owner_2' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_RemainTime_1) == 0x000160, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_RemainTime_1' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_param_1) == 0x000164, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_param_1' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_Owner_1) == 0x000168, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_Owner_1' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_param) == 0x000170, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_param' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_Owner) == 0x000178, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_Owner' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_RemainTime) == 0x000180, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_RemainTime' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_DeltaSeconds) == 0x000184, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000188, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000189, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, CallFunc_GetCutinManager_CutinManager) == 0x000190, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::CallFunc_GetCutinManager_CutinManager' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, CallFunc_BooleanOR_ReturnValue) == 0x000198, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, CallFunc_GetGameSystemManager_Manater) == 0x0001A0, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::CallFunc_GetGameSystemManager_Manater' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_Event_EndPlayReason) == 0x0001A8, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, CallFunc_GetCurrentCustomTimeDilation_CustomTimeDilation) == 0x0001AC, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::CallFunc_GetCurrentCustomTimeDilation_CustomTimeDilation' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001B0, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_ExecuteUbergraph_BP_SASManager, K2Node_CreateDelegate_OutputDelegate) == 0x0001B4, "Member 'BP_SASManager_C_ExecuteUbergraph_BP_SASManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_SASManager.BP_SASManager_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_SASManager_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASManager_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_SASManager_C_ReceiveEndPlay");
static_assert(sizeof(BP_SASManager_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_SASManager_C_ReceiveEndPlay");
static_assert(offsetof(BP_SASManager_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_SASManager_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_SASManager.BP_SASManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SASManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SASManager_C_ReceiveTick");
static_assert(sizeof(BP_SASManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_SASManager_C_ReceiveTick");
static_assert(offsetof(BP_SASManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SASManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_SASManager.BP_SASManager_C.OnPsychicEnd
// 0x0018 (0x0018 - 0x0000)
struct BP_SASManager_C_OnPsychicEnd final
{
public:
	struct FFSASPsychicParam                      Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41E4[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASManager_C_OnPsychicEnd) == 0x000008, "Wrong alignment on BP_SASManager_C_OnPsychicEnd");
static_assert(sizeof(BP_SASManager_C_OnPsychicEnd) == 0x000018, "Wrong size on BP_SASManager_C_OnPsychicEnd");
static_assert(offsetof(BP_SASManager_C_OnPsychicEnd, Param) == 0x000000, "Member 'BP_SASManager_C_OnPsychicEnd::Param' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnPsychicEnd, Param_Owner) == 0x000008, "Member 'BP_SASManager_C_OnPsychicEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnPsychicEnd, RemainTime) == 0x000010, "Member 'BP_SASManager_C_OnPsychicEnd::RemainTime' has a wrong offset!");

// Function BP_SASManager.BP_SASManager_C.OnPsychicStart
// 0x0010 (0x0010 - 0x0000)
struct BP_SASManager_C_OnPsychicStart final
{
public:
	struct FFSASPsychicParam                      Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41E5[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASManager_C_OnPsychicStart) == 0x000008, "Wrong alignment on BP_SASManager_C_OnPsychicStart");
static_assert(sizeof(BP_SASManager_C_OnPsychicStart) == 0x000010, "Wrong size on BP_SASManager_C_OnPsychicStart");
static_assert(offsetof(BP_SASManager_C_OnPsychicStart, Param) == 0x000000, "Member 'BP_SASManager_C_OnPsychicStart::Param' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnPsychicStart, Param_Owner) == 0x000008, "Member 'BP_SASManager_C_OnPsychicStart::Param_Owner' has a wrong offset!");

// Function BP_SASManager.BP_SASManager_C.OnCopyEnd
// 0x0018 (0x0018 - 0x0000)
struct BP_SASManager_C_OnCopyEnd final
{
public:
	struct FFSASCopyParam                         Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41E6[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASManager_C_OnCopyEnd) == 0x000008, "Wrong alignment on BP_SASManager_C_OnCopyEnd");
static_assert(sizeof(BP_SASManager_C_OnCopyEnd) == 0x000018, "Wrong size on BP_SASManager_C_OnCopyEnd");
static_assert(offsetof(BP_SASManager_C_OnCopyEnd, Param) == 0x000000, "Member 'BP_SASManager_C_OnCopyEnd::Param' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnCopyEnd, Param_Owner) == 0x000008, "Member 'BP_SASManager_C_OnCopyEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnCopyEnd, RemainTime) == 0x000010, "Member 'BP_SASManager_C_OnCopyEnd::RemainTime' has a wrong offset!");

// Function BP_SASManager.BP_SASManager_C.OnCopyStart
// 0x0010 (0x0010 - 0x0000)
struct BP_SASManager_C_OnCopyStart final
{
public:
	struct FFSASCopyParam                         Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41E7[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASManager_C_OnCopyStart) == 0x000008, "Wrong alignment on BP_SASManager_C_OnCopyStart");
static_assert(sizeof(BP_SASManager_C_OnCopyStart) == 0x000010, "Wrong size on BP_SASManager_C_OnCopyStart");
static_assert(offsetof(BP_SASManager_C_OnCopyStart, Param) == 0x000000, "Member 'BP_SASManager_C_OnCopyStart::Param' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnCopyStart, Param_Owner) == 0x000008, "Member 'BP_SASManager_C_OnCopyStart::Param_Owner' has a wrong offset!");

// Function BP_SASManager.BP_SASManager_C.OnStealthEnd
// 0x0018 (0x0018 - 0x0000)
struct BP_SASManager_C_OnStealthEnd final
{
public:
	struct FFSASStealthParam                      Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41E8[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASManager_C_OnStealthEnd) == 0x000008, "Wrong alignment on BP_SASManager_C_OnStealthEnd");
static_assert(sizeof(BP_SASManager_C_OnStealthEnd) == 0x000018, "Wrong size on BP_SASManager_C_OnStealthEnd");
static_assert(offsetof(BP_SASManager_C_OnStealthEnd, Param) == 0x000000, "Member 'BP_SASManager_C_OnStealthEnd::Param' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnStealthEnd, Param_Owner) == 0x000008, "Member 'BP_SASManager_C_OnStealthEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnStealthEnd, RemainTime) == 0x000010, "Member 'BP_SASManager_C_OnStealthEnd::RemainTime' has a wrong offset!");

// Function BP_SASManager.BP_SASManager_C.OnStealthStart
// 0x0010 (0x0010 - 0x0000)
struct BP_SASManager_C_OnStealthStart final
{
public:
	struct FFSASStealthParam                      Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41E9[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASManager_C_OnStealthStart) == 0x000008, "Wrong alignment on BP_SASManager_C_OnStealthStart");
static_assert(sizeof(BP_SASManager_C_OnStealthStart) == 0x000010, "Wrong size on BP_SASManager_C_OnStealthStart");
static_assert(offsetof(BP_SASManager_C_OnStealthStart, Param) == 0x000000, "Member 'BP_SASManager_C_OnStealthStart::Param' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnStealthStart, Param_Owner) == 0x000008, "Member 'BP_SASManager_C_OnStealthStart::Param_Owner' has a wrong offset!");

// Function BP_SASManager.BP_SASManager_C.OnTelepoEnd
// 0x0018 (0x0018 - 0x0000)
struct BP_SASManager_C_OnTelepoEnd final
{
public:
	struct FFSASTelepoParam                       Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41EA[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASManager_C_OnTelepoEnd) == 0x000008, "Wrong alignment on BP_SASManager_C_OnTelepoEnd");
static_assert(sizeof(BP_SASManager_C_OnTelepoEnd) == 0x000018, "Wrong size on BP_SASManager_C_OnTelepoEnd");
static_assert(offsetof(BP_SASManager_C_OnTelepoEnd, Param) == 0x000000, "Member 'BP_SASManager_C_OnTelepoEnd::Param' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnTelepoEnd, Param_Owner) == 0x000008, "Member 'BP_SASManager_C_OnTelepoEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnTelepoEnd, RemainTime) == 0x000010, "Member 'BP_SASManager_C_OnTelepoEnd::RemainTime' has a wrong offset!");

// Function BP_SASManager.BP_SASManager_C.OnTelepoStart
// 0x0010 (0x0010 - 0x0000)
struct BP_SASManager_C_OnTelepoStart final
{
public:
	struct FFSASTelepoParam                       Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41EB[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASManager_C_OnTelepoStart) == 0x000008, "Wrong alignment on BP_SASManager_C_OnTelepoStart");
static_assert(sizeof(BP_SASManager_C_OnTelepoStart) == 0x000010, "Wrong size on BP_SASManager_C_OnTelepoStart");
static_assert(offsetof(BP_SASManager_C_OnTelepoStart, Param) == 0x000000, "Member 'BP_SASManager_C_OnTelepoStart::Param' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnTelepoStart, Param_Owner) == 0x000008, "Member 'BP_SASManager_C_OnTelepoStart::Param_Owner' has a wrong offset!");

// Function BP_SASManager.BP_SASManager_C.OnSeeThroughEnd
// 0x0018 (0x0018 - 0x0000)
struct BP_SASManager_C_OnSeeThroughEnd final
{
public:
	struct FFSASSeeThroughParam                   Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41EC[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASManager_C_OnSeeThroughEnd) == 0x000008, "Wrong alignment on BP_SASManager_C_OnSeeThroughEnd");
static_assert(sizeof(BP_SASManager_C_OnSeeThroughEnd) == 0x000018, "Wrong size on BP_SASManager_C_OnSeeThroughEnd");
static_assert(offsetof(BP_SASManager_C_OnSeeThroughEnd, Param) == 0x000000, "Member 'BP_SASManager_C_OnSeeThroughEnd::Param' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnSeeThroughEnd, Param_Owner) == 0x000008, "Member 'BP_SASManager_C_OnSeeThroughEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnSeeThroughEnd, RemainTime) == 0x000010, "Member 'BP_SASManager_C_OnSeeThroughEnd::RemainTime' has a wrong offset!");

// Function BP_SASManager.BP_SASManager_C.OnSeeThroughStart
// 0x0010 (0x0010 - 0x0000)
struct BP_SASManager_C_OnSeeThroughStart final
{
public:
	struct FFSASSeeThroughParam                   Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41ED[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASManager_C_OnSeeThroughStart) == 0x000008, "Wrong alignment on BP_SASManager_C_OnSeeThroughStart");
static_assert(sizeof(BP_SASManager_C_OnSeeThroughStart) == 0x000010, "Wrong size on BP_SASManager_C_OnSeeThroughStart");
static_assert(offsetof(BP_SASManager_C_OnSeeThroughStart, Param) == 0x000000, "Member 'BP_SASManager_C_OnSeeThroughStart::Param' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnSeeThroughStart, Param_Owner) == 0x000008, "Member 'BP_SASManager_C_OnSeeThroughStart::Param_Owner' has a wrong offset!");

// Function BP_SASManager.BP_SASManager_C.OnMetalEnd
// 0x0018 (0x0018 - 0x0000)
struct BP_SASManager_C_OnMetalEnd final
{
public:
	struct FFSASMetalParam                        Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41EE[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASManager_C_OnMetalEnd) == 0x000008, "Wrong alignment on BP_SASManager_C_OnMetalEnd");
static_assert(sizeof(BP_SASManager_C_OnMetalEnd) == 0x000018, "Wrong size on BP_SASManager_C_OnMetalEnd");
static_assert(offsetof(BP_SASManager_C_OnMetalEnd, Param) == 0x000000, "Member 'BP_SASManager_C_OnMetalEnd::Param' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnMetalEnd, Param_Owner) == 0x000008, "Member 'BP_SASManager_C_OnMetalEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnMetalEnd, RemainTime) == 0x000010, "Member 'BP_SASManager_C_OnMetalEnd::RemainTime' has a wrong offset!");

// Function BP_SASManager.BP_SASManager_C.OnMetalStart
// 0x0010 (0x0010 - 0x0000)
struct BP_SASManager_C_OnMetalStart final
{
public:
	struct FFSASMetalParam                        Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41EF[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASManager_C_OnMetalStart) == 0x000008, "Wrong alignment on BP_SASManager_C_OnMetalStart");
static_assert(sizeof(BP_SASManager_C_OnMetalStart) == 0x000010, "Wrong size on BP_SASManager_C_OnMetalStart");
static_assert(offsetof(BP_SASManager_C_OnMetalStart, Param) == 0x000000, "Member 'BP_SASManager_C_OnMetalStart::Param' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnMetalStart, Param_Owner) == 0x000008, "Member 'BP_SASManager_C_OnMetalStart::Param_Owner' has a wrong offset!");

// Function BP_SASManager.BP_SASManager_C.OnFireEnd
// 0x0018 (0x0018 - 0x0000)
struct BP_SASManager_C_OnFireEnd final
{
public:
	struct FFSASFireParam                         Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41F0[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASManager_C_OnFireEnd) == 0x000008, "Wrong alignment on BP_SASManager_C_OnFireEnd");
static_assert(sizeof(BP_SASManager_C_OnFireEnd) == 0x000018, "Wrong size on BP_SASManager_C_OnFireEnd");
static_assert(offsetof(BP_SASManager_C_OnFireEnd, Param) == 0x000000, "Member 'BP_SASManager_C_OnFireEnd::Param' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnFireEnd, Param_Owner) == 0x000008, "Member 'BP_SASManager_C_OnFireEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnFireEnd, RemainTime) == 0x000010, "Member 'BP_SASManager_C_OnFireEnd::RemainTime' has a wrong offset!");

// Function BP_SASManager.BP_SASManager_C.OnFireStart
// 0x0010 (0x0010 - 0x0000)
struct BP_SASManager_C_OnFireStart final
{
public:
	struct FFSASFireParam                         Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41F1[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASManager_C_OnFireStart) == 0x000008, "Wrong alignment on BP_SASManager_C_OnFireStart");
static_assert(sizeof(BP_SASManager_C_OnFireStart) == 0x000010, "Wrong size on BP_SASManager_C_OnFireStart");
static_assert(offsetof(BP_SASManager_C_OnFireStart, Param) == 0x000000, "Member 'BP_SASManager_C_OnFireStart::Param' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnFireStart, Param_Owner) == 0x000008, "Member 'BP_SASManager_C_OnFireStart::Param_Owner' has a wrong offset!");

// Function BP_SASManager.BP_SASManager_C.OnElectricEnd
// 0x0018 (0x0018 - 0x0000)
struct BP_SASManager_C_OnElectricEnd final
{
public:
	struct FFSASElectricParam                     Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41F2[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASManager_C_OnElectricEnd) == 0x000008, "Wrong alignment on BP_SASManager_C_OnElectricEnd");
static_assert(sizeof(BP_SASManager_C_OnElectricEnd) == 0x000018, "Wrong size on BP_SASManager_C_OnElectricEnd");
static_assert(offsetof(BP_SASManager_C_OnElectricEnd, Param) == 0x000000, "Member 'BP_SASManager_C_OnElectricEnd::Param' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnElectricEnd, Param_Owner) == 0x000008, "Member 'BP_SASManager_C_OnElectricEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnElectricEnd, RemainTime) == 0x000010, "Member 'BP_SASManager_C_OnElectricEnd::RemainTime' has a wrong offset!");

// Function BP_SASManager.BP_SASManager_C.OnElectricStart
// 0x0010 (0x0010 - 0x0000)
struct BP_SASManager_C_OnElectricStart final
{
public:
	struct FFSASElectricParam                     Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41F3[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SASManager_C_OnElectricStart) == 0x000008, "Wrong alignment on BP_SASManager_C_OnElectricStart");
static_assert(sizeof(BP_SASManager_C_OnElectricStart) == 0x000010, "Wrong size on BP_SASManager_C_OnElectricStart");
static_assert(offsetof(BP_SASManager_C_OnElectricStart, Param) == 0x000000, "Member 'BP_SASManager_C_OnElectricStart::Param' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnElectricStart, Param_Owner) == 0x000008, "Member 'BP_SASManager_C_OnElectricStart::Param_Owner' has a wrong offset!");

// Function BP_SASManager.BP_SASManager_C.OnAcceleratorEnd
// 0x0020 (0x0020 - 0x0000)
struct BP_SASManager_C_OnAcceleratorEnd final
{
public:
	struct FAcceleratorParam                      Parameter;                                         // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41F4[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHologram;                                         // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SASManager_C_OnAcceleratorEnd) == 0x000008, "Wrong alignment on BP_SASManager_C_OnAcceleratorEnd");
static_assert(sizeof(BP_SASManager_C_OnAcceleratorEnd) == 0x000020, "Wrong size on BP_SASManager_C_OnAcceleratorEnd");
static_assert(offsetof(BP_SASManager_C_OnAcceleratorEnd, Parameter) == 0x000000, "Member 'BP_SASManager_C_OnAcceleratorEnd::Parameter' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnAcceleratorEnd, Param_Owner) == 0x000010, "Member 'BP_SASManager_C_OnAcceleratorEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnAcceleratorEnd, RemainTime) == 0x000018, "Member 'BP_SASManager_C_OnAcceleratorEnd::RemainTime' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnAcceleratorEnd, bHologram) == 0x00001C, "Member 'BP_SASManager_C_OnAcceleratorEnd::bHologram' has a wrong offset!");

// Function BP_SASManager.BP_SASManager_C.OnAcceleratorStart
// 0x0020 (0x0020 - 0x0000)
struct BP_SASManager_C_OnAcceleratorStart final
{
public:
	struct FAcceleratorParam                      Parameter;                                         // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41F5[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHologram;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SASManager_C_OnAcceleratorStart) == 0x000008, "Wrong alignment on BP_SASManager_C_OnAcceleratorStart");
static_assert(sizeof(BP_SASManager_C_OnAcceleratorStart) == 0x000020, "Wrong size on BP_SASManager_C_OnAcceleratorStart");
static_assert(offsetof(BP_SASManager_C_OnAcceleratorStart, Parameter) == 0x000000, "Member 'BP_SASManager_C_OnAcceleratorStart::Parameter' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnAcceleratorStart, Param_Owner) == 0x000010, "Member 'BP_SASManager_C_OnAcceleratorStart::Param_Owner' has a wrong offset!");
static_assert(offsetof(BP_SASManager_C_OnAcceleratorStart, bHologram) == 0x000018, "Member 'BP_SASManager_C_OnAcceleratorStart::bHologram' has a wrong offset!");

// Function BP_SASManager.BP_SASManager_C.UpdateSASCommand
// 0x0058 (0x0058 - 0x0000)
struct BP_SASManager_C_UpdateSASCommand final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41F6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFSASCommand                           L_Command;                                         // 0x0008(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_ArrayIndex;                                      // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
