#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_static_sky

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_static_sky.BP_static_sky_C
// 0x0030 (0x0260 - 0x0230)
class ABP_static_sky_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Kuronos;                                           // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sky;                                               // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          BeforePause;                                       // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A4C[0x7];                                     // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               SkyMID;                                            // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RestoreSkyXSpeed;                                  // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RestoreSkyYSpeed;                                  // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void PauseSkyParticle(bool Pause);
	void GetStaticMesh(class UStaticMeshComponent** StaticMesh);
	void GetSkeletalMesh(class USkeletalMeshComponent** SkeletalMesh);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_static_sky_C">();
	}
	static class ABP_static_sky_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_static_sky_C>();
	}
};
static_assert(alignof(ABP_static_sky_C) == 0x000008, "Wrong alignment on ABP_static_sky_C");
static_assert(sizeof(ABP_static_sky_C) == 0x000260, "Wrong size on ABP_static_sky_C");
static_assert(offsetof(ABP_static_sky_C, Kuronos) == 0x000230, "Member 'ABP_static_sky_C::Kuronos' has a wrong offset!");
static_assert(offsetof(ABP_static_sky_C, Sky) == 0x000238, "Member 'ABP_static_sky_C::Sky' has a wrong offset!");
static_assert(offsetof(ABP_static_sky_C, Scene) == 0x000240, "Member 'ABP_static_sky_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_static_sky_C, BeforePause) == 0x000248, "Member 'ABP_static_sky_C::BeforePause' has a wrong offset!");
static_assert(offsetof(ABP_static_sky_C, SkyMID) == 0x000250, "Member 'ABP_static_sky_C::SkyMID' has a wrong offset!");
static_assert(offsetof(ABP_static_sky_C, RestoreSkyXSpeed) == 0x000258, "Member 'ABP_static_sky_C::RestoreSkyXSpeed' has a wrong offset!");
static_assert(offsetof(ABP_static_sky_C, RestoreSkyYSpeed) == 0x00025C, "Member 'ABP_static_sky_C::RestoreSkyYSpeed' has a wrong offset!");

}

