#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TargetSearchComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TargetSearchComponent.BP_TargetSearchComponent_C
// 0x0040 (0x0190 - 0x0150)
class UBP_TargetSearchComponent_C final : public UTargetSearchComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0150(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 CurrentLockBoss;                                   // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCreateDebugWidgetTargetParam;                    // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53A4[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_WidgetTargetParam_C*                DebugWidgetTargetParamBP;                          // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayerFixParamater_C*               PlayerFixParam;                                    // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CrashTargetBoss;                                   // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OldLockTarget;                                     // 0x0180(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsLockAutoChange;                                  // 0x0181(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53A5[0x6];                                     // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PlayerCameraComponent_C*            OwnerCameraComponent;                              // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_TargetSearchComponent(int32 EntryPoint);
	void SetLockTarget(bool bLock);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UpdateBossTarget(class AActor** LockBoss);
	void DebugWidgetTargetParam();
	bool ChangeLockTarget(float AxisValue, const TArray<class ARSCharacterBase*>& EnemyList);
	void UpdateBossEnemyHp();
	void TargetUpdate();
	void SetLockBoss(class AActor* BossActor, bool* bDummy);
	void ClearLockBoss();
	void AutoNextTarget(bool bIgnoreRendered);
	void SetCrashTargetBoss(class AActor* CrashActor);

	void GetLockBoss(class AActor** LockBoss) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TargetSearchComponent_C">();
	}
	static class UBP_TargetSearchComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_TargetSearchComponent_C>();
	}
};
static_assert(alignof(UBP_TargetSearchComponent_C) == 0x000008, "Wrong alignment on UBP_TargetSearchComponent_C");
static_assert(sizeof(UBP_TargetSearchComponent_C) == 0x000190, "Wrong size on UBP_TargetSearchComponent_C");
static_assert(offsetof(UBP_TargetSearchComponent_C, UberGraphFrame) == 0x000150, "Member 'UBP_TargetSearchComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_TargetSearchComponent_C, CurrentLockBoss) == 0x000158, "Member 'UBP_TargetSearchComponent_C::CurrentLockBoss' has a wrong offset!");
static_assert(offsetof(UBP_TargetSearchComponent_C, IsCreateDebugWidgetTargetParam) == 0x000160, "Member 'UBP_TargetSearchComponent_C::IsCreateDebugWidgetTargetParam' has a wrong offset!");
static_assert(offsetof(UBP_TargetSearchComponent_C, DebugWidgetTargetParamBP) == 0x000168, "Member 'UBP_TargetSearchComponent_C::DebugWidgetTargetParamBP' has a wrong offset!");
static_assert(offsetof(UBP_TargetSearchComponent_C, PlayerFixParam) == 0x000170, "Member 'UBP_TargetSearchComponent_C::PlayerFixParam' has a wrong offset!");
static_assert(offsetof(UBP_TargetSearchComponent_C, CrashTargetBoss) == 0x000178, "Member 'UBP_TargetSearchComponent_C::CrashTargetBoss' has a wrong offset!");
static_assert(offsetof(UBP_TargetSearchComponent_C, OldLockTarget) == 0x000180, "Member 'UBP_TargetSearchComponent_C::OldLockTarget' has a wrong offset!");
static_assert(offsetof(UBP_TargetSearchComponent_C, IsLockAutoChange) == 0x000181, "Member 'UBP_TargetSearchComponent_C::IsLockAutoChange' has a wrong offset!");
static_assert(offsetof(UBP_TargetSearchComponent_C, OwnerCameraComponent) == 0x000188, "Member 'UBP_TargetSearchComponent_C::OwnerCameraComponent' has a wrong offset!");

}

