#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TriggerEffectManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TriggerEffectManager.BP_TriggerEffectManager_C
// 0x0018 (0x0368 - 0x0350)
class ABP_TriggerEffectManager_C final : public ATriggerEffectManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGamePaused;                                      // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEventPause;                                      // 0x0361(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSystemPuase;                                     // 0x0362(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_TriggerEffectManager(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void SetGamePauseForSystem(bool IsPause);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TriggerEffectManager_C">();
	}
	static class ABP_TriggerEffectManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TriggerEffectManager_C>();
	}
};
static_assert(alignof(ABP_TriggerEffectManager_C) == 0x000008, "Wrong alignment on ABP_TriggerEffectManager_C");
static_assert(sizeof(ABP_TriggerEffectManager_C) == 0x000368, "Wrong size on ABP_TriggerEffectManager_C");
static_assert(offsetof(ABP_TriggerEffectManager_C, UberGraphFrame) == 0x000350, "Member 'ABP_TriggerEffectManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TriggerEffectManager_C, DefaultSceneRoot) == 0x000358, "Member 'ABP_TriggerEffectManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_TriggerEffectManager_C, IsGamePaused) == 0x000360, "Member 'ABP_TriggerEffectManager_C::IsGamePaused' has a wrong offset!");
static_assert(offsetof(ABP_TriggerEffectManager_C, IsEventPause) == 0x000361, "Member 'ABP_TriggerEffectManager_C::IsEventPause' has a wrong offset!");
static_assert(offsetof(ABP_TriggerEffectManager_C, IsSystemPuase) == 0x000362, "Member 'ABP_TriggerEffectManager_C::IsSystemPuase' has a wrong offset!");

}

