#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TargetSearchComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TargetSearchComponent.BP_TargetSearchComponent_C.ExecuteUbergraph_BP_TargetSearchComponent
// 0x00B0 (0x00B0 - 0x0000)
struct BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLockTarget_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53A6[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_UpdateBossTarget_LockBoss;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLockTarget_ReturnValue_1;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLockTarget_ReturnValue_2;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53A7[0x5];                                     // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayerFixParamater_C*               CallFunc_GetPlayerFixParam_Param;                  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53A8[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SoundManager_C*                     CallFunc_GetSoundManager_SoundManager;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53A9[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SoundManager_C*                     CallFunc_GetSoundManager_SoundManager_1;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_GetCurrentTargetActor_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53AA[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_GetCurrentTargetActor_ReturnValue_1;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bLock;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterDead_ReturnValue;              // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53AB[0x1];                                     // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrainCrashManager_C*                CallFunc_GetBrainCrashManager_Manager;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingAnyBrainCrash_NowPlaying;        // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53AC[0x5];                                     // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53AD[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrainCrashManager_C*                CallFunc_GetBrainCrashManager_Manager_1;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingAnyBrainCrash_NowPlaying_1;      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent) == 0x000008, "Wrong alignment on BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent");
static_assert(sizeof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent) == 0x0000B0, "Wrong size on BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, EntryPoint) == 0x000000, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_IsLockTarget_ReturnValue) == 0x000004, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_IsLockTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_UpdateBossTarget_LockBoss) == 0x000008, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_UpdateBossTarget_LockBoss' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_IsLockTarget_ReturnValue_1) == 0x000010, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_IsLockTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_IsLockTarget_ReturnValue_2) == 0x000011, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_IsLockTarget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000012, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_GetPlayerManager_PlayerManager) == 0x000020, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_GetPlayerFixParam_Param) == 0x000028, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_GetPlayerFixParam_Param' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_GetPlayer_ReturnValue) == 0x000030, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_GetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000038, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_GetSoundManager_SoundManager) == 0x000040, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_GetSoundManager_SoundManager' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_GetSoundManager_SoundManager_1) == 0x000050, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_GetSoundManager_SoundManager_1' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_GetCurrentTargetActor_ReturnValue) == 0x000058, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_GetCurrentTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_IsValid_ReturnValue_2) == 0x000060, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_IsValid_ReturnValue_3) == 0x000061, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_GetCurrentTargetActor_ReturnValue_1) == 0x000068, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_GetCurrentTargetActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, K2Node_Event_bLock) == 0x000070, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::K2Node_Event_bLock' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_IsCharacterDead_ReturnValue) == 0x000071, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_IsCharacterDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_Not_PreBool_ReturnValue) == 0x000072, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, K2Node_Event_DeltaSeconds) == 0x000074, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_GetBrainCrashManager_Manager) == 0x000078, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_GetBrainCrashManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_IsValid_ReturnValue_4) == 0x000080, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_IsPlayingAnyBrainCrash_NowPlaying) == 0x000081, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_IsPlayingAnyBrainCrash_NowPlaying' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_Not_PreBool_ReturnValue_1) == 0x000082, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_GetOwner_ReturnValue_1) == 0x000088, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, K2Node_DynamicCast_AsRSBattle_Player) == 0x000090, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_GetBrainCrashManager_Manager_1) == 0x0000A0, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_GetBrainCrashManager_Manager_1' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_IsPlayingAnyBrainCrash_NowPlaying_1) == 0x0000A8, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_IsPlayingAnyBrainCrash_NowPlaying_1' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_IsValid_ReturnValue_5) == 0x0000A9, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent, CallFunc_Not_PreBool_ReturnValue_2) == 0x0000AA, "Member 'BP_TargetSearchComponent_C_ExecuteUbergraph_BP_TargetSearchComponent::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");

// Function BP_TargetSearchComponent.BP_TargetSearchComponent_C.SetLockTarget
// 0x0001 (0x0001 - 0x0000)
struct BP_TargetSearchComponent_C_SetLockTarget final
{
public:
	bool                                          bLock;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TargetSearchComponent_C_SetLockTarget) == 0x000001, "Wrong alignment on BP_TargetSearchComponent_C_SetLockTarget");
static_assert(sizeof(BP_TargetSearchComponent_C_SetLockTarget) == 0x000001, "Wrong size on BP_TargetSearchComponent_C_SetLockTarget");
static_assert(offsetof(BP_TargetSearchComponent_C_SetLockTarget, bLock) == 0x000000, "Member 'BP_TargetSearchComponent_C_SetLockTarget::bLock' has a wrong offset!");

// Function BP_TargetSearchComponent.BP_TargetSearchComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_TargetSearchComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TargetSearchComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_TargetSearchComponent_C_ReceiveTick");
static_assert(sizeof(BP_TargetSearchComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_TargetSearchComponent_C_ReceiveTick");
static_assert(offsetof(BP_TargetSearchComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_TargetSearchComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_TargetSearchComponent.BP_TargetSearchComponent_C.UpdateBossTarget
// 0x01C8 (0x01C8 - 0x0000)
struct BP_TargetSearchComponent_C_UpdateBossTarget final
{
public:
	class AActor*                                 LockBoss;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 BossElement;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 EnemyElement;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BossLength;                                        // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlayerLength;                                      // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         TargetBossList;                                    // 0x0020(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	TArray<class AActor*>                         EnemyList;                                         // 0x0030(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53AE[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0088(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D8(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBossBattle_ReturnValue;                 // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53AF[0x6];                                     // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BattleManager_C*                    CallFunc_GetBattleManager_BattleManager;           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53B0[0x3];                                     // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARSCharacterBase*>               CallFunc_GetBattleActorList_ReturnValue;           // 0x0118(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EnemyInterface_C> K2Node_DynamicCast_AsBPI_Enemy_Interface;          // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableEnemyMoveRange_bReturn;           // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53B1[0x2];                                     // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EnemyInterface_C> K2Node_DynamicCast_AsBPI_Enemy_Interface_1;        // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBossEnemy_bBoss;                        // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53B2[0x2];                                     // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLockTarget_ReturnValue;                 // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53B3[0x2];                                     // 0x0176(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_GetCurrentTargetActor_ReturnValue;        // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EnemyInterface_C> K2Node_DynamicCast_AsBPI_Enemy_Interface_2;        // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBossEnemy_bBoss_1;                      // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53B4[0x5];                                     // 0x0193(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53B5[0x6];                                     // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TargetSearchComponent_C_UpdateBossTarget) == 0x000008, "Wrong alignment on BP_TargetSearchComponent_C_UpdateBossTarget");
static_assert(sizeof(BP_TargetSearchComponent_C_UpdateBossTarget) == 0x0001C8, "Wrong size on BP_TargetSearchComponent_C_UpdateBossTarget");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, LockBoss) == 0x000000, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::LockBoss' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, BossElement) == 0x000008, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::BossElement' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, EnemyElement) == 0x000010, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::EnemyElement' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, BossLength) == 0x000018, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::BossLength' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, PlayerLength) == 0x00001C, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::PlayerLength' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, TargetBossList) == 0x000020, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::TargetBossList' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, EnemyList) == 0x000030, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::EnemyList' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, Temp_int_Array_Index_Variable) == 0x000044, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, Temp_int_Array_Index_Variable_1) == 0x000054, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_GetDisplayName_ReturnValue) == 0x000060, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, K2Node_MakeStruct_FormatArgumentData) == 0x000088, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, K2Node_MakeArray_Array) == 0x0000C8, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_Format_ReturnValue) == 0x0000D8, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_IsValid_ReturnValue) == 0x0000F0, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_IsBossBattle_ReturnValue) == 0x0000F1, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_IsBossBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_GetOwner_ReturnValue) == 0x0000F8, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_GetBattleManager_BattleManager) == 0x000100, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_GetBattleManager_BattleManager' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000108, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_IsValid_ReturnValue_1) == 0x000114, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_GetBattleActorList_ReturnValue) == 0x000118, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_GetBattleActorList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, K2Node_DynamicCast_AsBPI_Enemy_Interface) == 0x000128, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::K2Node_DynamicCast_AsBPI_Enemy_Interface' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_IsEnableEnemyMoveRange_bReturn) == 0x000139, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_IsEnableEnemyMoveRange_bReturn' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00013C, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000148, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_VSizeSquared_ReturnValue) == 0x000154, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, K2Node_DynamicCast_AsBPI_Enemy_Interface_1) == 0x000158, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::K2Node_DynamicCast_AsBPI_Enemy_Interface_1' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, K2Node_DynamicCast_bSuccess_1) == 0x000168, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_IsBossEnemy_bBoss) == 0x000169, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_IsBossEnemy_bBoss' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, Temp_int_Loop_Counter_Variable_1) == 0x00016C, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_Add_IntInt_ReturnValue_1) == 0x000170, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_IsLockTarget_ReturnValue) == 0x000174, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_IsLockTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_IsValid_ReturnValue_2) == 0x000175, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_GetCurrentTargetActor_ReturnValue) == 0x000178, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_GetCurrentTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, K2Node_DynamicCast_AsBPI_Enemy_Interface_2) == 0x000180, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::K2Node_DynamicCast_AsBPI_Enemy_Interface_2' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, K2Node_DynamicCast_bSuccess_2) == 0x000190, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_IsBossEnemy_bBoss_1) == 0x000191, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_IsBossEnemy_bBoss_1' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_IsValid_ReturnValue_3) == 0x000192, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_GetOwner_ReturnValue_1) == 0x000198, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_GetPlayerPawn_ReturnValue) == 0x0001A0, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001A8, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_Less_FloatFloat_ReturnValue) == 0x0001A9, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_Array_Get_Item_1) == 0x0001B0, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_Array_Add_ReturnValue) == 0x0001B8, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_Array_Length_ReturnValue_1) == 0x0001BC, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossTarget, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001C0, "Member 'BP_TargetSearchComponent_C_UpdateBossTarget::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_TargetSearchComponent.BP_TargetSearchComponent_C.DebugWidgetTargetParam
// 0x0028 (0x0028 - 0x0000)
struct BP_TargetSearchComponent_C_DebugWidgetTargetParam final
{
public:
	class UBP_WidgetTargetParam_C*                CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDebugEnemyParameter_ReturnValue;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53B6[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_WidgetTargetParam_C*>        CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TargetSearchComponent_C_DebugWidgetTargetParam) == 0x000008, "Wrong alignment on BP_TargetSearchComponent_C_DebugWidgetTargetParam");
static_assert(sizeof(BP_TargetSearchComponent_C_DebugWidgetTargetParam) == 0x000028, "Wrong size on BP_TargetSearchComponent_C_DebugWidgetTargetParam");
static_assert(offsetof(BP_TargetSearchComponent_C_DebugWidgetTargetParam, CallFunc_Create_ReturnValue) == 0x000000, "Member 'BP_TargetSearchComponent_C_DebugWidgetTargetParam::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_DebugWidgetTargetParam, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_TargetSearchComponent_C_DebugWidgetTargetParam::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_DebugWidgetTargetParam, CallFunc_IsDebugEnemyParameter_ReturnValue) == 0x000009, "Member 'BP_TargetSearchComponent_C_DebugWidgetTargetParam::CallFunc_IsDebugEnemyParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_DebugWidgetTargetParam, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000010, "Member 'BP_TargetSearchComponent_C_DebugWidgetTargetParam::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_DebugWidgetTargetParam, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_TargetSearchComponent_C_DebugWidgetTargetParam::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_DebugWidgetTargetParam, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000024, "Member 'BP_TargetSearchComponent_C_DebugWidgetTargetParam::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_TargetSearchComponent.BP_TargetSearchComponent_C.ChangeLockTarget
// 0x0050 (0x0050 - 0x0000)
struct BP_TargetSearchComponent_C_ChangeLockTarget final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53B7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARSCharacterBase*>               EnemyList;                                         // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53B8[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       LTarget;                                           // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bResult;                                           // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChangeLockTarget_ReturnValue;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53B9[0x5];                                     // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_GetCurrentTargetActor_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SoundManager_C*                     CallFunc_GetSoundManager_SoundManager;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53BA[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_GetCurrentTargetActor_ReturnValue_1;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TargetSearchComponent_C_ChangeLockTarget) == 0x000008, "Wrong alignment on BP_TargetSearchComponent_C_ChangeLockTarget");
static_assert(sizeof(BP_TargetSearchComponent_C_ChangeLockTarget) == 0x000050, "Wrong size on BP_TargetSearchComponent_C_ChangeLockTarget");
static_assert(offsetof(BP_TargetSearchComponent_C_ChangeLockTarget, AxisValue) == 0x000000, "Member 'BP_TargetSearchComponent_C_ChangeLockTarget::AxisValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ChangeLockTarget, EnemyList) == 0x000008, "Member 'BP_TargetSearchComponent_C_ChangeLockTarget::EnemyList' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ChangeLockTarget, ReturnValue) == 0x000018, "Member 'BP_TargetSearchComponent_C_ChangeLockTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ChangeLockTarget, LTarget) == 0x000020, "Member 'BP_TargetSearchComponent_C_ChangeLockTarget::LTarget' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ChangeLockTarget, bResult) == 0x000028, "Member 'BP_TargetSearchComponent_C_ChangeLockTarget::bResult' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ChangeLockTarget, CallFunc_ChangeLockTarget_ReturnValue) == 0x000029, "Member 'BP_TargetSearchComponent_C_ChangeLockTarget::CallFunc_ChangeLockTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ChangeLockTarget, CallFunc_IsValid_ReturnValue) == 0x00002A, "Member 'BP_TargetSearchComponent_C_ChangeLockTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ChangeLockTarget, CallFunc_GetCurrentTargetActor_ReturnValue) == 0x000030, "Member 'BP_TargetSearchComponent_C_ChangeLockTarget::CallFunc_GetCurrentTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ChangeLockTarget, CallFunc_GetSoundManager_SoundManager) == 0x000038, "Member 'BP_TargetSearchComponent_C_ChangeLockTarget::CallFunc_GetSoundManager_SoundManager' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ChangeLockTarget, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'BP_TargetSearchComponent_C_ChangeLockTarget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_ChangeLockTarget, CallFunc_GetCurrentTargetActor_ReturnValue_1) == 0x000048, "Member 'BP_TargetSearchComponent_C_ChangeLockTarget::CallFunc_GetCurrentTargetActor_ReturnValue_1' has a wrong offset!");

// Function BP_TargetSearchComponent.BP_TargetSearchComponent_C.UpdateBossEnemyHp
// 0x0050 (0x0050 - 0x0000)
struct BP_TargetSearchComponent_C_UpdateBossEnemyHp final
{
public:
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53BB[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattleCharacter_C*                   K2Node_DynamicCast_AsRSBattle_Character;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53BC[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame_1;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame_2;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_GetBackupBossActor_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53BD[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattleCharacter_C*                   K2Node_DynamicCast_AsRSBattle_Character_1;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TargetSearchComponent_C_UpdateBossEnemyHp) == 0x000008, "Wrong alignment on BP_TargetSearchComponent_C_UpdateBossEnemyHp");
static_assert(sizeof(BP_TargetSearchComponent_C_UpdateBossEnemyHp) == 0x000050, "Wrong size on BP_TargetSearchComponent_C_UpdateBossEnemyHp");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossEnemyHp, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000000, "Member 'BP_TargetSearchComponent_C_UpdateBossEnemyHp::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossEnemyHp, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_TargetSearchComponent_C_UpdateBossEnemyHp::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossEnemyHp, K2Node_DynamicCast_AsRSBattle_Character) == 0x000010, "Member 'BP_TargetSearchComponent_C_UpdateBossEnemyHp::K2Node_DynamicCast_AsRSBattle_Character' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossEnemyHp, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_TargetSearchComponent_C_UpdateBossEnemyHp::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossEnemyHp, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'BP_TargetSearchComponent_C_UpdateBossEnemyHp::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossEnemyHp, CallFunc_GetHUDMainGame_HUDMainGame_1) == 0x000020, "Member 'BP_TargetSearchComponent_C_UpdateBossEnemyHp::CallFunc_GetHUDMainGame_HUDMainGame_1' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossEnemyHp, CallFunc_GetHUDMainGame_HUDMainGame_2) == 0x000028, "Member 'BP_TargetSearchComponent_C_UpdateBossEnemyHp::CallFunc_GetHUDMainGame_HUDMainGame_2' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossEnemyHp, CallFunc_GetBackupBossActor_ReturnValue) == 0x000030, "Member 'BP_TargetSearchComponent_C_UpdateBossEnemyHp::CallFunc_GetBackupBossActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossEnemyHp, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000038, "Member 'BP_TargetSearchComponent_C_UpdateBossEnemyHp::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossEnemyHp, K2Node_DynamicCast_AsRSBattle_Character_1) == 0x000040, "Member 'BP_TargetSearchComponent_C_UpdateBossEnemyHp::K2Node_DynamicCast_AsRSBattle_Character_1' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_UpdateBossEnemyHp, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_TargetSearchComponent_C_UpdateBossEnemyHp::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_TargetSearchComponent.BP_TargetSearchComponent_C.TargetUpdate
// 0x0020 (0x0020 - 0x0000)
struct BP_TargetSearchComponent_C_TargetUpdate final
{
public:
	class ARSCharacterBase*                       LNextTarget;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLockTarget_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53BE[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_GetCurrentTargetActor_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterDead_ReturnValue;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TargetSearchComponent_C_TargetUpdate) == 0x000008, "Wrong alignment on BP_TargetSearchComponent_C_TargetUpdate");
static_assert(sizeof(BP_TargetSearchComponent_C_TargetUpdate) == 0x000020, "Wrong size on BP_TargetSearchComponent_C_TargetUpdate");
static_assert(offsetof(BP_TargetSearchComponent_C_TargetUpdate, LNextTarget) == 0x000000, "Member 'BP_TargetSearchComponent_C_TargetUpdate::LNextTarget' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_TargetUpdate, CallFunc_IsLockTarget_ReturnValue) == 0x000008, "Member 'BP_TargetSearchComponent_C_TargetUpdate::CallFunc_IsLockTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_TargetUpdate, CallFunc_GetCurrentTargetActor_ReturnValue) == 0x000010, "Member 'BP_TargetSearchComponent_C_TargetUpdate::CallFunc_GetCurrentTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_TargetUpdate, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_TargetSearchComponent_C_TargetUpdate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_TargetUpdate, CallFunc_IsCharacterDead_ReturnValue) == 0x000019, "Member 'BP_TargetSearchComponent_C_TargetUpdate::CallFunc_IsCharacterDead_ReturnValue' has a wrong offset!");

// Function BP_TargetSearchComponent.BP_TargetSearchComponent_C.SetLockBoss
// 0x0010 (0x0010 - 0x0000)
struct BP_TargetSearchComponent_C_SetLockBoss final
{
public:
	class AActor*                                 BossActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDummy;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TargetSearchComponent_C_SetLockBoss) == 0x000008, "Wrong alignment on BP_TargetSearchComponent_C_SetLockBoss");
static_assert(sizeof(BP_TargetSearchComponent_C_SetLockBoss) == 0x000010, "Wrong size on BP_TargetSearchComponent_C_SetLockBoss");
static_assert(offsetof(BP_TargetSearchComponent_C_SetLockBoss, BossActor) == 0x000000, "Member 'BP_TargetSearchComponent_C_SetLockBoss::BossActor' has a wrong offset!");
static_assert(offsetof(BP_TargetSearchComponent_C_SetLockBoss, bDummy) == 0x000008, "Member 'BP_TargetSearchComponent_C_SetLockBoss::bDummy' has a wrong offset!");

// Function BP_TargetSearchComponent.BP_TargetSearchComponent_C.AutoNextTarget
// 0x0080 (0x0080 - 0x0000)
struct BP_TargetSearchComponent_C_AutoNextTarget final
{
public:
	bool                                          bIgnoreRendered;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
