#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UIMain3DManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "ERenderTargetType_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_UIMain3DManager.BP_UIMain3DManager_C.ExecuteUbergraph_BP_UIMain3DManager
// 0x0070 (0x0070 - 0x0000)
struct BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9628[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RenderTargetManager_C*              CallFunc_GetRenderTargetManager_Manager;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9629[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_962A[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_962B[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_MenuPlayerBase_C*>           CallFunc_Map_Values_Values;                        // 0x0048(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ERenderTargetType RenderTargetType, class UTextureRenderTarget2D* NewTarget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager) == 0x000008, "Wrong alignment on BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager");
static_assert(sizeof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager) == 0x000070, "Wrong size on BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager");
static_assert(offsetof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager, EntryPoint) == 0x000000, "Member 'BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager, CallFunc_GetRenderTargetManager_Manager) == 0x000008, "Member 'BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager::CallFunc_GetRenderTargetManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager, Temp_int_Loop_Num_Variable) == 0x000014, "Member 'BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager, Temp_int_Loop_Counter_Variable_1) == 0x000024, "Member 'BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager, Temp_int_Array_Index_Variable_1) == 0x00002C, "Member 'BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager, Temp_int_Loop_Num_Variable_1) == 0x000030, "Member 'BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager, CallFunc_Less_IntInt_ReturnValue_1) == 0x000034, "Member 'BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager, Temp_bool_Has_Been_Initd_Variable) == 0x000035, "Member 'BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager, K2Node_Event_EndPlayReason) == 0x000036, "Member 'BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager, K2Node_SwitchEnum_CmpSuccess) == 0x000037, "Member 'BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager, CallFunc_IsValid_ReturnValue_1) == 0x000039, "Member 'BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager, Temp_bool_IsClosed_Variable) == 0x000040, "Member 'BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager, CallFunc_Map_Values_Values) == 0x000048, "Member 'BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager, K2Node_Event_DeltaSeconds) == 0x00005C, "Member 'BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'BP_UIMain3DManager_C_ExecuteUbergraph_BP_UIMain3DManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_UIMain3DManager.BP_UIMain3DManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_UIMain3DManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIMain3DManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_UIMain3DManager_C_ReceiveTick");
static_assert(sizeof(BP_UIMain3DManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_UIMain3DManager_C_ReceiveTick");
static_assert(offsetof(BP_UIMain3DManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_UIMain3DManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_UIMain3DManager.BP_UIMain3DManager_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_UIMain3DManager_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIMain3DManager_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_UIMain3DManager_C_ReceiveEndPlay");
static_assert(sizeof(BP_UIMain3DManager_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_UIMain3DManager_C_ReceiveEndPlay");
static_assert(offsetof(BP_UIMain3DManager_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_UIMain3DManager_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_UIMain3DManager.BP_UIMain3DManager_C.LoadAsset
// 0x0210 (0x0210 - 0x0000)
struct BP_UIMain3DManager_C_LoadAsset final
{
public:
	class ABP_MenuPlayerBase_C*                   Player;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_962C[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_962D[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetWeaponMeshes_Meshes;                   // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_962E[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FItemDataCell>                  K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm, HasGetValueTypeHash)
	struct FUIMain3DManagerEquipData              K2Node_MakeStruct_UIMain3DManagerEquipData;        // 0x0088(0x0110)()
	uint8                                         CallFunc_GetMenu3DCharacterRenderLayer_RenderLayer; // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_962F[0x3];                                     // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9630[0x4];                                     // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           CallFunc_Map_Values_Values;                        // 0x01A8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9631[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadSoftClass_ReturnValue;                // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9632[0x4];                                     // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsBP_Menu_Player_Base;     // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9633[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9634[0x4];                                     // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MenuPlayerBase_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9635[0x7];                                     // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0200(0x0010)(ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIMain3DManager_C_LoadAsset) == 0x000010, "Wrong alignment on BP_UIMain3DManager_C_LoadAsset");
static_assert(sizeof(BP_UIMain3DManager_C_LoadAsset) == 0x000210, "Wrong size on BP_UIMain3DManager_C_LoadAsset");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, Player) == 0x000000, "Member 'BP_UIMain3DManager_C_LoadAsset::Player' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_UIMain3DManager_C_LoadAsset::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, CallFunc_MakeLiteralInt_ReturnValue) == 0x000040, "Member 'BP_UIMain3DManager_C_LoadAsset::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, Temp_int_Array_Index_Variable) == 0x000044, "Member 'BP_UIMain3DManager_C_LoadAsset::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BP_UIMain3DManager_C_LoadAsset::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'BP_UIMain3DManager_C_LoadAsset::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, Temp_int_Array_Index_Variable_1) == 0x000050, "Member 'BP_UIMain3DManager_C_LoadAsset::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, Temp_int_Loop_Num_Variable) == 0x000054, "Member 'BP_UIMain3DManager_C_LoadAsset::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'BP_UIMain3DManager_C_LoadAsset::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, CallFunc_GetWeaponMeshes_Meshes) == 0x000060, "Member 'BP_UIMain3DManager_C_LoadAsset::CallFunc_GetWeaponMeshes_Meshes' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BP_UIMain3DManager_C_LoadAsset::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'BP_UIMain3DManager_C_LoadAsset::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, K2Node_MakeArray_Array) == 0x000078, "Member 'BP_UIMain3DManager_C_LoadAsset::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, K2Node_MakeStruct_UIMain3DManagerEquipData) == 0x000088, "Member 'BP_UIMain3DManager_C_LoadAsset::K2Node_MakeStruct_UIMain3DManagerEquipData' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, CallFunc_GetMenu3DCharacterRenderLayer_RenderLayer) == 0x000198, "Member 'BP_UIMain3DManager_C_LoadAsset::CallFunc_GetMenu3DCharacterRenderLayer_RenderLayer' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, CallFunc_Array_Add_ReturnValue) == 0x00019C, "Member 'BP_UIMain3DManager_C_LoadAsset::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, Temp_int_Loop_Counter_Variable_1) == 0x0001A0, "Member 'BP_UIMain3DManager_C_LoadAsset::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, CallFunc_Map_Values_Values) == 0x0001A8, "Member 'BP_UIMain3DManager_C_LoadAsset::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001B8, "Member 'BP_UIMain3DManager_C_LoadAsset::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, CallFunc_LoadSoftClass_ReturnValue) == 0x0001C0, "Member 'BP_UIMain3DManager_C_LoadAsset::CallFunc_LoadSoftClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, CallFunc_Array_Length_ReturnValue_1) == 0x0001C8, "Member 'BP_UIMain3DManager_C_LoadAsset::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, K2Node_ClassDynamicCast_AsBP_Menu_Player_Base) == 0x0001D0, "Member 'BP_UIMain3DManager_C_LoadAsset::K2Node_ClassDynamicCast_AsBP_Menu_Player_Base' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, K2Node_ClassDynamicCast_bSuccess) == 0x0001D8, "Member 'BP_UIMain3DManager_C_LoadAsset::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001E0, "Member 'BP_UIMain3DManager_C_LoadAsset::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001E8, "Member 'BP_UIMain3DManager_C_LoadAsset::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001F0, "Member 'BP_UIMain3DManager_C_LoadAsset::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, CallFunc_MakeLiteralByte_ReturnValue) == 0x0001F8, "Member 'BP_UIMain3DManager_C_LoadAsset::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_LoadAsset, CallFunc_Map_Keys_Keys) == 0x000200, "Member 'BP_UIMain3DManager_C_LoadAsset::CallFunc_Map_Keys_Keys' has a wrong offset!");

// Function BP_UIMain3DManager.BP_UIMain3DManager_C.GetMenuPlayer
// 0x0078 (0x0078 - 0x0000)
struct BP_UIMain3DManager_C_GetMenuPlayer final
{
public:
	int32                                         PlayerUniqueID;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9636[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MenuPlayerBase_C*                   Param_MenuPlayer;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFind;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9637[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param_Index;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SearchIndex;                                       // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9638[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_UniqueNameFromId_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9639[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_963A[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_963B[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_MenuPlayerBase_C*>           CallFunc_Map_Values_Values;                        // 0x0048(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0058(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class ABP_MenuPlayerBase_C*                   CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_963C[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIMain3DManager_C_GetMenuPlayer) == 0x000008, "Wrong alignment on BP_UIMain3DManager_C_GetMenuPlayer");
static_assert(sizeof(BP_UIMain3DManager_C_GetMenuPlayer) == 0x000078, "Wrong size on BP_UIMain3DManager_C_GetMenuPlayer");
static_assert(offsetof(BP_UIMain3DManager_C_GetMenuPlayer, PlayerUniqueID) == 0x000000, "Member 'BP_UIMain3DManager_C_GetMenuPlayer::PlayerUniqueID' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetMenuPlayer, Param_MenuPlayer) == 0x000008, "Member 'BP_UIMain3DManager_C_GetMenuPlayer::Param_MenuPlayer' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetMenuPlayer, IsFind) == 0x000010, "Member 'BP_UIMain3DManager_C_GetMenuPlayer::IsFind' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetMenuPlayer, Param_Index) == 0x000014, "Member 'BP_UIMain3DManager_C_GetMenuPlayer::Param_Index' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetMenuPlayer, SearchIndex) == 0x000018, "Member 'BP_UIMain3DManager_C_GetMenuPlayer::SearchIndex' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetMenuPlayer, Temp_bool_True_if_break_was_hit_Variable) == 0x00001C, "Member 'BP_UIMain3DManager_C_GetMenuPlayer::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetMenuPlayer, CallFunc_UniqueNameFromId_ReturnValue) == 0x000020, "Member 'BP_UIMain3DManager_C_GetMenuPlayer::CallFunc_UniqueNameFromId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetMenuPlayer, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'BP_UIMain3DManager_C_GetMenuPlayer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetMenuPlayer, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_UIMain3DManager_C_GetMenuPlayer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetMenuPlayer, Temp_int_Loop_Num_Variable) == 0x000030, "Member 'BP_UIMain3DManager_C_GetMenuPlayer::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetMenuPlayer, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BP_UIMain3DManager_C_GetMenuPlayer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetMenuPlayer, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_UIMain3DManager_C_GetMenuPlayer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetMenuPlayer, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_UIMain3DManager_C_GetMenuPlayer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetMenuPlayer, CallFunc_BooleanAND_ReturnValue) == 0x000040, "Member 'BP_UIMain3DManager_C_GetMenuPlayer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetMenuPlayer, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000041, "Member 'BP_UIMain3DManager_C_GetMenuPlayer::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetMenuPlayer, CallFunc_Map_Values_Values) == 0x000048, "Member 'BP_UIMain3DManager_C_GetMenuPlayer::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetMenuPlayer, CallFunc_Map_Keys_Keys) == 0x000058, "Member 'BP_UIMain3DManager_C_GetMenuPlayer::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetMenuPlayer, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_UIMain3DManager_C_GetMenuPlayer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetMenuPlayer, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000070, "Member 'BP_UIMain3DManager_C_GetMenuPlayer::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetMenuPlayer, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'BP_UIMain3DManager_C_GetMenuPlayer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function BP_UIMain3DManager.BP_UIMain3DManager_C.PrivateSetPlayer
// 0x0110 (0x0110 - 0x0000)
struct BP_UIMain3DManager_C_PrivateSetPlayer final
{
public:
	int32                                         PlayerUniqueID;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_963D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UIMain3DPlayerCapture_C*            TargetCapture;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuPlayerBase_C*                   Player;                                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuPlayerBase_C*                   CallFunc_GetMenuPlayer_MenuPlayer;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMenuPlayer_IsFind;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_963E[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMenuPlayer_Index;                      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_963F[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_SetPlayer_Chenged;                        // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9640[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_SetPlayer_Chenged_1;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9641[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9642[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIMain3DCharacterPlayerSetting        CallFunc_GetPlayerSetting_Setting;                 // 0x00C0(0x0040)(NoDestructor)
	bool                                          CallFunc_GetPlayerSetting_ReturnValue;             // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UIMain3DManager_C_PrivateSetPlayer) == 0x000010, "Wrong alignment on BP_UIMain3DManager_C_PrivateSetPlayer");
static_assert(sizeof(BP_UIMain3DManager_C_PrivateSetPlayer) == 0x000110, "Wrong size on BP_UIMain3DManager_C_PrivateSetPlayer");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateSetPlayer, PlayerUniqueID) == 0x000000, "Member 'BP_UIMain3DManager_C_PrivateSetPlayer::PlayerUniqueID' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateSetPlayer, TargetCapture) == 0x000008, "Member 'BP_UIMain3DManager_C_PrivateSetPlayer::TargetCapture' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateSetPlayer, Player) == 0x000010, "Member 'BP_UIMain3DManager_C_PrivateSetPlayer::Player' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateSetPlayer, CallFunc_GetMenuPlayer_MenuPlayer) == 0x000018, "Member 'BP_UIMain3DManager_C_PrivateSetPlayer::CallFunc_GetMenuPlayer_MenuPlayer' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateSetPlayer, CallFunc_GetMenuPlayer_IsFind) == 0x000020, "Member 'BP_UIMain3DManager_C_PrivateSetPlayer::CallFunc_GetMenuPlayer_IsFind' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateSetPlayer, CallFunc_GetMenuPlayer_Index) == 0x000024, "Member 'BP_UIMain3DManager_C_PrivateSetPlayer::CallFunc_GetMenuPlayer_Index' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateSetPlayer, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000028, "Member 'BP_UIMain3DManager_C_PrivateSetPlayer::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateSetPlayer, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'BP_UIMain3DManager_C_PrivateSetPlayer::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateSetPlayer, CallFunc_SetPlayer_Chenged) == 0x000070, "Member 'BP_UIMain3DManager_C_PrivateSetPlayer::CallFunc_SetPlayer_Chenged' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateSetPlayer, K2Node_MakeArray_Array) == 0x000078, "Member 'BP_UIMain3DManager_C_PrivateSetPlayer::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateSetPlayer, CallFunc_SetPlayer_Chenged_1) == 0x000088, "Member 'BP_UIMain3DManager_C_PrivateSetPlayer::CallFunc_SetPlayer_Chenged_1' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateSetPlayer, CallFunc_Format_ReturnValue) == 0x000090, "Member 'BP_UIMain3DManager_C_PrivateSetPlayer::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateSetPlayer, CallFunc_Conv_TextToString_ReturnValue) == 0x0000A8, "Member 'BP_UIMain3DManager_C_PrivateSetPlayer::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateSetPlayer, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'BP_UIMain3DManager_C_PrivateSetPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateSetPlayer, CallFunc_GetPlayerSetting_Setting) == 0x0000C0, "Member 'BP_UIMain3DManager_C_PrivateSetPlayer::CallFunc_GetPlayerSetting_Setting' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateSetPlayer, CallFunc_GetPlayerSetting_ReturnValue) == 0x000100, "Member 'BP_UIMain3DManager_C_PrivateSetPlayer::CallFunc_GetPlayerSetting_ReturnValue' has a wrong offset!");

// Function BP_UIMain3DManager.BP_UIMain3DManager_C.PrivateGetSelectCapture
// 0x0020 (0x0020 - 0x0000)
struct BP_UIMain3DManager_C_PrivateGetSelectCapture final
{
public:
	class ABP_UIMain3DPlayerCapture_C*            Capture;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9643[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UIMain3DPlayerCapture_C*            CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UIMain3DManager_C_PrivateGetSelectCapture) == 0x000008, "Wrong alignment on BP_UIMain3DManager_C_PrivateGetSelectCapture");
static_assert(sizeof(BP_UIMain3DManager_C_PrivateGetSelectCapture) == 0x000020, "Wrong size on BP_UIMain3DManager_C_PrivateGetSelectCapture");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateGetSelectCapture, Capture) == 0x000000, "Member 'BP_UIMain3DManager_C_PrivateGetSelectCapture::Capture' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateGetSelectCapture, CallFunc_MakeLiteralInt_ReturnValue) == 0x000008, "Member 'BP_UIMain3DManager_C_PrivateGetSelectCapture::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateGetSelectCapture, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_UIMain3DManager_C_PrivateGetSelectCapture::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateGetSelectCapture, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_UIMain3DManager_C_PrivateGetSelectCapture::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateGetSelectCapture, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'BP_UIMain3DManager_C_PrivateGetSelectCapture::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BP_UIMain3DManager.BP_UIMain3DManager_C.PrivateGetChangeTargetCapture
// 0x0020 (0x0020 - 0x0000)
struct BP_UIMain3DManager_C_PrivateGetChangeTargetCapture final
{
public:
	class ABP_UIMain3DPlayerCapture_C*            Capture;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9644[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UIMain3DPlayerCapture_C*            CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UIMain3DManager_C_PrivateGetChangeTargetCapture) == 0x000008, "Wrong alignment on BP_UIMain3DManager_C_PrivateGetChangeTargetCapture");
static_assert(sizeof(BP_UIMain3DManager_C_PrivateGetChangeTargetCapture) == 0x000020, "Wrong size on BP_UIMain3DManager_C_PrivateGetChangeTargetCapture");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateGetChangeTargetCapture, Capture) == 0x000000, "Member 'BP_UIMain3DManager_C_PrivateGetChangeTargetCapture::Capture' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateGetChangeTargetCapture, CallFunc_MakeLiteralInt_ReturnValue) == 0x000008, "Member 'BP_UIMain3DManager_C_PrivateGetChangeTargetCapture::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateGetChangeTargetCapture, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_UIMain3DManager_C_PrivateGetChangeTargetCapture::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateGetChangeTargetCapture, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_UIMain3DManager_C_PrivateGetChangeTargetCapture::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_PrivateGetChangeTargetCapture, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'BP_UIMain3DManager_C_PrivateGetChangeTargetCapture::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BP_UIMain3DManager.BP_UIMain3DManager_C.Initialize
// 0x0010 (0x0010 - 0x0000)
struct BP_UIMain3DManager_C_Initialize final
{
public:
	TArray<class UTextureRenderTarget2D*>         RenderTarget;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIMain3DManager_C_Initialize) == 0x000008, "Wrong alignment on BP_UIMain3DManager_C_Initialize");
static_assert(sizeof(BP_UIMain3DManager_C_Initialize) == 0x000010, "Wrong size on BP_UIMain3DManager_C_Initialize");
static_assert(offsetof(BP_UIMain3DManager_C_Initialize, RenderTarget) == 0x000000, "Member 'BP_UIMain3DManager_C_Initialize::RenderTarget' has a wrong offset!");

// Function BP_UIMain3DManager.BP_UIMain3DManager_C.SetScene
// 0x0840 (0x0840 - 0x0000)
struct BP_UIMain3DManager_C_SetScene final
{
public:
	EUIMain3DCharacterSceneID                     SceneID;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUIMain3DCharacterSceneID                     LastSceneID;                                       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9645[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UIMain3DPlayerCapture_C*            Capture;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9646[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UIMain3DPlayerCapture_C*            CallFunc_PrivateGetSelectCapture_Capture;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuPlayerBase_C*                   CallFunc_GetMenuPlayer_MenuPlayer;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMenuPlayer_IsFind;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9647[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMenuPlayer_Index;                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUIMain3DCharacterSceneSetting         CallFunc_GetSceneSetting_Setting;                  // 0x0030(0x0800)()
	bool                                          CallFunc_GetSceneSetting_ReturnValue;              // 0x0830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0831(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0832(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9648[0x5];                                     // 0x0833(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UIMain3DPlayerCapture_C*            CallFunc_PrivateGetSelectCapture_Capture_1;        // 0x0838(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIMain3DManager_C_SetScene) == 0x000010, "Wrong alignment on BP_UIMain3DManager_C_SetScene");
static_assert(sizeof(BP_UIMain3DManager_C_SetScene) == 0x000840, "Wrong size on BP_UIMain3DManager_C_SetScene");
static_assert(offsetof(BP_UIMain3DManager_C_SetScene, SceneID) == 0x000000, "Member 'BP_UIMain3DManager_C_SetScene::SceneID' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_SetScene, LastSceneID) == 0x000001, "Member 'BP_UIMain3DManager_C_SetScene::LastSceneID' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_SetScene, Capture) == 0x000008, "Member 'BP_UIMain3DManager_C_SetScene::Capture' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_SetScene, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000010, "Member 'BP_UIMain3DManager_C_SetScene::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_SetScene, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'BP_UIMain3DManager_C_SetScene::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_SetScene, CallFunc_PrivateGetSelectCapture_Capture) == 0x000018, "Member 'BP_UIMain3DManager_C_SetScene::CallFunc_PrivateGetSelectCapture_Capture' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_SetScene, CallFunc_GetMenuPlayer_MenuPlayer) == 0x000020, "Member 'BP_UIMain3DManager_C_SetScene::CallFunc_GetMenuPlayer_MenuPlayer' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_SetScene, CallFunc_GetMenuPlayer_IsFind) == 0x000028, "Member 'BP_UIMain3DManager_C_SetScene::CallFunc_GetMenuPlayer_IsFind' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_SetScene, CallFunc_GetMenuPlayer_Index) == 0x00002C, "Member 'BP_UIMain3DManager_C_SetScene::CallFunc_GetMenuPlayer_Index' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_SetScene, CallFunc_GetSceneSetting_Setting) == 0x000030, "Member 'BP_UIMain3DManager_C_SetScene::CallFunc_GetSceneSetting_Setting' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_SetScene, CallFunc_GetSceneSetting_ReturnValue) == 0x000830, "Member 'BP_UIMain3DManager_C_SetScene::CallFunc_GetSceneSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_SetScene, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000831, "Member 'BP_UIMain3DManager_C_SetScene::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_SetScene, CallFunc_IsValid_ReturnValue) == 0x000832, "Member 'BP_UIMain3DManager_C_SetScene::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_SetScene, CallFunc_PrivateGetSelectCapture_Capture_1) == 0x000838, "Member 'BP_UIMain3DManager_C_SetScene::CallFunc_PrivateGetSelectCapture_Capture_1' has a wrong offset!");

// Function BP_UIMain3DManager.BP_UIMain3DManager_C.GetSelectTexture
// 0x0030 (0x0030 - 0x0000)
struct BP_UIMain3DManager_C_GetSelectTexture final
{
public:
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 RenderTargetAlpha;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_UIMain3DPlayerCapture_C*            CallFunc_PrivateGetSelectCapture_Capture;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9649[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_GetTexture_Texture;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_GetTexture_AlphaTexture;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIMain3DManager_C_GetSelectTexture) == 0x000008, "Wrong alignment on BP_UIMain3DManager_C_GetSelectTexture");
static_assert(sizeof(BP_UIMain3DManager_C_GetSelectTexture) == 0x000030, "Wrong size on BP_UIMain3DManager_C_GetSelectTexture");
static_assert(offsetof(BP_UIMain3DManager_C_GetSelectTexture, RenderTarget) == 0x000000, "Member 'BP_UIMain3DManager_C_GetSelectTexture::RenderTarget' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetSelectTexture, RenderTargetAlpha) == 0x000008, "Member 'BP_UIMain3DManager_C_GetSelectTexture::RenderTargetAlpha' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetSelectTexture, CallFunc_PrivateGetSelectCapture_Capture) == 0x000010, "Member 'BP_UIMain3DManager_C_GetSelectTexture::CallFunc_PrivateGetSelectCapture_Capture' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetSelectTexture, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_UIMain3DManager_C_GetSelectTexture::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetSelectTexture, CallFunc_GetTexture_Texture) == 0x000020, "Member 'BP_UIMain3DManager_C_GetSelectTexture::CallFunc_GetTexture_Texture' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetSelectTexture, CallFunc_GetTexture_AlphaTexture) == 0x000028, "Member 'BP_UIMain3DManager_C_GetSelectTexture::CallFunc_GetTexture_AlphaTexture' has a wrong offset!");

// Function BP_UIMain3DManager.BP_UIMain3DManager_C.GetChangeTargetTexture
// 0x0030 (0x0030 - 0x0000)
struct BP_UIMain3DManager_C_GetChangeTargetTexture final
{
public:
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 RenderTargetAlpha;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_UIMain3DPlayerCapture_C*            CallFunc_PrivateGetChangeTargetCapture_Capture;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_964A[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_GetTexture_Texture;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_GetTexture_AlphaTexture;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIMain3DManager_C_GetChangeTargetTexture) == 0x000008, "Wrong alignment on BP_UIMain3DManager_C_GetChangeTargetTexture");
static_assert(sizeof(BP_UIMain3DManager_C_GetChangeTargetTexture) == 0x000030, "Wrong size on BP_UIMain3DManager_C_GetChangeTargetTexture");
static_assert(offsetof(BP_UIMain3DManager_C_GetChangeTargetTexture, RenderTarget) == 0x000000, "Member 'BP_UIMain3DManager_C_GetChangeTargetTexture::RenderTarget' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetChangeTargetTexture, RenderTargetAlpha) == 0x000008, "Member 'BP_UIMain3DManager_C_GetChangeTargetTexture::RenderTargetAlpha' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetChangeTargetTexture, CallFunc_PrivateGetChangeTargetCapture_Capture) == 0x000010, "Member 'BP_UIMain3DManager_C_GetChangeTargetTexture::CallFunc_PrivateGetChangeTargetCapture_Capture' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetChangeTargetTexture, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_UIMain3DManager_C_GetChangeTargetTexture::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DManager_C_GetChangeTargetTexture, CallFunc_GetTexture_Texture) == 0x000020, "Member 'BP_UIMain3DManager_C_GetChangeTargetTexture::CallFunc_GetTexture_Texture' has a wrong offset!");
