#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ui_UV_psychic_guage_frame_3

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ui_UV_psychic_guage_frame_3.BP_ui_UV_psychic_guage_frame_3_C.UI_GetArrayColor_psychic_guage_3
// 0x0038 (0x0038 - 0x0000)
struct BP_ui_UV_psychic_guage_frame_3_C_UI_GetArrayColor_psychic_guage_3 final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      UI_UVArray_psychic_guage_frame_3;                  // 0x0008(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	TArray<struct FVector2D>                      ArrayUV_psychic_guage_frame_3;                     // 0x0018(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FVector2D>                      K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_UV_psychic_guage_frame_3_C_UI_GetArrayColor_psychic_guage_3) == 0x000008, "Wrong alignment on BP_ui_UV_psychic_guage_frame_3_C_UI_GetArrayColor_psychic_guage_3");
static_assert(sizeof(BP_ui_UV_psychic_guage_frame_3_C_UI_GetArrayColor_psychic_guage_3) == 0x000038, "Wrong size on BP_ui_UV_psychic_guage_frame_3_C_UI_GetArrayColor_psychic_guage_3");
static_assert(offsetof(BP_ui_UV_psychic_guage_frame_3_C_UI_GetArrayColor_psychic_guage_3, __WorldContext) == 0x000000, "Member 'BP_ui_UV_psychic_guage_frame_3_C_UI_GetArrayColor_psychic_guage_3::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_psychic_guage_frame_3_C_UI_GetArrayColor_psychic_guage_3, UI_UVArray_psychic_guage_frame_3) == 0x000008, "Member 'BP_ui_UV_psychic_guage_frame_3_C_UI_GetArrayColor_psychic_guage_3::UI_UVArray_psychic_guage_frame_3' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_psychic_guage_frame_3_C_UI_GetArrayColor_psychic_guage_3, ArrayUV_psychic_guage_frame_3) == 0x000018, "Member 'BP_ui_UV_psychic_guage_frame_3_C_UI_GetArrayColor_psychic_guage_3::ArrayUV_psychic_guage_frame_3' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_psychic_guage_frame_3_C_UI_GetArrayColor_psychic_guage_3, K2Node_MakeArray_Array) == 0x000028, "Member 'BP_ui_UV_psychic_guage_frame_3_C_UI_GetArrayColor_psychic_guage_3::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_ui_UV_psychic_guage_frame_3.BP_ui_UV_psychic_guage_frame_3_C.UI_SetThumbnail_psychic_guage_3
// 0x0088 (0x0088 - 0x0000)
struct BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3 final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50FD[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 HeightWavepercent_List;                            // 0x0020(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<float>                                 WeidthWavepercent_List;                            // 0x0030(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<float>                                 UseU_Max_List;                                     // 0x0040(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array_1;                          // 0x0068(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array_2;                          // 0x0078(0x0010)(ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3) == 0x000008, "Wrong alignment on BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3");
static_assert(sizeof(BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3) == 0x000088, "Wrong size on BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3");
static_assert(offsetof(BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3, WorldContext) == 0x000000, "Member 'BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3::WorldContext' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3, Image) == 0x000008, "Member 'BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3::Image' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3, Param_Index) == 0x000010, "Member 'BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3::Param_Index' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3, __WorldContext) == 0x000018, "Member 'BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3, HeightWavepercent_List) == 0x000020, "Member 'BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3::HeightWavepercent_List' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3, WeidthWavepercent_List) == 0x000030, "Member 'BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3::WeidthWavepercent_List' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3, UseU_Max_List) == 0x000040, "Member 'BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3::UseU_Max_List' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3, K2Node_MakeArray_Array) == 0x000050, "Member 'BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000060, "Member 'BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3, K2Node_MakeArray_Array_1) == 0x000068, "Member 'BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3, K2Node_MakeArray_Array_2) == 0x000078, "Member 'BP_ui_UV_psychic_guage_frame_3_C_UI_SetThumbnail_psychic_guage_3::K2Node_MakeArray_Array_2' has a wrong offset!");

}

