#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ui_SceneWorldMap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ui_SceneWorldMap.BP_ui_SceneWorldMap_C.ExecuteUbergraph_BP_ui_SceneWorldMap
// 0x0020 (0x0020 - 0x0000)
struct BP_ui_SceneWorldMap_C_ExecuteUbergraph_BP_ui_SceneWorldMap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RenderTargetManager_C*              CallFunc_GetRenderTargetManager_Manager;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_GetRenderTarget_RenderTarget;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActorPauseFlag_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_SceneWorldMap_C_ExecuteUbergraph_BP_ui_SceneWorldMap) == 0x000008, "Wrong alignment on BP_ui_SceneWorldMap_C_ExecuteUbergraph_BP_ui_SceneWorldMap");
static_assert(sizeof(BP_ui_SceneWorldMap_C_ExecuteUbergraph_BP_ui_SceneWorldMap) == 0x000020, "Wrong size on BP_ui_SceneWorldMap_C_ExecuteUbergraph_BP_ui_SceneWorldMap");
static_assert(offsetof(BP_ui_SceneWorldMap_C_ExecuteUbergraph_BP_ui_SceneWorldMap, EntryPoint) == 0x000000, "Member 'BP_ui_SceneWorldMap_C_ExecuteUbergraph_BP_ui_SceneWorldMap::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_ExecuteUbergraph_BP_ui_SceneWorldMap, CallFunc_GetRenderTargetManager_Manager) == 0x000008, "Member 'BP_ui_SceneWorldMap_C_ExecuteUbergraph_BP_ui_SceneWorldMap::CallFunc_GetRenderTargetManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_ExecuteUbergraph_BP_ui_SceneWorldMap, CallFunc_GetRenderTarget_RenderTarget) == 0x000010, "Member 'BP_ui_SceneWorldMap_C_ExecuteUbergraph_BP_ui_SceneWorldMap::CallFunc_GetRenderTarget_RenderTarget' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_ExecuteUbergraph_BP_ui_SceneWorldMap, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BP_ui_SceneWorldMap_C_ExecuteUbergraph_BP_ui_SceneWorldMap::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_ExecuteUbergraph_BP_ui_SceneWorldMap, CallFunc_GetActorPauseFlag_ReturnValue) == 0x00001C, "Member 'BP_ui_SceneWorldMap_C_ExecuteUbergraph_BP_ui_SceneWorldMap::CallFunc_GetActorPauseFlag_ReturnValue' has a wrong offset!");

// Function BP_ui_SceneWorldMap.BP_ui_SceneWorldMap_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ui_SceneWorldMap_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_SceneWorldMap_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ui_SceneWorldMap_C_ReceiveTick");
static_assert(sizeof(BP_ui_SceneWorldMap_C_ReceiveTick) == 0x000004, "Wrong size on BP_ui_SceneWorldMap_C_ReceiveTick");
static_assert(offsetof(BP_ui_SceneWorldMap_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ui_SceneWorldMap_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ui_SceneWorldMap.BP_ui_SceneWorldMap_C.UserConstructionScript
// 0x0038 (0x0038 - 0x0000)
struct BP_ui_SceneWorldMap_C_UserConstructionScript final
{
public:
	TArray<class UMeshComponent*>                 Meshes;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A4B[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMeshComponent*>                 CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_SceneWorldMap_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_ui_SceneWorldMap_C_UserConstructionScript");
static_assert(sizeof(BP_ui_SceneWorldMap_C_UserConstructionScript) == 0x000038, "Wrong size on BP_ui_SceneWorldMap_C_UserConstructionScript");
static_assert(offsetof(BP_ui_SceneWorldMap_C_UserConstructionScript, Meshes) == 0x000000, "Member 'BP_ui_SceneWorldMap_C_UserConstructionScript::Meshes' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_ui_SceneWorldMap_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_UserConstructionScript, Temp_int_Loop_Num_Variable) == 0x000014, "Member 'BP_ui_SceneWorldMap_C_UserConstructionScript::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_ui_SceneWorldMap_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_ui_SceneWorldMap_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_ui_SceneWorldMap_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_ui_SceneWorldMap_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_UserConstructionScript, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000028, "Member 'BP_ui_SceneWorldMap_C_UserConstructionScript::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");

// Function BP_ui_SceneWorldMap.BP_ui_SceneWorldMap_C.SetupLocationList
// 0x0420 (0x0420 - 0x0000)
struct BP_ui_SceneWorldMap_C_SetupLocationList final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A4C[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A4D[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A4E[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4F[0xC];                                     // 0x00A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_2;     // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A50[0x8];                                     // 0x0158(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_3;     // 0x0160(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_4;     // 0x0190(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_3;                // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_3;                // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_3;                   // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_4;                // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_4;                // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_4;                   // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A51[0x8];                                     // 0x0208(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_5;     // 0x0210(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_5;                // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_5;                // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_5;                   // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A52[0xC];                                     // 0x0264(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_6;     // 0x0270(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_6;                // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_6;                // 0x02AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_6;                   // 0x02B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A53[0xC];                                     // 0x02C4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_7;     // 0x02D0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_7;                // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_7;                // 0x030C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_7;                   // 0x0318(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A54[0xC];                                     // 0x0324(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_8;     // 0x0330(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_8;                // 0x0360(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_8;                // 0x036C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_8;                   // 0x0378(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A55[0xC];                                     // 0x0384(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_9;     // 0x0390(0x0030)(IsPlainOldData, NoDestructor)
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array_1;                          // 0x03C0(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_9;                // 0x03D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_9;                // 0x03DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_9;                   // 0x03E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A56[0x4];                                     // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        K2Node_MakeArray_Array_2;                          // 0x03F8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x040C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A57[0x3];                                     // 0x040D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_SceneWorldMap_C_SetupLocationList) == 0x000010, "Wrong alignment on BP_ui_SceneWorldMap_C_SetupLocationList");
static_assert(sizeof(BP_ui_SceneWorldMap_C_SetupLocationList) == 0x000420, "Wrong size on BP_ui_SceneWorldMap_C_SetupLocationList");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_Array_Length_ReturnValue_1) == 0x000018, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000028, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, Temp_int_Array_Index_Variable_1) == 0x000034, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, K2Node_MakeArray_Array) == 0x000040, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000050, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Location) == 0x000080, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Rotation) == 0x00008C, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Scale) == 0x000098, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x0000B0, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_K2_GetComponentToWorld_ReturnValue_2) == 0x0000E0, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_K2_GetComponentToWorld_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Location_1) == 0x000110, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Rotation_1) == 0x00011C, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Scale_1) == 0x000128, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Location_2) == 0x000134, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Location_2' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Rotation_2) == 0x000140, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Rotation_2' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Scale_2) == 0x00014C, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Scale_2' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_K2_GetComponentToWorld_ReturnValue_3) == 0x000160, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_K2_GetComponentToWorld_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_K2_GetComponentToWorld_ReturnValue_4) == 0x000190, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_K2_GetComponentToWorld_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Location_3) == 0x0001C0, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Location_3' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Rotation_3) == 0x0001CC, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Rotation_3' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Scale_3) == 0x0001D8, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Scale_3' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Location_4) == 0x0001E4, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Location_4' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Rotation_4) == 0x0001F0, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Rotation_4' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Scale_4) == 0x0001FC, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Scale_4' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_K2_GetComponentToWorld_ReturnValue_5) == 0x000210, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_K2_GetComponentToWorld_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Location_5) == 0x000240, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Location_5' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Rotation_5) == 0x00024C, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Rotation_5' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Scale_5) == 0x000258, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Scale_5' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_K2_GetComponentToWorld_ReturnValue_6) == 0x000270, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_K2_GetComponentToWorld_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Location_6) == 0x0002A0, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Location_6' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Rotation_6) == 0x0002AC, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Rotation_6' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Scale_6) == 0x0002B8, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Scale_6' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_K2_GetComponentToWorld_ReturnValue_7) == 0x0002D0, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_K2_GetComponentToWorld_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Location_7) == 0x000300, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Location_7' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Rotation_7) == 0x00030C, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Rotation_7' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Scale_7) == 0x000318, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Scale_7' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_K2_GetComponentToWorld_ReturnValue_8) == 0x000330, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_K2_GetComponentToWorld_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Location_8) == 0x000360, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Location_8' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Rotation_8) == 0x00036C, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Rotation_8' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Scale_8) == 0x000378, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Scale_8' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_K2_GetComponentToWorld_ReturnValue_9) == 0x000390, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_K2_GetComponentToWorld_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, K2Node_MakeArray_Array_1) == 0x0003C0, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Location_9) == 0x0003D0, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Location_9' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Rotation_9) == 0x0003DC, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Rotation_9' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_BreakTransform_Scale_9) == 0x0003E8, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_BreakTransform_Scale_9' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, K2Node_MakeArray_Array_2) == 0x0003F8, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, Temp_int_Loop_Counter_Variable_1) == 0x000408, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_Less_IntInt_ReturnValue_1) == 0x00040C, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetupLocationList, CallFunc_Add_IntInt_ReturnValue_1) == 0x000410, "Member 'BP_ui_SceneWorldMap_C_SetupLocationList::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_ui_SceneWorldMap.BP_ui_SceneWorldMap_C.SetTarget
// 0x0120 (0x0120 - 0x0000)
struct BP_ui_SceneWorldMap_C_SetTarget final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDirect;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A58[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           _SuouList;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   _WorkName;                                         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _index;                                            // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A59[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A5A[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A5B[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A5C[0x2];                                     // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A5D[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_2;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A5E[0x6];                                     // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A5F[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_3;                         // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A60[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_4;                         // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_2;            // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A61[0x2];                                     // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ui_SceneWorldMap_C_SetTarget) == 0x000008, "Wrong alignment on BP_ui_SceneWorldMap_C_SetTarget");
static_assert(sizeof(BP_ui_SceneWorldMap_C_SetTarget) == 0x000120, "Wrong size on BP_ui_SceneWorldMap_C_SetTarget");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, Param_Name) == 0x000000, "Member 'BP_ui_SceneWorldMap_C_SetTarget::Param_Name' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, IsDirect) == 0x000008, "Member 'BP_ui_SceneWorldMap_C_SetTarget::IsDirect' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, _SuouList) == 0x000010, "Member 'BP_ui_SceneWorldMap_C_SetTarget::_SuouList' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, _WorkName) == 0x000020, "Member 'BP_ui_SceneWorldMap_C_SetTarget::_WorkName' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, _index) == 0x000028, "Member 'BP_ui_SceneWorldMap_C_SetTarget::_index' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, Temp_int_Loop_Num_Variable) == 0x00002C, "Member 'BP_ui_SceneWorldMap_C_SetTarget::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_Conv_NameToString_ReturnValue) == 0x000038, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BP_ui_SceneWorldMap_C_SetTarget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'BP_ui_SceneWorldMap_C_SetTarget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_IsValid_ReturnValue_1) == 0x000069, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, Temp_int_Loop_Counter_Variable_1) == 0x00006C, "Member 'BP_ui_SceneWorldMap_C_SetTarget::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, Temp_int_Array_Index_Variable_1) == 0x000070, "Member 'BP_ui_SceneWorldMap_C_SetTarget::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000074, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_Less_IntInt_ReturnValue_1) == 0x000075, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_Add_IntInt_ReturnValue_1) == 0x000078, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_Array_Get_Item_2) == 0x000080, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000088, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_IsValid_ReturnValue_2) == 0x000089, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, K2Node_MakeArray_Array) == 0x000090, "Member 'BP_ui_SceneWorldMap_C_SetTarget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000A0, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_Array_Get_Item_3) == 0x0000A8, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_IsValid_ReturnValue_3) == 0x0000B0, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000B4, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_MakeVector_ReturnValue) == 0x0000B8, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_MakeRotator_ReturnValue) == 0x0000C4, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x0000D0, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_Array_Get_Item_4) == 0x0000DC, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_Add_VectorVector_ReturnValue) == 0x0000E8, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000F4, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000100, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_NotEqual_IntInt_ReturnValue_2) == 0x000101, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_NotEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_Array_Length_ReturnValue_1) == 0x000104, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_GetObjectName_ReturnValue) == 0x000108, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_SetTarget, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000118, "Member 'BP_ui_SceneWorldMap_C_SetTarget::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function BP_ui_SceneWorldMap.BP_ui_SceneWorldMap_C.MoveCamera
// 0x0044 (0x0044 - 0x0000)
struct BP_ui_SceneWorldMap_C_MoveCamera final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _Work;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A62[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldNormalDeltaSeconds_ReturnValue;   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_SceneWorldMap_C_MoveCamera) == 0x000004, "Wrong alignment on BP_ui_SceneWorldMap_C_MoveCamera");
static_assert(sizeof(BP_ui_SceneWorldMap_C_MoveCamera) == 0x000044, "Wrong size on BP_ui_SceneWorldMap_C_MoveCamera");
static_assert(offsetof(BP_ui_SceneWorldMap_C_MoveCamera, DeltaSeconds) == 0x000000, "Member 'BP_ui_SceneWorldMap_C_MoveCamera::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_MoveCamera, _Work) == 0x000004, "Member 'BP_ui_SceneWorldMap_C_MoveCamera::_Work' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_MoveCamera, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000008, "Member 'BP_ui_SceneWorldMap_C_MoveCamera::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_MoveCamera, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000014, "Member 'BP_ui_SceneWorldMap_C_MoveCamera::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_MoveCamera, CallFunc_Add_VectorVector_ReturnValue) == 0x000020, "Member 'BP_ui_SceneWorldMap_C_MoveCamera::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_MoveCamera, CallFunc_FClamp_ReturnValue) == 0x00002C, "Member 'BP_ui_SceneWorldMap_C_MoveCamera::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_MoveCamera, CallFunc_Less_FloatFloat_ReturnValue) == 0x000030, "Member 'BP_ui_SceneWorldMap_C_MoveCamera::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_MoveCamera, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000034, "Member 'BP_ui_SceneWorldMap_C_MoveCamera::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_MoveCamera, CallFunc_GetFloatValue_ReturnValue) == 0x000038, "Member 'BP_ui_SceneWorldMap_C_MoveCamera::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_MoveCamera, CallFunc_GetWorldNormalDeltaSeconds_ReturnValue) == 0x00003C, "Member 'BP_ui_SceneWorldMap_C_MoveCamera::CallFunc_GetWorldNormalDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_MoveCamera, CallFunc_Add_FloatFloat_ReturnValue) == 0x000040, "Member 'BP_ui_SceneWorldMap_C_MoveCamera::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_ui_SceneWorldMap.BP_ui_SceneWorldMap_C.UpdateCamera
// 0x00D0 (0x00D0 - 0x0000)
struct BP_ui_SceneWorldMap_C_UpdateCamera final
{
public:
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A63[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0040(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ui_SceneWorldMap_C_UpdateCamera) == 0x000010, "Wrong alignment on BP_ui_SceneWorldMap_C_UpdateCamera");
static_assert(sizeof(BP_ui_SceneWorldMap_C_UpdateCamera) == 0x0000D0, "Wrong size on BP_ui_SceneWorldMap_C_UpdateCamera");
static_assert(offsetof(BP_ui_SceneWorldMap_C_UpdateCamera, CallFunc_MakeRotator_ReturnValue) == 0x000000, "Member 'BP_ui_SceneWorldMap_C_UpdateCamera::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_UpdateCamera, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_ui_SceneWorldMap_C_UpdateCamera::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneWorldMap_C_UpdateCamera, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000040, "Member 'BP_ui_SceneWorldMap_C_UpdateCamera::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");

// Function BP_ui_SceneWorldMap.BP_ui_SceneWorldMap_C.SetCurrentLocation
// 0x0058 (0x0058 - 0x0000)
struct BP_ui_SceneWorldMap_C_SetCurrentLocation final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _index;                                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A64[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A65[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A66[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ui_SceneWorldMap_C_SetCurrentLocation) == 0x000008, "Wrong alignment on BP_ui_SceneWorldMap_C_SetCurrentLocation");
