#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ui_SceneMap

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Enum_ui_help_window_type_structs.hpp"


namespace SDK::Params
{

// Function BP_ui_SceneMap.BP_ui_SceneMap_C.ExecuteUbergraph_BP_ui_SceneMap
// 0x00D8 (0x00D8 - 0x0000)
struct BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AMapGimmickObject* Gimmick)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_DestinationDispFlag;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B90[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_floor;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B91[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMapGimmickManager*                     CallFunc_GetMapGimmickManager_MapGimmickManager;   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B92[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AMapGimmickObject*                K2Node_CustomEvent_gimmick_1;                      // 0x0060(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool DestinationDispFlag)>     K2Node_CreateDelegate_OutputDelegate_1;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   CallFunc_GetGimmickActorName_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B93[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLineTraceActorLocation_ReturnValue;    // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRateData_ReturnValue;                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B94[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AMapGimmickObject*                K2Node_CustomEvent_gimmick;                        // 0x0098(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFloorIndexCore2_ReturnValue;           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetGimmickActorName_ReturnValue_1;        // 0x00A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B95[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Floor)>                  K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AMapGimmickObject* Gimmick)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap) == 0x000008, "Wrong alignment on BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap");
static_assert(sizeof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap) == 0x0000D8, "Wrong size on BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap");
static_assert(offsetof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap, EntryPoint) == 0x000000, "Member 'BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap, K2Node_CustomEvent_DestinationDispFlag) == 0x000018, "Member 'BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap::K2Node_CustomEvent_DestinationDispFlag' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap, CallFunc_GetEventManager_EventManager) == 0x000020, "Member 'BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap, K2Node_CustomEvent_floor) == 0x000028, "Member 'BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap::K2Node_CustomEvent_floor' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap, CallFunc_Conv_IntToString_ReturnValue) == 0x000030, "Member 'BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap, CallFunc_GetMapGimmickManager_MapGimmickManager) == 0x000050, "Member 'BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap::CallFunc_GetMapGimmickManager_MapGimmickManager' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap, K2Node_CustomEvent_gimmick_1) == 0x000060, "Member 'BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap::K2Node_CustomEvent_gimmick_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap, K2Node_CreateDelegate_OutputDelegate_1) == 0x000068, "Member 'BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap, CallFunc_GetGimmickActorName_ReturnValue) == 0x000078, "Member 'BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap::CallFunc_GetGimmickActorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap, CallFunc_GetLineTraceActorLocation_ReturnValue) == 0x000084, "Member 'BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap::CallFunc_GetLineTraceActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap, CallFunc_GetRateData_ReturnValue) == 0x000090, "Member 'BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap::CallFunc_GetRateData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap, K2Node_CustomEvent_gimmick) == 0x000098, "Member 'BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap::K2Node_CustomEvent_gimmick' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap, CallFunc_GetFloorIndexCore2_ReturnValue) == 0x0000A0, "Member 'BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap::CallFunc_GetFloorIndexCore2_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap, CallFunc_GetGimmickActorName_ReturnValue_1) == 0x0000A4, "Member 'BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap::CallFunc_GetGimmickActorName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap, CallFunc_IsValid_ReturnValue_2) == 0x0000AC, "Member 'BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000B0, "Member 'BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000C0, "Member 'BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap, CallFunc_IsValid_ReturnValue_3) == 0x0000D0, "Member 'BP_ui_SceneMap_C_ExecuteUbergraph_BP_ui_SceneMap::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function BP_ui_SceneMap.BP_ui_SceneMap_C.UpdateMapGimmickReuse
// 0x0008 (0x0008 - 0x0000)
struct BP_ui_SceneMap_C_UpdateMapGimmickReuse final
{
public:
	const class AMapGimmickObject*                Gimmick;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_SceneMap_C_UpdateMapGimmickReuse) == 0x000008, "Wrong alignment on BP_ui_SceneMap_C_UpdateMapGimmickReuse");
static_assert(sizeof(BP_ui_SceneMap_C_UpdateMapGimmickReuse) == 0x000008, "Wrong size on BP_ui_SceneMap_C_UpdateMapGimmickReuse");
static_assert(offsetof(BP_ui_SceneMap_C_UpdateMapGimmickReuse, Gimmick) == 0x000000, "Member 'BP_ui_SceneMap_C_UpdateMapGimmickReuse::Gimmick' has a wrong offset!");

// Function BP_ui_SceneMap.BP_ui_SceneMap_C.UpdateMapGimmick
// 0x0008 (0x0008 - 0x0000)
struct BP_ui_SceneMap_C_UpdateMapGimmick final
{
public:
	const class AMapGimmickObject*                Gimmick;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_SceneMap_C_UpdateMapGimmick) == 0x000008, "Wrong alignment on BP_ui_SceneMap_C_UpdateMapGimmick");
static_assert(sizeof(BP_ui_SceneMap_C_UpdateMapGimmick) == 0x000008, "Wrong size on BP_ui_SceneMap_C_UpdateMapGimmick");
static_assert(offsetof(BP_ui_SceneMap_C_UpdateMapGimmick, Gimmick) == 0x000000, "Member 'BP_ui_SceneMap_C_UpdateMapGimmick::Gimmick' has a wrong offset!");

// Function BP_ui_SceneMap.BP_ui_SceneMap_C.ChangeMinimapFloor
// 0x0004 (0x0004 - 0x0000)
struct BP_ui_SceneMap_C_ChangeMinimapFloor final
{
public:
	int32                                         Floor;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_SceneMap_C_ChangeMinimapFloor) == 0x000004, "Wrong alignment on BP_ui_SceneMap_C_ChangeMinimapFloor");
static_assert(sizeof(BP_ui_SceneMap_C_ChangeMinimapFloor) == 0x000004, "Wrong size on BP_ui_SceneMap_C_ChangeMinimapFloor");
static_assert(offsetof(BP_ui_SceneMap_C_ChangeMinimapFloor, Floor) == 0x000000, "Member 'BP_ui_SceneMap_C_ChangeMinimapFloor::Floor' has a wrong offset!");

// Function BP_ui_SceneMap.BP_ui_SceneMap_C.Event_UpdateTargetPoint
// 0x0001 (0x0001 - 0x0000)
struct BP_ui_SceneMap_C_Event_UpdateTargetPoint final
{
public:
	bool                                          DestinationDispFlag;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ui_SceneMap_C_Event_UpdateTargetPoint) == 0x000001, "Wrong alignment on BP_ui_SceneMap_C_Event_UpdateTargetPoint");
static_assert(sizeof(BP_ui_SceneMap_C_Event_UpdateTargetPoint) == 0x000001, "Wrong size on BP_ui_SceneMap_C_Event_UpdateTargetPoint");
static_assert(offsetof(BP_ui_SceneMap_C_Event_UpdateTargetPoint, DestinationDispFlag) == 0x000000, "Member 'BP_ui_SceneMap_C_Event_UpdateTargetPoint::DestinationDispFlag' has a wrong offset!");

// Function BP_ui_SceneMap.BP_ui_SceneMap_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ui_SceneMap_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_SceneMap_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ui_SceneMap_C_ReceiveTick");
static_assert(sizeof(BP_ui_SceneMap_C_ReceiveTick) == 0x000004, "Wrong size on BP_ui_SceneMap_C_ReceiveTick");
static_assert(offsetof(BP_ui_SceneMap_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ui_SceneMap_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ui_SceneMap.BP_ui_SceneMap_C.Camera_Init
// 0x0028 (0x0028 - 0x0000)
struct BP_ui_SceneMap_C_Camera_Init final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B96[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RenderTargetManager_C*              CallFunc_GetRenderTargetManager_Manager;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B97[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_GetRenderTarget_RenderTarget;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      CallFunc_GetCollisitonData_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_SceneMap_C_Camera_Init) == 0x000008, "Wrong alignment on BP_ui_SceneMap_C_Camera_Init");
static_assert(sizeof(BP_ui_SceneMap_C_Camera_Init) == 0x000028, "Wrong size on BP_ui_SceneMap_C_Camera_Init");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_Init, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_ui_SceneMap_C_Camera_Init::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_Init, CallFunc_GetRenderTargetManager_Manager) == 0x000008, "Member 'BP_ui_SceneMap_C_Camera_Init::CallFunc_GetRenderTargetManager_Manager' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_Init, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'BP_ui_SceneMap_C_Camera_Init::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_Init, CallFunc_GetRenderTarget_RenderTarget) == 0x000018, "Member 'BP_ui_SceneMap_C_Camera_Init::CallFunc_GetRenderTarget_RenderTarget' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_Init, CallFunc_GetCollisitonData_ReturnValue) == 0x000020, "Member 'BP_ui_SceneMap_C_Camera_Init::CallFunc_GetCollisitonData_ReturnValue' has a wrong offset!");

// Function BP_ui_SceneMap.BP_ui_SceneMap_C.Camera_InitPerspective
// 0x00E0 (0x00E0 - 0x0000)
struct BP_ui_SceneMap_C_Camera_InitPerspective final
{
public:
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CreateVectorFromYawPitch_ReturnValue;     // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B98[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0050(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ui_SceneMap_C_Camera_InitPerspective) == 0x000010, "Wrong alignment on BP_ui_SceneMap_C_Camera_InitPerspective");
static_assert(sizeof(BP_ui_SceneMap_C_Camera_InitPerspective) == 0x0000E0, "Wrong size on BP_ui_SceneMap_C_Camera_InitPerspective");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_InitPerspective, CallFunc_MakeRotator_ReturnValue) == 0x000000, "Member 'BP_ui_SceneMap_C_Camera_InitPerspective::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_InitPerspective, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_ui_SceneMap_C_Camera_InitPerspective::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_InitPerspective, CallFunc_CreateVectorFromYawPitch_ReturnValue) == 0x000010, "Member 'BP_ui_SceneMap_C_Camera_InitPerspective::CallFunc_CreateVectorFromYawPitch_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_InitPerspective, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'BP_ui_SceneMap_C_Camera_InitPerspective::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_InitPerspective, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000050, "Member 'BP_ui_SceneMap_C_Camera_InitPerspective::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");

// Function BP_ui_SceneMap.BP_ui_SceneMap_C.Camera_InitOrthographic
// 0x00C0 (0x00C0 - 0x0000)
struct BP_ui_SceneMap_C_Camera_InitOrthographic final
{
public:
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0030(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ui_SceneMap_C_Camera_InitOrthographic) == 0x000010, "Wrong alignment on BP_ui_SceneMap_C_Camera_InitOrthographic");
static_assert(sizeof(BP_ui_SceneMap_C_Camera_InitOrthographic) == 0x0000C0, "Wrong size on BP_ui_SceneMap_C_Camera_InitOrthographic");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_InitOrthographic, CallFunc_MakeTransform_ReturnValue) == 0x000000, "Member 'BP_ui_SceneMap_C_Camera_InitOrthographic::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_InitOrthographic, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000030, "Member 'BP_ui_SceneMap_C_Camera_InitOrthographic::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");

// Function BP_ui_SceneMap.BP_ui_SceneMap_C.Camera_UpdateMinimapPerspective
// 0x000C (0x000C - 0x0000)
struct BP_ui_SceneMap_C_Camera_UpdateMinimapPerspective final
{
public:
	struct FVector                                LocationVector;                                    // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_SceneMap_C_Camera_UpdateMinimapPerspective) == 0x000004, "Wrong alignment on BP_ui_SceneMap_C_Camera_UpdateMinimapPerspective");
static_assert(sizeof(BP_ui_SceneMap_C_Camera_UpdateMinimapPerspective) == 0x00000C, "Wrong size on BP_ui_SceneMap_C_Camera_UpdateMinimapPerspective");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_UpdateMinimapPerspective, LocationVector) == 0x000000, "Member 'BP_ui_SceneMap_C_Camera_UpdateMinimapPerspective::LocationVector' has a wrong offset!");

// Function BP_ui_SceneMap.BP_ui_SceneMap_C.Camera_UpdateMinimapOrthographic
// 0x00C0 (0x00C0 - 0x0000)
struct BP_ui_SceneMap_C_Camera_UpdateMinimapOrthographic final
{
public:
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B99[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0038(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ui_SceneMap_C_Camera_UpdateMinimapOrthographic) == 0x000008, "Wrong alignment on BP_ui_SceneMap_C_Camera_UpdateMinimapOrthographic");
static_assert(sizeof(BP_ui_SceneMap_C_Camera_UpdateMinimapOrthographic) == 0x0000C0, "Wrong size on BP_ui_SceneMap_C_Camera_UpdateMinimapOrthographic");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_UpdateMinimapOrthographic, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000000, "Member 'BP_ui_SceneMap_C_Camera_UpdateMinimapOrthographic::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_UpdateMinimapOrthographic, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'BP_ui_SceneMap_C_Camera_UpdateMinimapOrthographic::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_UpdateMinimapOrthographic, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_ui_SceneMap_C_Camera_UpdateMinimapOrthographic::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_UpdateMinimapOrthographic, CallFunc_BreakVector_X) == 0x00001C, "Member 'BP_ui_SceneMap_C_Camera_UpdateMinimapOrthographic::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_UpdateMinimapOrthographic, CallFunc_BreakVector_Y) == 0x000020, "Member 'BP_ui_SceneMap_C_Camera_UpdateMinimapOrthographic::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_UpdateMinimapOrthographic, CallFunc_BreakVector_Z) == 0x000024, "Member 'BP_ui_SceneMap_C_Camera_UpdateMinimapOrthographic::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_UpdateMinimapOrthographic, CallFunc_Add_FloatFloat_ReturnValue) == 0x000028, "Member 'BP_ui_SceneMap_C_Camera_UpdateMinimapOrthographic::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_UpdateMinimapOrthographic, CallFunc_MakeVector_ReturnValue) == 0x00002C, "Member 'BP_ui_SceneMap_C_Camera_UpdateMinimapOrthographic::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_UpdateMinimapOrthographic, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000038, "Member 'BP_ui_SceneMap_C_Camera_UpdateMinimapOrthographic::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function BP_ui_SceneMap.BP_ui_SceneMap_C.Player_Init
// 0x0080 (0x0080 - 0x0000)
struct BP_ui_SceneMap_C_Player_Init final
{
public:
	float                                         MinData;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isAdjusterFlag_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B9A[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B9B[0x8];                                     // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRateData_ReturnValue;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFloorIndex_floorindex;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFloorIndexCore2_ReturnValue;           // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_SceneMap_C_Player_Init) == 0x000010, "Wrong alignment on BP_ui_SceneMap_C_Player_Init");
static_assert(sizeof(BP_ui_SceneMap_C_Player_Init) == 0x000080, "Wrong size on BP_ui_SceneMap_C_Player_Init");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Init, MinData) == 0x000000, "Member 'BP_ui_SceneMap_C_Player_Init::MinData' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Init, CallFunc_isAdjusterFlag_ReturnValue) == 0x000004, "Member 'BP_ui_SceneMap_C_Player_Init::CallFunc_isAdjusterFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Init, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_ui_SceneMap_C_Player_Init::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Init, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'BP_ui_SceneMap_C_Player_Init::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Init, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'BP_ui_SceneMap_C_Player_Init::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Init, CallFunc_BreakTransform_Location) == 0x000050, "Member 'BP_ui_SceneMap_C_Player_Init::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Init, CallFunc_BreakTransform_Rotation) == 0x00005C, "Member 'BP_ui_SceneMap_C_Player_Init::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Init, CallFunc_BreakTransform_Scale) == 0x000068, "Member 'BP_ui_SceneMap_C_Player_Init::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Init, CallFunc_GetRateData_ReturnValue) == 0x000074, "Member 'BP_ui_SceneMap_C_Player_Init::CallFunc_GetRateData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Init, CallFunc_GetFloorIndex_floorindex) == 0x000078, "Member 'BP_ui_SceneMap_C_Player_Init::CallFunc_GetFloorIndex_floorindex' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Init, CallFunc_GetFloorIndexCore2_ReturnValue) == 0x00007C, "Member 'BP_ui_SceneMap_C_Player_Init::CallFunc_GetFloorIndexCore2_ReturnValue' has a wrong offset!");

// Function BP_ui_SceneMap.BP_ui_SceneMap_C.Player Detaile
// 0x01E0 (0x01E0 - 0x0000)
struct BP_ui_SceneMap_C_Player_Detaile final
{
public:
	struct FVector                                PlayerDirectionScale;                              // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                _PlayerLocation;                                   // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               _PlayerRotation;                                   // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         _Yaw;                                              // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isAdjusterFlag_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B9C[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B9D[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B9E[0x8];                                     // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0060(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetMapIconScaleRate_ReturnValue;          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B9F[0x2];                                     // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BA0[0x8];                                     // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0110(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetFloorIndex_floorindex;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0144(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BA1[0x3];                                     // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_SceneMap_C_Player_Detaile) == 0x000010, "Wrong alignment on BP_ui_SceneMap_C_Player_Detaile");
static_assert(sizeof(BP_ui_SceneMap_C_Player_Detaile) == 0x0001E0, "Wrong size on BP_ui_SceneMap_C_Player_Detaile");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, PlayerDirectionScale) == 0x000000, "Member 'BP_ui_SceneMap_C_Player_Detaile::PlayerDirectionScale' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, _PlayerLocation) == 0x00000C, "Member 'BP_ui_SceneMap_C_Player_Detaile::_PlayerLocation' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, _PlayerRotation) == 0x000018, "Member 'BP_ui_SceneMap_C_Player_Detaile::_PlayerRotation' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, _Yaw) == 0x000024, "Member 'BP_ui_SceneMap_C_Player_Detaile::_Yaw' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_isAdjusterFlag_ReturnValue) == 0x000028, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_isAdjusterFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_K2_GetPawn_ReturnValue) == 0x000038, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_GetPlayerController_ReturnValue_1) == 0x000040, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000050, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_GetTransform_ReturnValue) == 0x000060, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_BreakTransform_Location) == 0x000090, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_BreakTransform_Rotation) == 0x00009C, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_BreakTransform_Scale) == 0x0000A8, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_BreakRotator_Roll) == 0x0000B4, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_BreakRotator_Pitch) == 0x0000B8, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_BreakRotator_Yaw) == 0x0000BC, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000C0, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_MakeRotator_ReturnValue) == 0x0000C4, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_GetMapIconScaleRate_ReturnValue) == 0x0000D0, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_GetMapIconScaleRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000D4, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000E1, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_MakeVector_ReturnValue) == 0x0000E4, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x0000F0, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_Add_VectorVector_ReturnValue) == 0x0000FC, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_MakeTransform_ReturnValue) == 0x000110, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_GetFloorIndex_floorindex) == 0x000140, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_GetFloorIndex_floorindex' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000144, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0001CC, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Player_Detaile, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0001D0, "Member 'BP_ui_SceneMap_C_Player_Detaile::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");

// Function BP_ui_SceneMap.BP_ui_SceneMap_C.Camera_SetHeight
// 0x0004 (0x0004 - 0x0000)
struct BP_ui_SceneMap_C_Camera_SetHeight final
{
public:
	float                                         Height;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_SceneMap_C_Camera_SetHeight) == 0x000004, "Wrong alignment on BP_ui_SceneMap_C_Camera_SetHeight");
static_assert(sizeof(BP_ui_SceneMap_C_Camera_SetHeight) == 0x000004, "Wrong size on BP_ui_SceneMap_C_Camera_SetHeight");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_SetHeight, Height) == 0x000000, "Member 'BP_ui_SceneMap_C_Camera_SetHeight::Height' has a wrong offset!");

// Function BP_ui_SceneMap.BP_ui_SceneMap_C.Camera_SetScale
// 0x0004 (0x0004 - 0x0000)
struct BP_ui_SceneMap_C_Camera_SetScale final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_SceneMap_C_Camera_SetScale) == 0x000004, "Wrong alignment on BP_ui_SceneMap_C_Camera_SetScale");
static_assert(sizeof(BP_ui_SceneMap_C_Camera_SetScale) == 0x000004, "Wrong size on BP_ui_SceneMap_C_Camera_SetScale");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_SetScale, Scale) == 0x000000, "Member 'BP_ui_SceneMap_C_Camera_SetScale::Scale' has a wrong offset!");

// Function BP_ui_SceneMap.BP_ui_SceneMap_C.Camera_SetPerspective
// 0x0003 (0x0003 - 0x0000)
struct BP_ui_SceneMap_C_Camera_SetPerspective final
{
public:
	bool                                          Isperspective;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Force;                                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ui_SceneMap_C_Camera_SetPerspective) == 0x000001, "Wrong alignment on BP_ui_SceneMap_C_Camera_SetPerspective");
static_assert(sizeof(BP_ui_SceneMap_C_Camera_SetPerspective) == 0x000003, "Wrong size on BP_ui_SceneMap_C_Camera_SetPerspective");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_SetPerspective, Isperspective) == 0x000000, "Member 'BP_ui_SceneMap_C_Camera_SetPerspective::Isperspective' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_SetPerspective, Force) == 0x000001, "Member 'BP_ui_SceneMap_C_Camera_SetPerspective::Force' has a wrong offset!");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_SetPerspective, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000002, "Member 'BP_ui_SceneMap_C_Camera_SetPerspective::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function BP_ui_SceneMap.BP_ui_SceneMap_C.Camera_SetRotate
// 0x0001 (0x0001 - 0x0000)
struct BP_ui_SceneMap_C_Camera_SetRotate final
{
public:
	bool                                          IsRotate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ui_SceneMap_C_Camera_SetRotate) == 0x000001, "Wrong alignment on BP_ui_SceneMap_C_Camera_SetRotate");
static_assert(sizeof(BP_ui_SceneMap_C_Camera_SetRotate) == 0x000001, "Wrong size on BP_ui_SceneMap_C_Camera_SetRotate");
static_assert(offsetof(BP_ui_SceneMap_C_Camera_SetRotate, IsRotate) == 0x000000, "Member 'BP_ui_SceneMap_C_Camera_SetRotate::IsRotate' has a wrong offset!");

// Function BP_ui_SceneMap.BP_ui_SceneMap_C.PickUpPoint_Init
// 0x0230 (0x0230 - 0x0000)
struct BP_ui_SceneMap_C_PickUpPoint_Init final
{
public:
	float                                         _offsetIconZ;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _Area;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _Location;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BA2[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue_1;       // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue_2;       // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue_3;       // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_2;    // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_3;    // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AArrangeItemManager*                    CallFunc_GetArrangeItemManager_ArrangeItemManager; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFloorIndex_floorindex;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CalcMapIconLocation_ReturnValue;          // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BA3[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFloorIndex_floorindex_1;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BA4[0xC];                                     // 0x00C4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BA5[0x3];                                     // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddInstanceWorldSpace_ReturnValue;        // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFloorIndex_floorindex_2;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFloorIndex_floorindex_3;               // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BA6[0x2];                                     // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_CalcMapIconLocation_ReturnValue_1;        // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BA7[0x8];                                     // 0x0138(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0140(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstanceWorldSpace_ReturnValue_1;      // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0190(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_3;              // 0x01C0(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_AddInstanceWorldSpace_ReturnValue_2;      // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstanceWorldSpace_ReturnValue_3;      // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetArrangeItemParam_intervaltime;         // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetArrangeItemParam_acquired;             // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetArrangeItemParam_accessed;             // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetArrangeItemParam_ReturnValue;          // 0x01FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BA8[0x1];                                     // 0x01FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Mid_ReturnValue;                          // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
