#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UniqueObjectComponentBase

#include "Basic.hpp"

#include "UniqueObjectAttackInfo_structs.hpp"
#include "PsychicObjectSizeParameter_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "Engine_structs.hpp"
#include "UniqueObjectCommonParameter_structs.hpp"
#include "Enum_ui_action_icon_device_type_structs.hpp"
#include "PsychicObjectAttackParameterData_structs.hpp"


namespace SDK::Params
{

// Function BP_UniqueObjectComponentBase.BP_UniqueObjectComponentBase_C.InitializeUniqueObject
// 0x0018 (0x0018 - 0x0000)
struct BP_UniqueObjectComponentBase_C_InitializeUniqueObject final
{
public:
	class UBP_PsychicObjectComponent_C*           Psy_obj_comp_in;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_PsychicComponentMain_C*             Psy_comp_main_in;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InitialParameter_dummy;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InitialComponent_dummy;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UniqueObjectComponentBase_C_InitializeUniqueObject) == 0x000008, "Wrong alignment on BP_UniqueObjectComponentBase_C_InitializeUniqueObject");
static_assert(sizeof(BP_UniqueObjectComponentBase_C_InitializeUniqueObject) == 0x000018, "Wrong size on BP_UniqueObjectComponentBase_C_InitializeUniqueObject");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitializeUniqueObject, Psy_obj_comp_in) == 0x000000, "Member 'BP_UniqueObjectComponentBase_C_InitializeUniqueObject::Psy_obj_comp_in' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitializeUniqueObject, Psy_comp_main_in) == 0x000008, "Member 'BP_UniqueObjectComponentBase_C_InitializeUniqueObject::Psy_comp_main_in' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitializeUniqueObject, CallFunc_InitialParameter_dummy) == 0x000010, "Member 'BP_UniqueObjectComponentBase_C_InitializeUniqueObject::CallFunc_InitialParameter_dummy' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitializeUniqueObject, CallFunc_InitialComponent_dummy) == 0x000011, "Member 'BP_UniqueObjectComponentBase_C_InitializeUniqueObject::CallFunc_InitialComponent_dummy' has a wrong offset!");

// Function BP_UniqueObjectComponentBase.BP_UniqueObjectComponentBase_C.FinalizeUniqueObject
// 0x0001 (0x0001 - 0x0000)
struct BP_UniqueObjectComponentBase_C_FinalizeUniqueObject final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UniqueObjectComponentBase_C_FinalizeUniqueObject) == 0x000001, "Wrong alignment on BP_UniqueObjectComponentBase_C_FinalizeUniqueObject");
static_assert(sizeof(BP_UniqueObjectComponentBase_C_FinalizeUniqueObject) == 0x000001, "Wrong size on BP_UniqueObjectComponentBase_C_FinalizeUniqueObject");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_FinalizeUniqueObject, Dummy) == 0x000000, "Member 'BP_UniqueObjectComponentBase_C_FinalizeUniqueObject::Dummy' has a wrong offset!");

// Function BP_UniqueObjectComponentBase.BP_UniqueObjectComponentBase_C.InitialComponent
// 0x0038 (0x0038 - 0x0000)
struct BP_UniqueObjectComponentBase_C_InitialComponent final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DED[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DEE[0x1];                                     // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DEF[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPsychicObjectInterface> K2Node_DynamicCast_AsPsychic_Object_Interface;     // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetUniqueObjectC_ReturnValue;             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UniqueObjectComponentBase_C_InitialComponent) == 0x000008, "Wrong alignment on BP_UniqueObjectComponentBase_C_InitialComponent");
static_assert(sizeof(BP_UniqueObjectComponentBase_C_InitialComponent) == 0x000038, "Wrong size on BP_UniqueObjectComponentBase_C_InitialComponent");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitialComponent, Dummy) == 0x000000, "Member 'BP_UniqueObjectComponentBase_C_InitialComponent::Dummy' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitialComponent, Temp_float_Variable) == 0x000004, "Member 'BP_UniqueObjectComponentBase_C_InitialComponent::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitialComponent, Temp_float_Variable_1) == 0x000008, "Member 'BP_UniqueObjectComponentBase_C_InitialComponent::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitialComponent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000C, "Member 'BP_UniqueObjectComponentBase_C_InitialComponent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitialComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00000D, "Member 'BP_UniqueObjectComponentBase_C_InitialComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitialComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00000E, "Member 'BP_UniqueObjectComponentBase_C_InitialComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitialComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00000F, "Member 'BP_UniqueObjectComponentBase_C_InitialComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitialComponent, CallFunc_BooleanOR_ReturnValue) == 0x000010, "Member 'BP_UniqueObjectComponentBase_C_InitialComponent::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitialComponent, CallFunc_BooleanOR_ReturnValue_1) == 0x000011, "Member 'BP_UniqueObjectComponentBase_C_InitialComponent::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitialComponent, CallFunc_BooleanOR_ReturnValue_2) == 0x000012, "Member 'BP_UniqueObjectComponentBase_C_InitialComponent::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitialComponent, CallFunc_Array_Add_ReturnValue) == 0x000014, "Member 'BP_UniqueObjectComponentBase_C_InitialComponent::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitialComponent, CallFunc_Array_Add_ReturnValue_1) == 0x000018, "Member 'BP_UniqueObjectComponentBase_C_InitialComponent::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitialComponent, K2Node_DynamicCast_AsPsychic_Object_Interface) == 0x000020, "Member 'BP_UniqueObjectComponentBase_C_InitialComponent::K2Node_DynamicCast_AsPsychic_Object_Interface' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitialComponent, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_UniqueObjectComponentBase_C_InitialComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitialComponent, CallFunc_SetUniqueObjectC_ReturnValue) == 0x000031, "Member 'BP_UniqueObjectComponentBase_C_InitialComponent::CallFunc_SetUniqueObjectC_ReturnValue' has a wrong offset!");

// Function BP_UniqueObjectComponentBase.BP_UniqueObjectComponentBase_C.InitialParameter
// 0x0038 (0x0038 - 0x0000)
struct BP_UniqueObjectComponentBase_C_InitialParameter final
{
public:
	bool                                          Flag_in;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          First_time_in;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Dummy;                                             // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DF0[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UniqueObjectComponentBase_C_InitialParameter) == 0x000008, "Wrong alignment on BP_UniqueObjectComponentBase_C_InitialParameter");
static_assert(sizeof(BP_UniqueObjectComponentBase_C_InitialParameter) == 0x000038, "Wrong size on BP_UniqueObjectComponentBase_C_InitialParameter");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitialParameter, Flag_in) == 0x000000, "Member 'BP_UniqueObjectComponentBase_C_InitialParameter::Flag_in' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitialParameter, First_time_in) == 0x000001, "Member 'BP_UniqueObjectComponentBase_C_InitialParameter::First_time_in' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitialParameter, Dummy) == 0x000002, "Member 'BP_UniqueObjectComponentBase_C_InitialParameter::Dummy' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitialParameter, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'BP_UniqueObjectComponentBase_C_InitialParameter::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitialParameter, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'BP_UniqueObjectComponentBase_C_InitialParameter::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_InitialParameter, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000028, "Member 'BP_UniqueObjectComponentBase_C_InitialParameter::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");

// Function BP_UniqueObjectComponentBase.BP_UniqueObjectComponentBase_C.SetAsyncCapture
// 0x0005 (0x0005 - 0x0000)
struct BP_UniqueObjectComponentBase_C_SetAsyncCapture final
{
public:
	bool                                          Flag_in;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Capture_success_in;                                // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Dummy;                                             // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UniqueObjectComponentBase_C_SetAsyncCapture) == 0x000001, "Wrong alignment on BP_UniqueObjectComponentBase_C_SetAsyncCapture");
static_assert(sizeof(BP_UniqueObjectComponentBase_C_SetAsyncCapture) == 0x000005, "Wrong size on BP_UniqueObjectComponentBase_C_SetAsyncCapture");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetAsyncCapture, Flag_in) == 0x000000, "Member 'BP_UniqueObjectComponentBase_C_SetAsyncCapture::Flag_in' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetAsyncCapture, Capture_success_in) == 0x000001, "Member 'BP_UniqueObjectComponentBase_C_SetAsyncCapture::Capture_success_in' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetAsyncCapture, Dummy) == 0x000002, "Member 'BP_UniqueObjectComponentBase_C_SetAsyncCapture::Dummy' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetAsyncCapture, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'BP_UniqueObjectComponentBase_C_SetAsyncCapture::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetAsyncCapture, CallFunc_BooleanOR_ReturnValue_1) == 0x000004, "Member 'BP_UniqueObjectComponentBase_C_SetAsyncCapture::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function BP_UniqueObjectComponentBase.BP_UniqueObjectComponentBase_C.PrevAsyncCapture
// 0x0001 (0x0001 - 0x0000)
struct BP_UniqueObjectComponentBase_C_PrevAsyncCapture final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UniqueObjectComponentBase_C_PrevAsyncCapture) == 0x000001, "Wrong alignment on BP_UniqueObjectComponentBase_C_PrevAsyncCapture");
static_assert(sizeof(BP_UniqueObjectComponentBase_C_PrevAsyncCapture) == 0x000001, "Wrong size on BP_UniqueObjectComponentBase_C_PrevAsyncCapture");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_PrevAsyncCapture, Dummy) == 0x000000, "Member 'BP_UniqueObjectComponentBase_C_PrevAsyncCapture::Dummy' has a wrong offset!");

// Function BP_UniqueObjectComponentBase.BP_UniqueObjectComponentBase_C.UpdateAsyncCapture
// 0x00A0 (0x00A0 - 0x0000)
struct BP_UniqueObjectComponentBase_C_UpdateAsyncCapture final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DF1[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         L_rate;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVectorValue_ReturnValue;               // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVectorValue_ReturnValue_1;             // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DF2[0x2];                                     // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVectorValue_ReturnValue_2;             // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRate_ReturnValue;                      // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture) == 0x000004, "Wrong alignment on BP_UniqueObjectComponentBase_C_UpdateAsyncCapture");
static_assert(sizeof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture) == 0x0000A0, "Wrong size on BP_UniqueObjectComponentBase_C_UpdateAsyncCapture");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture, Dummy) == 0x000000, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCapture::Dummy' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture, L_rate) == 0x000004, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCapture::L_rate' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture, CallFunc_ComposeRotators_ReturnValue) == 0x000008, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCapture::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture, CallFunc_Add_VectorVector_ReturnValue) == 0x000014, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCapture::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000020, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCapture::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture, CallFunc_BreakVector_X) == 0x00002C, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCapture::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture, CallFunc_BreakVector_Y) == 0x000030, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCapture::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture, CallFunc_BreakVector_Z) == 0x000034, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCapture::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture, CallFunc_GetVectorValue_ReturnValue) == 0x000038, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCapture::CallFunc_GetVectorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture, CallFunc_BreakVector_X_1) == 0x000044, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCapture::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture, CallFunc_BreakVector_Y_1) == 0x000048, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCapture::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture, CallFunc_BreakVector_Z_1) == 0x00004C, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCapture::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000050, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCapture::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000054, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCapture::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000058, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCapture::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture, CallFunc_MakeRotator_ReturnValue) == 0x00005C, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCapture::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture, CallFunc_GetVectorValue_ReturnValue_1) == 0x000068, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCapture::CallFunc_GetVectorValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000074, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCapture::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture, CallFunc_BooleanOR_ReturnValue) == 0x000080, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCapture::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture, CallFunc_BooleanOR_ReturnValue_1) == 0x000081, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCapture::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture, CallFunc_GetVectorValue_ReturnValue_2) == 0x000084, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCapture::CallFunc_GetVectorValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000090, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCapture::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCapture, CallFunc_GetRate_ReturnValue) == 0x00009C, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCapture::CallFunc_GetRate_ReturnValue' has a wrong offset!");

// Function BP_UniqueObjectComponentBase.BP_UniqueObjectComponentBase_C.PostAsyncCapture
// 0x0001 (0x0001 - 0x0000)
struct BP_UniqueObjectComponentBase_C_PostAsyncCapture final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UniqueObjectComponentBase_C_PostAsyncCapture) == 0x000001, "Wrong alignment on BP_UniqueObjectComponentBase_C_PostAsyncCapture");
static_assert(sizeof(BP_UniqueObjectComponentBase_C_PostAsyncCapture) == 0x000001, "Wrong size on BP_UniqueObjectComponentBase_C_PostAsyncCapture");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_PostAsyncCapture, Dummy) == 0x000000, "Member 'BP_UniqueObjectComponentBase_C_PostAsyncCapture::Dummy' has a wrong offset!");

// Function BP_UniqueObjectComponentBase.BP_UniqueObjectComponentBase_C.SetCaptureLevel
// 0x0002 (0x0002 - 0x0000)
struct BP_UniqueObjectComponentBase_C_SetCaptureLevel final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetUniqueBend_dummy;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UniqueObjectComponentBase_C_SetCaptureLevel) == 0x000001, "Wrong alignment on BP_UniqueObjectComponentBase_C_SetCaptureLevel");
static_assert(sizeof(BP_UniqueObjectComponentBase_C_SetCaptureLevel) == 0x000002, "Wrong size on BP_UniqueObjectComponentBase_C_SetCaptureLevel");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetCaptureLevel, Dummy) == 0x000000, "Member 'BP_UniqueObjectComponentBase_C_SetCaptureLevel::Dummy' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetCaptureLevel, CallFunc_SetUniqueBend_dummy) == 0x000001, "Member 'BP_UniqueObjectComponentBase_C_SetCaptureLevel::CallFunc_SetUniqueBend_dummy' has a wrong offset!");

// Function BP_UniqueObjectComponentBase.BP_UniqueObjectComponentBase_C.PrevAsyncCommon
// 0x0001 (0x0001 - 0x0000)
struct BP_UniqueObjectComponentBase_C_PrevAsyncCommon final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UniqueObjectComponentBase_C_PrevAsyncCommon) == 0x000001, "Wrong alignment on BP_UniqueObjectComponentBase_C_PrevAsyncCommon");
static_assert(sizeof(BP_UniqueObjectComponentBase_C_PrevAsyncCommon) == 0x000001, "Wrong size on BP_UniqueObjectComponentBase_C_PrevAsyncCommon");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_PrevAsyncCommon, Dummy) == 0x000000, "Member 'BP_UniqueObjectComponentBase_C_PrevAsyncCommon::Dummy' has a wrong offset!");

// Function BP_UniqueObjectComponentBase.BP_UniqueObjectComponentBase_C.UpdateAsyncCommon
// 0x0006 (0x0006 - 0x0000)
struct BP_UniqueObjectComponentBase_C_UpdateAsyncCommon final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateUniqueRide_dummy;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateUniqueRidePrev_dummy;               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateGroundSlope_dummy;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateUniqueExplosion_dummy;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateUniquePress_dummy;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UniqueObjectComponentBase_C_UpdateAsyncCommon) == 0x000001, "Wrong alignment on BP_UniqueObjectComponentBase_C_UpdateAsyncCommon");
static_assert(sizeof(BP_UniqueObjectComponentBase_C_UpdateAsyncCommon) == 0x000006, "Wrong size on BP_UniqueObjectComponentBase_C_UpdateAsyncCommon");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCommon, Dummy) == 0x000000, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCommon::Dummy' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCommon, CallFunc_UpdateUniqueRide_dummy) == 0x000001, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCommon::CallFunc_UpdateUniqueRide_dummy' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCommon, CallFunc_UpdateUniqueRidePrev_dummy) == 0x000002, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCommon::CallFunc_UpdateUniqueRidePrev_dummy' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCommon, CallFunc_UpdateGroundSlope_dummy) == 0x000003, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCommon::CallFunc_UpdateGroundSlope_dummy' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCommon, CallFunc_UpdateUniqueExplosion_dummy) == 0x000004, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCommon::CallFunc_UpdateUniqueExplosion_dummy' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncCommon, CallFunc_UpdateUniquePress_dummy) == 0x000005, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncCommon::CallFunc_UpdateUniquePress_dummy' has a wrong offset!");

// Function BP_UniqueObjectComponentBase.BP_UniqueObjectComponentBase_C.PostAsyncCommon
// 0x0006 (0x0006 - 0x0000)
struct BP_UniqueObjectComponentBase_C_PostAsyncCommon final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateUniqueRide_dummy;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateUniqueRidePrev_dummy;               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateGroundSlope_dummy;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateUniqueExplosion_dummy;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateUniquePress_dummy;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UniqueObjectComponentBase_C_PostAsyncCommon) == 0x000001, "Wrong alignment on BP_UniqueObjectComponentBase_C_PostAsyncCommon");
static_assert(sizeof(BP_UniqueObjectComponentBase_C_PostAsyncCommon) == 0x000006, "Wrong size on BP_UniqueObjectComponentBase_C_PostAsyncCommon");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_PostAsyncCommon, Dummy) == 0x000000, "Member 'BP_UniqueObjectComponentBase_C_PostAsyncCommon::Dummy' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_PostAsyncCommon, CallFunc_UpdateUniqueRide_dummy) == 0x000001, "Member 'BP_UniqueObjectComponentBase_C_PostAsyncCommon::CallFunc_UpdateUniqueRide_dummy' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_PostAsyncCommon, CallFunc_UpdateUniqueRidePrev_dummy) == 0x000002, "Member 'BP_UniqueObjectComponentBase_C_PostAsyncCommon::CallFunc_UpdateUniqueRidePrev_dummy' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_PostAsyncCommon, CallFunc_UpdateGroundSlope_dummy) == 0x000003, "Member 'BP_UniqueObjectComponentBase_C_PostAsyncCommon::CallFunc_UpdateGroundSlope_dummy' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_PostAsyncCommon, CallFunc_UpdateUniqueExplosion_dummy) == 0x000004, "Member 'BP_UniqueObjectComponentBase_C_PostAsyncCommon::CallFunc_UpdateUniqueExplosion_dummy' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_PostAsyncCommon, CallFunc_UpdateUniquePress_dummy) == 0x000005, "Member 'BP_UniqueObjectComponentBase_C_PostAsyncCommon::CallFunc_UpdateUniquePress_dummy' has a wrong offset!");

// Function BP_UniqueObjectComponentBase.BP_UniqueObjectComponentBase_C.SetHitUnqObj
// 0x02A0 (0x02A0 - 0x0000)
struct BP_UniqueObjectComponentBase_C_SetHitUnqObj final
{
public:
	bool                                          Hit_enemy_in;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Hit_background_in;                                 // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DF3[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHCHitResult                           Hit_result_in;                                     // 0x0008(0x01C0)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FHitResult                             Hit_result_bg_in;                                  // 0x01C8(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Dummy;                                             // 0x0250(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DF4[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDamageCollisionInvincible_bInvincible;  // 0x0273(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DF5[0x3];                                     // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamagePartCollisionComponent*          K2Node_DynamicCast_AsDamage_Part_Collision_Component; // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x028A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DF6[0x5];                                     // 0x028B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattleEnemy_C*                       K2Node_DynamicCast_AsRSBattle_Enemy;               // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInvincible_invincibleAll;               // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInvincible_invincibleParts;             // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInvincible_ReturnValue;                 // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetUniquePressHit_dummy;                  // 0x029D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UniqueObjectComponentBase_C_SetHitUnqObj) == 0x000008, "Wrong alignment on BP_UniqueObjectComponentBase_C_SetHitUnqObj");
static_assert(sizeof(BP_UniqueObjectComponentBase_C_SetHitUnqObj) == 0x0002A0, "Wrong size on BP_UniqueObjectComponentBase_C_SetHitUnqObj");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, Hit_enemy_in) == 0x000000, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::Hit_enemy_in' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, Hit_background_in) == 0x000001, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::Hit_background_in' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, Hit_result_in) == 0x000008, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::Hit_result_in' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, Hit_result_bg_in) == 0x0001C8, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::Hit_result_bg_in' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, Dummy) == 0x000250, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::Dummy' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, CallFunc_GetOwner_ReturnValue) == 0x000258, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, CallFunc_GetOwner_ReturnValue_1) == 0x000260, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, K2Node_DynamicCast_AsRSBattle_Player) == 0x000268, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, K2Node_DynamicCast_bSuccess) == 0x000270, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, CallFunc_IsValid_ReturnValue) == 0x000271, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, CallFunc_IsValid_ReturnValue_1) == 0x000272, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, CallFunc_IsDamageCollisionInvincible_bInvincible) == 0x000273, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::CallFunc_IsDamageCollisionInvincible_bInvincible' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000274, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, CallFunc_GetOwner_ReturnValue_2) == 0x000278, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, K2Node_DynamicCast_AsDamage_Part_Collision_Component) == 0x000280, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::K2Node_DynamicCast_AsDamage_Part_Collision_Component' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, K2Node_DynamicCast_bSuccess_1) == 0x000288, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, CallFunc_IsValid_ReturnValue_2) == 0x000289, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00028A, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, K2Node_DynamicCast_AsRSBattle_Enemy) == 0x000290, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::K2Node_DynamicCast_AsRSBattle_Enemy' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, K2Node_DynamicCast_bSuccess_2) == 0x000298, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, CallFunc_IsValid_ReturnValue_3) == 0x000299, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, CallFunc_IsInvincible_invincibleAll) == 0x00029A, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::CallFunc_IsInvincible_invincibleAll' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, CallFunc_IsInvincible_invincibleParts) == 0x00029B, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::CallFunc_IsInvincible_invincibleParts' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, CallFunc_IsInvincible_ReturnValue) == 0x00029C, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::CallFunc_IsInvincible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetHitUnqObj, CallFunc_SetUniquePressHit_dummy) == 0x00029D, "Member 'BP_UniqueObjectComponentBase_C_SetHitUnqObj::CallFunc_SetUniquePressHit_dummy' has a wrong offset!");

// Function BP_UniqueObjectComponentBase.BP_UniqueObjectComponentBase_C.SetAttackUnique
// 0x0002 (0x0002 - 0x0000)
struct BP_UniqueObjectComponentBase_C_SetAttackUnique final
{
public:
	bool                                          Flag_in;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Dummy;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UniqueObjectComponentBase_C_SetAttackUnique) == 0x000001, "Wrong alignment on BP_UniqueObjectComponentBase_C_SetAttackUnique");
static_assert(sizeof(BP_UniqueObjectComponentBase_C_SetAttackUnique) == 0x000002, "Wrong size on BP_UniqueObjectComponentBase_C_SetAttackUnique");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetAttackUnique, Flag_in) == 0x000000, "Member 'BP_UniqueObjectComponentBase_C_SetAttackUnique::Flag_in' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetAttackUnique, Dummy) == 0x000001, "Member 'BP_UniqueObjectComponentBase_C_SetAttackUnique::Dummy' has a wrong offset!");

// Function BP_UniqueObjectComponentBase.BP_UniqueObjectComponentBase_C.SetInputDelay
// 0x0002 (0x0002 - 0x0000)
struct BP_UniqueObjectComponentBase_C_SetInputDelay final
{
public:
	bool                                          Flag_in;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UniqueObjectComponentBase_C_SetInputDelay) == 0x000001, "Wrong alignment on BP_UniqueObjectComponentBase_C_SetInputDelay");
static_assert(sizeof(BP_UniqueObjectComponentBase_C_SetInputDelay) == 0x000002, "Wrong size on BP_UniqueObjectComponentBase_C_SetInputDelay");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetInputDelay, Flag_in) == 0x000000, "Member 'BP_UniqueObjectComponentBase_C_SetInputDelay::Flag_in' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetInputDelay, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'BP_UniqueObjectComponentBase_C_SetInputDelay::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function BP_UniqueObjectComponentBase.BP_UniqueObjectComponentBase_C.UpdateAsyncInputDelay
// 0x0010 (0x0010 - 0x0000)
struct BP_UniqueObjectComponentBase_C_UpdateAsyncInputDelay final
{
public:
	struct FVector                                CallFunc_GetGuidePos_guide_pos;                    // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetInputWait_dummy;                       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOver_ReturnValue;                       // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UniqueObjectComponentBase_C_UpdateAsyncInputDelay) == 0x000004, "Wrong alignment on BP_UniqueObjectComponentBase_C_UpdateAsyncInputDelay");
static_assert(sizeof(BP_UniqueObjectComponentBase_C_UpdateAsyncInputDelay) == 0x000010, "Wrong size on BP_UniqueObjectComponentBase_C_UpdateAsyncInputDelay");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncInputDelay, CallFunc_GetGuidePos_guide_pos) == 0x000000, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncInputDelay::CallFunc_GetGuidePos_guide_pos' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncInputDelay, CallFunc_SetInputWait_dummy) == 0x00000C, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncInputDelay::CallFunc_SetInputWait_dummy' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_UpdateAsyncInputDelay, CallFunc_IsOver_ReturnValue) == 0x00000D, "Member 'BP_UniqueObjectComponentBase_C_UpdateAsyncInputDelay::CallFunc_IsOver_ReturnValue' has a wrong offset!");

// Function BP_UniqueObjectComponentBase.BP_UniqueObjectComponentBase_C.SetInputWait
// 0x00C0 (0x00C0 - 0x0000)
struct BP_UniqueObjectComponentBase_C_SetInputWait final
{
public:
	bool                                          Flag_in;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Success_in;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Dummy;                                             // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	Enum_ui_action_icon_device_type               L_deviceType;                                      // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerInputType                              CallFunc_GetInputType_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DF7[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetInputWaitEnemy_dummy;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInputSetting_dummy;                    // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DF8[0x2];                                     // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APsychicObjectManager_C*                CallFunc_GetPsychicObjectManager_PsyObjManager;    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DF9[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APsychicObjectManager_C*                CallFunc_GetPsychicObjectManager_PsyObjManager_1;  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DFA[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APsychicObjectManager_C*                CallFunc_GetPsychicObjectManager_PsyObjManager_2;  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DFB[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHud_hud_main;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         CallFunc_GetHud_hud_main_1;                        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DFC[0x6];                                     // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PostProcessManager_C*               CallFunc_GetPostProcessManager_Manager;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PostProcessManager_C*               CallFunc_GetPostProcessManager_Manager_1;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UniqueObjectComponentBase_C_SetInputWait) == 0x000008, "Wrong alignment on BP_UniqueObjectComponentBase_C_SetInputWait");
static_assert(sizeof(BP_UniqueObjectComponentBase_C_SetInputWait) == 0x0000C0, "Wrong size on BP_UniqueObjectComponentBase_C_SetInputWait");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetInputWait, Flag_in) == 0x000000, "Member 'BP_UniqueObjectComponentBase_C_SetInputWait::Flag_in' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetInputWait, Success_in) == 0x000001, "Member 'BP_UniqueObjectComponentBase_C_SetInputWait::Success_in' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetInputWait, Dummy) == 0x000002, "Member 'BP_UniqueObjectComponentBase_C_SetInputWait::Dummy' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetInputWait, L_deviceType) == 0x000003, "Member 'BP_UniqueObjectComponentBase_C_SetInputWait::L_deviceType' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetInputWait, CallFunc_GetInputType_ReturnValue) == 0x000004, "Member 'BP_UniqueObjectComponentBase_C_SetInputWait::CallFunc_GetInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetInputWait, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'BP_UniqueObjectComponentBase_C_SetInputWait::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetInputWait, CallFunc_Conv_BoolToString_ReturnValue) == 0x000008, "Member 'BP_UniqueObjectComponentBase_C_SetInputWait::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueObjectComponentBase_C_SetInputWait, CallFunc_GetDisplayName_ReturnValue) == 0x000018, "Member 'BP_UniqueObjectComponentBase_C_SetInputWait::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
