#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UILoading3D

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ERenderTargetType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_UILoading3D.BP_UILoading3D_C
// 0x03E0 (0x0610 - 0x0230)
class ABP_UILoading3D_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Ground;                                            // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URSSceneCaptureComponent2D*             RSSceneCaptureComponent2D;                         // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftClassPtr<class UClass>>           CharacterClass;                                    // 0x0250(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class AActor*>                         CharacterList;                                     // 0x0260(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance, HasGetValueTypeHash)
	uint8                                         RenderLayer;                                       // 0x0270(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_933A[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMaterialInterface>      RenderMaterialAsset;                               // 0x0278(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      RenderLineMaterialAsset;                           // 0x02A0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      PPSilhouetteMaterialAsset;                         // 0x02C8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, HasGetValueTypeHash)
	class UMaterialInterface*                     RenderMaterial;                                    // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UDataTable>              SceneDataTableAsset;                               // 0x02F8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UDataTable>              GeneralDataTableAsset;                             // 0x0320(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, HasGetValueTypeHash)
	struct FVector                                CameraOffset;                                      // 0x0348(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_933B[0x4];                                     // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           Lines;                                             // 0x0358(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	class UMaterialInterface*                     RenderLineMaterial;                                // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             GeneralTable;                                      // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 LineDataIndex;                                     // 0x0378(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         NowSceneID;                                        // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_933C[0x4];                                     // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 DefaultCharacterLocationX;                         // 0x0390(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, HasGetValueTypeHash)
	struct FUILoading3DGeneral                    GeneralSetting;                                    // 0x03A0(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 CharacterMoveSpeedScale;                           // 0x03E0(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PPLoadingMaterialInstance;                         // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 CharacterDepthList;                                // 0x03F8(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, HasGetValueTypeHash)
	struct FUILoading3DSceneData                  SceneData;                                         // 0x0408(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FUILoading3DSceneCharacterData         CharacterData;                                     // 0x0428(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CharaIndex;                                        // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayerInfo                            _PlayerInfo;                                       // 0x0474(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	uint8                                         Pad_933D[0x4];                                     // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   SpawnClass;                                        // 0x0548(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 TargetMesh;                                        // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         TargetMesheComps;                                  // 0x0578(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterial;                                   // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TranslucenctSortPriority;                          // 0x0590(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_933E[0x4];                                     // 0x0594(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 MaterialTargetMesh;                                // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaterialLastIndex;                                 // 0x05A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_933F[0x4];                                     // 0x05A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AttachmentManageComponent_C*        _AttachmentManageComponent;                        // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            AnimationAsset;                                    // 0x05B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FUILoading3DScenePlayerData            SceneCahracterData;                                // 0x05D8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bFinishCreateScene;                                // 0x0608(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_UILoading3D(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void PrivateSetupSceneFromID(int32 LoadingID);
	void UserConstructionScript();
	void SetupSceneFromID(int32 LoadingID);
	void GetTexture(class UTexture** Texture);
	void SetupScene();
	void PrivateSetupRenderTarget(class UTextureRenderTarget2D* Target);
	void Initialize();
	void SetupCamera();
	void ReleaseScene();
	void SetupCameraFromParam(float InCameraSize, float InCameraOffsetZ);
	void GetCameraSetting(float* CaptureSize, float* CameraHeight);
	void DebugReloadCameraOffset(int32 LoadingID);
	void PrivateCreateLines(int32 Num);
	void ReloadGeneralTable();
	void DebugResetLineData();
	void PrivateSetupLine(class UStaticMeshComponent* Line, int32 Param_Index);
	void IsVisibleMaterial(class USkeletalMeshComponent* SkeletalMesh, int32 MaterialID, bool* IsVisible);
	void DebugResetSceneTransform();
	void PrivateGetTransformFromCharacterData(const struct FUILoading3DSceneCharacterData& Param_CharacterData, struct FTransform* Transform);
	void PrivateUpdate(float DeltaSeconds);
	void PrivateUpdateInput(float DeltaSeconds, float InputRate);
	void DebugUpdateInput(float InputRate);
	void OnAttachmentLoadCompleteInternal(int32 Param_CharaIndex);
	void OnAttachmentLoadComplete_0();
	void OnAttachmentLoadComplete_1();
	void OnAttachmentLoadComplete_2();
	void OnAttachmentLoadComplete_3();
	void OnAttachmentLoadComplete_4();
	void OnAttachmentLoadComplete_5();
	void OnAttachmentLoadComplete_6();
	void OnAttachmentLoadComplete_7();
	void OnAttachmentLoadComplete_8();
	void OnAttachmentLoadComplete_9();
	void PrivateResetRenderTarget(ERenderTargetType RenderTargetType, class UTextureRenderTarget2D* NewTarget);
	void IsFinishCreateScene(bool* FinishCreate);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UILoading3D_C">();
	}
	static class ABP_UILoading3D_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_UILoading3D_C>();
	}
};
static_assert(alignof(ABP_UILoading3D_C) == 0x000008, "Wrong alignment on ABP_UILoading3D_C");
static_assert(sizeof(ABP_UILoading3D_C) == 0x000610, "Wrong size on ABP_UILoading3D_C");
static_assert(offsetof(ABP_UILoading3D_C, UberGraphFrame) == 0x000230, "Member 'ABP_UILoading3D_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, Ground) == 0x000238, "Member 'ABP_UILoading3D_C::Ground' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, RSSceneCaptureComponent2D) == 0x000240, "Member 'ABP_UILoading3D_C::RSSceneCaptureComponent2D' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, DefaultSceneRoot) == 0x000248, "Member 'ABP_UILoading3D_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, CharacterClass) == 0x000250, "Member 'ABP_UILoading3D_C::CharacterClass' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, CharacterList) == 0x000260, "Member 'ABP_UILoading3D_C::CharacterList' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, RenderLayer) == 0x000270, "Member 'ABP_UILoading3D_C::RenderLayer' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, RenderMaterialAsset) == 0x000278, "Member 'ABP_UILoading3D_C::RenderMaterialAsset' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, RenderLineMaterialAsset) == 0x0002A0, "Member 'ABP_UILoading3D_C::RenderLineMaterialAsset' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, PPSilhouetteMaterialAsset) == 0x0002C8, "Member 'ABP_UILoading3D_C::PPSilhouetteMaterialAsset' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, RenderMaterial) == 0x0002F0, "Member 'ABP_UILoading3D_C::RenderMaterial' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, SceneDataTableAsset) == 0x0002F8, "Member 'ABP_UILoading3D_C::SceneDataTableAsset' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, GeneralDataTableAsset) == 0x000320, "Member 'ABP_UILoading3D_C::GeneralDataTableAsset' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, CameraOffset) == 0x000348, "Member 'ABP_UILoading3D_C::CameraOffset' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, Lines) == 0x000358, "Member 'ABP_UILoading3D_C::Lines' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, RenderLineMaterial) == 0x000368, "Member 'ABP_UILoading3D_C::RenderLineMaterial' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, GeneralTable) == 0x000370, "Member 'ABP_UILoading3D_C::GeneralTable' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, LineDataIndex) == 0x000378, "Member 'ABP_UILoading3D_C::LineDataIndex' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, NowSceneID) == 0x000388, "Member 'ABP_UILoading3D_C::NowSceneID' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, DefaultCharacterLocationX) == 0x000390, "Member 'ABP_UILoading3D_C::DefaultCharacterLocationX' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, GeneralSetting) == 0x0003A0, "Member 'ABP_UILoading3D_C::GeneralSetting' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, CharacterMoveSpeedScale) == 0x0003E0, "Member 'ABP_UILoading3D_C::CharacterMoveSpeedScale' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, PPLoadingMaterialInstance) == 0x0003F0, "Member 'ABP_UILoading3D_C::PPLoadingMaterialInstance' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, CharacterDepthList) == 0x0003F8, "Member 'ABP_UILoading3D_C::CharacterDepthList' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, SceneData) == 0x000408, "Member 'ABP_UILoading3D_C::SceneData' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, CharacterData) == 0x000428, "Member 'ABP_UILoading3D_C::CharacterData' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, CharaIndex) == 0x000470, "Member 'ABP_UILoading3D_C::CharaIndex' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, _PlayerInfo) == 0x000474, "Member 'ABP_UILoading3D_C::_PlayerInfo' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, SpawnClass) == 0x000548, "Member 'ABP_UILoading3D_C::SpawnClass' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, TargetMesh) == 0x000570, "Member 'ABP_UILoading3D_C::TargetMesh' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, TargetMesheComps) == 0x000578, "Member 'ABP_UILoading3D_C::TargetMesheComps' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, DynamicMaterial) == 0x000588, "Member 'ABP_UILoading3D_C::DynamicMaterial' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, TranslucenctSortPriority) == 0x000590, "Member 'ABP_UILoading3D_C::TranslucenctSortPriority' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, MaterialTargetMesh) == 0x000598, "Member 'ABP_UILoading3D_C::MaterialTargetMesh' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, MaterialLastIndex) == 0x0005A0, "Member 'ABP_UILoading3D_C::MaterialLastIndex' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, _AttachmentManageComponent) == 0x0005A8, "Member 'ABP_UILoading3D_C::_AttachmentManageComponent' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, AnimationAsset) == 0x0005B0, "Member 'ABP_UILoading3D_C::AnimationAsset' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, SceneCahracterData) == 0x0005D8, "Member 'ABP_UILoading3D_C::SceneCahracterData' has a wrong offset!");
static_assert(offsetof(ABP_UILoading3D_C, bFinishCreateScene) == 0x000608, "Member 'ABP_UILoading3D_C::bFinishCreateScene' has a wrong offset!");

}

