#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ui_UV_BrainMes_ListHeder_1

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ui_UV_BrainMes_ListHeder_1.BP_ui_UV_BrainMes_ListHeder_1_C.UI_SetBrainMes_ListHeder_1
// 0x0030 (0x0030 - 0x0000)
struct BP_ui_UV_BrainMes_ListHeder_1_C_UI_SetBrainMes_ListHeder_1 final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4136[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_UV_BrainMes_ListHeder_1_C_UI_SetBrainMes_ListHeder_1) == 0x000008, "Wrong alignment on BP_ui_UV_BrainMes_ListHeder_1_C_UI_SetBrainMes_ListHeder_1");
static_assert(sizeof(BP_ui_UV_BrainMes_ListHeder_1_C_UI_SetBrainMes_ListHeder_1) == 0x000030, "Wrong size on BP_ui_UV_BrainMes_ListHeder_1_C_UI_SetBrainMes_ListHeder_1");
static_assert(offsetof(BP_ui_UV_BrainMes_ListHeder_1_C_UI_SetBrainMes_ListHeder_1, WorldContext) == 0x000000, "Member 'BP_ui_UV_BrainMes_ListHeder_1_C_UI_SetBrainMes_ListHeder_1::WorldContext' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_BrainMes_ListHeder_1_C_UI_SetBrainMes_ListHeder_1, Image) == 0x000008, "Member 'BP_ui_UV_BrainMes_ListHeder_1_C_UI_SetBrainMes_ListHeder_1::Image' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_BrainMes_ListHeder_1_C_UI_SetBrainMes_ListHeder_1, Param_Index) == 0x000010, "Member 'BP_ui_UV_BrainMes_ListHeder_1_C_UI_SetBrainMes_ListHeder_1::Param_Index' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_BrainMes_ListHeder_1_C_UI_SetBrainMes_ListHeder_1, __WorldContext) == 0x000018, "Member 'BP_ui_UV_BrainMes_ListHeder_1_C_UI_SetBrainMes_ListHeder_1::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_BrainMes_ListHeder_1_C_UI_SetBrainMes_ListHeder_1, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'BP_ui_UV_BrainMes_ListHeder_1_C_UI_SetBrainMes_ListHeder_1::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_BrainMes_ListHeder_1_C_UI_SetBrainMes_ListHeder_1, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000028, "Member 'BP_ui_UV_BrainMes_ListHeder_1_C_UI_SetBrainMes_ListHeder_1::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_BrainMes_ListHeder_1_C_UI_SetBrainMes_ListHeder_1, CallFunc_Add_FloatFloat_ReturnValue) == 0x00002C, "Member 'BP_ui_UV_BrainMes_ListHeder_1_C_UI_SetBrainMes_ListHeder_1::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

}

