#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UniqueEffectComponent

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PsychicObjectSizeParameter_structs.hpp"
#include "Engine_structs.hpp"
#include "E_SASKind_structs.hpp"
#include "SPsychicCaptureMaterial_structs.hpp"


namespace SDK::Params
{

// Function BP_UniqueEffectComponent.BP_UniqueEffectComponent_C.ExecuteUbergraph_BP_UniqueEffectComponent
// 0x0020 (0x0020 - 0x0000)
struct BP_UniqueEffectComponent_C_ExecuteUbergraph_BP_UniqueEffectComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4081[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TriggerEffectManager_C*             CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4082[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UniqueEffectComponent_C_ExecuteUbergraph_BP_UniqueEffectComponent) == 0x000008, "Wrong alignment on BP_UniqueEffectComponent_C_ExecuteUbergraph_BP_UniqueEffectComponent");
static_assert(sizeof(BP_UniqueEffectComponent_C_ExecuteUbergraph_BP_UniqueEffectComponent) == 0x000020, "Wrong size on BP_UniqueEffectComponent_C_ExecuteUbergraph_BP_UniqueEffectComponent");
static_assert(offsetof(BP_UniqueEffectComponent_C_ExecuteUbergraph_BP_UniqueEffectComponent, EntryPoint) == 0x000000, "Member 'BP_UniqueEffectComponent_C_ExecuteUbergraph_BP_UniqueEffectComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_ExecuteUbergraph_BP_UniqueEffectComponent, CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager) == 0x000008, "Member 'BP_UniqueEffectComponent_C_ExecuteUbergraph_BP_UniqueEffectComponent::CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_ExecuteUbergraph_BP_UniqueEffectComponent, Temp_bool_Has_Been_Initd_Variable) == 0x000010, "Member 'BP_UniqueEffectComponent_C_ExecuteUbergraph_BP_UniqueEffectComponent::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_ExecuteUbergraph_BP_UniqueEffectComponent, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'BP_UniqueEffectComponent_C_ExecuteUbergraph_BP_UniqueEffectComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_ExecuteUbergraph_BP_UniqueEffectComponent, Temp_bool_IsClosed_Variable) == 0x000018, "Member 'BP_UniqueEffectComponent_C_ExecuteUbergraph_BP_UniqueEffectComponent::Temp_bool_IsClosed_Variable' has a wrong offset!");

// Function BP_UniqueEffectComponent.BP_UniqueEffectComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_UniqueEffectComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UniqueEffectComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_UniqueEffectComponent_C_ReceiveTick");
static_assert(sizeof(BP_UniqueEffectComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_UniqueEffectComponent_C_ReceiveTick");
static_assert(offsetof(BP_UniqueEffectComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_UniqueEffectComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_UniqueEffectComponent.BP_UniqueEffectComponent_C.SetEffectCapture
// 0x00A0 (0x00A0 - 0x0000)
struct BP_UniqueEffectComponent_C_SetEffectCapture final
{
public:
	bool                                          FlagIn;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4083[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         L_particle;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         L_mesh_comp;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_index;                                           // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SASKind                                     CallFunc_GetEffectCaptureParam_sas_kind;           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEffectCaptureParam_capture;            // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4084[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEffectCaptureParam_rate;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetEffectCaptureParam_size;               // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEffectCaptureParam_rateAura;           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetEffectCaptureParam_sizeAura;           // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSParticleSystemComponentBase*         CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4085[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         CallFunc_SpawnMeshEffect_particle_system;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_SASKind                                     CallFunc_GetEffectCaptureParam_sas_kind_1;         // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEffectCaptureParam_capture_1;          // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4086[0x1];                                     // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEffectCaptureParam_rate_1;             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetEffectCaptureParam_size_1;             // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEffectCaptureParam_rateAura_1;         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetEffectCaptureParam_sizeAura_1;         // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4087[0x6];                                     // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class URSParticleSystemComponentBase*   Temp_object_Variable;                              // 0x0098(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UniqueEffectComponent_C_SetEffectCapture) == 0x000008, "Wrong alignment on BP_UniqueEffectComponent_C_SetEffectCapture");
static_assert(sizeof(BP_UniqueEffectComponent_C_SetEffectCapture) == 0x0000A0, "Wrong size on BP_UniqueEffectComponent_C_SetEffectCapture");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, FlagIn) == 0x000000, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::FlagIn' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, L_particle) == 0x000008, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::L_particle' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, L_mesh_comp) == 0x000010, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::L_mesh_comp' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, L_index) == 0x000018, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::L_index' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, CallFunc_GetEffectCaptureParam_sas_kind) == 0x000024, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::CallFunc_GetEffectCaptureParam_sas_kind' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, CallFunc_GetEffectCaptureParam_capture) == 0x000025, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::CallFunc_GetEffectCaptureParam_capture' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, CallFunc_GetEffectCaptureParam_rate) == 0x000028, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::CallFunc_GetEffectCaptureParam_rate' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, CallFunc_GetEffectCaptureParam_size) == 0x00002C, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::CallFunc_GetEffectCaptureParam_size' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, CallFunc_GetEffectCaptureParam_rateAura) == 0x000038, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::CallFunc_GetEffectCaptureParam_rateAura' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, CallFunc_GetEffectCaptureParam_sizeAura) == 0x00003C, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::CallFunc_GetEffectCaptureParam_sizeAura' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000050, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, CallFunc_SpawnMeshEffect_particle_system) == 0x000058, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::CallFunc_SpawnMeshEffect_particle_system' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, Temp_int_Array_Index_Variable) == 0x000064, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, Temp_int_Loop_Num_Variable) == 0x000068, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, CallFunc_GetEffectCaptureParam_sas_kind_1) == 0x00006D, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::CallFunc_GetEffectCaptureParam_sas_kind_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, CallFunc_GetEffectCaptureParam_capture_1) == 0x00006E, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::CallFunc_GetEffectCaptureParam_capture_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, CallFunc_GetEffectCaptureParam_rate_1) == 0x000070, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::CallFunc_GetEffectCaptureParam_rate_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, CallFunc_GetEffectCaptureParam_size_1) == 0x000074, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::CallFunc_GetEffectCaptureParam_size_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, CallFunc_GetEffectCaptureParam_rateAura_1) == 0x000080, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::CallFunc_GetEffectCaptureParam_rateAura_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, CallFunc_GetEffectCaptureParam_sizeAura_1) == 0x000084, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::CallFunc_GetEffectCaptureParam_sizeAura_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, CallFunc_IsValid_ReturnValue_1) == 0x000091, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetEffectCapture, Temp_object_Variable) == 0x000098, "Member 'BP_UniqueEffectComponent_C_SetEffectCapture::Temp_object_Variable' has a wrong offset!");

// Function BP_UniqueEffectComponent.BP_UniqueEffectComponent_C.SetMaterialCaptureStart
// 0x00F0 (0x00F0 - 0x0000)
struct BP_UniqueEffectComponent_C_SetMaterialCaptureStart final
{
public:
	bool                                          FlagIn;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4088[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         L_Mesh;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4089[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_408A[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveVector*                           CallFunc_GetMaterialCaptureStartCurve_material_curve; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSPsychicCaptureMaterial               CallFunc_GetMateralCaptureStartParam_MaterialParam; // 0x0038(0x00A0)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_408B[0x2];                                     // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetupStartPsychicCaptureMaterial_Finish;  // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UniqueEffectComponent_C_SetMaterialCaptureStart) == 0x000008, "Wrong alignment on BP_UniqueEffectComponent_C_SetMaterialCaptureStart");
static_assert(sizeof(BP_UniqueEffectComponent_C_SetMaterialCaptureStart) == 0x0000F0, "Wrong size on BP_UniqueEffectComponent_C_SetMaterialCaptureStart");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetMaterialCaptureStart, FlagIn) == 0x000000, "Member 'BP_UniqueEffectComponent_C_SetMaterialCaptureStart::FlagIn' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetMaterialCaptureStart, L_Mesh) == 0x000008, "Member 'BP_UniqueEffectComponent_C_SetMaterialCaptureStart::L_Mesh' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetMaterialCaptureStart, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_UniqueEffectComponent_C_SetMaterialCaptureStart::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetMaterialCaptureStart, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_UniqueEffectComponent_C_SetMaterialCaptureStart::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetMaterialCaptureStart, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_UniqueEffectComponent_C_SetMaterialCaptureStart::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetMaterialCaptureStart, Temp_int_Loop_Num_Variable) == 0x00001C, "Member 'BP_UniqueEffectComponent_C_SetMaterialCaptureStart::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetMaterialCaptureStart, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'BP_UniqueEffectComponent_C_SetMaterialCaptureStart::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetMaterialCaptureStart, Temp_int_Loop_Counter_Variable_1) == 0x000024, "Member 'BP_UniqueEffectComponent_C_SetMaterialCaptureStart::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetMaterialCaptureStart, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'BP_UniqueEffectComponent_C_SetMaterialCaptureStart::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetMaterialCaptureStart, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'BP_UniqueEffectComponent_C_SetMaterialCaptureStart::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetMaterialCaptureStart, CallFunc_IsValid_ReturnValue_1) == 0x00002D, "Member 'BP_UniqueEffectComponent_C_SetMaterialCaptureStart::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetMaterialCaptureStart, CallFunc_GetMaterialCaptureStartCurve_material_curve) == 0x000030, "Member 'BP_UniqueEffectComponent_C_SetMaterialCaptureStart::CallFunc_GetMaterialCaptureStartCurve_material_curve' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetMaterialCaptureStart, CallFunc_GetMateralCaptureStartParam_MaterialParam) == 0x000038, "Member 'BP_UniqueEffectComponent_C_SetMaterialCaptureStart::CallFunc_GetMateralCaptureStartParam_MaterialParam' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetMaterialCaptureStart, Temp_int_Loop_Num_Variable_1) == 0x0000D8, "Member 'BP_UniqueEffectComponent_C_SetMaterialCaptureStart::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetMaterialCaptureStart, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x0000DC, "Member 'BP_UniqueEffectComponent_C_SetMaterialCaptureStart::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetMaterialCaptureStart, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000DD, "Member 'BP_UniqueEffectComponent_C_SetMaterialCaptureStart::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetMaterialCaptureStart, CallFunc_Array_Length_ReturnValue) == 0x0000E0, "Member 'BP_UniqueEffectComponent_C_SetMaterialCaptureStart::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetMaterialCaptureStart, Temp_int_Array_Index_Variable_1) == 0x0000E4, "Member 'BP_UniqueEffectComponent_C_SetMaterialCaptureStart::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetMaterialCaptureStart, CallFunc_Array_Length_ReturnValue_1) == 0x0000E8, "Member 'BP_UniqueEffectComponent_C_SetMaterialCaptureStart::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetMaterialCaptureStart, CallFunc_SetupStartPsychicCaptureMaterial_Finish) == 0x0000EC, "Member 'BP_UniqueEffectComponent_C_SetMaterialCaptureStart::CallFunc_SetupStartPsychicCaptureMaterial_Finish' has a wrong offset!");

// Function BP_UniqueEffectComponent.BP_UniqueEffectComponent_C.GetEffectCaptureParam
// 0x0180 (0x0180 - 0x0000)
struct BP_UniqueEffectComponent_C_GetEffectCaptureParam final
{
public:
	E_SASKind                                     SAS_Kind;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Capture;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_408C[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Rate;                                              // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Size;                                              // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RateAura;                                          // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SizeAura;                                          // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                L_sizeAura;                                        // 0x0024(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                L_size;                                            // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L_rateAura;                                        // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L_rate;                                            // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_408D[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPsychicObjectSizeParameter            L_param;                                           // 0x0048(0x0138)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UniqueEffectComponent_C_GetEffectCaptureParam) == 0x000008, "Wrong alignment on BP_UniqueEffectComponent_C_GetEffectCaptureParam");
static_assert(sizeof(BP_UniqueEffectComponent_C_GetEffectCaptureParam) == 0x000180, "Wrong size on BP_UniqueEffectComponent_C_GetEffectCaptureParam");
static_assert(offsetof(BP_UniqueEffectComponent_C_GetEffectCaptureParam, SAS_Kind) == 0x000000, "Member 'BP_UniqueEffectComponent_C_GetEffectCaptureParam::SAS_Kind' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_GetEffectCaptureParam, Capture) == 0x000001, "Member 'BP_UniqueEffectComponent_C_GetEffectCaptureParam::Capture' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_GetEffectCaptureParam, Rate) == 0x000004, "Member 'BP_UniqueEffectComponent_C_GetEffectCaptureParam::Rate' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_GetEffectCaptureParam, Size) == 0x000008, "Member 'BP_UniqueEffectComponent_C_GetEffectCaptureParam::Size' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_GetEffectCaptureParam, RateAura) == 0x000014, "Member 'BP_UniqueEffectComponent_C_GetEffectCaptureParam::RateAura' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_GetEffectCaptureParam, SizeAura) == 0x000018, "Member 'BP_UniqueEffectComponent_C_GetEffectCaptureParam::SizeAura' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_GetEffectCaptureParam, L_sizeAura) == 0x000024, "Member 'BP_UniqueEffectComponent_C_GetEffectCaptureParam::L_sizeAura' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_GetEffectCaptureParam, L_size) == 0x000030, "Member 'BP_UniqueEffectComponent_C_GetEffectCaptureParam::L_size' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_GetEffectCaptureParam, L_rateAura) == 0x00003C, "Member 'BP_UniqueEffectComponent_C_GetEffectCaptureParam::L_rateAura' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_GetEffectCaptureParam, L_rate) == 0x000040, "Member 'BP_UniqueEffectComponent_C_GetEffectCaptureParam::L_rate' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_GetEffectCaptureParam, L_param) == 0x000048, "Member 'BP_UniqueEffectComponent_C_GetEffectCaptureParam::L_param' has a wrong offset!");

// Function BP_UniqueEffectComponent.BP_UniqueEffectComponent_C.SpawnEffect
// 0x0024 (0x0024 - 0x0000)
struct BP_UniqueEffectComponent_C_SpawnEffect final
{
public:
	E_SASKind                                     SasKind;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Force;                                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Capture;                                           // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_408E[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Rate;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Size;                                              // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RateAura;                                          // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SizeAura;                                          // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UniqueEffectComponent_C_SpawnEffect) == 0x000004, "Wrong alignment on BP_UniqueEffectComponent_C_SpawnEffect");
static_assert(sizeof(BP_UniqueEffectComponent_C_SpawnEffect) == 0x000024, "Wrong size on BP_UniqueEffectComponent_C_SpawnEffect");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnEffect, SasKind) == 0x000000, "Member 'BP_UniqueEffectComponent_C_SpawnEffect::SasKind' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnEffect, Force) == 0x000001, "Member 'BP_UniqueEffectComponent_C_SpawnEffect::Force' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnEffect, Capture) == 0x000002, "Member 'BP_UniqueEffectComponent_C_SpawnEffect::Capture' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnEffect, Rate) == 0x000004, "Member 'BP_UniqueEffectComponent_C_SpawnEffect::Rate' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnEffect, Size) == 0x000008, "Member 'BP_UniqueEffectComponent_C_SpawnEffect::Size' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnEffect, RateAura) == 0x000014, "Member 'BP_UniqueEffectComponent_C_SpawnEffect::RateAura' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnEffect, SizeAura) == 0x000018, "Member 'BP_UniqueEffectComponent_C_SpawnEffect::SizeAura' has a wrong offset!");

// Function BP_UniqueEffectComponent.BP_UniqueEffectComponent_C.SpawnMeshEffect
// 0x0330 (0x0330 - 0x0000)
struct BP_UniqueEffectComponent_C_SpawnMeshEffect final
{
public:
	class UMeshComponent*                         Mesh_in;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SASKind                                     Sas_kind_in;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Capture_in;                                        // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_408F[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Rate_in;                                           // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Size_in;                                           // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RateAura_in;                                       // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SizeAura_in;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4090[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         Particle_system;                                   // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_skeletalMesh;                                   // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4091[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         L_effect;                                          // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4092[0xF];                                     // 0x0051(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0060(0x0080)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4093[0x8];                                     // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_1;              // 0x00F0(0x0080)(IsPlainOldData, NoDestructor)
	class UParticleSystem*                        CallFunc_GetEmitterTemplate_Template;              // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSParticleSystemComponentBase*         CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_2;              // 0x0180(0x0080)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4094[0x8];                                     // 0x0208(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_3;              // 0x0210(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_4;              // 0x0290(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x0310(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UniqueEffectComponent_C_SpawnMeshEffect) == 0x000010, "Wrong alignment on BP_UniqueEffectComponent_C_SpawnMeshEffect");
static_assert(sizeof(BP_UniqueEffectComponent_C_SpawnMeshEffect) == 0x000330, "Wrong size on BP_UniqueEffectComponent_C_SpawnMeshEffect");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnMeshEffect, Mesh_in) == 0x000000, "Member 'BP_UniqueEffectComponent_C_SpawnMeshEffect::Mesh_in' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnMeshEffect, Sas_kind_in) == 0x000008, "Member 'BP_UniqueEffectComponent_C_SpawnMeshEffect::Sas_kind_in' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnMeshEffect, Capture_in) == 0x000009, "Member 'BP_UniqueEffectComponent_C_SpawnMeshEffect::Capture_in' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnMeshEffect, Rate_in) == 0x00000C, "Member 'BP_UniqueEffectComponent_C_SpawnMeshEffect::Rate_in' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnMeshEffect, Size_in) == 0x000010, "Member 'BP_UniqueEffectComponent_C_SpawnMeshEffect::Size_in' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnMeshEffect, RateAura_in) == 0x00001C, "Member 'BP_UniqueEffectComponent_C_SpawnMeshEffect::RateAura_in' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnMeshEffect, SizeAura_in) == 0x000020, "Member 'BP_UniqueEffectComponent_C_SpawnMeshEffect::SizeAura_in' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnMeshEffect, Particle_system) == 0x000030, "Member 'BP_UniqueEffectComponent_C_SpawnMeshEffect::Particle_system' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnMeshEffect, Is_skeletalMesh) == 0x000038, "Member 'BP_UniqueEffectComponent_C_SpawnMeshEffect::Is_skeletalMesh' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnMeshEffect, L_effect) == 0x000040, "Member 'BP_UniqueEffectComponent_C_SpawnMeshEffect::L_effect' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnMeshEffect, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x000048, "Member 'BP_UniqueEffectComponent_C_SpawnMeshEffect::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnMeshEffect, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_UniqueEffectComponent_C_SpawnMeshEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnMeshEffect, K2Node_MakeStruct_ParticleSysParam) == 0x000060, "Member 'BP_UniqueEffectComponent_C_SpawnMeshEffect::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnMeshEffect, CallFunc_GetOwner_ReturnValue) == 0x0000E0, "Member 'BP_UniqueEffectComponent_C_SpawnMeshEffect::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnMeshEffect, K2Node_MakeStruct_ParticleSysParam_1) == 0x0000F0, "Member 'BP_UniqueEffectComponent_C_SpawnMeshEffect::K2Node_MakeStruct_ParticleSysParam_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnMeshEffect, CallFunc_GetEmitterTemplate_Template) == 0x000170, "Member 'BP_UniqueEffectComponent_C_SpawnMeshEffect::CallFunc_GetEmitterTemplate_Template' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnMeshEffect, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000178, "Member 'BP_UniqueEffectComponent_C_SpawnMeshEffect::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnMeshEffect, K2Node_MakeStruct_ParticleSysParam_2) == 0x000180, "Member 'BP_UniqueEffectComponent_C_SpawnMeshEffect::K2Node_MakeStruct_ParticleSysParam_2' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnMeshEffect, CallFunc_GetOwner_ReturnValue_1) == 0x000200, "Member 'BP_UniqueEffectComponent_C_SpawnMeshEffect::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnMeshEffect, K2Node_MakeStruct_ParticleSysParam_3) == 0x000210, "Member 'BP_UniqueEffectComponent_C_SpawnMeshEffect::K2Node_MakeStruct_ParticleSysParam_3' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnMeshEffect, K2Node_MakeStruct_ParticleSysParam_4) == 0x000290, "Member 'BP_UniqueEffectComponent_C_SpawnMeshEffect::K2Node_MakeStruct_ParticleSysParam_4' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnMeshEffect, K2Node_MakeArray_Array) == 0x000310, "Member 'BP_UniqueEffectComponent_C_SpawnMeshEffect::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SpawnMeshEffect, CallFunc_IsValid_ReturnValue) == 0x000320, "Member 'BP_UniqueEffectComponent_C_SpawnMeshEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_UniqueEffectComponent.BP_UniqueEffectComponent_C.DeactivateEffect
// 0x0002 (0x0002 - 0x0000)
struct BP_UniqueEffectComponent_C_DeactivateEffect final
{
public:
	E_SASKind                                     SasKind;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Capture;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UniqueEffectComponent_C_DeactivateEffect) == 0x000001, "Wrong alignment on BP_UniqueEffectComponent_C_DeactivateEffect");
static_assert(sizeof(BP_UniqueEffectComponent_C_DeactivateEffect) == 0x000002, "Wrong size on BP_UniqueEffectComponent_C_DeactivateEffect");
static_assert(offsetof(BP_UniqueEffectComponent_C_DeactivateEffect, SasKind) == 0x000000, "Member 'BP_UniqueEffectComponent_C_DeactivateEffect::SasKind' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_DeactivateEffect, Capture) == 0x000001, "Member 'BP_UniqueEffectComponent_C_DeactivateEffect::Capture' has a wrong offset!");

// Function BP_UniqueEffectComponent.BP_UniqueEffectComponent_C.SetAsyncCommon
// 0x000C (0x000C - 0x0000)
struct BP_UniqueEffectComponent_C_SetAsyncCommon final
{
public:
	class FName                                   RefNameIn;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlagIn;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UniqueEffectComponent_C_SetAsyncCommon) == 0x000004, "Wrong alignment on BP_UniqueEffectComponent_C_SetAsyncCommon");
static_assert(sizeof(BP_UniqueEffectComponent_C_SetAsyncCommon) == 0x00000C, "Wrong size on BP_UniqueEffectComponent_C_SetAsyncCommon");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetAsyncCommon, RefNameIn) == 0x000000, "Member 'BP_UniqueEffectComponent_C_SetAsyncCommon::RefNameIn' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_SetAsyncCommon, FlagIn) == 0x000008, "Member 'BP_UniqueEffectComponent_C_SetAsyncCommon::FlagIn' has a wrong offset!");

// Function BP_UniqueEffectComponent.BP_UniqueEffectComponent_C.GetMateralCaptureStartParam
// 0x00A8 (0x00A8 - 0x0000)
struct BP_UniqueEffectComponent_C_GetMateralCaptureStartParam final
{
public:
	E_SASKind                                     SasKindIn;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4095[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSPsychicCaptureMaterial               MaterialParam;                                     // 0x0008(0x00A0)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_UniqueEffectComponent_C_GetMateralCaptureStartParam) == 0x000008, "Wrong alignment on BP_UniqueEffectComponent_C_GetMateralCaptureStartParam");
static_assert(sizeof(BP_UniqueEffectComponent_C_GetMateralCaptureStartParam) == 0x0000A8, "Wrong size on BP_UniqueEffectComponent_C_GetMateralCaptureStartParam");
static_assert(offsetof(BP_UniqueEffectComponent_C_GetMateralCaptureStartParam, SasKindIn) == 0x000000, "Member 'BP_UniqueEffectComponent_C_GetMateralCaptureStartParam::SasKindIn' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_GetMateralCaptureStartParam, MaterialParam) == 0x000008, "Member 'BP_UniqueEffectComponent_C_GetMateralCaptureStartParam::MaterialParam' has a wrong offset!");

// Function BP_UniqueEffectComponent.BP_UniqueEffectComponent_C.GetMaterialCaptureStartCurve
// 0x0010 (0x0010 - 0x0000)
struct BP_UniqueEffectComponent_C_GetMaterialCaptureStartCurve final
{
public:
	E_SASKind                                     Sas_kind_in;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4096[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveVector*                           Material_curve;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UniqueEffectComponent_C_GetMaterialCaptureStartCurve) == 0x000008, "Wrong alignment on BP_UniqueEffectComponent_C_GetMaterialCaptureStartCurve");
static_assert(sizeof(BP_UniqueEffectComponent_C_GetMaterialCaptureStartCurve) == 0x000010, "Wrong size on BP_UniqueEffectComponent_C_GetMaterialCaptureStartCurve");
static_assert(offsetof(BP_UniqueEffectComponent_C_GetMaterialCaptureStartCurve, Sas_kind_in) == 0x000000, "Member 'BP_UniqueEffectComponent_C_GetMaterialCaptureStartCurve::Sas_kind_in' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_GetMaterialCaptureStartCurve, Material_curve) == 0x000008, "Member 'BP_UniqueEffectComponent_C_GetMaterialCaptureStartCurve::Material_curve' has a wrong offset!");

// Function BP_UniqueEffectComponent.BP_UniqueEffectComponent_C.InitMaterialCaptureStartParam
// 0x00B8 (0x00B8 - 0x0000)
struct BP_UniqueEffectComponent_C_InitMaterialCaptureStartParam final
{
public:
	class APsychicObjectManager_C*                CallFunc_GetPsychicObjectManager_PsyObjManager;    // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSPsychicCaptureMaterial               CallFunc_GetPsychicCaptureMaterialParameter_material_param; // 0x0008(0x00A0)(HasGetValueTypeHash)
	class UCurveVector*                           CallFunc_LoadMaterialCaptureStartCurve_AsCurve_Vector; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UniqueEffectComponent_C_InitMaterialCaptureStartParam) == 0x000008, "Wrong alignment on BP_UniqueEffectComponent_C_InitMaterialCaptureStartParam");
static_assert(sizeof(BP_UniqueEffectComponent_C_InitMaterialCaptureStartParam) == 0x0000B8, "Wrong size on BP_UniqueEffectComponent_C_InitMaterialCaptureStartParam");
static_assert(offsetof(BP_UniqueEffectComponent_C_InitMaterialCaptureStartParam, CallFunc_GetPsychicObjectManager_PsyObjManager) == 0x000000, "Member 'BP_UniqueEffectComponent_C_InitMaterialCaptureStartParam::CallFunc_GetPsychicObjectManager_PsyObjManager' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_InitMaterialCaptureStartParam, CallFunc_GetPsychicCaptureMaterialParameter_material_param) == 0x000008, "Member 'BP_UniqueEffectComponent_C_InitMaterialCaptureStartParam::CallFunc_GetPsychicCaptureMaterialParameter_material_param' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_InitMaterialCaptureStartParam, CallFunc_LoadMaterialCaptureStartCurve_AsCurve_Vector) == 0x0000A8, "Member 'BP_UniqueEffectComponent_C_InitMaterialCaptureStartParam::CallFunc_LoadMaterialCaptureStartCurve_AsCurve_Vector' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_InitMaterialCaptureStartParam, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'BP_UniqueEffectComponent_C_InitMaterialCaptureStartParam::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_UniqueEffectComponent.BP_UniqueEffectComponent_C.LoadMaterialCaptureStartCurve
// 0x00C8 (0x00C8 - 0x0000)
struct BP_UniqueEffectComponent_C_LoadMaterialCaptureStartCurve final
{
public:
	struct FSPsychicCaptureMaterial               SPsychicCaptureMaterial;                           // 0x0000(0x00A0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class UCurveVector*                           AsCurve_Vector;                                    // 0x00A0(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4097[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveVector*                           K2Node_DynamicCast_AsCurve_Vector;                 // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UniqueEffectComponent_C_LoadMaterialCaptureStartCurve) == 0x000008, "Wrong alignment on BP_UniqueEffectComponent_C_LoadMaterialCaptureStartCurve");
static_assert(sizeof(BP_UniqueEffectComponent_C_LoadMaterialCaptureStartCurve) == 0x0000C8, "Wrong size on BP_UniqueEffectComponent_C_LoadMaterialCaptureStartCurve");
static_assert(offsetof(BP_UniqueEffectComponent_C_LoadMaterialCaptureStartCurve, SPsychicCaptureMaterial) == 0x000000, "Member 'BP_UniqueEffectComponent_C_LoadMaterialCaptureStartCurve::SPsychicCaptureMaterial' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_LoadMaterialCaptureStartCurve, AsCurve_Vector) == 0x0000A0, "Member 'BP_UniqueEffectComponent_C_LoadMaterialCaptureStartCurve::AsCurve_Vector' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_LoadMaterialCaptureStartCurve, CallFunc_LoadSoftObject_ReturnValue) == 0x0000A8, "Member 'BP_UniqueEffectComponent_C_LoadMaterialCaptureStartCurve::CallFunc_LoadSoftObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_LoadMaterialCaptureStartCurve, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0000B0, "Member 'BP_UniqueEffectComponent_C_LoadMaterialCaptureStartCurve::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_LoadMaterialCaptureStartCurve, K2Node_DynamicCast_AsCurve_Vector) == 0x0000B8, "Member 'BP_UniqueEffectComponent_C_LoadMaterialCaptureStartCurve::K2Node_DynamicCast_AsCurve_Vector' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_LoadMaterialCaptureStartCurve, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'BP_UniqueEffectComponent_C_LoadMaterialCaptureStartCurve::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_UniqueEffectComponent.BP_UniqueEffectComponent_C.InitializeParameter
// 0x0008 (0x0008 - 0x0000)
struct BP_UniqueEffectComponent_C_InitializeParameter final
{
public:
	class URSParticleSystemComponentBase*         L_particle;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UniqueEffectComponent_C_InitializeParameter) == 0x000008, "Wrong alignment on BP_UniqueEffectComponent_C_InitializeParameter");
static_assert(sizeof(BP_UniqueEffectComponent_C_InitializeParameter) == 0x000008, "Wrong size on BP_UniqueEffectComponent_C_InitializeParameter");
static_assert(offsetof(BP_UniqueEffectComponent_C_InitializeParameter, L_particle) == 0x000000, "Member 'BP_UniqueEffectComponent_C_InitializeParameter::L_particle' has a wrong offset!");

// Function BP_UniqueEffectComponent.BP_UniqueEffectComponent_C.Initialize Component
// 0x0028 (0x0028 - 0x0000)
struct BP_UniqueEffectComponent_C_Initialize_Component final
{
public:
	class UMeshComponent*                         Mesh_comp_in;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Arrow_comp_in;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Attack_sphere_in;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Attack_capsule_in;                                 // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPsychicSasParticleComponent_C*         PsychicSasParticleComp;                            // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UniqueEffectComponent_C_Initialize_Component) == 0x000008, "Wrong alignment on BP_UniqueEffectComponent_C_Initialize_Component");
static_assert(sizeof(BP_UniqueEffectComponent_C_Initialize_Component) == 0x000028, "Wrong size on BP_UniqueEffectComponent_C_Initialize_Component");
static_assert(offsetof(BP_UniqueEffectComponent_C_Initialize_Component, Mesh_comp_in) == 0x000000, "Member 'BP_UniqueEffectComponent_C_Initialize_Component::Mesh_comp_in' has a wrong offset!");
static_assert(offsetof(BP_UniqueEffectComponent_C_Initialize_Component, Arrow_comp_in) == 0x000008, "Member 'BP_UniqueEffectComponent_C_Initialize_Component::Arrow_comp_in' has a wrong offset!");
