#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UseItemComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "EPlayerBattleVoiceType_structs.hpp"


namespace SDK::Params
{

// Function BP_UseItemComponent.BP_UseItemComponent_C.ExecuteUbergraph_BP_UseItemComponent
// 0x0140 (0x0140 - 0x0000)
struct BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89E7[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89E8[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89E9[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89EA[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemDataCell                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0058(0x0080)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89EB[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89EC[0x2];                                     // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89ED[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89EE[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         K2Node_DynamicCast_AsHUDMain_Game;                 // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89EF[0x3];                                     // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent) == 0x000008, "Wrong alignment on BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent");
static_assert(sizeof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent) == 0x000140, "Wrong size on BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, EntryPoint) == 0x000000, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, Temp_int_Variable) == 0x000004, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, CallFunc_Conv_IntToByte_ReturnValue) == 0x00000C, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, CallFunc_GetValidValue_ReturnValue) == 0x00000D, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, Temp_int_Variable_1) == 0x000010, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, CallFunc_GetEnumeratorName_ReturnValue) == 0x000018, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, CallFunc_Conv_NameToString_ReturnValue) == 0x000020, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000030, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, CallFunc_GetSubstring_ReturnValue) == 0x000038, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000048, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, CallFunc_Conv_StringToName_ReturnValue) == 0x00004C, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000054, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, CallFunc_GetDataTableRowFromName_OutRow) == 0x000058, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000D8, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x0000DC, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, CallFunc_MakeLiteralInt_ReturnValue) == 0x0000E0, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, Temp_int_Loop_Counter_Variable) == 0x0000E4, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000E8, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, Temp_int_Array_Index_Variable) == 0x0000EC, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, Temp_int_Loop_Num_Variable) == 0x0000F0, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, Temp_bool_Has_Been_Initd_Variable) == 0x0000F4, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, CallFunc_Less_IntInt_ReturnValue) == 0x0000F5, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, K2Node_Event_DeltaSeconds) == 0x0000F8, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, CallFunc_GetOwner_ReturnValue) == 0x000100, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, CallFunc_GetPlayerController_ReturnValue) == 0x000108, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, K2Node_DynamicCast_AsRSBattle_Player) == 0x000110, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, CallFunc_GetHUD_ReturnValue) == 0x000120, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, K2Node_DynamicCast_AsHUDMain_Game) == 0x000128, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::K2Node_DynamicCast_AsHUDMain_Game' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, K2Node_DynamicCast_bSuccess_1) == 0x000130, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, CallFunc_MakeLiteralInt_ReturnValue_1) == 0x000134, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::CallFunc_MakeLiteralInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, CallFunc_Less_IntInt_ReturnValue_1) == 0x000138, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent, Temp_bool_IsClosed_Variable) == 0x000139, "Member 'BP_UseItemComponent_C_ExecuteUbergraph_BP_UseItemComponent::Temp_bool_IsClosed_Variable' has a wrong offset!");

// Function BP_UseItemComponent.BP_UseItemComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_UseItemComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UseItemComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_UseItemComponent_C_ReceiveTick");
static_assert(sizeof(BP_UseItemComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_UseItemComponent_C_ReceiveTick");
static_assert(offsetof(BP_UseItemComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_UseItemComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_UseItemComponent.BP_UseItemComponent_C.ItemApply
// 0x02E0 (0x02E0 - 0x0000)
struct BP_UseItemComponent_C_ItemApply final
{
public:
	bool                                          bRevive;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LbBadStatus;                                       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89F0[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EPlayerID>                             LBrainTalkTarget;                                  // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          bRecoveryItem;                                     // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89F1[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LRecoveryRate;                                     // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LbRevive;                                          // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89F2[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      LTarget;                                           // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AddHp;                                             // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89F3[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharacterParamater_C> CallFunc_IsDead_self_CastInput;                    // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDead_bDead;                             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89F4[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharacterParamater_C> CallFunc_IsDead_self_CastInput_1;                  // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDead_bDead_1;                           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89F5[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerBattleVoiceType                        Temp_byte_Variable;                                // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89F6[0x2];                                     // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerBattleVoiceType                        Temp_byte_Variable_1;                              // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlayerAccessoryExtendParameter_bOutEquip; // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89F7[0x5];                                     // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 CallFunc_GetPlayerAccessoryExtendParameter_outParameter; // 0x0098(0x0010)(ReferenceParm, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsControlAI_bAI;                          // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89F8[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89F9[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMin_ReturnValue;                         // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClearGetterManager*                    CallFunc_GetClearGetterManager_ClearGetterManager; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_2;                      // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89FA[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleSimulatorManager*                CallFunc_GetBattleSimulatorManager_BattleSimulatorManager; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerStatus_Result;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89FB[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_IsMainPlayer_self_CastInput;              // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMainPlayer_bMainPlayer;                 // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89FC[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      CallFunc_GetPlayerID_self_CastInput;               // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89FD[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABrainTalkManager*                      CallFunc_GetBrainTalkManager_BrainTalkManager;     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BrainTalkBt_RecoveryAbToPL_ReturnValue;   // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BrainTalkBt_RecoveryHpToPL_ReturnValue;   // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89FE[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_IsMainPlayer_self_CastInput_1;            // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMainPlayer_bMainPlayer_1;               // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89FF[0x4];                                     // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_IsMainPlayer_self_CastInput_2;            // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMainPlayer_bMainPlayer_2;               // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A00[0x3];                                     // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerBattleVoiceType                        Temp_byte_Variable_2;                              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     CallFunc_Array_Get_Item_1;                         // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerBattleVoiceType                        Temp_byte_Variable_3;                              // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A01[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      CallFunc_GetPlayerID_self_CastInput_1;             // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue_1;                // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A02[0x3];                                     // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CharacterParamater_C> K2Node_DynamicCast_AsBPI_Character_Paramater;      // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A03[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharacterParamater_C> K2Node_DynamicCast_AsBPI_Character_Paramater_1;    // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBadStatusConfusion_bBadStatus;          // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBadStatusOil_bBadStatus;                // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A04[0x5];                                     // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharacterParamater_C> K2Node_DynamicCast_AsBPI_Character_Paramater_2;    // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A05[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharacterParamater_C> K2Node_DynamicCast_AsBPI_Character_Paramater_3;    // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBadStatusFlooded_bBadStatus;            // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBadStatusFrame_bBadStatus;              // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A06[0x5];                                     // 0x01CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharacterParamater_C> CallFunc_IsBadStatusElectric_self_CastInput;       // 0x01D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBadStatusElectric_bBadStatus;           // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsControlAI_bAI_1;                        // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A07[0x5];                                     // 0x01E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      CallFunc_GetPlayerID_self_CastInput_2;             // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue_2;                // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A08[0x3];                                     // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CharacterParamater_C> CallFunc_GetHPPercent_self_CastInput;              // 0x0200(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetHPPercent_Percent;                     // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsControlAI_bAI_2;                        // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0216(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x0217(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                CallFunc_GetDebuggingManager_Manager;              // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0223(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A09[0x4];                                     // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABrainTalkManager*                      CallFunc_GetBrainTalkManager_BrainTalkManager_1;   // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BrainTalkBt_RecoveryItemZero_ReturnValue; // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A0A[0x6];                                     // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserParamManager*                      CallFunc_GetUserParamManager_UserParamManager;     // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHaveRepairItem_ReturnValue;             // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A0B[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserParamManager*                      CallFunc_GetUserParamManager_UserParamManager_1;   // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CharacterParamater_C> CallFunc_GetMaxHP_self_CastInput;                  // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetMaxHP_MaxHP;                           // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A0C[0x4];                                     // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetItemName_name;                         // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddItemNum_ReturnValue;                   // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A0D[0x3];                                     // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetItemVitalityValue_value;               // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue_1;                       // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsControlAI_bAI_3;                        // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A0E[0x3];                                     // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARSBattlePlayer_C*>              CallFunc_GetItemTargetList_TargetList;             // 0x02A8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A0F[0x3];                                     // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerBattleVoiceType                        K2Node_Select_Default;                             // 0x02C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A10[0x2];                                     // 0x02C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A11[0x3];                                     // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerBattleVoiceType                        K2Node_Select_Default_1;                           // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UseItemComponent_C_ItemApply) == 0x000008, "Wrong alignment on BP_UseItemComponent_C_ItemApply");
static_assert(sizeof(BP_UseItemComponent_C_ItemApply) == 0x0002E0, "Wrong size on BP_UseItemComponent_C_ItemApply");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, bRevive) == 0x000000, "Member 'BP_UseItemComponent_C_ItemApply::bRevive' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, LbBadStatus) == 0x000001, "Member 'BP_UseItemComponent_C_ItemApply::LbBadStatus' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, LBrainTalkTarget) == 0x000008, "Member 'BP_UseItemComponent_C_ItemApply::LBrainTalkTarget' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, bRecoveryItem) == 0x000018, "Member 'BP_UseItemComponent_C_ItemApply::bRecoveryItem' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, LRecoveryRate) == 0x00001C, "Member 'BP_UseItemComponent_C_ItemApply::LRecoveryRate' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, LbRevive) == 0x000020, "Member 'BP_UseItemComponent_C_ItemApply::LbRevive' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, LTarget) == 0x000028, "Member 'BP_UseItemComponent_C_ItemApply::LTarget' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, AddHp) == 0x000030, "Member 'BP_UseItemComponent_C_ItemApply::AddHp' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_IsDead_self_CastInput) == 0x000038, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_IsDead_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_IsDead_bDead) == 0x000048, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_IsDead_bDead' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_IsDead_self_CastInput_1) == 0x000050, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_IsDead_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_IsDead_bDead_1) == 0x000060, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_IsDead_bDead_1' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'BP_UseItemComponent_C_ItemApply::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, Temp_int_Array_Index_Variable) == 0x00006C, "Member 'BP_UseItemComponent_C_ItemApply::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, Temp_int_Loop_Num_Variable) == 0x000070, "Member 'BP_UseItemComponent_C_ItemApply::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, Temp_byte_Variable) == 0x000075, "Member 'BP_UseItemComponent_C_ItemApply::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, Temp_int_Loop_Counter_Variable_1) == 0x000078, "Member 'BP_UseItemComponent_C_ItemApply::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_Add_IntInt_ReturnValue_1) == 0x00007C, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, Temp_int_Array_Index_Variable_1) == 0x000080, "Member 'BP_UseItemComponent_C_ItemApply::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, Temp_int_Loop_Counter_Variable_2) == 0x000084, "Member 'BP_UseItemComponent_C_ItemApply::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_Add_IntInt_ReturnValue_2) == 0x000088, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, Temp_int_Loop_Num_Variable_1) == 0x00008C, "Member 'BP_UseItemComponent_C_ItemApply::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_Less_IntInt_ReturnValue_1) == 0x000090, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, Temp_byte_Variable_1) == 0x000091, "Member 'BP_UseItemComponent_C_ItemApply::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_GetPlayerAccessoryExtendParameter_bOutEquip) == 0x000092, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_GetPlayerAccessoryExtendParameter_bOutEquip' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_GetPlayerAccessoryExtendParameter_outParameter) == 0x000098, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_GetPlayerAccessoryExtendParameter_outParameter' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_IsControlAI_bAI) == 0x0000AC, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_IsControlAI_bAI' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000B0, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000B4, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000B8, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_FMin_ReturnValue) == 0x0000BC, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_GetClearGetterManager_ClearGetterManager) == 0x0000C0, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_GetClearGetterManager_ClearGetterManager' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, Temp_int_Loop_Num_Variable_2) == 0x0000C8, "Member 'BP_UseItemComponent_C_ItemApply::Temp_int_Loop_Num_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000CC, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_GetBattleSimulatorManager_BattleSimulatorManager) == 0x0000D0, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_GetBattleSimulatorManager_BattleSimulatorManager' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_IsPlayerStatus_Result) == 0x0000D8, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_IsPlayerStatus_Result' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_IsMainPlayer_self_CastInput) == 0x0000E0, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_IsMainPlayer_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_IsMainPlayer_bMainPlayer) == 0x0000F0, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_IsMainPlayer_bMainPlayer' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_GetPlayerID_self_CastInput) == 0x0000F8, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_GetPlayerID_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_GetPlayerID_ReturnValue) == 0x000108, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_GetPlayerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_GetBrainTalkManager_BrainTalkManager) == 0x000110, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_GetBrainTalkManager_BrainTalkManager' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, Temp_bool_Variable) == 0x000118, "Member 'BP_UseItemComponent_C_ItemApply::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_BrainTalkBt_RecoveryAbToPL_ReturnValue) == 0x000119, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_BrainTalkBt_RecoveryAbToPL_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_BrainTalkBt_RecoveryHpToPL_ReturnValue) == 0x00011A, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_BrainTalkBt_RecoveryHpToPL_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00011B, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_IsMainPlayer_self_CastInput_1) == 0x000120, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_IsMainPlayer_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_IsMainPlayer_bMainPlayer_1) == 0x000130, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_IsMainPlayer_bMainPlayer_1' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000131, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_BooleanOR_ReturnValue) == 0x000132, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000133, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_IsMainPlayer_self_CastInput_2) == 0x000138, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_IsMainPlayer_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_IsMainPlayer_bMainPlayer_2) == 0x000148, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_IsMainPlayer_bMainPlayer_2' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, Temp_int_Array_Index_Variable_2) == 0x00014C, "Member 'BP_UseItemComponent_C_ItemApply::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, Temp_byte_Variable_2) == 0x000150, "Member 'BP_UseItemComponent_C_ItemApply::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_Array_Get_Item_1) == 0x000151, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000152, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, Temp_byte_Variable_3) == 0x000153, "Member 'BP_UseItemComponent_C_ItemApply::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_GetPlayerID_self_CastInput_1) == 0x000158, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_GetPlayerID_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_GetPlayerID_ReturnValue_1) == 0x000168, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_GetPlayerID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_Array_AddUnique_ReturnValue) == 0x00016C, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, K2Node_DynamicCast_AsBPI_Character_Paramater) == 0x000170, "Member 'BP_UseItemComponent_C_ItemApply::K2Node_DynamicCast_AsBPI_Character_Paramater' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, K2Node_DynamicCast_bSuccess) == 0x000180, "Member 'BP_UseItemComponent_C_ItemApply::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, K2Node_DynamicCast_AsBPI_Character_Paramater_1) == 0x000188, "Member 'BP_UseItemComponent_C_ItemApply::K2Node_DynamicCast_AsBPI_Character_Paramater_1' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, K2Node_DynamicCast_bSuccess_1) == 0x000198, "Member 'BP_UseItemComponent_C_ItemApply::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_IsBadStatusConfusion_bBadStatus) == 0x000199, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_IsBadStatusConfusion_bBadStatus' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, CallFunc_IsBadStatusOil_bBadStatus) == 0x00019A, "Member 'BP_UseItemComponent_C_ItemApply::CallFunc_IsBadStatusOil_bBadStatus' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, K2Node_DynamicCast_AsBPI_Character_Paramater_2) == 0x0001A0, "Member 'BP_UseItemComponent_C_ItemApply::K2Node_DynamicCast_AsBPI_Character_Paramater_2' has a wrong offset!");
static_assert(offsetof(BP_UseItemComponent_C_ItemApply, K2Node_DynamicCast_bSuccess_2) == 0x0001B0, "Member 'BP_UseItemComponent_C_ItemApply::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
