#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UIShop3DManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_UIShop3DManager.BP_UIShop3DManager_C
// 0x00E0 (0x0310 - 0x0230)
class ABP_UIShop3DManager_C final : public AUIShop3DManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDirectionalLightComponent*             PlayerLight;                                       // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_UIShop3DBG_C*                       MenuBG;                                            // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APostProcessVolume*>             RestorePPV;                                        // 0x0250(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<bool>                                  RestorePPVEnabled;                                 // 0x0260(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          InViewMode;                                        // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D8[0xF];                                     // 0x0271(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ViewModeRestoreCameraTransform;                    // 0x0280(0x0030)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ViewModeRestoreOverrideViewRect;                   // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D9[0x3];                                     // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ViewModeViewLocation;                              // 0x02B4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ViewModeViewLocationDefault;                       // 0x02C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ViewModeCameraLocation;                            // 0x02CC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ViewModeZoom;                                      // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ViewModeScreenLocationX;                           // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ViewModeScreenLocationY;                           // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUIMain3DViewModeSetting               ViewModeSetting;                                   // 0x02E4(0x0024)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_BP_UIShop3DManager(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void InitializeBG();
	void PrivateSetupMenuPP();
	void PrivateRestoreScenePP();
	void StartViewMode();
	void EndViewMode();
	void PrivateUpdateViewModeRotation(float DeltaSeconds, float InputX, float InputY);
	void PrivateUpdateViewModeZoom(float DeltaSeconds, float InputIn, float InputOut);
	void PrivateResetViewModeCamera();
	bool Start();
	bool End();
	void ResetBGCameraParameter();

	void IsInViewMode(bool* IsViewMode) const;
	bool IsWaitStart() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UIShop3DManager_C">();
	}
	static class ABP_UIShop3DManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_UIShop3DManager_C>();
	}
};
static_assert(alignof(ABP_UIShop3DManager_C) == 0x000010, "Wrong alignment on ABP_UIShop3DManager_C");
static_assert(sizeof(ABP_UIShop3DManager_C) == 0x000310, "Wrong size on ABP_UIShop3DManager_C");
static_assert(offsetof(ABP_UIShop3DManager_C, UberGraphFrame) == 0x000230, "Member 'ABP_UIShop3DManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_UIShop3DManager_C, PlayerLight) == 0x000238, "Member 'ABP_UIShop3DManager_C::PlayerLight' has a wrong offset!");
static_assert(offsetof(ABP_UIShop3DManager_C, DefaultSceneRoot) == 0x000240, "Member 'ABP_UIShop3DManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_UIShop3DManager_C, MenuBG) == 0x000248, "Member 'ABP_UIShop3DManager_C::MenuBG' has a wrong offset!");
static_assert(offsetof(ABP_UIShop3DManager_C, RestorePPV) == 0x000250, "Member 'ABP_UIShop3DManager_C::RestorePPV' has a wrong offset!");
static_assert(offsetof(ABP_UIShop3DManager_C, RestorePPVEnabled) == 0x000260, "Member 'ABP_UIShop3DManager_C::RestorePPVEnabled' has a wrong offset!");
static_assert(offsetof(ABP_UIShop3DManager_C, InViewMode) == 0x000270, "Member 'ABP_UIShop3DManager_C::InViewMode' has a wrong offset!");
static_assert(offsetof(ABP_UIShop3DManager_C, ViewModeRestoreCameraTransform) == 0x000280, "Member 'ABP_UIShop3DManager_C::ViewModeRestoreCameraTransform' has a wrong offset!");
static_assert(offsetof(ABP_UIShop3DManager_C, ViewModeRestoreOverrideViewRect) == 0x0002B0, "Member 'ABP_UIShop3DManager_C::ViewModeRestoreOverrideViewRect' has a wrong offset!");
static_assert(offsetof(ABP_UIShop3DManager_C, ViewModeViewLocation) == 0x0002B4, "Member 'ABP_UIShop3DManager_C::ViewModeViewLocation' has a wrong offset!");
static_assert(offsetof(ABP_UIShop3DManager_C, ViewModeViewLocationDefault) == 0x0002C0, "Member 'ABP_UIShop3DManager_C::ViewModeViewLocationDefault' has a wrong offset!");
static_assert(offsetof(ABP_UIShop3DManager_C, ViewModeCameraLocation) == 0x0002CC, "Member 'ABP_UIShop3DManager_C::ViewModeCameraLocation' has a wrong offset!");
static_assert(offsetof(ABP_UIShop3DManager_C, ViewModeZoom) == 0x0002D8, "Member 'ABP_UIShop3DManager_C::ViewModeZoom' has a wrong offset!");
static_assert(offsetof(ABP_UIShop3DManager_C, ViewModeScreenLocationX) == 0x0002DC, "Member 'ABP_UIShop3DManager_C::ViewModeScreenLocationX' has a wrong offset!");
static_assert(offsetof(ABP_UIShop3DManager_C, ViewModeScreenLocationY) == 0x0002E0, "Member 'ABP_UIShop3DManager_C::ViewModeScreenLocationY' has a wrong offset!");
static_assert(offsetof(ABP_UIShop3DManager_C, ViewModeSetting) == 0x0002E4, "Member 'ABP_UIShop3DManager_C::ViewModeSetting' has a wrong offset!");

}

