#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_UV_Party_Categorybase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_UI_UV_Party_Categorybase.BP_UI_UV_Party_Categorybase_C.UI_UV_Party_Categorybase
// 0x0040 (0x0040 - 0x0000)
struct BP_UI_UV_Party_Categorybase_C_UI_UV_Party_Categorybase final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57BD[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI_UV_Party_Categorybase_C_UI_UV_Party_Categorybase) == 0x000008, "Wrong alignment on BP_UI_UV_Party_Categorybase_C_UI_UV_Party_Categorybase");
static_assert(sizeof(BP_UI_UV_Party_Categorybase_C_UI_UV_Party_Categorybase) == 0x000040, "Wrong size on BP_UI_UV_Party_Categorybase_C_UI_UV_Party_Categorybase");
static_assert(offsetof(BP_UI_UV_Party_Categorybase_C_UI_UV_Party_Categorybase, WorldContext) == 0x000000, "Member 'BP_UI_UV_Party_Categorybase_C_UI_UV_Party_Categorybase::WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UI_UV_Party_Categorybase_C_UI_UV_Party_Categorybase, Image) == 0x000008, "Member 'BP_UI_UV_Party_Categorybase_C_UI_UV_Party_Categorybase::Image' has a wrong offset!");
static_assert(offsetof(BP_UI_UV_Party_Categorybase_C_UI_UV_Party_Categorybase, Param_Index) == 0x000010, "Member 'BP_UI_UV_Party_Categorybase_C_UI_UV_Party_Categorybase::Param_Index' has a wrong offset!");
static_assert(offsetof(BP_UI_UV_Party_Categorybase_C_UI_UV_Party_Categorybase, __WorldContext) == 0x000018, "Member 'BP_UI_UV_Party_Categorybase_C_UI_UV_Party_Categorybase::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UI_UV_Party_Categorybase_C_UI_UV_Party_Categorybase, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'BP_UI_UV_Party_Categorybase_C_UI_UV_Party_Categorybase::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_UV_Party_Categorybase_C_UI_UV_Party_Categorybase, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000028, "Member 'BP_UI_UV_Party_Categorybase_C_UI_UV_Party_Categorybase::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_UV_Party_Categorybase_C_UI_UV_Party_Categorybase, CallFunc_Add_FloatFloat_ReturnValue) == 0x00002C, "Member 'BP_UI_UV_Party_Categorybase_C_UI_UV_Party_Categorybase::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_UV_Party_Categorybase_C_UI_UV_Party_Categorybase, K2Node_MakeStruct_LinearColor) == 0x000030, "Member 'BP_UI_UV_Party_Categorybase_C_UI_UV_Party_Categorybase::K2Node_MakeStruct_LinearColor' has a wrong offset!");

}

