#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ui_SceneWorldMap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ui_SceneWorldMap.BP_ui_SceneWorldMap_C
// 0x01C8 (0x03F8 - 0x0230)
class ABP_ui_SceneWorldMap_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   LC20_Icon;                                         // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC20_Point;                                        // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC19_Icon;                                         // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC19_Point;                                        // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC17_Point;                                        // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC17_Icon;                                         // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC15_Icon;                                         // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC15_Point;                                        // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC13_Icon;                                         // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC13_Point;                                        // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC10_Icon;                                         // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC10_Point;                                        // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC09_Icon;                                         // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC09_Point;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC08_Point;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC08_Icon;                                         // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC07_Point;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC07_Icon;                                         // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC06_Point;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC06_Icon;                                         // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             DirectionalLight;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BG;                                                // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Angle_Scene;                                       // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Point_Scene;                                       // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               Camera;                                            // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Lc20;                                              // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Lc19;                                              // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Lc17;                                              // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Lc15;                                              // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC13;                                              // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC10;                                              // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC09;                                              // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC08;                                              // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC07;                                              // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC06;                                              // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LC01;                                              // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           LocationList;                                      // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	float                                         Length;                                            // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Angle;                                             // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetPosition;                                    // 0x0378(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraPosition;                                    // 0x0384(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           IconList;                                          // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         SelectIndex;                                       // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A48[0x4];                                     // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            MoveCurve;                                         // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraStartPosition;                               // 0x03B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraGoarlPosition;                               // 0x03BC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraTimer;                                       // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraMoveTime;                                    // 0x03CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentIndex;                                      // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A49[0x4];                                     // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        LocationTrans;                                     // 0x03D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         UnSelectAlpha;                                     // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UnSelectEmissive;                                  // 0x03EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UnSelectGravityMov2PFly;                           // 0x03F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ui_SceneWorldMap(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void SetupLocationList();
	void SetTarget(class FName Param_Name, bool IsDirect);
	void MoveCamera(float DeltaSeconds);
	void UpdateCamera();
	void SetCurrentLocation(class FName Param_Name);
	void SetLocationVisible(class FName LocationName, bool IsVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ui_SceneWorldMap_C">();
	}
	static class ABP_ui_SceneWorldMap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ui_SceneWorldMap_C>();
	}
};
static_assert(alignof(ABP_ui_SceneWorldMap_C) == 0x000008, "Wrong alignment on ABP_ui_SceneWorldMap_C");
static_assert(sizeof(ABP_ui_SceneWorldMap_C) == 0x0003F8, "Wrong size on ABP_ui_SceneWorldMap_C");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, UberGraphFrame) == 0x000230, "Member 'ABP_ui_SceneWorldMap_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC20_Icon) == 0x000238, "Member 'ABP_ui_SceneWorldMap_C::LC20_Icon' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC20_Point) == 0x000240, "Member 'ABP_ui_SceneWorldMap_C::LC20_Point' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC19_Icon) == 0x000248, "Member 'ABP_ui_SceneWorldMap_C::LC19_Icon' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC19_Point) == 0x000250, "Member 'ABP_ui_SceneWorldMap_C::LC19_Point' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC17_Point) == 0x000258, "Member 'ABP_ui_SceneWorldMap_C::LC17_Point' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC17_Icon) == 0x000260, "Member 'ABP_ui_SceneWorldMap_C::LC17_Icon' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC15_Icon) == 0x000268, "Member 'ABP_ui_SceneWorldMap_C::LC15_Icon' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC15_Point) == 0x000270, "Member 'ABP_ui_SceneWorldMap_C::LC15_Point' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC13_Icon) == 0x000278, "Member 'ABP_ui_SceneWorldMap_C::LC13_Icon' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC13_Point) == 0x000280, "Member 'ABP_ui_SceneWorldMap_C::LC13_Point' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC10_Icon) == 0x000288, "Member 'ABP_ui_SceneWorldMap_C::LC10_Icon' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC10_Point) == 0x000290, "Member 'ABP_ui_SceneWorldMap_C::LC10_Point' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC09_Icon) == 0x000298, "Member 'ABP_ui_SceneWorldMap_C::LC09_Icon' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC09_Point) == 0x0002A0, "Member 'ABP_ui_SceneWorldMap_C::LC09_Point' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC08_Point) == 0x0002A8, "Member 'ABP_ui_SceneWorldMap_C::LC08_Point' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC08_Icon) == 0x0002B0, "Member 'ABP_ui_SceneWorldMap_C::LC08_Icon' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC07_Point) == 0x0002B8, "Member 'ABP_ui_SceneWorldMap_C::LC07_Point' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC07_Icon) == 0x0002C0, "Member 'ABP_ui_SceneWorldMap_C::LC07_Icon' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC06_Point) == 0x0002C8, "Member 'ABP_ui_SceneWorldMap_C::LC06_Point' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC06_Icon) == 0x0002D0, "Member 'ABP_ui_SceneWorldMap_C::LC06_Icon' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, DirectionalLight) == 0x0002D8, "Member 'ABP_ui_SceneWorldMap_C::DirectionalLight' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, BG) == 0x0002E0, "Member 'ABP_ui_SceneWorldMap_C::BG' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, Angle_Scene) == 0x0002E8, "Member 'ABP_ui_SceneWorldMap_C::Angle_Scene' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, Point_Scene) == 0x0002F0, "Member 'ABP_ui_SceneWorldMap_C::Point_Scene' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, Camera) == 0x0002F8, "Member 'ABP_ui_SceneWorldMap_C::Camera' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, Lc20) == 0x000300, "Member 'ABP_ui_SceneWorldMap_C::Lc20' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, Lc19) == 0x000308, "Member 'ABP_ui_SceneWorldMap_C::Lc19' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, Lc17) == 0x000310, "Member 'ABP_ui_SceneWorldMap_C::Lc17' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, Lc15) == 0x000318, "Member 'ABP_ui_SceneWorldMap_C::Lc15' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC13) == 0x000320, "Member 'ABP_ui_SceneWorldMap_C::LC13' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC10) == 0x000328, "Member 'ABP_ui_SceneWorldMap_C::LC10' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC09) == 0x000330, "Member 'ABP_ui_SceneWorldMap_C::LC09' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC08) == 0x000338, "Member 'ABP_ui_SceneWorldMap_C::LC08' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC07) == 0x000340, "Member 'ABP_ui_SceneWorldMap_C::LC07' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC06) == 0x000348, "Member 'ABP_ui_SceneWorldMap_C::LC06' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LC01) == 0x000350, "Member 'ABP_ui_SceneWorldMap_C::LC01' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, DefaultSceneRoot) == 0x000358, "Member 'ABP_ui_SceneWorldMap_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LocationList) == 0x000360, "Member 'ABP_ui_SceneWorldMap_C::LocationList' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, Length) == 0x000370, "Member 'ABP_ui_SceneWorldMap_C::Length' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, Angle) == 0x000374, "Member 'ABP_ui_SceneWorldMap_C::Angle' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, TargetPosition) == 0x000378, "Member 'ABP_ui_SceneWorldMap_C::TargetPosition' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, CameraPosition) == 0x000384, "Member 'ABP_ui_SceneWorldMap_C::CameraPosition' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, IconList) == 0x000390, "Member 'ABP_ui_SceneWorldMap_C::IconList' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, SelectIndex) == 0x0003A0, "Member 'ABP_ui_SceneWorldMap_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, MoveCurve) == 0x0003A8, "Member 'ABP_ui_SceneWorldMap_C::MoveCurve' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, CameraStartPosition) == 0x0003B0, "Member 'ABP_ui_SceneWorldMap_C::CameraStartPosition' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, CameraGoarlPosition) == 0x0003BC, "Member 'ABP_ui_SceneWorldMap_C::CameraGoarlPosition' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, CameraTimer) == 0x0003C8, "Member 'ABP_ui_SceneWorldMap_C::CameraTimer' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, CameraMoveTime) == 0x0003CC, "Member 'ABP_ui_SceneWorldMap_C::CameraMoveTime' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, CurrentIndex) == 0x0003D0, "Member 'ABP_ui_SceneWorldMap_C::CurrentIndex' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, LocationTrans) == 0x0003D8, "Member 'ABP_ui_SceneWorldMap_C::LocationTrans' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, UnSelectAlpha) == 0x0003E8, "Member 'ABP_ui_SceneWorldMap_C::UnSelectAlpha' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, UnSelectEmissive) == 0x0003EC, "Member 'ABP_ui_SceneWorldMap_C::UnSelectEmissive' has a wrong offset!");
static_assert(offsetof(ABP_ui_SceneWorldMap_C, UnSelectGravityMov2PFly) == 0x0003F0, "Member 'ABP_ui_SceneWorldMap_C::UnSelectGravityMov2PFly' has a wrong offset!");

}

