#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ui_color_shop_1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BP_ui_color_shop_1.BP_ui_color_shop_1_C.UI_GetArrayColor_Shop_Frame_1
// 0x0078 (0x0078 - 0x0000)
struct BP_ui_color_shop_1_C_UI_GetArrayColor_Shop_Frame_1 final
{
public:
	EItemRarity                                   Rarity;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47DB[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           UI_ColorArray_Shop_Frame_1;                        // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47DC[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_2;                   // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_3;                   // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_4;                   // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_color_shop_1_C_UI_GetArrayColor_Shop_Frame_1) == 0x000008, "Wrong alignment on BP_ui_color_shop_1_C_UI_GetArrayColor_Shop_Frame_1");
static_assert(sizeof(BP_ui_color_shop_1_C_UI_GetArrayColor_Shop_Frame_1) == 0x000078, "Wrong size on BP_ui_color_shop_1_C_UI_GetArrayColor_Shop_Frame_1");
static_assert(offsetof(BP_ui_color_shop_1_C_UI_GetArrayColor_Shop_Frame_1, Rarity) == 0x000000, "Member 'BP_ui_color_shop_1_C_UI_GetArrayColor_Shop_Frame_1::Rarity' has a wrong offset!");
static_assert(offsetof(BP_ui_color_shop_1_C_UI_GetArrayColor_Shop_Frame_1, __WorldContext) == 0x000008, "Member 'BP_ui_color_shop_1_C_UI_GetArrayColor_Shop_Frame_1::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_ui_color_shop_1_C_UI_GetArrayColor_Shop_Frame_1, UI_ColorArray_Shop_Frame_1) == 0x000010, "Member 'BP_ui_color_shop_1_C_UI_GetArrayColor_Shop_Frame_1::UI_ColorArray_Shop_Frame_1' has a wrong offset!");
static_assert(offsetof(BP_ui_color_shop_1_C_UI_GetArrayColor_Shop_Frame_1, K2Node_MakeStruct_LinearColor) == 0x000020, "Member 'BP_ui_color_shop_1_C_UI_GetArrayColor_Shop_Frame_1::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(BP_ui_color_shop_1_C_UI_GetArrayColor_Shop_Frame_1, K2Node_SwitchEnum_CmpSuccess) == 0x000030, "Member 'BP_ui_color_shop_1_C_UI_GetArrayColor_Shop_Frame_1::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ui_color_shop_1_C_UI_GetArrayColor_Shop_Frame_1, K2Node_MakeStruct_LinearColor_1) == 0x000034, "Member 'BP_ui_color_shop_1_C_UI_GetArrayColor_Shop_Frame_1::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(BP_ui_color_shop_1_C_UI_GetArrayColor_Shop_Frame_1, K2Node_MakeStruct_LinearColor_2) == 0x000044, "Member 'BP_ui_color_shop_1_C_UI_GetArrayColor_Shop_Frame_1::K2Node_MakeStruct_LinearColor_2' has a wrong offset!");
static_assert(offsetof(BP_ui_color_shop_1_C_UI_GetArrayColor_Shop_Frame_1, K2Node_MakeStruct_LinearColor_3) == 0x000054, "Member 'BP_ui_color_shop_1_C_UI_GetArrayColor_Shop_Frame_1::K2Node_MakeStruct_LinearColor_3' has a wrong offset!");
static_assert(offsetof(BP_ui_color_shop_1_C_UI_GetArrayColor_Shop_Frame_1, K2Node_MakeStruct_LinearColor_4) == 0x000064, "Member 'BP_ui_color_shop_1_C_UI_GetArrayColor_Shop_Frame_1::K2Node_MakeStruct_LinearColor_4' has a wrong offset!");

}

