#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ui_UV_Status_1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ui_UV_Status_1.BP_ui_UV_Status_1_C.UI_SetIcon_Status_1
// 0x0038 (0x0038 - 0x0000)
struct BP_ui_UV_Status_1_C_UI_SetIcon_Status_1 final
{
public:
	class UImage*                                 Image;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5013[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         U;                                                 // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5014[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_UV_Status_1_C_UI_SetIcon_Status_1) == 0x000008, "Wrong alignment on BP_ui_UV_Status_1_C_UI_SetIcon_Status_1");
static_assert(sizeof(BP_ui_UV_Status_1_C_UI_SetIcon_Status_1) == 0x000038, "Wrong size on BP_ui_UV_Status_1_C_UI_SetIcon_Status_1");
static_assert(offsetof(BP_ui_UV_Status_1_C_UI_SetIcon_Status_1, Image) == 0x000000, "Member 'BP_ui_UV_Status_1_C_UI_SetIcon_Status_1::Image' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_Status_1_C_UI_SetIcon_Status_1, Param_Index) == 0x000008, "Member 'BP_ui_UV_Status_1_C_UI_SetIcon_Status_1::Param_Index' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_Status_1_C_UI_SetIcon_Status_1, __WorldContext) == 0x000010, "Member 'BP_ui_UV_Status_1_C_UI_SetIcon_Status_1::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_Status_1_C_UI_SetIcon_Status_1, U) == 0x000018, "Member 'BP_ui_UV_Status_1_C_UI_SetIcon_Status_1::U' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_Status_1_C_UI_SetIcon_Status_1, K2Node_SwitchInteger_CmpSuccess) == 0x00001C, "Member 'BP_ui_UV_Status_1_C_UI_SetIcon_Status_1::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_Status_1_C_UI_SetIcon_Status_1, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'BP_ui_UV_Status_1_C_UI_SetIcon_Status_1::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_Status_1_C_UI_SetIcon_Status_1, K2Node_MakeStruct_LinearColor) == 0x000028, "Member 'BP_ui_UV_Status_1_C_UI_SetIcon_Status_1::K2Node_MakeStruct_LinearColor' has a wrong offset!");

}

