#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ui_Scene_Detailmap

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ui_Scene_Detailmap.BP_ui_Scene_Detailmap_C.ExecuteUbergraph_BP_ui_Scene_Detailmap
// 0x0008 (0x0008 - 0x0000)
struct BP_ui_Scene_Detailmap_C_ExecuteUbergraph_BP_ui_Scene_Detailmap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_Scene_Detailmap_C_ExecuteUbergraph_BP_ui_Scene_Detailmap) == 0x000004, "Wrong alignment on BP_ui_Scene_Detailmap_C_ExecuteUbergraph_BP_ui_Scene_Detailmap");
static_assert(sizeof(BP_ui_Scene_Detailmap_C_ExecuteUbergraph_BP_ui_Scene_Detailmap) == 0x000008, "Wrong size on BP_ui_Scene_Detailmap_C_ExecuteUbergraph_BP_ui_Scene_Detailmap");
static_assert(offsetof(BP_ui_Scene_Detailmap_C_ExecuteUbergraph_BP_ui_Scene_Detailmap, EntryPoint) == 0x000000, "Member 'BP_ui_Scene_Detailmap_C_ExecuteUbergraph_BP_ui_Scene_Detailmap::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ui_Scene_Detailmap_C_ExecuteUbergraph_BP_ui_Scene_Detailmap, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_ui_Scene_Detailmap_C_ExecuteUbergraph_BP_ui_Scene_Detailmap::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_ui_Scene_Detailmap.BP_ui_Scene_Detailmap_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ui_Scene_Detailmap_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_Scene_Detailmap_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ui_Scene_Detailmap_C_ReceiveTick");
static_assert(sizeof(BP_ui_Scene_Detailmap_C_ReceiveTick) == 0x000004, "Wrong size on BP_ui_Scene_Detailmap_C_ReceiveTick");
static_assert(offsetof(BP_ui_Scene_Detailmap_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ui_Scene_Detailmap_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ui_Scene_Detailmap.BP_ui_Scene_Detailmap_C.Set Texture Render
// 0x0008 (0x0008 - 0x0000)
struct BP_ui_Scene_Detailmap_C_Set_Texture_Render final
{
public:
	class UTextureRenderTarget2D*                 TargetTexture;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_Scene_Detailmap_C_Set_Texture_Render) == 0x000008, "Wrong alignment on BP_ui_Scene_Detailmap_C_Set_Texture_Render");
static_assert(sizeof(BP_ui_Scene_Detailmap_C_Set_Texture_Render) == 0x000008, "Wrong size on BP_ui_Scene_Detailmap_C_Set_Texture_Render");
static_assert(offsetof(BP_ui_Scene_Detailmap_C_Set_Texture_Render, TargetTexture) == 0x000000, "Member 'BP_ui_Scene_Detailmap_C_Set_Texture_Render::TargetTexture' has a wrong offset!");

}

