#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ui_UV_Action_State

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ui_UV_Action_State.BP_ui_UV_Action_State_C.UI_SetThumbnail_Action_State
// 0x0038 (0x0038 - 0x0000)
struct BP_ui_UV_Action_State_C_UI_SetThumbnail_Action_State final
{
public:
	class UImage*                                 Image;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsQuestActive;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsActive;                                          // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38CF[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         R;                                                 // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         V;                                                 // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_UV_Action_State_C_UI_SetThumbnail_Action_State) == 0x000008, "Wrong alignment on BP_ui_UV_Action_State_C_UI_SetThumbnail_Action_State");
static_assert(sizeof(BP_ui_UV_Action_State_C_UI_SetThumbnail_Action_State) == 0x000038, "Wrong size on BP_ui_UV_Action_State_C_UI_SetThumbnail_Action_State");
static_assert(offsetof(BP_ui_UV_Action_State_C_UI_SetThumbnail_Action_State, Image) == 0x000000, "Member 'BP_ui_UV_Action_State_C_UI_SetThumbnail_Action_State::Image' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_Action_State_C_UI_SetThumbnail_Action_State, IsQuestActive) == 0x000008, "Member 'BP_ui_UV_Action_State_C_UI_SetThumbnail_Action_State::IsQuestActive' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_Action_State_C_UI_SetThumbnail_Action_State, IsActive) == 0x000009, "Member 'BP_ui_UV_Action_State_C_UI_SetThumbnail_Action_State::IsActive' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_Action_State_C_UI_SetThumbnail_Action_State, __WorldContext) == 0x000010, "Member 'BP_ui_UV_Action_State_C_UI_SetThumbnail_Action_State::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_Action_State_C_UI_SetThumbnail_Action_State, R) == 0x000018, "Member 'BP_ui_UV_Action_State_C_UI_SetThumbnail_Action_State::R' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_Action_State_C_UI_SetThumbnail_Action_State, V) == 0x00001C, "Member 'BP_ui_UV_Action_State_C_UI_SetThumbnail_Action_State::V' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_Action_State_C_UI_SetThumbnail_Action_State, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'BP_ui_UV_Action_State_C_UI_SetThumbnail_Action_State::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_Action_State_C_UI_SetThumbnail_Action_State, K2Node_MakeStruct_LinearColor) == 0x000028, "Member 'BP_ui_UV_Action_State_C_UI_SetThumbnail_Action_State::K2Node_MakeStruct_LinearColor' has a wrong offset!");

}

