#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ui_UV_Sas_Guage_r

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ui_UV_Sas_Guage_r.BP_ui_UV_Sas_Guage_r_C.UI_SetArrayColor_Sas_Gauge_r
// 0x0040 (0x0040 - 0x0000)
struct BP_ui_UV_Sas_Guage_r_C_UI_SetArrayColor_Sas_Gauge_r final
{
public:
	class UImage*                                 Image;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4ECC[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         B;                                                 // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         G;                                                 // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         R;                                                 // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4ECD[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_UV_Sas_Guage_r_C_UI_SetArrayColor_Sas_Gauge_r) == 0x000008, "Wrong alignment on BP_ui_UV_Sas_Guage_r_C_UI_SetArrayColor_Sas_Gauge_r");
static_assert(sizeof(BP_ui_UV_Sas_Guage_r_C_UI_SetArrayColor_Sas_Gauge_r) == 0x000040, "Wrong size on BP_ui_UV_Sas_Guage_r_C_UI_SetArrayColor_Sas_Gauge_r");
static_assert(offsetof(BP_ui_UV_Sas_Guage_r_C_UI_SetArrayColor_Sas_Gauge_r, Image) == 0x000000, "Member 'BP_ui_UV_Sas_Guage_r_C_UI_SetArrayColor_Sas_Gauge_r::Image' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_Sas_Guage_r_C_UI_SetArrayColor_Sas_Gauge_r, Param_Index) == 0x000008, "Member 'BP_ui_UV_Sas_Guage_r_C_UI_SetArrayColor_Sas_Gauge_r::Param_Index' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_Sas_Guage_r_C_UI_SetArrayColor_Sas_Gauge_r, __WorldContext) == 0x000010, "Member 'BP_ui_UV_Sas_Guage_r_C_UI_SetArrayColor_Sas_Gauge_r::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_Sas_Guage_r_C_UI_SetArrayColor_Sas_Gauge_r, B) == 0x000018, "Member 'BP_ui_UV_Sas_Guage_r_C_UI_SetArrayColor_Sas_Gauge_r::B' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_Sas_Guage_r_C_UI_SetArrayColor_Sas_Gauge_r, G) == 0x00001C, "Member 'BP_ui_UV_Sas_Guage_r_C_UI_SetArrayColor_Sas_Gauge_r::G' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_Sas_Guage_r_C_UI_SetArrayColor_Sas_Gauge_r, R) == 0x000020, "Member 'BP_ui_UV_Sas_Guage_r_C_UI_SetArrayColor_Sas_Gauge_r::R' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_Sas_Guage_r_C_UI_SetArrayColor_Sas_Gauge_r, K2Node_SwitchInteger_CmpSuccess) == 0x000024, "Member 'BP_ui_UV_Sas_Guage_r_C_UI_SetArrayColor_Sas_Gauge_r::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_Sas_Guage_r_C_UI_SetArrayColor_Sas_Gauge_r, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000028, "Member 'BP_ui_UV_Sas_Guage_r_C_UI_SetArrayColor_Sas_Gauge_r::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_Sas_Guage_r_C_UI_SetArrayColor_Sas_Gauge_r, K2Node_MakeStruct_LinearColor) == 0x000030, "Member 'BP_ui_UV_Sas_Guage_r_C_UI_SetArrayColor_Sas_Gauge_r::K2Node_MakeStruct_LinearColor' has a wrong offset!");

}

