#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI3DBGBase

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_UI3DBGBase.BP_UI3DBGBase_C.ExecuteUbergraph_BP_UI3DBGBase
// 0x002C (0x002C - 0x0000)
struct BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42BA[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42BB[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42BC[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldNormalDeltaSeconds_ReturnValue;   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase) == 0x000004, "Wrong alignment on BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase");
static_assert(sizeof(BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase) == 0x00002C, "Wrong size on BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase");
static_assert(offsetof(BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase, EntryPoint) == 0x000000, "Member 'BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase, Temp_int_Loop_Num_Variable) == 0x000014, "Member 'BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase, Temp_bool_IsClosed_Variable) == 0x000020, "Member 'BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase, CallFunc_GetWorldNormalDeltaSeconds_ReturnValue) == 0x000028, "Member 'BP_UI3DBGBase_C_ExecuteUbergraph_BP_UI3DBGBase::CallFunc_GetWorldNormalDeltaSeconds_ReturnValue' has a wrong offset!");

// Function BP_UI3DBGBase.BP_UI3DBGBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_UI3DBGBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI3DBGBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_UI3DBGBase_C_ReceiveTick");
static_assert(sizeof(BP_UI3DBGBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_UI3DBGBase_C_ReceiveTick");
static_assert(offsetof(BP_UI3DBGBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_UI3DBGBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_UI3DBGBase.BP_UI3DBGBase_C.End
// 0x0028 (0x0028 - 0x0000)
struct BP_UI3DBGBase_C_End final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42BD[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42BE[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI3DBGBase_C_End) == 0x000008, "Wrong alignment on BP_UI3DBGBase_C_End");
static_assert(sizeof(BP_UI3DBGBase_C_End) == 0x000028, "Wrong size on BP_UI3DBGBase_C_End");
static_assert(offsetof(BP_UI3DBGBase_C_End, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_UI3DBGBase_C_End::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_End, Temp_int_Loop_Num_Variable) == 0x000004, "Member 'BP_UI3DBGBase_C_End::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_End, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_UI3DBGBase_C_End::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_End, CallFunc_Less_IntInt_ReturnValue) == 0x00000C, "Member 'BP_UI3DBGBase_C_End::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_End, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_UI3DBGBase_C_End::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_End, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'BP_UI3DBGBase_C_End::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_End, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_UI3DBGBase_C_End::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function BP_UI3DBGBase.BP_UI3DBGBase_C.PrivateStartVisible
// 0x0048 (0x0048 - 0x0000)
struct BP_UI3DBGBase_C_PrivateStartVisible final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidUseLevelCamera_Valid;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42BF[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCelLookLightDirection_ReturnValue;     // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42C0[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C1[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI3DBGBase_C_PrivateStartVisible) == 0x000008, "Wrong alignment on BP_UI3DBGBase_C_PrivateStartVisible");
static_assert(sizeof(BP_UI3DBGBase_C_PrivateStartVisible) == 0x000048, "Wrong size on BP_UI3DBGBase_C_PrivateStartVisible");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateStartVisible, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_UI3DBGBase_C_PrivateStartVisible::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateStartVisible, Temp_int_Loop_Num_Variable) == 0x000004, "Member 'BP_UI3DBGBase_C_PrivateStartVisible::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateStartVisible, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_UI3DBGBase_C_PrivateStartVisible::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateStartVisible, CallFunc_IsValidUseLevelCamera_Valid) == 0x000010, "Member 'BP_UI3DBGBase_C_PrivateStartVisible::CallFunc_IsValidUseLevelCamera_Valid' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateStartVisible, CallFunc_GetCelLookLightDirection_ReturnValue) == 0x000014, "Member 'BP_UI3DBGBase_C_PrivateStartVisible::CallFunc_GetCelLookLightDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateStartVisible, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_UI3DBGBase_C_PrivateStartVisible::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateStartVisible, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'BP_UI3DBGBase_C_PrivateStartVisible::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateStartVisible, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_UI3DBGBase_C_PrivateStartVisible::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateStartVisible, CallFunc_GetPlayerController_ReturnValue_1) == 0x000030, "Member 'BP_UI3DBGBase_C_PrivateStartVisible::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateStartVisible, CallFunc_GetViewTarget_ReturnValue) == 0x000038, "Member 'BP_UI3DBGBase_C_PrivateStartVisible::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateStartVisible, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_UI3DBGBase_C_PrivateStartVisible::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function BP_UI3DBGBase.BP_UI3DBGBase_C.SetCameraParameter
// 0x0020 (0x0020 - 0x0000)
struct BP_UI3DBGBase_C_SetCameraParameter final
{
public:
	struct FUIMain3DBGCameraSetting               CameraSetting;                                     // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_UI3DBGBase_C_SetCameraParameter) == 0x000004, "Wrong alignment on BP_UI3DBGBase_C_SetCameraParameter");
static_assert(sizeof(BP_UI3DBGBase_C_SetCameraParameter) == 0x000020, "Wrong size on BP_UI3DBGBase_C_SetCameraParameter");
static_assert(offsetof(BP_UI3DBGBase_C_SetCameraParameter, CameraSetting) == 0x000000, "Member 'BP_UI3DBGBase_C_SetCameraParameter::CameraSetting' has a wrong offset!");

// Function BP_UI3DBGBase.BP_UI3DBGBase_C.PrivateTickBGCamera
// 0x0120 (0x0120 - 0x0000)
struct BP_UI3DBGBase_C_PrivateTickBGCamera final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidUseLevelCamera_Valid;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42C2[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C3[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x007C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI3DBGBase_C_PrivateTickBGCamera) == 0x000010, "Wrong alignment on BP_UI3DBGBase_C_PrivateTickBGCamera");
static_assert(sizeof(BP_UI3DBGBase_C_PrivateTickBGCamera) == 0x000120, "Wrong size on BP_UI3DBGBase_C_PrivateTickBGCamera");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateTickBGCamera, DeltaSeconds) == 0x000000, "Member 'BP_UI3DBGBase_C_PrivateTickBGCamera::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateTickBGCamera, Location) == 0x000004, "Member 'BP_UI3DBGBase_C_PrivateTickBGCamera::Location' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateTickBGCamera, CallFunc_IsValidUseLevelCamera_Valid) == 0x000010, "Member 'BP_UI3DBGBase_C_PrivateTickBGCamera::CallFunc_IsValidUseLevelCamera_Valid' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateTickBGCamera, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_UI3DBGBase_C_PrivateTickBGCamera::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateTickBGCamera, CallFunc_MakeRotator_ReturnValue) == 0x000018, "Member 'BP_UI3DBGBase_C_PrivateTickBGCamera::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateTickBGCamera, CallFunc_FindLookAtRotation_ReturnValue) == 0x000024, "Member 'BP_UI3DBGBase_C_PrivateTickBGCamera::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateTickBGCamera, CallFunc_GetForwardVector_ReturnValue) == 0x000030, "Member 'BP_UI3DBGBase_C_PrivateTickBGCamera::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateTickBGCamera, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'BP_UI3DBGBase_C_PrivateTickBGCamera::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateTickBGCamera, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000070, "Member 'BP_UI3DBGBase_C_PrivateTickBGCamera::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateTickBGCamera, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x00007C, "Member 'BP_UI3DBGBase_C_PrivateTickBGCamera::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateTickBGCamera, CallFunc_Add_VectorVector_ReturnValue) == 0x000104, "Member 'BP_UI3DBGBase_C_PrivateTickBGCamera::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateTickBGCamera, CallFunc_Add_FloatFloat_ReturnValue) == 0x000110, "Member 'BP_UI3DBGBase_C_PrivateTickBGCamera::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_UI3DBGBase.BP_UI3DBGBase_C.PrivateBGLevelLoadEnd
// 0x00C0 (0x00C0 - 0x0000)
struct BP_UI3DBGBase_C_PrivateBGLevelLoadEnd final
{
public:
	class AActor*                                 BGActor;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPrimitiveComponent*>            Components;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_2;                      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42C4[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42C5[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42C6[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C7[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraActor*                           K2Node_DynamicCast_AsCamera_Actor;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42C8[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class ADirectionalLight*                      K2Node_DynamicCast_AsDirectional_Light;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42C9[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42CA[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetActorsFromLevelStreaming_ReturnValue;  // 0x00A0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42CB[0x2];                                     // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd) == 0x000008, "Wrong alignment on BP_UI3DBGBase_C_PrivateBGLevelLoadEnd");
static_assert(sizeof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd) == 0x0000C0, "Wrong size on BP_UI3DBGBase_C_PrivateBGLevelLoadEnd");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, BGActor) == 0x000000, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::BGActor' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, Components) == 0x000008, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::Components' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, Temp_int_Loop_Num_Variable) == 0x000020, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, Temp_int_Loop_Num_Variable_1) == 0x000024, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, Temp_int_Array_Index_Variable_2) == 0x000030, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, Temp_int_Loop_Num_Variable_2) == 0x000034, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::Temp_int_Loop_Num_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, Temp_int_Loop_Counter_Variable_1) == 0x00003C, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, Temp_int_Loop_Counter_Variable_2) == 0x000040, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, CallFunc_Less_IntInt_ReturnValue_1) == 0x000044, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, CallFunc_Add_IntInt_ReturnValue_1) == 0x000048, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, CallFunc_Less_IntInt_ReturnValue_2) == 0x00004C, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, CallFunc_Add_IntInt_ReturnValue_2) == 0x000050, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, K2Node_DynamicCast_AsCamera_Actor) == 0x000058, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::K2Node_DynamicCast_AsCamera_Actor' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000068, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, K2Node_DynamicCast_AsDirectional_Light) == 0x000078, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::K2Node_DynamicCast_AsDirectional_Light' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, CallFunc_GetActorForwardVector_ReturnValue) == 0x000084, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, Temp_int_Variable) == 0x000094, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, CallFunc_Array_Length_ReturnValue_1) == 0x000098, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, CallFunc_GetActorsFromLevelStreaming_ReturnValue) == 0x0000A0, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::CallFunc_GetActorsFromLevelStreaming_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, CallFunc_Array_Length_ReturnValue_2) == 0x0000B0, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, CallFunc_Array_Length_ReturnValue_3) == 0x0000B4, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000B9, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateBGLevelLoadEnd, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000BC, "Member 'BP_UI3DBGBase_C_PrivateBGLevelLoadEnd::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");

// Function BP_UI3DBGBase.BP_UI3DBGBase_C.PrivateLevelLoad
// 0x0088 (0x0088 - 0x0000)
struct BP_UI3DBGBase_C_PrivateLevelLoad final
{
public:
	class ULevelStreaming*                        LoadedLevel;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 LevelName;                                         // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class ULevelStreamingDynamic*                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42CC[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42CD[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadLevelInstance_bOutSuccess;            // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42CE[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreamingDynamic*                 CallFunc_LoadLevelInstance_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI3DBGBase_C_PrivateLevelLoad) == 0x000008, "Wrong alignment on BP_UI3DBGBase_C_PrivateLevelLoad");
static_assert(sizeof(BP_UI3DBGBase_C_PrivateLevelLoad) == 0x000088, "Wrong size on BP_UI3DBGBase_C_PrivateLevelLoad");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateLevelLoad, LoadedLevel) == 0x000000, "Member 'BP_UI3DBGBase_C_PrivateLevelLoad::LoadedLevel' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateLevelLoad, LevelName) == 0x000008, "Member 'BP_UI3DBGBase_C_PrivateLevelLoad::LevelName' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateLevelLoad, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_UI3DBGBase_C_PrivateLevelLoad::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateLevelLoad, Temp_int_Loop_Num_Variable) == 0x00001C, "Member 'BP_UI3DBGBase_C_PrivateLevelLoad::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateLevelLoad, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'BP_UI3DBGBase_C_PrivateLevelLoad::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateLevelLoad, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_UI3DBGBase_C_PrivateLevelLoad::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateLevelLoad, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000038, "Member 'BP_UI3DBGBase_C_PrivateLevelLoad::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateLevelLoad, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'BP_UI3DBGBase_C_PrivateLevelLoad::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateLevelLoad, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_UI3DBGBase_C_PrivateLevelLoad::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateLevelLoad, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_UI3DBGBase_C_PrivateLevelLoad::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateLevelLoad, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'BP_UI3DBGBase_C_PrivateLevelLoad::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateLevelLoad, CallFunc_MakeRotator_ReturnValue) == 0x000058, "Member 'BP_UI3DBGBase_C_PrivateLevelLoad::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateLevelLoad, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'BP_UI3DBGBase_C_PrivateLevelLoad::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateLevelLoad, CallFunc_MakeVector_ReturnValue) == 0x000068, "Member 'BP_UI3DBGBase_C_PrivateLevelLoad::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateLevelLoad, CallFunc_LoadLevelInstance_bOutSuccess) == 0x000074, "Member 'BP_UI3DBGBase_C_PrivateLevelLoad::CallFunc_LoadLevelInstance_bOutSuccess' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateLevelLoad, CallFunc_LoadLevelInstance_ReturnValue) == 0x000078, "Member 'BP_UI3DBGBase_C_PrivateLevelLoad::CallFunc_LoadLevelInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_PrivateLevelLoad, CallFunc_Array_Add_ReturnValue) == 0x000080, "Member 'BP_UI3DBGBase_C_PrivateLevelLoad::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_UI3DBGBase.BP_UI3DBGBase_C.SetCameraAngle
// 0x0004 (0x0004 - 0x0000)
struct BP_UI3DBGBase_C_SetCameraAngle final
{
public:
	float                                         Angle;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI3DBGBase_C_SetCameraAngle) == 0x000004, "Wrong alignment on BP_UI3DBGBase_C_SetCameraAngle");
static_assert(sizeof(BP_UI3DBGBase_C_SetCameraAngle) == 0x000004, "Wrong size on BP_UI3DBGBase_C_SetCameraAngle");
static_assert(offsetof(BP_UI3DBGBase_C_SetCameraAngle, Angle) == 0x000000, "Member 'BP_UI3DBGBase_C_SetCameraAngle::Angle' has a wrong offset!");

// Function BP_UI3DBGBase.BP_UI3DBGBase_C.IsValidUseLevelCamera
// 0x0003 (0x0003 - 0x0000)
struct BP_UI3DBGBase_C_IsValidUseLevelCamera final
{
public:
	bool                                          Valid;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI3DBGBase_C_IsValidUseLevelCamera) == 0x000001, "Wrong alignment on BP_UI3DBGBase_C_IsValidUseLevelCamera");
static_assert(sizeof(BP_UI3DBGBase_C_IsValidUseLevelCamera) == 0x000003, "Wrong size on BP_UI3DBGBase_C_IsValidUseLevelCamera");
static_assert(offsetof(BP_UI3DBGBase_C_IsValidUseLevelCamera, Valid) == 0x000000, "Member 'BP_UI3DBGBase_C_IsValidUseLevelCamera::Valid' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_IsValidUseLevelCamera, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_UI3DBGBase_C_IsValidUseLevelCamera::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_IsValidUseLevelCamera, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'BP_UI3DBGBase_C_IsValidUseLevelCamera::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_UI3DBGBase.BP_UI3DBGBase_C.SetLevelRenderLayer
// 0x00A0 (0x00A0 - 0x0000)
struct BP_UI3DBGBase_C_SetLevelRenderLayer final
{
public:
	uint8                                         RenderLayer;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42CF[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            Components;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	class AActor*                                 BGActor;                                           // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42D0[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_2;                      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42D1[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42D2[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASplineLooperCustom_C*                  K2Node_DynamicCast_AsSpline_Looper_Custom;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42D3[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42D4[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetActorsFromLevelStreaming_ReturnValue;  // 0x0088(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI3DBGBase_C_SetLevelRenderLayer) == 0x000008, "Wrong alignment on BP_UI3DBGBase_C_SetLevelRenderLayer");
static_assert(sizeof(BP_UI3DBGBase_C_SetLevelRenderLayer) == 0x0000A0, "Wrong size on BP_UI3DBGBase_C_SetLevelRenderLayer");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, RenderLayer) == 0x000000, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::RenderLayer' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, Components) == 0x000008, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::Components' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, BGActor) == 0x000018, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::BGActor' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, Temp_int_Loop_Num_Variable) == 0x000020, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, Temp_int_Loop_Num_Variable_1) == 0x000030, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, Temp_int_Array_Index_Variable_1) == 0x000038, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, Temp_int_Loop_Counter_Variable_1) == 0x00003C, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, CallFunc_Add_IntInt_ReturnValue_1) == 0x000040, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, Temp_int_Array_Index_Variable_2) == 0x000044, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, Temp_int_Loop_Num_Variable_2) == 0x000048, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::Temp_int_Loop_Num_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, CallFunc_Less_IntInt_ReturnValue_1) == 0x00004C, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, Temp_int_Loop_Counter_Variable_2) == 0x000050, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, CallFunc_Less_IntInt_ReturnValue_2) == 0x000058, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, CallFunc_Add_IntInt_ReturnValue_2) == 0x00005C, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, K2Node_DynamicCast_AsSpline_Looper_Custom) == 0x000060, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::K2Node_DynamicCast_AsSpline_Looper_Custom' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000070, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, CallFunc_GetActorsFromLevelStreaming_ReturnValue) == 0x000088, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::CallFunc_GetActorsFromLevelStreaming_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, CallFunc_Array_Length_ReturnValue_1) == 0x000098, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_SetLevelRenderLayer, CallFunc_Array_Length_ReturnValue_2) == 0x00009C, "Member 'BP_UI3DBGBase_C_SetLevelRenderLayer::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");

// Function BP_UI3DBGBase.BP_UI3DBGBase_C.UpdateCheckLevelVisible
// 0x001C (0x001C - 0x0000)
struct BP_UI3DBGBase_C_UpdateCheckLevelVisible final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLevelVisible_ReturnValue;               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42D5[0x1];                                     // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetMenu3DBGRenderLayer_RenderLayer;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI3DBGBase_C_UpdateCheckLevelVisible) == 0x000004, "Wrong alignment on BP_UI3DBGBase_C_UpdateCheckLevelVisible");
static_assert(sizeof(BP_UI3DBGBase_C_UpdateCheckLevelVisible) == 0x00001C, "Wrong size on BP_UI3DBGBase_C_UpdateCheckLevelVisible");
static_assert(offsetof(BP_UI3DBGBase_C_UpdateCheckLevelVisible, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_UI3DBGBase_C_UpdateCheckLevelVisible::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_UpdateCheckLevelVisible, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_UI3DBGBase_C_UpdateCheckLevelVisible::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_UpdateCheckLevelVisible, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_UI3DBGBase_C_UpdateCheckLevelVisible::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_UpdateCheckLevelVisible, Temp_int_Loop_Num_Variable) == 0x00000C, "Member 'BP_UI3DBGBase_C_UpdateCheckLevelVisible::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_UpdateCheckLevelVisible, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'BP_UI3DBGBase_C_UpdateCheckLevelVisible::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_UpdateCheckLevelVisible, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_UI3DBGBase_C_UpdateCheckLevelVisible::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3DBGBase_C_UpdateCheckLevelVisible, CallFunc_IsLevelVisible_ReturnValue) == 0x000012, "Member 'BP_UI3DBGBase_C_UpdateCheckLevelVisible::CallFunc_IsLevelVisible_ReturnValue' has a wrong offset!");
