#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ui_UV_minimap_icon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ui_UV_minimap_icon.BP_ui_UV_minimap_icon_C.UI_GetArrayUV_minimap_icon_player
// 0x0058 (0x0058 - 0x0000)
struct BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_player final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      UI_UVArray_minimap_camera;                         // 0x0008(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	TArray<struct FVector2D>                      _ArrayUVminimap_icon_camera;                       // 0x0018(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FVector2D>                      _ArrayUVminimap_icon_player;                       // 0x0028(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FVector2D>                      K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<struct FVector2D>                      K2Node_MakeArray_Array_1;                          // 0x0048(0x0010)(ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_player) == 0x000008, "Wrong alignment on BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_player");
static_assert(sizeof(BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_player) == 0x000058, "Wrong size on BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_player");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_player, __WorldContext) == 0x000000, "Member 'BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_player::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_player, UI_UVArray_minimap_camera) == 0x000008, "Member 'BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_player::UI_UVArray_minimap_camera' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_player, _ArrayUVminimap_icon_camera) == 0x000018, "Member 'BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_player::_ArrayUVminimap_icon_camera' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_player, _ArrayUVminimap_icon_player) == 0x000028, "Member 'BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_player::_ArrayUVminimap_icon_player' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_player, K2Node_MakeArray_Array) == 0x000038, "Member 'BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_player::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_player, K2Node_MakeArray_Array_1) == 0x000048, "Member 'BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_player::K2Node_MakeArray_Array_1' has a wrong offset!");

// Function BP_ui_UV_minimap_icon.BP_ui_UV_minimap_icon_C.UI_SetThumbnail_minimap_icon_player
// 0x0050 (0x0050 - 0x0000)
struct BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_player final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47AA[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      CallFunc_UI_GetArrayUV_minimap_icon_player_UI_UVArray_minimap_camera; // 0x0020(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_player) == 0x000008, "Wrong alignment on BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_player");
static_assert(sizeof(BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_player) == 0x000050, "Wrong size on BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_player");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_player, WorldContext) == 0x000000, "Member 'BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_player::WorldContext' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_player, Image) == 0x000008, "Member 'BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_player::Image' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_player, Param_Index) == 0x000010, "Member 'BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_player::Param_Index' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_player, __WorldContext) == 0x000018, "Member 'BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_player::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_player, CallFunc_UI_GetArrayUV_minimap_icon_player_UI_UVArray_minimap_camera) == 0x000020, "Member 'BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_player::CallFunc_UI_GetArrayUV_minimap_icon_player_UI_UVArray_minimap_camera' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_player, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000030, "Member 'BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_player::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_player, CallFunc_BreakVector2D_X) == 0x000038, "Member 'BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_player::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_player, CallFunc_BreakVector2D_Y) == 0x00003C, "Member 'BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_player::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_player, K2Node_MakeStruct_LinearColor) == 0x000040, "Member 'BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_player::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function BP_ui_UV_minimap_icon.BP_ui_UV_minimap_icon_C.UI_GetArrayUV_minimap_icon_camera
// 0x0038 (0x0038 - 0x0000)
struct BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_camera final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      UI_UVArray_minimap_icon_camera;                    // 0x0008(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	TArray<struct FVector2D>                      _ArrayUVminimap_icon_camera;                       // 0x0018(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FVector2D>                      K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_camera) == 0x000008, "Wrong alignment on BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_camera");
static_assert(sizeof(BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_camera) == 0x000038, "Wrong size on BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_camera");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_camera, __WorldContext) == 0x000000, "Member 'BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_camera::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_camera, UI_UVArray_minimap_icon_camera) == 0x000008, "Member 'BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_camera::UI_UVArray_minimap_icon_camera' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_camera, _ArrayUVminimap_icon_camera) == 0x000018, "Member 'BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_camera::_ArrayUVminimap_icon_camera' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_camera, K2Node_MakeArray_Array) == 0x000028, "Member 'BP_ui_UV_minimap_icon_C_UI_GetArrayUV_minimap_icon_camera::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_ui_UV_minimap_icon.BP_ui_UV_minimap_icon_C.UI_SetThumbnail_minimap_icon_camera
// 0x0050 (0x0050 - 0x0000)
struct BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_camera final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47AB[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      CallFunc_UI_GetArrayUV_minimap_icon_camera_UI_UVArray_minimap_icon_camera; // 0x0020(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_camera) == 0x000008, "Wrong alignment on BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_camera");
static_assert(sizeof(BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_camera) == 0x000050, "Wrong size on BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_camera");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_camera, WorldContext) == 0x000000, "Member 'BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_camera::WorldContext' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_camera, Image) == 0x000008, "Member 'BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_camera::Image' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_camera, Param_Index) == 0x000010, "Member 'BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_camera::Param_Index' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_camera, __WorldContext) == 0x000018, "Member 'BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_camera::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_camera, CallFunc_UI_GetArrayUV_minimap_icon_camera_UI_UVArray_minimap_icon_camera) == 0x000020, "Member 'BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_camera::CallFunc_UI_GetArrayUV_minimap_icon_camera_UI_UVArray_minimap_icon_camera' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_camera, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000030, "Member 'BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_camera::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_camera, CallFunc_BreakVector2D_X) == 0x000038, "Member 'BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_camera::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_camera, CallFunc_BreakVector2D_Y) == 0x00003C, "Member 'BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_camera::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_camera, K2Node_MakeStruct_LinearColor) == 0x000040, "Member 'BP_ui_UV_minimap_icon_C_UI_SetThumbnail_minimap_icon_camera::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function BP_ui_UV_minimap_icon.BP_ui_UV_minimap_icon_C.UI Set Thumbnail Minimap Icon Distance
// 0x0040 (0x0040 - 0x0000)
struct BP_ui_UV_minimap_icon_C_UI_Set_Thumbnail_Minimap_Icon_Distance final
{
public:
	class UImage*                                 Image;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ID;                                                // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47AC[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_UV_minimap_icon_C_UI_Set_Thumbnail_Minimap_Icon_Distance) == 0x000008, "Wrong alignment on BP_ui_UV_minimap_icon_C_UI_Set_Thumbnail_Minimap_Icon_Distance");
static_assert(sizeof(BP_ui_UV_minimap_icon_C_UI_Set_Thumbnail_Minimap_Icon_Distance) == 0x000040, "Wrong size on BP_ui_UV_minimap_icon_C_UI_Set_Thumbnail_Minimap_Icon_Distance");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_Set_Thumbnail_Minimap_Icon_Distance, Image) == 0x000000, "Member 'BP_ui_UV_minimap_icon_C_UI_Set_Thumbnail_Minimap_Icon_Distance::Image' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_Set_Thumbnail_Minimap_Icon_Distance, ID) == 0x000008, "Member 'BP_ui_UV_minimap_icon_C_UI_Set_Thumbnail_Minimap_Icon_Distance::ID' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_Set_Thumbnail_Minimap_Icon_Distance, __WorldContext) == 0x000010, "Member 'BP_ui_UV_minimap_icon_C_UI_Set_Thumbnail_Minimap_Icon_Distance::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_Set_Thumbnail_Minimap_Icon_Distance, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'BP_ui_UV_minimap_icon_C_UI_Set_Thumbnail_Minimap_Icon_Distance::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_Set_Thumbnail_Minimap_Icon_Distance, CallFunc_Percent_IntInt_ReturnValue) == 0x000020, "Member 'BP_ui_UV_minimap_icon_C_UI_Set_Thumbnail_Minimap_Icon_Distance::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_Set_Thumbnail_Minimap_Icon_Distance, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000024, "Member 'BP_ui_UV_minimap_icon_C_UI_Set_Thumbnail_Minimap_Icon_Distance::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_Set_Thumbnail_Minimap_Icon_Distance, CallFunc_Add_FloatFloat_ReturnValue) == 0x000028, "Member 'BP_ui_UV_minimap_icon_C_UI_Set_Thumbnail_Minimap_Icon_Distance::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_minimap_icon_C_UI_Set_Thumbnail_Minimap_Icon_Distance, K2Node_MakeStruct_LinearColor) == 0x00002C, "Member 'BP_ui_UV_minimap_icon_C_UI_Set_Thumbnail_Minimap_Icon_Distance::K2Node_MakeStruct_LinearColor' has a wrong offset!");

}

