#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_ui_map_icon_manager

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function bp_ui_map_icon_manager.bp_ui_map_icon_manager_C.GetElementNum
// 0x0028 (0x0028 - 0x0000)
struct bp_ui_map_icon_manager_C_GetElementNum final
{
public:
	int32                                         TableIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Num;                                               // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0010(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_ui_map_icon_manager_C_GetElementNum) == 0x000008, "Wrong alignment on bp_ui_map_icon_manager_C_GetElementNum");
static_assert(sizeof(bp_ui_map_icon_manager_C_GetElementNum) == 0x000028, "Wrong size on bp_ui_map_icon_manager_C_GetElementNum");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetElementNum, TableIndex) == 0x000000, "Member 'bp_ui_map_icon_manager_C_GetElementNum::TableIndex' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetElementNum, Num) == 0x000004, "Member 'bp_ui_map_icon_manager_C_GetElementNum::Num' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetElementNum, CallFunc_Array_Get_Item) == 0x000008, "Member 'bp_ui_map_icon_manager_C_GetElementNum::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetElementNum, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000010, "Member 'bp_ui_map_icon_manager_C_GetElementNum::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetElementNum, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'bp_ui_map_icon_manager_C_GetElementNum::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function bp_ui_map_icon_manager.bp_ui_map_icon_manager_C.GetElement
// 0x00C0 (0x00C0 - 0x0000)
struct bp_ui_map_icon_manager_C_GetElement final
{
public:
	int32                                         TableIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUiSceneMapIconDataCell                Param;                                             // 0x0008(0x0030)(Parm, OutParm)
	struct FUiSceneMapIconDataCell                _Param;                                            // 0x0038(0x0030)(Edit, BlueprintVisible)
	class UDataTable*                             CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0078(0x0010)(ReferenceParm, HasGetValueTypeHash)
	struct FUiSceneMapIconDataCell                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0088(0x0030)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_ui_map_icon_manager_C_GetElement) == 0x000008, "Wrong alignment on bp_ui_map_icon_manager_C_GetElement");
static_assert(sizeof(bp_ui_map_icon_manager_C_GetElement) == 0x0000C0, "Wrong size on bp_ui_map_icon_manager_C_GetElement");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetElement, TableIndex) == 0x000000, "Member 'bp_ui_map_icon_manager_C_GetElement::TableIndex' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetElement, Param_Index) == 0x000004, "Member 'bp_ui_map_icon_manager_C_GetElement::Param_Index' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetElement, Param) == 0x000008, "Member 'bp_ui_map_icon_manager_C_GetElement::Param' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetElement, _Param) == 0x000038, "Member 'bp_ui_map_icon_manager_C_GetElement::_Param' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetElement, CallFunc_Array_Get_Item) == 0x000068, "Member 'bp_ui_map_icon_manager_C_GetElement::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetElement, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'bp_ui_map_icon_manager_C_GetElement::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetElement, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000078, "Member 'bp_ui_map_icon_manager_C_GetElement::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetElement, CallFunc_GetDataTableRowFromName_OutRow) == 0x000088, "Member 'bp_ui_map_icon_manager_C_GetElement::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetElement, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000B8, "Member 'bp_ui_map_icon_manager_C_GetElement::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function bp_ui_map_icon_manager.bp_ui_map_icon_manager_C.GetElementList
// 0x0128 (0x0128 - 0x0000)
struct bp_ui_map_icon_manager_C_GetElementList final
{
public:
	EUiSceneMapIconType                           Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3239[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Locate;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Area;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_323A[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FUiSceneMapIconNode>            ResultList;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	struct FUiSceneMapIconNode                    _Param;                                            // 0x0020(0x00C8)(Edit, BlueprintVisible)
	struct FUiSceneMapIconDataCell                _Work;                                             // 0x00E8(0x0030)(Edit, BlueprintVisible)
	int32                                         _Area;                                             // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _Locate;                                           // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUiSceneMapIconType                           _Type;                                             // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_ui_map_icon_manager_C_GetElementList) == 0x000008, "Wrong alignment on bp_ui_map_icon_manager_C_GetElementList");
static_assert(sizeof(bp_ui_map_icon_manager_C_GetElementList) == 0x000128, "Wrong size on bp_ui_map_icon_manager_C_GetElementList");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetElementList, Type) == 0x000000, "Member 'bp_ui_map_icon_manager_C_GetElementList::Type' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetElementList, Locate) == 0x000004, "Member 'bp_ui_map_icon_manager_C_GetElementList::Locate' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetElementList, Area) == 0x000008, "Member 'bp_ui_map_icon_manager_C_GetElementList::Area' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetElementList, ResultList) == 0x000010, "Member 'bp_ui_map_icon_manager_C_GetElementList::ResultList' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetElementList, _Param) == 0x000020, "Member 'bp_ui_map_icon_manager_C_GetElementList::_Param' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetElementList, _Work) == 0x0000E8, "Member 'bp_ui_map_icon_manager_C_GetElementList::_Work' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetElementList, _Area) == 0x000118, "Member 'bp_ui_map_icon_manager_C_GetElementList::_Area' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetElementList, _Locate) == 0x00011C, "Member 'bp_ui_map_icon_manager_C_GetElementList::_Locate' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetElementList, _Type) == 0x000120, "Member 'bp_ui_map_icon_manager_C_GetElementList::_Type' has a wrong offset!");

// Function bp_ui_map_icon_manager.bp_ui_map_icon_manager_C.GetArrangeElementList
// 0x0050 (0x0050 - 0x0000)
struct bp_ui_map_icon_manager_C_GetArrangeElementList final
{
public:
	int32                                         Location;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Area;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMapArrangeItemNode>            ResultList;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	EMapIconType                                  MapIconType;                                       // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMapIconType                                  _MapIconType;                                      // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAreaName                                     _Area;                                             // 0x001A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELocationName                                 _Location;                                         // 0x001B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_323B[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMapArrangeItemInfo                    _Table;                                            // 0x0020(0x0030)(Edit, BlueprintVisible)
};
static_assert(alignof(bp_ui_map_icon_manager_C_GetArrangeElementList) == 0x000008, "Wrong alignment on bp_ui_map_icon_manager_C_GetArrangeElementList");
static_assert(sizeof(bp_ui_map_icon_manager_C_GetArrangeElementList) == 0x000050, "Wrong size on bp_ui_map_icon_manager_C_GetArrangeElementList");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetArrangeElementList, Location) == 0x000000, "Member 'bp_ui_map_icon_manager_C_GetArrangeElementList::Location' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetArrangeElementList, Area) == 0x000004, "Member 'bp_ui_map_icon_manager_C_GetArrangeElementList::Area' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetArrangeElementList, ResultList) == 0x000008, "Member 'bp_ui_map_icon_manager_C_GetArrangeElementList::ResultList' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetArrangeElementList, MapIconType) == 0x000018, "Member 'bp_ui_map_icon_manager_C_GetArrangeElementList::MapIconType' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetArrangeElementList, _MapIconType) == 0x000019, "Member 'bp_ui_map_icon_manager_C_GetArrangeElementList::_MapIconType' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetArrangeElementList, _Area) == 0x00001A, "Member 'bp_ui_map_icon_manager_C_GetArrangeElementList::_Area' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetArrangeElementList, _Location) == 0x00001B, "Member 'bp_ui_map_icon_manager_C_GetArrangeElementList::_Location' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetArrangeElementList, _Table) == 0x000020, "Member 'bp_ui_map_icon_manager_C_GetArrangeElementList::_Table' has a wrong offset!");

// Function bp_ui_map_icon_manager.bp_ui_map_icon_manager_C.GetArrangeIconType
// 0x0028 (0x0028 - 0x0000)
struct bp_ui_map_icon_manager_C_GetArrangeIconType final
{
public:
	class FName                                   PointIDName;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMapIconType                                  RetIconType;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_323C[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDataTable*>                     K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, HasGetValueTypeHash)
	EMapIconType                                  CallFunc_MinimapIconGetArrangeIconType_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_ui_map_icon_manager_C_GetArrangeIconType) == 0x000008, "Wrong alignment on bp_ui_map_icon_manager_C_GetArrangeIconType");
static_assert(sizeof(bp_ui_map_icon_manager_C_GetArrangeIconType) == 0x000028, "Wrong size on bp_ui_map_icon_manager_C_GetArrangeIconType");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetArrangeIconType, PointIDName) == 0x000000, "Member 'bp_ui_map_icon_manager_C_GetArrangeIconType::PointIDName' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetArrangeIconType, RetIconType) == 0x000008, "Member 'bp_ui_map_icon_manager_C_GetArrangeIconType::RetIconType' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetArrangeIconType, K2Node_MakeArray_Array) == 0x000010, "Member 'bp_ui_map_icon_manager_C_GetArrangeIconType::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(bp_ui_map_icon_manager_C_GetArrangeIconType, CallFunc_MinimapIconGetArrangeIconType_ReturnValue) == 0x000020, "Member 'bp_ui_map_icon_manager_C_GetArrangeIconType::CallFunc_MinimapIconGetArrangeIconType_ReturnValue' has a wrong offset!");

}

