#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ui_UV_item_large

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ui_UV_item_large.BP_ui_UV_item_large_C.UI_SetThumbnail_Item
// 0x0068 (0x0068 - 0x0000)
struct BP_ui_UV_item_large_C_UI_SetThumbnail_Item final
{
public:
	class UImage*                                 Image;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FCF[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 _IconIndexList;                                    // 0x0018(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ui_UV_item_large_C_UI_SetThumbnail_Item) == 0x000008, "Wrong alignment on BP_ui_UV_item_large_C_UI_SetThumbnail_Item");
static_assert(sizeof(BP_ui_UV_item_large_C_UI_SetThumbnail_Item) == 0x000068, "Wrong size on BP_ui_UV_item_large_C_UI_SetThumbnail_Item");
static_assert(offsetof(BP_ui_UV_item_large_C_UI_SetThumbnail_Item, Image) == 0x000000, "Member 'BP_ui_UV_item_large_C_UI_SetThumbnail_Item::Image' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_item_large_C_UI_SetThumbnail_Item, Param_Index) == 0x000008, "Member 'BP_ui_UV_item_large_C_UI_SetThumbnail_Item::Param_Index' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_item_large_C_UI_SetThumbnail_Item, __WorldContext) == 0x000010, "Member 'BP_ui_UV_item_large_C_UI_SetThumbnail_Item::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_item_large_C_UI_SetThumbnail_Item, _IconIndexList) == 0x000018, "Member 'BP_ui_UV_item_large_C_UI_SetThumbnail_Item::_IconIndexList' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_item_large_C_UI_SetThumbnail_Item, K2Node_MakeArray_Array) == 0x000028, "Member 'BP_ui_UV_item_large_C_UI_SetThumbnail_Item::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_item_large_C_UI_SetThumbnail_Item, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000038, "Member 'BP_ui_UV_item_large_C_UI_SetThumbnail_Item::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_item_large_C_UI_SetThumbnail_Item, CallFunc_Percent_IntInt_ReturnValue) == 0x000040, "Member 'BP_ui_UV_item_large_C_UI_SetThumbnail_Item::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_item_large_C_UI_SetThumbnail_Item, CallFunc_Divide_IntInt_ReturnValue) == 0x000044, "Member 'BP_ui_UV_item_large_C_UI_SetThumbnail_Item::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_item_large_C_UI_SetThumbnail_Item, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000048, "Member 'BP_ui_UV_item_large_C_UI_SetThumbnail_Item::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_item_large_C_UI_SetThumbnail_Item, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x00004C, "Member 'BP_ui_UV_item_large_C_UI_SetThumbnail_Item::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_item_large_C_UI_SetThumbnail_Item, CallFunc_Add_FloatFloat_ReturnValue) == 0x000050, "Member 'BP_ui_UV_item_large_C_UI_SetThumbnail_Item::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_item_large_C_UI_SetThumbnail_Item, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000054, "Member 'BP_ui_UV_item_large_C_UI_SetThumbnail_Item::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ui_UV_item_large_C_UI_SetThumbnail_Item, K2Node_MakeStruct_LinearColor) == 0x000058, "Member 'BP_ui_UV_item_large_C_UI_SetThumbnail_Item::K2Node_MakeStruct_LinearColor' has a wrong offset!");

}

