#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UIMain3DBG

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_UIMain3DBG.BP_UIMain3DBG_C.ExecuteUbergraph_BP_UIMain3DBG
// 0x0004 (0x0004 - 0x0000)
struct BP_UIMain3DBG_C_ExecuteUbergraph_BP_UIMain3DBG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIMain3DBG_C_ExecuteUbergraph_BP_UIMain3DBG) == 0x000004, "Wrong alignment on BP_UIMain3DBG_C_ExecuteUbergraph_BP_UIMain3DBG");
static_assert(sizeof(BP_UIMain3DBG_C_ExecuteUbergraph_BP_UIMain3DBG) == 0x000004, "Wrong size on BP_UIMain3DBG_C_ExecuteUbergraph_BP_UIMain3DBG");
static_assert(offsetof(BP_UIMain3DBG_C_ExecuteUbergraph_BP_UIMain3DBG, EntryPoint) == 0x000000, "Member 'BP_UIMain3DBG_C_ExecuteUbergraph_BP_UIMain3DBG::EntryPoint' has a wrong offset!");

// Function BP_UIMain3DBG.BP_UIMain3DBG_C.SetupMenuBGLevel
// 0x0080 (0x0080 - 0x0000)
struct BP_UIMain3DBG_C_SetupMenuBGLevel final
{
public:
	int32                                         ProgressId;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7859[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array_1;                          // 0x0018(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array_2;                          // 0x0028(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_GetProgressID_self_CastInput;             // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetProgressID_ProgressID;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_785A[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Mid_ReturnValue;                          // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UIMain3DBG_C_SetupMenuBGLevel) == 0x000008, "Wrong alignment on BP_UIMain3DBG_C_SetupMenuBGLevel");
static_assert(sizeof(BP_UIMain3DBG_C_SetupMenuBGLevel) == 0x000080, "Wrong size on BP_UIMain3DBG_C_SetupMenuBGLevel");
static_assert(offsetof(BP_UIMain3DBG_C_SetupMenuBGLevel, ProgressId) == 0x000000, "Member 'BP_UIMain3DBG_C_SetupMenuBGLevel::ProgressId' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DBG_C_SetupMenuBGLevel, CallFunc_Less_IntInt_ReturnValue) == 0x000004, "Member 'BP_UIMain3DBG_C_SetupMenuBGLevel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DBG_C_SetupMenuBGLevel, CallFunc_Less_IntInt_ReturnValue_1) == 0x000005, "Member 'BP_UIMain3DBG_C_SetupMenuBGLevel::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DBG_C_SetupMenuBGLevel, K2Node_MakeArray_Array) == 0x000008, "Member 'BP_UIMain3DBG_C_SetupMenuBGLevel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DBG_C_SetupMenuBGLevel, K2Node_MakeArray_Array_1) == 0x000018, "Member 'BP_UIMain3DBG_C_SetupMenuBGLevel::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DBG_C_SetupMenuBGLevel, K2Node_MakeArray_Array_2) == 0x000028, "Member 'BP_UIMain3DBG_C_SetupMenuBGLevel::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DBG_C_SetupMenuBGLevel, CallFunc_GetEventManager_EventManager) == 0x000038, "Member 'BP_UIMain3DBG_C_SetupMenuBGLevel::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DBG_C_SetupMenuBGLevel, CallFunc_GetProgressID_self_CastInput) == 0x000040, "Member 'BP_UIMain3DBG_C_SetupMenuBGLevel::CallFunc_GetProgressID_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DBG_C_SetupMenuBGLevel, CallFunc_GetProgressID_ProgressID) == 0x000050, "Member 'BP_UIMain3DBG_C_SetupMenuBGLevel::CallFunc_GetProgressID_ProgressID' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DBG_C_SetupMenuBGLevel, CallFunc_IsValid_ReturnValue) == 0x000054, "Member 'BP_UIMain3DBG_C_SetupMenuBGLevel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DBG_C_SetupMenuBGLevel, CallFunc_Conv_IntToString_ReturnValue) == 0x000058, "Member 'BP_UIMain3DBG_C_SetupMenuBGLevel::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DBG_C_SetupMenuBGLevel, CallFunc_Mid_ReturnValue) == 0x000068, "Member 'BP_UIMain3DBG_C_SetupMenuBGLevel::CallFunc_Mid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DBG_C_SetupMenuBGLevel, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000078, "Member 'BP_UIMain3DBG_C_SetupMenuBGLevel::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMain3DBG_C_SetupMenuBGLevel, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000079, "Member 'BP_UIMain3DBG_C_SetupMenuBGLevel::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");

}

