#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VibrationComponent

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BP_VibrationComponent.BP_VibrationComponent_C.Play Vibration
// 0x0050 (0x0050 - 0x0000)
struct BP_VibrationComponent_C_Play_Vibration final
{
public:
	class UForceFeedbackEffect*                   ForceFeedbackEffect;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLooping;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51E8[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Tag;                                               // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51E9[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TriggerEffectManager_C*             CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserParamManager*                      CallFunc_GetUserParamManager_UserParamManager;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51EA[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOptionParam*                           CallFunc_GetOptionParam_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOptionControllerVibration                    CallFunc_GetControllerVibration_ReturnValue;       // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51EB[0x5];                                     // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VibrationComponent_C_Play_Vibration) == 0x000008, "Wrong alignment on BP_VibrationComponent_C_Play_Vibration");
static_assert(sizeof(BP_VibrationComponent_C_Play_Vibration) == 0x000050, "Wrong size on BP_VibrationComponent_C_Play_Vibration");
static_assert(offsetof(BP_VibrationComponent_C_Play_Vibration, ForceFeedbackEffect) == 0x000000, "Member 'BP_VibrationComponent_C_Play_Vibration::ForceFeedbackEffect' has a wrong offset!");
static_assert(offsetof(BP_VibrationComponent_C_Play_Vibration, bLooping) == 0x000008, "Member 'BP_VibrationComponent_C_Play_Vibration::bLooping' has a wrong offset!");
static_assert(offsetof(BP_VibrationComponent_C_Play_Vibration, Tag) == 0x00000C, "Member 'BP_VibrationComponent_C_Play_Vibration::Tag' has a wrong offset!");
static_assert(offsetof(BP_VibrationComponent_C_Play_Vibration, CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager) == 0x000018, "Member 'BP_VibrationComponent_C_Play_Vibration::CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager' has a wrong offset!");
static_assert(offsetof(BP_VibrationComponent_C_Play_Vibration, CallFunc_GetUserParamManager_UserParamManager) == 0x000020, "Member 'BP_VibrationComponent_C_Play_Vibration::CallFunc_GetUserParamManager_UserParamManager' has a wrong offset!");
static_assert(offsetof(BP_VibrationComponent_C_Play_Vibration, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_VibrationComponent_C_Play_Vibration::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VibrationComponent_C_Play_Vibration, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'BP_VibrationComponent_C_Play_Vibration::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VibrationComponent_C_Play_Vibration, CallFunc_GetOptionParam_ReturnValue) == 0x000030, "Member 'BP_VibrationComponent_C_Play_Vibration::CallFunc_GetOptionParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VibrationComponent_C_Play_Vibration, CallFunc_IsValid_ReturnValue_2) == 0x000038, "Member 'BP_VibrationComponent_C_Play_Vibration::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VibrationComponent_C_Play_Vibration, CallFunc_GetControllerVibration_ReturnValue) == 0x000039, "Member 'BP_VibrationComponent_C_Play_Vibration::CallFunc_GetControllerVibration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VibrationComponent_C_Play_Vibration, K2Node_SwitchEnum_CmpSuccess) == 0x00003A, "Member 'BP_VibrationComponent_C_Play_Vibration::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_VibrationComponent_C_Play_Vibration, CallFunc_GetPlayerController_ReturnValue) == 0x000040, "Member 'BP_VibrationComponent_C_Play_Vibration::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VibrationComponent_C_Play_Vibration, CallFunc_IsValid_ReturnValue_3) == 0x000048, "Member 'BP_VibrationComponent_C_Play_Vibration::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function BP_VibrationComponent.BP_VibrationComponent_C.StopVibration
// 0x0020 (0x0020 - 0x0000)
struct BP_VibrationComponent_C_StopVibration final
{
public:
	class FName                                   Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_TriggerEffectManager_C*             CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VibrationComponent_C_StopVibration) == 0x000008, "Wrong alignment on BP_VibrationComponent_C_StopVibration");
static_assert(sizeof(BP_VibrationComponent_C_StopVibration) == 0x000020, "Wrong size on BP_VibrationComponent_C_StopVibration");
static_assert(offsetof(BP_VibrationComponent_C_StopVibration, Tag) == 0x000000, "Member 'BP_VibrationComponent_C_StopVibration::Tag' has a wrong offset!");
static_assert(offsetof(BP_VibrationComponent_C_StopVibration, CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager) == 0x000008, "Member 'BP_VibrationComponent_C_StopVibration::CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager' has a wrong offset!");
static_assert(offsetof(BP_VibrationComponent_C_StopVibration, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'BP_VibrationComponent_C_StopVibration::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VibrationComponent_C_StopVibration, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_VibrationComponent_C_StopVibration::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VibrationComponent_C_StopVibration, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'BP_VibrationComponent_C_StopVibration::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_VibrationComponent.BP_VibrationComponent_C.StopVibrationAll
// 0x0018 (0x0018 - 0x0000)
struct BP_VibrationComponent_C_StopVibrationAll final
{
public:
	class ABP_TriggerEffectManager_C*             CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VibrationComponent_C_StopVibrationAll) == 0x000008, "Wrong alignment on BP_VibrationComponent_C_StopVibrationAll");
static_assert(sizeof(BP_VibrationComponent_C_StopVibrationAll) == 0x000018, "Wrong size on BP_VibrationComponent_C_StopVibrationAll");
static_assert(offsetof(BP_VibrationComponent_C_StopVibrationAll, CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager) == 0x000000, "Member 'BP_VibrationComponent_C_StopVibrationAll::CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager' has a wrong offset!");
static_assert(offsetof(BP_VibrationComponent_C_StopVibrationAll, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_VibrationComponent_C_StopVibrationAll::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VibrationComponent_C_StopVibrationAll, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_VibrationComponent_C_StopVibrationAll::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VibrationComponent_C_StopVibrationAll, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'BP_VibrationComponent_C_StopVibrationAll::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

