#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponManageComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_WeaponManageComponent.BP_WeaponManageComponent_C.ExecuteUbergraph_BP_WeaponManageComponent
// 0x000C (0x000C - 0x0000)
struct BP_WeaponManageComponent_C_ExecuteUbergraph_BP_WeaponManageComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponManageComponent_C_ExecuteUbergraph_BP_WeaponManageComponent) == 0x000004, "Wrong alignment on BP_WeaponManageComponent_C_ExecuteUbergraph_BP_WeaponManageComponent");
static_assert(sizeof(BP_WeaponManageComponent_C_ExecuteUbergraph_BP_WeaponManageComponent) == 0x00000C, "Wrong size on BP_WeaponManageComponent_C_ExecuteUbergraph_BP_WeaponManageComponent");
static_assert(offsetof(BP_WeaponManageComponent_C_ExecuteUbergraph_BP_WeaponManageComponent, EntryPoint) == 0x000000, "Member 'BP_WeaponManageComponent_C_ExecuteUbergraph_BP_WeaponManageComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_ExecuteUbergraph_BP_WeaponManageComponent, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_WeaponManageComponent_C_ExecuteUbergraph_BP_WeaponManageComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_ExecuteUbergraph_BP_WeaponManageComponent, K2Node_Event_EndPlayReason) == 0x000008, "Member 'BP_WeaponManageComponent_C_ExecuteUbergraph_BP_WeaponManageComponent::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BP_WeaponManageComponent.BP_WeaponManageComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_WeaponManageComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponManageComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_WeaponManageComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_WeaponManageComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_WeaponManageComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_WeaponManageComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_WeaponManageComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_WeaponManageComponent.BP_WeaponManageComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_WeaponManageComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponManageComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_WeaponManageComponent_C_ReceiveTick");
static_assert(sizeof(BP_WeaponManageComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_WeaponManageComponent_C_ReceiveTick");
static_assert(offsetof(BP_WeaponManageComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_WeaponManageComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_WeaponManageComponent.BP_WeaponManageComponent_C.CreateWeapon
// 0x0200 (0x0200 - 0x0000)
struct BP_WeaponManageComponent_C_CreateWeapon final
{
public:
	class UClass*                                 WeaponClass;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bMainWeapon;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_568A[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LWeaponID;                                         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_568B[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_8;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_9;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_10;                              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_11;                              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_12;                              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_13;                              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_14;                              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_15;                              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_16;                              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_17;                              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_18;                              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_19;                              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_20;                              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_21;                              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_22;                              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_23;                              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_568C[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable_24;                              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_568D[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      CallFunc_GetPlayerID_self_CastInput;               // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     Temp_byte_Variable;                                // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_568E[0x6];                                     // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_568F[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerInfo                            CallFunc_GetPartyMemberInfo_ReturnValue;           // 0x00DC(0x00D0)(NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5690[0x3];                                     // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      CallFunc_GetPlayerID_self_CastInput_1;             // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue_1;                // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5691[0x3];                                     // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5692[0x3];                                     // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_25;                              // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_26;                              // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EREDActorStatType                             CallFunc_GetActorStatType_ReturnValue;             // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5693[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_WeaponBase_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponManageComponent_C_CreateWeapon) == 0x000010, "Wrong alignment on BP_WeaponManageComponent_C_CreateWeapon");
static_assert(sizeof(BP_WeaponManageComponent_C_CreateWeapon) == 0x000200, "Wrong size on BP_WeaponManageComponent_C_CreateWeapon");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, WeaponClass) == 0x000000, "Member 'BP_WeaponManageComponent_C_CreateWeapon::WeaponClass' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, SocketName) == 0x000008, "Member 'BP_WeaponManageComponent_C_CreateWeapon::SocketName' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, bMainWeapon) == 0x000010, "Member 'BP_WeaponManageComponent_C_CreateWeapon::bMainWeapon' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, LWeaponID) == 0x000014, "Member 'BP_WeaponManageComponent_C_CreateWeapon::LWeaponID' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable) == 0x000018, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, CallFunc_IsValidClass_ReturnValue) == 0x00001C, "Member 'BP_WeaponManageComponent_C_CreateWeapon::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_1) == 0x000020, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_2) == 0x000024, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_3) == 0x000028, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_4) == 0x00002C, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_5) == 0x000030, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_6) == 0x000034, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_7) == 0x000038, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_8) == 0x00003C, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_9) == 0x000040, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_10) == 0x000044, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_11) == 0x000048, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_12) == 0x00004C, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_12' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_13) == 0x000050, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_13' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_14) == 0x000054, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_14' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_15) == 0x000058, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_15' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_16) == 0x00005C, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_16' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_17) == 0x000060, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_17' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_18) == 0x000064, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_18' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_19) == 0x000068, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_19' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_20) == 0x00006C, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_20' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_21) == 0x000070, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_21' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_22) == 0x000074, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_22' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_23) == 0x000078, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_23' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'BP_WeaponManageComponent_C_CreateWeapon::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_24) == 0x0000B0, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_24' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, CallFunc_GetPlayerID_self_CastInput) == 0x0000B8, "Member 'BP_WeaponManageComponent_C_CreateWeapon::CallFunc_GetPlayerID_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, CallFunc_GetPlayerID_ReturnValue) == 0x0000C8, "Member 'BP_WeaponManageComponent_C_CreateWeapon::CallFunc_GetPlayerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_byte_Variable) == 0x0000C9, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, CallFunc_GetPlayerManager_PlayerManager) == 0x0000D0, "Member 'BP_WeaponManageComponent_C_CreateWeapon::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, CallFunc_IsValid_ReturnValue) == 0x0000D8, "Member 'BP_WeaponManageComponent_C_CreateWeapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, CallFunc_GetPartyMemberInfo_ReturnValue) == 0x0000DC, "Member 'BP_WeaponManageComponent_C_CreateWeapon::CallFunc_GetPartyMemberInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0001AC, "Member 'BP_WeaponManageComponent_C_CreateWeapon::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, CallFunc_GetPlayerID_self_CastInput_1) == 0x0001B0, "Member 'BP_WeaponManageComponent_C_CreateWeapon::CallFunc_GetPlayerID_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, CallFunc_GetPlayerID_ReturnValue_1) == 0x0001C0, "Member 'BP_WeaponManageComponent_C_CreateWeapon::CallFunc_GetPlayerID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, CallFunc_SelectInt_ReturnValue) == 0x0001C4, "Member 'BP_WeaponManageComponent_C_CreateWeapon::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x0001C8, "Member 'BP_WeaponManageComponent_C_CreateWeapon::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_25) == 0x0001CC, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_25' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, Temp_int_Variable_26) == 0x0001D0, "Member 'BP_WeaponManageComponent_C_CreateWeapon::Temp_int_Variable_26' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, K2Node_Select_Default) == 0x0001D4, "Member 'BP_WeaponManageComponent_C_CreateWeapon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, CallFunc_GetActorStatType_ReturnValue) == 0x0001D8, "Member 'BP_WeaponManageComponent_C_CreateWeapon::CallFunc_GetActorStatType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001E0, "Member 'BP_WeaponManageComponent_C_CreateWeapon::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001E8, "Member 'BP_WeaponManageComponent_C_CreateWeapon::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_CreateWeapon, CallFunc_Array_Add_ReturnValue) == 0x0001F0, "Member 'BP_WeaponManageComponent_C_CreateWeapon::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_WeaponManageComponent.BP_WeaponManageComponent_C.SetBattleEffect
// 0x0050 (0x0050 - 0x0000)
struct BP_WeaponManageComponent_C_SetBattleEffect final
{
public:
	bool                                          bBattle;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5694[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SASCopyPlayerActor_C*               LCopyPlayer;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCopyVisible_bVisible;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5695[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_SASCopyPlayerActor_C*>       CallFunc_GetCopyPlayerList_CopyPlayerList;         // 0x0030(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5696[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponManageComponent_C_SetBattleEffect) == 0x000008, "Wrong alignment on BP_WeaponManageComponent_C_SetBattleEffect");
static_assert(sizeof(BP_WeaponManageComponent_C_SetBattleEffect) == 0x000050, "Wrong size on BP_WeaponManageComponent_C_SetBattleEffect");
static_assert(offsetof(BP_WeaponManageComponent_C_SetBattleEffect, bBattle) == 0x000000, "Member 'BP_WeaponManageComponent_C_SetBattleEffect::bBattle' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetBattleEffect, LCopyPlayer) == 0x000008, "Member 'BP_WeaponManageComponent_C_SetBattleEffect::LCopyPlayer' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetBattleEffect, Temp_int_Loop_Num_Variable) == 0x000010, "Member 'BP_WeaponManageComponent_C_SetBattleEffect::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetBattleEffect, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_WeaponManageComponent_C_SetBattleEffect::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetBattleEffect, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_WeaponManageComponent_C_SetBattleEffect::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetBattleEffect, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_WeaponManageComponent_C_SetBattleEffect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetBattleEffect, Temp_int_Array_Index_Variable_1) == 0x000020, "Member 'BP_WeaponManageComponent_C_SetBattleEffect::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetBattleEffect, Temp_int_Loop_Num_Variable_1) == 0x000024, "Member 'BP_WeaponManageComponent_C_SetBattleEffect::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetBattleEffect, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'BP_WeaponManageComponent_C_SetBattleEffect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetBattleEffect, CallFunc_IsCopyVisible_bVisible) == 0x000029, "Member 'BP_WeaponManageComponent_C_SetBattleEffect::CallFunc_IsCopyVisible_bVisible' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetBattleEffect, Temp_int_Loop_Counter_Variable_1) == 0x00002C, "Member 'BP_WeaponManageComponent_C_SetBattleEffect::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetBattleEffect, CallFunc_GetCopyPlayerList_CopyPlayerList) == 0x000030, "Member 'BP_WeaponManageComponent_C_SetBattleEffect::CallFunc_GetCopyPlayerList_CopyPlayerList' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetBattleEffect, CallFunc_Less_IntInt_ReturnValue_1) == 0x000040, "Member 'BP_WeaponManageComponent_C_SetBattleEffect::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetBattleEffect, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'BP_WeaponManageComponent_C_SetBattleEffect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetBattleEffect, CallFunc_Add_IntInt_ReturnValue_1) == 0x000048, "Member 'BP_WeaponManageComponent_C_SetBattleEffect::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetBattleEffect, CallFunc_Array_Length_ReturnValue_1) == 0x00004C, "Member 'BP_WeaponManageComponent_C_SetBattleEffect::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");

// Function BP_WeaponManageComponent.BP_WeaponManageComponent_C.SetWeaponVisibility
// 0x0060 (0x0060 - 0x0000)
struct BP_WeaponManageComponent_C_SetWeaponVisibility final
{
public:
	bool                                          bVisibility;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bBattle;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWithSubWeapon;                                    // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5697[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SASCopyPlayerActor_C*               LCopyPlayer;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_WeaponBase_C*                       LWeapon;                                           // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5698[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCopyVisible_bVisible;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5699[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_569A[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_SASCopyPlayerActor_C*>       CallFunc_GetCopyPlayerList_CopyPlayerList;         // 0x0048(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponManageComponent_C_SetWeaponVisibility) == 0x000008, "Wrong alignment on BP_WeaponManageComponent_C_SetWeaponVisibility");
static_assert(sizeof(BP_WeaponManageComponent_C_SetWeaponVisibility) == 0x000060, "Wrong size on BP_WeaponManageComponent_C_SetWeaponVisibility");
static_assert(offsetof(BP_WeaponManageComponent_C_SetWeaponVisibility, bVisibility) == 0x000000, "Member 'BP_WeaponManageComponent_C_SetWeaponVisibility::bVisibility' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetWeaponVisibility, bBattle) == 0x000001, "Member 'BP_WeaponManageComponent_C_SetWeaponVisibility::bBattle' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetWeaponVisibility, bWithSubWeapon) == 0x000002, "Member 'BP_WeaponManageComponent_C_SetWeaponVisibility::bWithSubWeapon' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetWeaponVisibility, LCopyPlayer) == 0x000008, "Member 'BP_WeaponManageComponent_C_SetWeaponVisibility::LCopyPlayer' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetWeaponVisibility, LWeapon) == 0x000010, "Member 'BP_WeaponManageComponent_C_SetWeaponVisibility::LWeapon' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetWeaponVisibility, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_WeaponManageComponent_C_SetWeaponVisibility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetWeaponVisibility, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_WeaponManageComponent_C_SetWeaponVisibility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetWeaponVisibility, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_WeaponManageComponent_C_SetWeaponVisibility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetWeaponVisibility, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'BP_WeaponManageComponent_C_SetWeaponVisibility::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetWeaponVisibility, Temp_int_Loop_Num_Variable) == 0x000028, "Member 'BP_WeaponManageComponent_C_SetWeaponVisibility::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetWeaponVisibility, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_WeaponManageComponent_C_SetWeaponVisibility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetWeaponVisibility, Temp_int_Loop_Counter_Variable_1) == 0x000030, "Member 'BP_WeaponManageComponent_C_SetWeaponVisibility::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetWeaponVisibility, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'BP_WeaponManageComponent_C_SetWeaponVisibility::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetWeaponVisibility, CallFunc_IsCopyVisible_bVisible) == 0x000038, "Member 'BP_WeaponManageComponent_C_SetWeaponVisibility::CallFunc_IsCopyVisible_bVisible' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetWeaponVisibility, Temp_int_Loop_Num_Variable_1) == 0x00003C, "Member 'BP_WeaponManageComponent_C_SetWeaponVisibility::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetWeaponVisibility, CallFunc_Less_IntInt_ReturnValue_1) == 0x000040, "Member 'BP_WeaponManageComponent_C_SetWeaponVisibility::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetWeaponVisibility, CallFunc_GetCopyPlayerList_CopyPlayerList) == 0x000048, "Member 'BP_WeaponManageComponent_C_SetWeaponVisibility::CallFunc_GetCopyPlayerList_CopyPlayerList' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetWeaponVisibility, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_WeaponManageComponent_C_SetWeaponVisibility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetWeaponVisibility, CallFunc_Array_Length_ReturnValue_1) == 0x00005C, "Member 'BP_WeaponManageComponent_C_SetWeaponVisibility::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");

// Function BP_WeaponManageComponent.BP_WeaponManageComponent_C.SetMaterialScalarParameter
// 0x0028 (0x0028 - 0x0000)
struct BP_WeaponManageComponent_C_SetMaterialScalarParameter final
{
public:
	class FName                                   ParamName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_569B[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetWeaponMaterialScalarParameter_bDummy;  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WeaponManageComponent_C_SetMaterialScalarParameter) == 0x000004, "Wrong alignment on BP_WeaponManageComponent_C_SetMaterialScalarParameter");
static_assert(sizeof(BP_WeaponManageComponent_C_SetMaterialScalarParameter) == 0x000028, "Wrong size on BP_WeaponManageComponent_C_SetMaterialScalarParameter");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialScalarParameter, ParamName) == 0x000000, "Member 'BP_WeaponManageComponent_C_SetMaterialScalarParameter::ParamName' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialScalarParameter, Value) == 0x000008, "Member 'BP_WeaponManageComponent_C_SetMaterialScalarParameter::Value' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialScalarParameter, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_WeaponManageComponent_C_SetMaterialScalarParameter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialScalarParameter, Temp_int_Loop_Num_Variable) == 0x000010, "Member 'BP_WeaponManageComponent_C_SetMaterialScalarParameter::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialScalarParameter, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_WeaponManageComponent_C_SetMaterialScalarParameter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialScalarParameter, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'BP_WeaponManageComponent_C_SetMaterialScalarParameter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialScalarParameter, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_WeaponManageComponent_C_SetMaterialScalarParameter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialScalarParameter, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_WeaponManageComponent_C_SetMaterialScalarParameter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialScalarParameter, CallFunc_SetWeaponMaterialScalarParameter_bDummy) == 0x000024, "Member 'BP_WeaponManageComponent_C_SetMaterialScalarParameter::CallFunc_SetWeaponMaterialScalarParameter_bDummy' has a wrong offset!");

// Function BP_WeaponManageComponent.BP_WeaponManageComponent_C.SetMaterialScalarArrayParameter
// 0x0040 (0x0040 - 0x0000)
struct BP_WeaponManageComponent_C_SetMaterialScalarArrayParameter final
{
public:
	TArray<class FName>                           ParamName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	TArray<float>                                 Value;                                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_569C[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_WeaponBase_C*                       CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetWeaponMaterialScalarArrayParameter_bDummy; // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WeaponManageComponent_C_SetMaterialScalarArrayParameter) == 0x000008, "Wrong alignment on BP_WeaponManageComponent_C_SetMaterialScalarArrayParameter");
static_assert(sizeof(BP_WeaponManageComponent_C_SetMaterialScalarArrayParameter) == 0x000040, "Wrong size on BP_WeaponManageComponent_C_SetMaterialScalarArrayParameter");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialScalarArrayParameter, ParamName) == 0x000000, "Member 'BP_WeaponManageComponent_C_SetMaterialScalarArrayParameter::ParamName' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialScalarArrayParameter, Value) == 0x000010, "Member 'BP_WeaponManageComponent_C_SetMaterialScalarArrayParameter::Value' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialScalarArrayParameter, Temp_int_Variable) == 0x000020, "Member 'BP_WeaponManageComponent_C_SetMaterialScalarArrayParameter::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialScalarArrayParameter, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_WeaponManageComponent_C_SetMaterialScalarArrayParameter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialScalarArrayParameter, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_WeaponManageComponent_C_SetMaterialScalarArrayParameter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialScalarArrayParameter, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_WeaponManageComponent_C_SetMaterialScalarArrayParameter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialScalarArrayParameter, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_WeaponManageComponent_C_SetMaterialScalarArrayParameter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialScalarArrayParameter, CallFunc_SetWeaponMaterialScalarArrayParameter_bDummy) == 0x000039, "Member 'BP_WeaponManageComponent_C_SetMaterialScalarArrayParameter::CallFunc_SetWeaponMaterialScalarArrayParameter_bDummy' has a wrong offset!");

// Function BP_WeaponManageComponent.BP_WeaponManageComponent_C.SetMaterialVectorParameter
// 0x0034 (0x0034 - 0x0000)
struct BP_WeaponManageComponent_C_SetMaterialVectorParameter final
{
public:
	class FName                                   ParamName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_569D[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetWeaponMaterialVectorParameter_bDummy;  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WeaponManageComponent_C_SetMaterialVectorParameter) == 0x000004, "Wrong alignment on BP_WeaponManageComponent_C_SetMaterialVectorParameter");
static_assert(sizeof(BP_WeaponManageComponent_C_SetMaterialVectorParameter) == 0x000034, "Wrong size on BP_WeaponManageComponent_C_SetMaterialVectorParameter");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialVectorParameter, ParamName) == 0x000000, "Member 'BP_WeaponManageComponent_C_SetMaterialVectorParameter::ParamName' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialVectorParameter, Color) == 0x000008, "Member 'BP_WeaponManageComponent_C_SetMaterialVectorParameter::Color' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialVectorParameter, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_WeaponManageComponent_C_SetMaterialVectorParameter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialVectorParameter, Temp_int_Loop_Num_Variable) == 0x00001C, "Member 'BP_WeaponManageComponent_C_SetMaterialVectorParameter::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialVectorParameter, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_WeaponManageComponent_C_SetMaterialVectorParameter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialVectorParameter, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'BP_WeaponManageComponent_C_SetMaterialVectorParameter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialVectorParameter, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_WeaponManageComponent_C_SetMaterialVectorParameter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialVectorParameter, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'BP_WeaponManageComponent_C_SetMaterialVectorParameter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetMaterialVectorParameter, CallFunc_SetWeaponMaterialVectorParameter_bDummy) == 0x000030, "Member 'BP_WeaponManageComponent_C_SetMaterialVectorParameter::CallFunc_SetWeaponMaterialVectorParameter_bDummy' has a wrong offset!");

// Function BP_WeaponManageComponent.BP_WeaponManageComponent_C.SetShadowEnable
// 0x001C (0x001C - 0x0000)
struct BP_WeaponManageComponent_C_SetShadowEnable final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_569E[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_569F[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponManageComponent_C_SetShadowEnable) == 0x000004, "Wrong alignment on BP_WeaponManageComponent_C_SetShadowEnable");
static_assert(sizeof(BP_WeaponManageComponent_C_SetShadowEnable) == 0x00001C, "Wrong size on BP_WeaponManageComponent_C_SetShadowEnable");
static_assert(offsetof(BP_WeaponManageComponent_C_SetShadowEnable, bEnable) == 0x000000, "Member 'BP_WeaponManageComponent_C_SetShadowEnable::bEnable' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetShadowEnable, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_WeaponManageComponent_C_SetShadowEnable::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetShadowEnable, Temp_int_Loop_Num_Variable) == 0x000008, "Member 'BP_WeaponManageComponent_C_SetShadowEnable::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetShadowEnable, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_WeaponManageComponent_C_SetShadowEnable::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetShadowEnable, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_WeaponManageComponent_C_SetShadowEnable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetShadowEnable, CallFunc_Less_IntInt_ReturnValue) == 0x000014, "Member 'BP_WeaponManageComponent_C_SetShadowEnable::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponManageComponent_C_SetShadowEnable, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_WeaponManageComponent_C_SetShadowEnable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_WeaponManageComponent.BP_WeaponManageComponent_C.SetWeaponHidden
// 0x001C (0x001C - 0x0000)
struct BP_WeaponManageComponent_C_SetWeaponHidden final
{
public:
	bool                                          bHidden;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56A0[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56A1[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponManageComponent_C_SetWeaponHidden) == 0x000004, "Wrong alignment on BP_WeaponManageComponent_C_SetWeaponHidden");
static_assert(sizeof(BP_WeaponManageComponent_C_SetWeaponHidden) == 0x00001C, "Wrong size on BP_WeaponManageComponent_C_SetWeaponHidden");
