#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponBase_ch0100

#include "Basic.hpp"

#include "EPlayerComboPattern_structs.hpp"
#include "BP_WeaponBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WeaponBase_ch0100.BP_WeaponBase_ch0100_C
// 0x0030 (0x0440 - 0x0410)
class ABP_WeaponBase_ch0100_C : public ABP_WeaponBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_WeaponBase_ch0100_C;             // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SheathMesh;                                        // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       SheathMeshMaterialInstanceArray;                   // 0x0420(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class URSParticleSystemComponentBase*         EffectHandle;                                      // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerComboPattern                           WeaponEffectType;                                  // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_WeaponBase_ch0100(int32 EntryPoint);
	void SetBattleEffect(bool bON);
	void Attach(class ARSBattlePlayer_C* Param_Owner, class USceneComponent* Component, class FName SocketName);
	void UserConstructionScript();
	void GetExtraMaterialInstanceArray(TArray<class UMaterialInstanceDynamic*>* MaterialInstance);
	void GetExtraMesh(TArray<class USkeletalMeshComponent*>* ExtraMesh);
	void OnBattleEffect();
	void OffBattleEffect();
	void ResetMaterialInstanceArray();
	void SetWeaponVisibility(bool bVisible);
	void DoLoadMeshAfter(bool bDisableStringWeapon, bool* bDummy);
	void DoAttachAfter(bool bDisableStringWeapon, bool* bDummy);
	void SheathStringSetting(bool bDisableStringWeapon);

	void GetAttachTransform(struct FTransform* Transform) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WeaponBase_ch0100_C">();
	}
	static class ABP_WeaponBase_ch0100_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WeaponBase_ch0100_C>();
	}
};
static_assert(alignof(ABP_WeaponBase_ch0100_C) == 0x000008, "Wrong alignment on ABP_WeaponBase_ch0100_C");
static_assert(sizeof(ABP_WeaponBase_ch0100_C) == 0x000440, "Wrong size on ABP_WeaponBase_ch0100_C");
static_assert(offsetof(ABP_WeaponBase_ch0100_C, UberGraphFrame_BP_WeaponBase_ch0100_C) == 0x000410, "Member 'ABP_WeaponBase_ch0100_C::UberGraphFrame_BP_WeaponBase_ch0100_C' has a wrong offset!");
static_assert(offsetof(ABP_WeaponBase_ch0100_C, SheathMesh) == 0x000418, "Member 'ABP_WeaponBase_ch0100_C::SheathMesh' has a wrong offset!");
static_assert(offsetof(ABP_WeaponBase_ch0100_C, SheathMeshMaterialInstanceArray) == 0x000420, "Member 'ABP_WeaponBase_ch0100_C::SheathMeshMaterialInstanceArray' has a wrong offset!");
static_assert(offsetof(ABP_WeaponBase_ch0100_C, EffectHandle) == 0x000430, "Member 'ABP_WeaponBase_ch0100_C::EffectHandle' has a wrong offset!");
static_assert(offsetof(ABP_WeaponBase_ch0100_C, WeaponEffectType) == 0x000438, "Member 'ABP_WeaponBase_ch0100_C::WeaponEffectType' has a wrong offset!");

}

