#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponBase

#include "Basic.hpp"

#include "ECharaExecuteNotifyKind_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "E_SASKind_structs.hpp"


namespace SDK::Params
{

// Function BP_WeaponBase.BP_WeaponBase_C.DispatchThrowHit__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct BP_WeaponBase_C_DispatchThrowHit__DelegateSignature final
{
public:
	struct FVector                                HitLocation;                                       // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponBase_C_DispatchThrowHit__DelegateSignature) == 0x000004, "Wrong alignment on BP_WeaponBase_C_DispatchThrowHit__DelegateSignature");
static_assert(sizeof(BP_WeaponBase_C_DispatchThrowHit__DelegateSignature) == 0x00000C, "Wrong size on BP_WeaponBase_C_DispatchThrowHit__DelegateSignature");
static_assert(offsetof(BP_WeaponBase_C_DispatchThrowHit__DelegateSignature, HitLocation) == 0x000000, "Member 'BP_WeaponBase_C_DispatchThrowHit__DelegateSignature::HitLocation' has a wrong offset!");

// Function BP_WeaponBase.BP_WeaponBase_C.ExecuteUbergraph_BP_WeaponBase
// 0x001C (0x001C - 0x0000)
struct BP_WeaponBase_C_ExecuteUbergraph_BP_WeaponBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8243[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetActorDeltaSeconds_ReturnValue;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8244[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Initialize_bDummy;                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WeaponBase_C_ExecuteUbergraph_BP_WeaponBase) == 0x000004, "Wrong alignment on BP_WeaponBase_C_ExecuteUbergraph_BP_WeaponBase");
static_assert(sizeof(BP_WeaponBase_C_ExecuteUbergraph_BP_WeaponBase) == 0x00001C, "Wrong size on BP_WeaponBase_C_ExecuteUbergraph_BP_WeaponBase");
static_assert(offsetof(BP_WeaponBase_C_ExecuteUbergraph_BP_WeaponBase, EntryPoint) == 0x000000, "Member 'BP_WeaponBase_C_ExecuteUbergraph_BP_WeaponBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ExecuteUbergraph_BP_WeaponBase, Temp_bool_Variable) == 0x000004, "Member 'BP_WeaponBase_C_ExecuteUbergraph_BP_WeaponBase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ExecuteUbergraph_BP_WeaponBase, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_WeaponBase_C_ExecuteUbergraph_BP_WeaponBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ExecuteUbergraph_BP_WeaponBase, CallFunc_GetActorDeltaSeconds_ReturnValue) == 0x00000C, "Member 'BP_WeaponBase_C_ExecuteUbergraph_BP_WeaponBase::CallFunc_GetActorDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ExecuteUbergraph_BP_WeaponBase, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_WeaponBase_C_ExecuteUbergraph_BP_WeaponBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ExecuteUbergraph_BP_WeaponBase, K2Node_Select_Default) == 0x000014, "Member 'BP_WeaponBase_C_ExecuteUbergraph_BP_WeaponBase::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ExecuteUbergraph_BP_WeaponBase, CallFunc_Initialize_bDummy) == 0x000018, "Member 'BP_WeaponBase_C_ExecuteUbergraph_BP_WeaponBase::CallFunc_Initialize_bDummy' has a wrong offset!");

// Function BP_WeaponBase.BP_WeaponBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_WeaponBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_WeaponBase_C_ReceiveTick");
static_assert(sizeof(BP_WeaponBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_WeaponBase_C_ReceiveTick");
static_assert(offsetof(BP_WeaponBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_WeaponBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_WeaponBase.BP_WeaponBase_C.TakeBackOwner
// 0x0008 (0x0008 - 0x0000)
struct BP_WeaponBase_C_TakeBackOwner final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WeaponBase_C_TakeBackOwner) == 0x000004, "Wrong alignment on BP_WeaponBase_C_TakeBackOwner");
static_assert(sizeof(BP_WeaponBase_C_TakeBackOwner) == 0x000008, "Wrong size on BP_WeaponBase_C_TakeBackOwner");
static_assert(offsetof(BP_WeaponBase_C_TakeBackOwner, Time) == 0x000000, "Member 'BP_WeaponBase_C_TakeBackOwner::Time' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_TakeBackOwner, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_WeaponBase_C_TakeBackOwner::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_WeaponBase.BP_WeaponBase_C.ThrowToPoint
// 0x0010 (0x0010 - 0x0000)
struct BP_WeaponBase_C_ThrowToPoint final
{
public:
	float                                         Speed;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetPoint;                                       // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponBase_C_ThrowToPoint) == 0x000004, "Wrong alignment on BP_WeaponBase_C_ThrowToPoint");
static_assert(sizeof(BP_WeaponBase_C_ThrowToPoint) == 0x000010, "Wrong size on BP_WeaponBase_C_ThrowToPoint");
static_assert(offsetof(BP_WeaponBase_C_ThrowToPoint, Speed) == 0x000000, "Member 'BP_WeaponBase_C_ThrowToPoint::Speed' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowToPoint, TargetPoint) == 0x000004, "Member 'BP_WeaponBase_C_ThrowToPoint::TargetPoint' has a wrong offset!");

// Function BP_WeaponBase.BP_WeaponBase_C.ThrowToTarget
// 0x0018 (0x0018 - 0x0000)
struct BP_WeaponBase_C_ThrowToTarget final
{
public:
	float                                         Speed;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8245[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CheckHeightOnGround;                               // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WeaponBase_C_ThrowToTarget) == 0x000008, "Wrong alignment on BP_WeaponBase_C_ThrowToTarget");
static_assert(sizeof(BP_WeaponBase_C_ThrowToTarget) == 0x000018, "Wrong size on BP_WeaponBase_C_ThrowToTarget");
static_assert(offsetof(BP_WeaponBase_C_ThrowToTarget, Speed) == 0x000000, "Member 'BP_WeaponBase_C_ThrowToTarget::Speed' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowToTarget, TargetActor) == 0x000008, "Member 'BP_WeaponBase_C_ThrowToTarget::TargetActor' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowToTarget, CheckHeightOnGround) == 0x000010, "Member 'BP_WeaponBase_C_ThrowToTarget::CheckHeightOnGround' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowToTarget, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_WeaponBase_C_ThrowToTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_WeaponBase.BP_WeaponBase_C.ThrowUpdate
// 0x0418 (0x0418 - 0x0000)
struct BP_WeaponBase_C_ThrowUpdate final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             LElement;                                          // 0x0004(0x0088)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                LThrowPoint;                                       // 0x008C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LLength;                                           // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LSocketLocation;                                   // 0x009C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LSpeed;                                            // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LDist;                                             // 0x00AC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8246[0x2];                                     // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0174(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8247[0x2];                                     // 0x01FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8248[0x4];                                     // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0228(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8249[0x3];                                     // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_824A[0x2];                                     // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_824B[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0258(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TArray<struct FHitResult>                     CallFunc_LineTraceMultiForObjects_OutHits;         // 0x0268(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_LineTraceMultiForObjects_ReturnValue;     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_824C[0x3];                                     // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0280(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_824D[0x2];                                     // 0x0312(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0314(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_824E[0x2];                                     // 0x0322(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0324(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0330(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x033C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult_1; // 0x034C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue_1; // 0x03D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_824F[0x3];                                     // 0x03D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x03D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetThrowPoint_Point;                      // 0x03E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x03F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x03FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromY_ReturnValue;                 // 0x0408(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WeaponBase_C_ThrowUpdate) == 0x000008, "Wrong alignment on BP_WeaponBase_C_ThrowUpdate");
static_assert(sizeof(BP_WeaponBase_C_ThrowUpdate) == 0x000418, "Wrong size on BP_WeaponBase_C_ThrowUpdate");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, DeltaTime) == 0x000000, "Member 'BP_WeaponBase_C_ThrowUpdate::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, LElement) == 0x000004, "Member 'BP_WeaponBase_C_ThrowUpdate::LElement' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, LThrowPoint) == 0x00008C, "Member 'BP_WeaponBase_C_ThrowUpdate::LThrowPoint' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, LLength) == 0x000098, "Member 'BP_WeaponBase_C_ThrowUpdate::LLength' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, LSocketLocation) == 0x00009C, "Member 'BP_WeaponBase_C_ThrowUpdate::LSocketLocation' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, LSpeed) == 0x0000A8, "Member 'BP_WeaponBase_C_ThrowUpdate::LSpeed' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, LDist) == 0x0000AC, "Member 'BP_WeaponBase_C_ThrowUpdate::LDist' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, Temp_int_Array_Index_Variable) == 0x0000B8, "Member 'BP_WeaponBase_C_ThrowUpdate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_BreakHitResult_bBlockingHit) == 0x0000BC, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000BD, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_BreakHitResult_Time) == 0x0000C0, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_BreakHitResult_Distance) == 0x0000C4, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_BreakHitResult_Location) == 0x0000C8, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_BreakHitResult_ImpactPoint) == 0x0000D4, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_BreakHitResult_Normal) == 0x0000E0, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_BreakHitResult_ImpactNormal) == 0x0000EC, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_BreakHitResult_PhysMat) == 0x0000F8, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_BreakHitResult_HitActor) == 0x000100, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_BreakHitResult_HitComponent) == 0x000108, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_BreakHitResult_HitBoneName) == 0x000110, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_BreakHitResult_HitItem) == 0x000118, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_BreakHitResult_FaceIndex) == 0x00011C, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_BreakHitResult_TraceStart) == 0x000120, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_BreakHitResult_TraceEnd) == 0x00012C, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000138, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000144, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000150, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00015C, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_Add_VectorVector_ReturnValue) == 0x000168, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x000174, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x0001FC, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001FD, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000200, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_Normal_ReturnValue) == 0x00020C, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000218, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, K2Node_MakeArray_Array) == 0x000228, "Member 'BP_WeaponBase_C_ThrowUpdate::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_IsValid_ReturnValue) == 0x000238, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_VSize_ReturnValue) == 0x00023C, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000240, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000241, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_GetSocketLocation_ReturnValue) == 0x000244, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, K2Node_SwitchEnum_CmpSuccess) == 0x000250, "Member 'BP_WeaponBase_C_ThrowUpdate::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, Temp_object_Variable) == 0x000258, "Member 'BP_WeaponBase_C_ThrowUpdate::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_LineTraceMultiForObjects_OutHits) == 0x000268, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_LineTraceMultiForObjects_OutHits' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_LineTraceMultiForObjects_ReturnValue) == 0x000278, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_LineTraceMultiForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, Temp_int_Loop_Counter_Variable) == 0x00027C, "Member 'BP_WeaponBase_C_ThrowUpdate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_Array_Get_Item) == 0x000280, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_Add_IntInt_ReturnValue) == 0x000308, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_Array_Length_ReturnValue) == 0x00030C, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_Less_IntInt_ReturnValue) == 0x000310, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, Temp_bool_True_if_break_was_hit_Variable) == 0x000311, "Member 'BP_WeaponBase_C_ThrowUpdate::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000314, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_Not_PreBool_ReturnValue) == 0x000320, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_BooleanAND_ReturnValue) == 0x000321, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_Normal_ReturnValue_1) == 0x000324, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000330, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_Add_VectorVector_ReturnValue_2) == 0x00033C, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000348, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult_1) == 0x00034C, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_K2_SetActorLocationAndRotation_ReturnValue_1) == 0x0003D4, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_K2_SetActorLocationAndRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x0003D8, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_GetThrowPoint_Point) == 0x0003E4, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_GetThrowPoint_Point' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0003F0, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_Subtract_VectorVector_ReturnValue_2) == 0x0003FC, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_Subtract_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowUpdate, CallFunc_MakeRotFromY_ReturnValue) == 0x000408, "Member 'BP_WeaponBase_C_ThrowUpdate::CallFunc_MakeRotFromY_ReturnValue' has a wrong offset!");

// Function BP_WeaponBase.BP_WeaponBase_C.ThrowStart
// 0x0028 (0x0028 - 0x0000)
struct BP_WeaponBase_C_ThrowStart final
{
public:
	EWeaponThrowType                              Param_ThrowType;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8250[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CheckHeightOnGround;                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8251[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetAttachParent_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetAttachParentSocketName_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponBase_C_ThrowStart) == 0x000008, "Wrong alignment on BP_WeaponBase_C_ThrowStart");
static_assert(sizeof(BP_WeaponBase_C_ThrowStart) == 0x000028, "Wrong size on BP_WeaponBase_C_ThrowStart");
static_assert(offsetof(BP_WeaponBase_C_ThrowStart, Param_ThrowType) == 0x000000, "Member 'BP_WeaponBase_C_ThrowStart::Param_ThrowType' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowStart, CheckHeightOnGround) == 0x000004, "Member 'BP_WeaponBase_C_ThrowStart::CheckHeightOnGround' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowStart, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_WeaponBase_C_ThrowStart::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowStart, CallFunc_GetAttachParent_ReturnValue) == 0x000018, "Member 'BP_WeaponBase_C_ThrowStart::CallFunc_GetAttachParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_ThrowStart, CallFunc_GetAttachParentSocketName_ReturnValue) == 0x000020, "Member 'BP_WeaponBase_C_ThrowStart::CallFunc_GetAttachParentSocketName_ReturnValue' has a wrong offset!");

// Function BP_WeaponBase.BP_WeaponBase_C.Attach
// 0x00E0 (0x00E0 - 0x0000)
struct BP_WeaponBase_C_Attach final
{
public:
	class ARSBattlePlayer_C*                      Param_Owner;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8252[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetAttachTransform_Transform;             // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0050(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoAttachAfter_bDummy;                     // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WeaponBase_C_Attach) == 0x000010, "Wrong alignment on BP_WeaponBase_C_Attach");
static_assert(sizeof(BP_WeaponBase_C_Attach) == 0x0000E0, "Wrong size on BP_WeaponBase_C_Attach");
static_assert(offsetof(BP_WeaponBase_C_Attach, Param_Owner) == 0x000000, "Member 'BP_WeaponBase_C_Attach::Param_Owner' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_Attach, Component) == 0x000008, "Member 'BP_WeaponBase_C_Attach::Component' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_Attach, SocketName) == 0x000010, "Member 'BP_WeaponBase_C_Attach::SocketName' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_Attach, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_WeaponBase_C_Attach::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_Attach, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'BP_WeaponBase_C_Attach::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_Attach, CallFunc_GetAttachTransform_Transform) == 0x000020, "Member 'BP_WeaponBase_C_Attach::CallFunc_GetAttachTransform_Transform' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_Attach, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000050, "Member 'BP_WeaponBase_C_Attach::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_Attach, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0000D8, "Member 'BP_WeaponBase_C_Attach::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_Attach, CallFunc_DoAttachAfter_bDummy) == 0x0000D9, "Member 'BP_WeaponBase_C_Attach::CallFunc_DoAttachAfter_bDummy' has a wrong offset!");

// Function BP_WeaponBase.BP_WeaponBase_C.ThrowEnd
// 0x0001 (0x0001 - 0x0000)
struct BP_WeaponBase_C_ThrowEnd final
{
public:
	bool                                          bAttach;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WeaponBase_C_ThrowEnd) == 0x000001, "Wrong alignment on BP_WeaponBase_C_ThrowEnd");
static_assert(sizeof(BP_WeaponBase_C_ThrowEnd) == 0x000001, "Wrong size on BP_WeaponBase_C_ThrowEnd");
static_assert(offsetof(BP_WeaponBase_C_ThrowEnd, bAttach) == 0x000000, "Member 'BP_WeaponBase_C_ThrowEnd::bAttach' has a wrong offset!");

// Function BP_WeaponBase.BP_WeaponBase_C.TakeBackUpdate
// 0x0190 (0x0190 - 0x0000)
struct BP_WeaponBase_C_TakeBackUpdate final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnd;                                              // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8253[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRate_ReturnValue;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8254[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetAttachTransform_Transform;             // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_TLerp_ReturnValue;                        // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOver_ReturnValue;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8255[0x3];                                     // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0104(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesSocketExist_ReturnValue;              // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x018E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WeaponBase_C_TakeBackUpdate) == 0x000010, "Wrong alignment on BP_WeaponBase_C_TakeBackUpdate");
static_assert(sizeof(BP_WeaponBase_C_TakeBackUpdate) == 0x000190, "Wrong size on BP_WeaponBase_C_TakeBackUpdate");
static_assert(offsetof(BP_WeaponBase_C_TakeBackUpdate, DeltaTime) == 0x000000, "Member 'BP_WeaponBase_C_TakeBackUpdate::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_TakeBackUpdate, bEnd) == 0x000004, "Member 'BP_WeaponBase_C_TakeBackUpdate::bEnd' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_TakeBackUpdate, CallFunc_GetRate_ReturnValue) == 0x000008, "Member 'BP_WeaponBase_C_TakeBackUpdate::CallFunc_GetRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_TakeBackUpdate, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'BP_WeaponBase_C_TakeBackUpdate::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_TakeBackUpdate, CallFunc_GetSocketTransform_ReturnValue) == 0x000040, "Member 'BP_WeaponBase_C_TakeBackUpdate::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_TakeBackUpdate, CallFunc_GetAttachTransform_Transform) == 0x000070, "Member 'BP_WeaponBase_C_TakeBackUpdate::CallFunc_GetAttachTransform_Transform' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_TakeBackUpdate, CallFunc_ComposeTransforms_ReturnValue) == 0x0000A0, "Member 'BP_WeaponBase_C_TakeBackUpdate::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_TakeBackUpdate, CallFunc_TLerp_ReturnValue) == 0x0000D0, "Member 'BP_WeaponBase_C_TakeBackUpdate::CallFunc_TLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_TakeBackUpdate, CallFunc_IsOver_ReturnValue) == 0x000100, "Member 'BP_WeaponBase_C_TakeBackUpdate::CallFunc_IsOver_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_TakeBackUpdate, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000104, "Member 'BP_WeaponBase_C_TakeBackUpdate::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_TakeBackUpdate, CallFunc_K2_SetActorTransform_ReturnValue) == 0x00018C, "Member 'BP_WeaponBase_C_TakeBackUpdate::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_TakeBackUpdate, CallFunc_DoesSocketExist_ReturnValue) == 0x00018D, "Member 'BP_WeaponBase_C_TakeBackUpdate::CallFunc_DoesSocketExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_TakeBackUpdate, CallFunc_IsValid_ReturnValue) == 0x00018E, "Member 'BP_WeaponBase_C_TakeBackUpdate::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_WeaponBase.BP_WeaponBase_C.SetBattleEffect
// 0x0018 (0x0018 - 0x0000)
struct BP_WeaponBase_C_SetBattleEffect final
{
public:
	bool                                          bON;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESequencerDilationOwner                       Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequencerDilationOwner                       Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequencerDilationOwner                       K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8256[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponBase_C_SetBattleEffect) == 0x000008, "Wrong alignment on BP_WeaponBase_C_SetBattleEffect");
static_assert(sizeof(BP_WeaponBase_C_SetBattleEffect) == 0x000018, "Wrong size on BP_WeaponBase_C_SetBattleEffect");
static_assert(offsetof(BP_WeaponBase_C_SetBattleEffect, bON) == 0x000000, "Member 'BP_WeaponBase_C_SetBattleEffect::bON' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_SetBattleEffect, Temp_bool_Variable) == 0x000001, "Member 'BP_WeaponBase_C_SetBattleEffect::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_SetBattleEffect, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'BP_WeaponBase_C_SetBattleEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_SetBattleEffect, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'BP_WeaponBase_C_SetBattleEffect::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_SetBattleEffect, CallFunc_IsValid_ReturnValue_1) == 0x000004, "Member 'BP_WeaponBase_C_SetBattleEffect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_SetBattleEffect, Temp_byte_Variable) == 0x000005, "Member 'BP_WeaponBase_C_SetBattleEffect::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_SetBattleEffect, Temp_byte_Variable_1) == 0x000006, "Member 'BP_WeaponBase_C_SetBattleEffect::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_SetBattleEffect, K2Node_Select_Default) == 0x000007, "Member 'BP_WeaponBase_C_SetBattleEffect::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_SetBattleEffect, CallFunc_IsValid_ReturnValue_2) == 0x000008, "Member 'BP_WeaponBase_C_SetBattleEffect::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_SetBattleEffect, CallFunc_IsValid_ReturnValue_3) == 0x000009, "Member 'BP_WeaponBase_C_SetBattleEffect::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_SetBattleEffect, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000010, "Member 'BP_WeaponBase_C_SetBattleEffect::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");

// Function BP_WeaponBase.BP_WeaponBase_C.SetWeaponVisibility
// 0x0030 (0x0030 - 0x0000)
struct BP_WeaponBase_C_SetWeaponVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8257[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8258[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CallFunc_GetExtraMesh_ExtraMesh;                   // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponBase_C_SetWeaponVisibility) == 0x000008, "Wrong alignment on BP_WeaponBase_C_SetWeaponVisibility");
static_assert(sizeof(BP_WeaponBase_C_SetWeaponVisibility) == 0x000030, "Wrong size on BP_WeaponBase_C_SetWeaponVisibility");
static_assert(offsetof(BP_WeaponBase_C_SetWeaponVisibility, bVisible) == 0x000000, "Member 'BP_WeaponBase_C_SetWeaponVisibility::bVisible' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_SetWeaponVisibility, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_WeaponBase_C_SetWeaponVisibility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_SetWeaponVisibility, Temp_int_Loop_Num_Variable) == 0x000008, "Member 'BP_WeaponBase_C_SetWeaponVisibility::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_SetWeaponVisibility, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_WeaponBase_C_SetWeaponVisibility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_SetWeaponVisibility, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'BP_WeaponBase_C_SetWeaponVisibility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_SetWeaponVisibility, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_WeaponBase_C_SetWeaponVisibility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_SetWeaponVisibility, CallFunc_GetExtraMesh_ExtraMesh) == 0x000018, "Member 'BP_WeaponBase_C_SetWeaponVisibility::CallFunc_GetExtraMesh_ExtraMesh' has a wrong offset!");
static_assert(offsetof(BP_WeaponBase_C_SetWeaponVisibility, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_WeaponBase_C_SetWeaponVisibility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function BP_WeaponBase.BP_WeaponBase_C.Initialize
// 0x0001 (0x0001 - 0x0000)
struct BP_WeaponBase_C_Initialize final
{
public:
	bool                                          bDummy;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WeaponBase_C_Initialize) == 0x000001, "Wrong alignment on BP_WeaponBase_C_Initialize");
static_assert(sizeof(BP_WeaponBase_C_Initialize) == 0x000001, "Wrong size on BP_WeaponBase_C_Initialize");
static_assert(offsetof(BP_WeaponBase_C_Initialize, bDummy) == 0x000000, "Member 'BP_WeaponBase_C_Initialize::bDummy' has a wrong offset!");

// Function BP_WeaponBase.BP_WeaponBase_C.SetMaterialColor_PsychicEmission
// 0x0098 (0x0098 - 0x0000)
struct BP_WeaponBase_C_SetMaterialColor_PsychicEmission final
{
public:
	float                                         R;                                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         G;                                                 // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         B;                                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ClaimantName;                                      // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8259[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               LElement;                                          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LIndex;                                            // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
