#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_BrainCrashPostProcessControl

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BPC_BrainCrashPostProcessControl.BPC_BrainCrashPostProcessControl_C.ExecuteUbergraph_BPC_BrainCrashPostProcessControl
// 0x0008 (0x0008 - 0x0000)
struct BPC_BrainCrashPostProcessControl_C_ExecuteUbergraph_BPC_BrainCrashPostProcessControl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_BrainCrashPostProcessControl_C_ExecuteUbergraph_BPC_BrainCrashPostProcessControl) == 0x000004, "Wrong alignment on BPC_BrainCrashPostProcessControl_C_ExecuteUbergraph_BPC_BrainCrashPostProcessControl");
static_assert(sizeof(BPC_BrainCrashPostProcessControl_C_ExecuteUbergraph_BPC_BrainCrashPostProcessControl) == 0x000008, "Wrong size on BPC_BrainCrashPostProcessControl_C_ExecuteUbergraph_BPC_BrainCrashPostProcessControl");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_ExecuteUbergraph_BPC_BrainCrashPostProcessControl, EntryPoint) == 0x000000, "Member 'BPC_BrainCrashPostProcessControl_C_ExecuteUbergraph_BPC_BrainCrashPostProcessControl::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_ExecuteUbergraph_BPC_BrainCrashPostProcessControl, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BPC_BrainCrashPostProcessControl_C_ExecuteUbergraph_BPC_BrainCrashPostProcessControl::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BPC_BrainCrashPostProcessControl.BPC_BrainCrashPostProcessControl_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BPC_BrainCrashPostProcessControl_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_BrainCrashPostProcessControl_C_ReceiveTick) == 0x000004, "Wrong alignment on BPC_BrainCrashPostProcessControl_C_ReceiveTick");
static_assert(sizeof(BPC_BrainCrashPostProcessControl_C_ReceiveTick) == 0x000004, "Wrong size on BPC_BrainCrashPostProcessControl_C_ReceiveTick");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BPC_BrainCrashPostProcessControl_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BPC_BrainCrashPostProcessControl.BPC_BrainCrashPostProcessControl_C.LoadAssets
// 0x00B0 (0x00B0 - 0x0000)
struct BPC_BrainCrashPostProcessControl_C_LoadAssets final
{
public:
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue_1;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95EE[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance_1;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95EF[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue_2;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue_3;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance_2;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95F0[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance_3;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95F1[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue_4;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance_4;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95F2[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue_5;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance_5;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_BrainCrashPostProcessControl_C_LoadAssets) == 0x000008, "Wrong alignment on BPC_BrainCrashPostProcessControl_C_LoadAssets");
static_assert(sizeof(BPC_BrainCrashPostProcessControl_C_LoadAssets) == 0x0000B0, "Wrong size on BPC_BrainCrashPostProcessControl_C_LoadAssets");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_LoadAssets, CallFunc_LoadSoftObject_ReturnValue) == 0x000000, "Member 'BPC_BrainCrashPostProcessControl_C_LoadAssets::CallFunc_LoadSoftObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_LoadAssets, CallFunc_LoadSoftObject_ReturnValue_1) == 0x000008, "Member 'BPC_BrainCrashPostProcessControl_C_LoadAssets::CallFunc_LoadSoftObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_LoadAssets, K2Node_DynamicCast_AsMaterial_Instance) == 0x000010, "Member 'BPC_BrainCrashPostProcessControl_C_LoadAssets::K2Node_DynamicCast_AsMaterial_Instance' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_LoadAssets, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BPC_BrainCrashPostProcessControl_C_LoadAssets::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_LoadAssets, K2Node_DynamicCast_AsMaterial_Instance_1) == 0x000020, "Member 'BPC_BrainCrashPostProcessControl_C_LoadAssets::K2Node_DynamicCast_AsMaterial_Instance_1' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_LoadAssets, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'BPC_BrainCrashPostProcessControl_C_LoadAssets::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_LoadAssets, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000030, "Member 'BPC_BrainCrashPostProcessControl_C_LoadAssets::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_LoadAssets, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000038, "Member 'BPC_BrainCrashPostProcessControl_C_LoadAssets::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_LoadAssets, CallFunc_LoadSoftObject_ReturnValue_2) == 0x000040, "Member 'BPC_BrainCrashPostProcessControl_C_LoadAssets::CallFunc_LoadSoftObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_LoadAssets, CallFunc_LoadSoftObject_ReturnValue_3) == 0x000048, "Member 'BPC_BrainCrashPostProcessControl_C_LoadAssets::CallFunc_LoadSoftObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_LoadAssets, K2Node_DynamicCast_AsMaterial_Instance_2) == 0x000050, "Member 'BPC_BrainCrashPostProcessControl_C_LoadAssets::K2Node_DynamicCast_AsMaterial_Instance_2' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_LoadAssets, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'BPC_BrainCrashPostProcessControl_C_LoadAssets::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_LoadAssets, K2Node_DynamicCast_AsMaterial_Instance_3) == 0x000060, "Member 'BPC_BrainCrashPostProcessControl_C_LoadAssets::K2Node_DynamicCast_AsMaterial_Instance_3' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_LoadAssets, K2Node_DynamicCast_bSuccess_3) == 0x000068, "Member 'BPC_BrainCrashPostProcessControl_C_LoadAssets::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_LoadAssets, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000070, "Member 'BPC_BrainCrashPostProcessControl_C_LoadAssets::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_LoadAssets, CallFunc_LoadSoftObject_ReturnValue_4) == 0x000078, "Member 'BPC_BrainCrashPostProcessControl_C_LoadAssets::CallFunc_LoadSoftObject_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_LoadAssets, K2Node_DynamicCast_AsMaterial_Instance_4) == 0x000080, "Member 'BPC_BrainCrashPostProcessControl_C_LoadAssets::K2Node_DynamicCast_AsMaterial_Instance_4' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_LoadAssets, K2Node_DynamicCast_bSuccess_4) == 0x000088, "Member 'BPC_BrainCrashPostProcessControl_C_LoadAssets::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_LoadAssets, CallFunc_LoadSoftObject_ReturnValue_5) == 0x000090, "Member 'BPC_BrainCrashPostProcessControl_C_LoadAssets::CallFunc_LoadSoftObject_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_LoadAssets, CallFunc_CreateDynamicMaterialInstance_ReturnValue_3) == 0x000098, "Member 'BPC_BrainCrashPostProcessControl_C_LoadAssets::CallFunc_CreateDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_LoadAssets, K2Node_DynamicCast_AsMaterial_Instance_5) == 0x0000A0, "Member 'BPC_BrainCrashPostProcessControl_C_LoadAssets::K2Node_DynamicCast_AsMaterial_Instance_5' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_LoadAssets, K2Node_DynamicCast_bSuccess_5) == 0x0000A8, "Member 'BPC_BrainCrashPostProcessControl_C_LoadAssets::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");

// Function BPC_BrainCrashPostProcessControl.BPC_BrainCrashPostProcessControl_C.SetupAllOff
// 0x0068 (0x0068 - 0x0000)
struct BPC_BrainCrashPostProcessControl_C_SetupAllOff final
{
public:
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_1; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_2; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_3; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_4; // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PrivateGetPerformPostProcess_Enable;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95F3[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_5; // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_BrainCrashPostProcessControl_C_SetupAllOff) == 0x000008, "Wrong alignment on BPC_BrainCrashPostProcessControl_C_SetupAllOff");
static_assert(sizeof(BPC_BrainCrashPostProcessControl_C_SetupAllOff) == 0x000068, "Wrong size on BPC_BrainCrashPostProcessControl_C_SetupAllOff");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_SetupAllOff, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000000, "Member 'BPC_BrainCrashPostProcessControl_C_SetupAllOff::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_SetupAllOff, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_1) == 0x000010, "Member 'BPC_BrainCrashPostProcessControl_C_SetupAllOff::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_1' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_SetupAllOff, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_2) == 0x000020, "Member 'BPC_BrainCrashPostProcessControl_C_SetupAllOff::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_2' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_SetupAllOff, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_3) == 0x000030, "Member 'BPC_BrainCrashPostProcessControl_C_SetupAllOff::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_3' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_SetupAllOff, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_4) == 0x000040, "Member 'BPC_BrainCrashPostProcessControl_C_SetupAllOff::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_4' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_SetupAllOff, CallFunc_PrivateGetPerformPostProcess_Enable) == 0x000050, "Member 'BPC_BrainCrashPostProcessControl_C_SetupAllOff::CallFunc_PrivateGetPerformPostProcess_Enable' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_SetupAllOff, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_5) == 0x000058, "Member 'BPC_BrainCrashPostProcessControl_C_SetupAllOff::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_5' has a wrong offset!");

// Function BPC_BrainCrashPostProcessControl.BPC_BrainCrashPostProcessControl_C.PrivateGetPerformPostProcess
// 0x0020 (0x0020 - 0x0000)
struct BPC_BrainCrashPostProcessControl_C_PrivateGetPerformPostProcess final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95F4[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PostProcessManager_C*               CallFunc_GetPostProcessManager_Manager;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  CallFunc_GetPerformPostProcess_PostProcess;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_BrainCrashPostProcessControl_C_PrivateGetPerformPostProcess) == 0x000008, "Wrong alignment on BPC_BrainCrashPostProcessControl_C_PrivateGetPerformPostProcess");
static_assert(sizeof(BPC_BrainCrashPostProcessControl_C_PrivateGetPerformPostProcess) == 0x000020, "Wrong size on BPC_BrainCrashPostProcessControl_C_PrivateGetPerformPostProcess");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_PrivateGetPerformPostProcess, Enable) == 0x000000, "Member 'BPC_BrainCrashPostProcessControl_C_PrivateGetPerformPostProcess::Enable' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_PrivateGetPerformPostProcess, CallFunc_GetPostProcessManager_Manager) == 0x000008, "Member 'BPC_BrainCrashPostProcessControl_C_PrivateGetPerformPostProcess::CallFunc_GetPostProcessManager_Manager' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_PrivateGetPerformPostProcess, CallFunc_GetPerformPostProcess_PostProcess) == 0x000010, "Member 'BPC_BrainCrashPostProcessControl_C_PrivateGetPerformPostProcess::CallFunc_GetPerformPostProcess_PostProcess' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_PrivateGetPerformPostProcess, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BPC_BrainCrashPostProcessControl_C_PrivateGetPerformPostProcess::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_PrivateGetPerformPostProcess, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'BPC_BrainCrashPostProcessControl_C_PrivateGetPerformPostProcess::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BPC_BrainCrashPostProcessControl.BPC_BrainCrashPostProcessControl_C.Update
// 0x0078 (0x0078 - 0x0000)
struct BPC_BrainCrashPostProcessControl_C_Update final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enabled;                                           // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95F5[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95F6[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95F7[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_1; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95F8[0x1];                                     // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_1; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaySimulate_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95F9[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_1;           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_2; // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PrivateGetPerformPostProcess_Enable;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95FA[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95FB[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_2;           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_3; // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_BrainCrashPostProcessControl_C_Update) == 0x000008, "Wrong alignment on BPC_BrainCrashPostProcessControl_C_Update");
static_assert(sizeof(BPC_BrainCrashPostProcessControl_C_Update) == 0x000078, "Wrong size on BPC_BrainCrashPostProcessControl_C_Update");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_Update, DeltaSeconds) == 0x000000, "Member 'BPC_BrainCrashPostProcessControl_C_Update::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_Update, Enabled) == 0x000004, "Member 'BPC_BrainCrashPostProcessControl_C_Update::Enabled' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_Update, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BPC_BrainCrashPostProcessControl_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_Update, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000008, "Member 'BPC_BrainCrashPostProcessControl_C_Update::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_Update, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'BPC_BrainCrashPostProcessControl_C_Update::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_Update, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x00001C, "Member 'BPC_BrainCrashPostProcessControl_C_Update::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_Update, CallFunc_IsValid_ReturnValue_2) == 0x000020, "Member 'BPC_BrainCrashPostProcessControl_C_Update::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_Update, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000021, "Member 'BPC_BrainCrashPostProcessControl_C_Update::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_Update, CallFunc_K2_GetScalarParameterValue_ReturnValue_1) == 0x000024, "Member 'BPC_BrainCrashPostProcessControl_C_Update::CallFunc_K2_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_Update, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000028, "Member 'BPC_BrainCrashPostProcessControl_C_Update::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_Update, CallFunc_BooleanAND_ReturnValue) == 0x000029, "Member 'BPC_BrainCrashPostProcessControl_C_Update::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_Update, CallFunc_IsValid_ReturnValue_3) == 0x00002A, "Member 'BPC_BrainCrashPostProcessControl_C_Update::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_Update, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00002C, "Member 'BPC_BrainCrashPostProcessControl_C_Update::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_Update, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_1) == 0x000030, "Member 'BPC_BrainCrashPostProcessControl_C_Update::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_1' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_Update, CallFunc_IsPlaySimulate_ReturnValue) == 0x000040, "Member 'BPC_BrainCrashPostProcessControl_C_Update::CallFunc_IsPlaySimulate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_Update, CallFunc_Conv_BoolToFloat_ReturnValue_1) == 0x000044, "Member 'BPC_BrainCrashPostProcessControl_C_Update::CallFunc_Conv_BoolToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_Update, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_2) == 0x000048, "Member 'BPC_BrainCrashPostProcessControl_C_Update::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_2' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_Update, CallFunc_PrivateGetPerformPostProcess_Enable) == 0x000058, "Member 'BPC_BrainCrashPostProcessControl_C_Update::CallFunc_PrivateGetPerformPostProcess_Enable' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_Update, CallFunc_GetScalarParameterValue_ReturnValue) == 0x00005C, "Member 'BPC_BrainCrashPostProcessControl_C_Update::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_Update, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000060, "Member 'BPC_BrainCrashPostProcessControl_C_Update::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_Update, CallFunc_Conv_BoolToFloat_ReturnValue_2) == 0x000064, "Member 'BPC_BrainCrashPostProcessControl_C_Update::CallFunc_Conv_BoolToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_Update, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_3) == 0x000068, "Member 'BPC_BrainCrashPostProcessControl_C_Update::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_3' has a wrong offset!");

// Function BPC_BrainCrashPostProcessControl.BPC_BrainCrashPostProcessControl_C.GetBGCrashMID
// 0x0008 (0x0008 - 0x0000)
struct BPC_BrainCrashPostProcessControl_C_GetBGCrashMID final
{
public:
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_BrainCrashPostProcessControl_C_GetBGCrashMID) == 0x000008, "Wrong alignment on BPC_BrainCrashPostProcessControl_C_GetBGCrashMID");
static_assert(sizeof(BPC_BrainCrashPostProcessControl_C_GetBGCrashMID) == 0x000008, "Wrong size on BPC_BrainCrashPostProcessControl_C_GetBGCrashMID");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_GetBGCrashMID, Mid) == 0x000000, "Member 'BPC_BrainCrashPostProcessControl_C_GetBGCrashMID::Mid' has a wrong offset!");

// Function BPC_BrainCrashPostProcessControl.BPC_BrainCrashPostProcessControl_C.SetupGeneral
// 0x0001 (0x0001 - 0x0000)
struct BPC_BrainCrashPostProcessControl_C_SetupGeneral final
{
public:
	bool                                          General;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_BrainCrashPostProcessControl_C_SetupGeneral) == 0x000001, "Wrong alignment on BPC_BrainCrashPostProcessControl_C_SetupGeneral");
static_assert(sizeof(BPC_BrainCrashPostProcessControl_C_SetupGeneral) == 0x000001, "Wrong size on BPC_BrainCrashPostProcessControl_C_SetupGeneral");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_SetupGeneral, General) == 0x000000, "Member 'BPC_BrainCrashPostProcessControl_C_SetupGeneral::General' has a wrong offset!");

// Function BPC_BrainCrashPostProcessControl.BPC_BrainCrashPostProcessControl_C.UpdateProductEnemy
// 0x0028 (0x0028 - 0x0000)
struct BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy final
{
public:
	class UMaterialInstanceDynamic*               TargetMaterial;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enabled;                                           // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EGradualQuality                               CallFunc_UseRenderingOptionPPMBrainCrash_Quality;  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95FC[0x1];                                     // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy) == 0x000008, "Wrong alignment on BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy");
static_assert(sizeof(BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy) == 0x000028, "Wrong size on BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy, TargetMaterial) == 0x000000, "Member 'BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy::TargetMaterial' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy, Enabled) == 0x000008, "Member 'BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy::Enabled' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy, CallFunc_UseRenderingOptionPPMBrainCrash_Quality) == 0x000009, "Member 'BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy::CallFunc_UseRenderingOptionPPMBrainCrash_Quality' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy, K2Node_SwitchEnum_CmpSuccess) == 0x00000A, "Member 'BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00000C, "Member 'BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000010, "Member 'BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000020, "Member 'BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000021, "Member 'BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x000023, "Member 'BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy, CallFunc_BooleanOR_ReturnValue) == 0x000024, "Member 'BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy, CallFunc_BooleanOR_ReturnValue_1) == 0x000025, "Member 'BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy, CallFunc_BooleanAND_ReturnValue_1) == 0x000026, "Member 'BPC_BrainCrashPostProcessControl_C_UpdateProductEnemy::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BPC_BrainCrashPostProcessControl.BPC_BrainCrashPostProcessControl_C.GetENPCDamageMID
// 0x0008 (0x0008 - 0x0000)
struct BPC_BrainCrashPostProcessControl_C_GetENPCDamageMID final
{
public:
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_BrainCrashPostProcessControl_C_GetENPCDamageMID) == 0x000008, "Wrong alignment on BPC_BrainCrashPostProcessControl_C_GetENPCDamageMID");
static_assert(sizeof(BPC_BrainCrashPostProcessControl_C_GetENPCDamageMID) == 0x000008, "Wrong size on BPC_BrainCrashPostProcessControl_C_GetENPCDamageMID");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_GetENPCDamageMID, Mid) == 0x000000, "Member 'BPC_BrainCrashPostProcessControl_C_GetENPCDamageMID::Mid' has a wrong offset!");

// Function BPC_BrainCrashPostProcessControl.BPC_BrainCrashPostProcessControl_C.ActivateENPCDamageMID
// 0x0001 (0x0001 - 0x0000)
struct BPC_BrainCrashPostProcessControl_C_ActivateENPCDamageMID final
{
public:
	bool                                          Param_IsActive;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_BrainCrashPostProcessControl_C_ActivateENPCDamageMID) == 0x000001, "Wrong alignment on BPC_BrainCrashPostProcessControl_C_ActivateENPCDamageMID");
static_assert(sizeof(BPC_BrainCrashPostProcessControl_C_ActivateENPCDamageMID) == 0x000001, "Wrong size on BPC_BrainCrashPostProcessControl_C_ActivateENPCDamageMID");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_ActivateENPCDamageMID, Param_IsActive) == 0x000000, "Member 'BPC_BrainCrashPostProcessControl_C_ActivateENPCDamageMID::Param_IsActive' has a wrong offset!");

// Function BPC_BrainCrashPostProcessControl.BPC_BrainCrashPostProcessControl_C.SetUseProductEnemyPPM
// 0x0001 (0x0001 - 0x0000)
struct BPC_BrainCrashPostProcessControl_C_SetUseProductEnemyPPM final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_BrainCrashPostProcessControl_C_SetUseProductEnemyPPM) == 0x000001, "Wrong alignment on BPC_BrainCrashPostProcessControl_C_SetUseProductEnemyPPM");
static_assert(sizeof(BPC_BrainCrashPostProcessControl_C_SetUseProductEnemyPPM) == 0x000001, "Wrong size on BPC_BrainCrashPostProcessControl_C_SetUseProductEnemyPPM");
static_assert(offsetof(BPC_BrainCrashPostProcessControl_C_SetUseProductEnemyPPM, Enable) == 0x000000, "Member 'BPC_BrainCrashPostProcessControl_C_SetUseProductEnemyPPM::Enable' has a wrong offset!");

}

