#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_RenderScarComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_RenderScarComponent.BPC_RenderScarComponent_C
// 0x0028 (0x00E8 - 0x00C0)
class UBPC_RenderScarComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMeshComponent*                         TargetMesh;                                        // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         RenderMesh;                                        // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InitializeSetupTexture;                            // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          InitializeSetupMaterial;                           // 0x00D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UseScar;                                           // 0x00DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61B8[0x1];                                     // 0x00DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TagName;                                           // 0x00DC(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPC_RenderScarComponent(int32 EntryPoint);
	void PrivatePostCapture();
	void Initialize(class UMeshComponent* TargetComponent);
	void AddScarMatrix(float RadiusSideScale, float RadiusFrontScale, float ThicknessScale, const struct FVector& Location, const struct FVector& MatrixForward, const struct FVector& MatrixRight, const struct FVector& MatrixUpper, int32 SkillAttribute, EHDamageEffectType DamageEffectType, bool UsePriority, int32* Handle);
	void PrivateInitializeSetupTexture();
	void PrivateInitializeSetupMaterial();
	void AddScarFromHitResult(class AActor* DamageActor, const struct FHCHitResult& HitResult);
	void AddScarFromHitDamageInfo(class AActor* DamageActor, const struct FHitDamageInfo& HitDamageInfo);
	void SetUseScar(bool Param_UseScar);
	void GetTagName(class FName* Tag);
	void SetRenderMeshScalarParameter(class FName ParameterName, float ParameterValue);
	void GetRenderMeshScalarParameter(class FName ParameterName, float* ParameterValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_RenderScarComponent_C">();
	}
	static class UBPC_RenderScarComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_RenderScarComponent_C>();
	}
};
static_assert(alignof(UBPC_RenderScarComponent_C) == 0x000008, "Wrong alignment on UBPC_RenderScarComponent_C");
static_assert(sizeof(UBPC_RenderScarComponent_C) == 0x0000E8, "Wrong size on UBPC_RenderScarComponent_C");
static_assert(offsetof(UBPC_RenderScarComponent_C, UberGraphFrame) == 0x0000C0, "Member 'UBPC_RenderScarComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_RenderScarComponent_C, TargetMesh) == 0x0000C8, "Member 'UBPC_RenderScarComponent_C::TargetMesh' has a wrong offset!");
static_assert(offsetof(UBPC_RenderScarComponent_C, RenderMesh) == 0x0000D0, "Member 'UBPC_RenderScarComponent_C::RenderMesh' has a wrong offset!");
static_assert(offsetof(UBPC_RenderScarComponent_C, InitializeSetupTexture) == 0x0000D8, "Member 'UBPC_RenderScarComponent_C::InitializeSetupTexture' has a wrong offset!");
static_assert(offsetof(UBPC_RenderScarComponent_C, InitializeSetupMaterial) == 0x0000D9, "Member 'UBPC_RenderScarComponent_C::InitializeSetupMaterial' has a wrong offset!");
static_assert(offsetof(UBPC_RenderScarComponent_C, UseScar) == 0x0000DA, "Member 'UBPC_RenderScarComponent_C::UseScar' has a wrong offset!");
static_assert(offsetof(UBPC_RenderScarComponent_C, TagName) == 0x0000DC, "Member 'UBPC_RenderScarComponent_C::TagName' has a wrong offset!");

}

