#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_CutinEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_CutinEffect.BPC_CutinEffect_C
// 0x00A8 (0x0168 - 0x00C0)
class UBPC_CutinEffect_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         DotCrawBlendWeight;                                // 0x00C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         DotCrawTexelScale;                                 // 0x00CC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         DotCrawYtoIQInterferenceIntensity;                 // 0x00D0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         TapeDistortionBlendWeight;                         // 0x00D4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         TapeDistortionCrease1NoiseSpeed;                   // 0x00D8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         TapeDistortionCrease1Speed;                        // 0x00DC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         TapeDistortionCrease3NoiseSpeed;                   // 0x00E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         TapeDistortionCrease3Speed;                        // 0x00E4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         TapeDistortionOctave1Speed;                        // 0x00E8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         TapeDistortionOctave2Speed;                        // 0x00EC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         TapeDistortionOctave3Speed;                        // 0x00F0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TapeDistortionCrease1SignalInfluence;              // 0x00F4(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TapeDistortionCrease3SignalInfluence;              // 0x0104(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CharaRimColor;                                     // 0x0114(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         CharaRimIntensity;                                 // 0x0124(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CharaEmissiveColor;                                // 0x0128(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         CharaEmissiveIntensity;                            // 0x0138(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         CharaLightDirYaw;                                  // 0x013C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         CharaLightDirPitch;                                // 0x0140(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCharaMaterial;                                  // 0x0144(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95FD[0x3];                                     // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               MIDDotCraw;                                        // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MIDTapeDistortion;                                 // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSSceneCaptureComponent2D*             TargetCaptureComponent;                            // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ApplySpeedTimeDilationCounter;                     // 0x0160(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)

public:
	void ExecuteUbergraph_BPC_CutinEffect(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void InitializePPM();
	void UpdatePPM();
	void UpdateCharaMat();
	void SetUseCharaMaterial(bool Use);
	void Initialize(class URSSceneCaptureComponent2D* RsSceneCapture2D);
	void Start();
	void End();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_CutinEffect_C">();
	}
	static class UBPC_CutinEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_CutinEffect_C>();
	}
};
static_assert(alignof(UBPC_CutinEffect_C) == 0x000008, "Wrong alignment on UBPC_CutinEffect_C");
static_assert(sizeof(UBPC_CutinEffect_C) == 0x000168, "Wrong size on UBPC_CutinEffect_C");
static_assert(offsetof(UBPC_CutinEffect_C, UberGraphFrame) == 0x0000C0, "Member 'UBPC_CutinEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_CutinEffect_C, DotCrawBlendWeight) == 0x0000C8, "Member 'UBPC_CutinEffect_C::DotCrawBlendWeight' has a wrong offset!");
static_assert(offsetof(UBPC_CutinEffect_C, DotCrawTexelScale) == 0x0000CC, "Member 'UBPC_CutinEffect_C::DotCrawTexelScale' has a wrong offset!");
static_assert(offsetof(UBPC_CutinEffect_C, DotCrawYtoIQInterferenceIntensity) == 0x0000D0, "Member 'UBPC_CutinEffect_C::DotCrawYtoIQInterferenceIntensity' has a wrong offset!");
static_assert(offsetof(UBPC_CutinEffect_C, TapeDistortionBlendWeight) == 0x0000D4, "Member 'UBPC_CutinEffect_C::TapeDistortionBlendWeight' has a wrong offset!");
static_assert(offsetof(UBPC_CutinEffect_C, TapeDistortionCrease1NoiseSpeed) == 0x0000D8, "Member 'UBPC_CutinEffect_C::TapeDistortionCrease1NoiseSpeed' has a wrong offset!");
static_assert(offsetof(UBPC_CutinEffect_C, TapeDistortionCrease1Speed) == 0x0000DC, "Member 'UBPC_CutinEffect_C::TapeDistortionCrease1Speed' has a wrong offset!");
static_assert(offsetof(UBPC_CutinEffect_C, TapeDistortionCrease3NoiseSpeed) == 0x0000E0, "Member 'UBPC_CutinEffect_C::TapeDistortionCrease3NoiseSpeed' has a wrong offset!");
static_assert(offsetof(UBPC_CutinEffect_C, TapeDistortionCrease3Speed) == 0x0000E4, "Member 'UBPC_CutinEffect_C::TapeDistortionCrease3Speed' has a wrong offset!");
static_assert(offsetof(UBPC_CutinEffect_C, TapeDistortionOctave1Speed) == 0x0000E8, "Member 'UBPC_CutinEffect_C::TapeDistortionOctave1Speed' has a wrong offset!");
static_assert(offsetof(UBPC_CutinEffect_C, TapeDistortionOctave2Speed) == 0x0000EC, "Member 'UBPC_CutinEffect_C::TapeDistortionOctave2Speed' has a wrong offset!");
static_assert(offsetof(UBPC_CutinEffect_C, TapeDistortionOctave3Speed) == 0x0000F0, "Member 'UBPC_CutinEffect_C::TapeDistortionOctave3Speed' has a wrong offset!");
static_assert(offsetof(UBPC_CutinEffect_C, TapeDistortionCrease1SignalInfluence) == 0x0000F4, "Member 'UBPC_CutinEffect_C::TapeDistortionCrease1SignalInfluence' has a wrong offset!");
static_assert(offsetof(UBPC_CutinEffect_C, TapeDistortionCrease3SignalInfluence) == 0x000104, "Member 'UBPC_CutinEffect_C::TapeDistortionCrease3SignalInfluence' has a wrong offset!");
static_assert(offsetof(UBPC_CutinEffect_C, CharaRimColor) == 0x000114, "Member 'UBPC_CutinEffect_C::CharaRimColor' has a wrong offset!");
static_assert(offsetof(UBPC_CutinEffect_C, CharaRimIntensity) == 0x000124, "Member 'UBPC_CutinEffect_C::CharaRimIntensity' has a wrong offset!");
static_assert(offsetof(UBPC_CutinEffect_C, CharaEmissiveColor) == 0x000128, "Member 'UBPC_CutinEffect_C::CharaEmissiveColor' has a wrong offset!");
static_assert(offsetof(UBPC_CutinEffect_C, CharaEmissiveIntensity) == 0x000138, "Member 'UBPC_CutinEffect_C::CharaEmissiveIntensity' has a wrong offset!");
static_assert(offsetof(UBPC_CutinEffect_C, CharaLightDirYaw) == 0x00013C, "Member 'UBPC_CutinEffect_C::CharaLightDirYaw' has a wrong offset!");
static_assert(offsetof(UBPC_CutinEffect_C, CharaLightDirPitch) == 0x000140, "Member 'UBPC_CutinEffect_C::CharaLightDirPitch' has a wrong offset!");
static_assert(offsetof(UBPC_CutinEffect_C, UseCharaMaterial) == 0x000144, "Member 'UBPC_CutinEffect_C::UseCharaMaterial' has a wrong offset!");
static_assert(offsetof(UBPC_CutinEffect_C, MIDDotCraw) == 0x000148, "Member 'UBPC_CutinEffect_C::MIDDotCraw' has a wrong offset!");
static_assert(offsetof(UBPC_CutinEffect_C, MIDTapeDistortion) == 0x000150, "Member 'UBPC_CutinEffect_C::MIDTapeDistortion' has a wrong offset!");
static_assert(offsetof(UBPC_CutinEffect_C, TargetCaptureComponent) == 0x000158, "Member 'UBPC_CutinEffect_C::TargetCaptureComponent' has a wrong offset!");
static_assert(offsetof(UBPC_CutinEffect_C, ApplySpeedTimeDilationCounter) == 0x000160, "Member 'UBPC_CutinEffect_C::ApplySpeedTimeDilationCounter' has a wrong offset!");

}

