#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_PsychicBattle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SPsychicCaptureMaterial_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function BPC_PsychicBattle.BPC_PsychicBattle_C.OnFinished__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BPC_PsychicBattle_C_OnFinished__DelegateSignature final
{
public:
	EPsychicBattleType                            PsychicBattleType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PsychicBattle_C_OnFinished__DelegateSignature) == 0x000001, "Wrong alignment on BPC_PsychicBattle_C_OnFinished__DelegateSignature");
static_assert(sizeof(BPC_PsychicBattle_C_OnFinished__DelegateSignature) == 0x000001, "Wrong size on BPC_PsychicBattle_C_OnFinished__DelegateSignature");
static_assert(offsetof(BPC_PsychicBattle_C_OnFinished__DelegateSignature, PsychicBattleType) == 0x000000, "Member 'BPC_PsychicBattle_C_OnFinished__DelegateSignature::PsychicBattleType' has a wrong offset!");

// Function BPC_PsychicBattle.BPC_PsychicBattle_C.OnStart__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BPC_PsychicBattle_C_OnStart__DelegateSignature final
{
public:
	EPsychicBattleType                            PsychicBattleType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PsychicBattle_C_OnStart__DelegateSignature) == 0x000001, "Wrong alignment on BPC_PsychicBattle_C_OnStart__DelegateSignature");
static_assert(sizeof(BPC_PsychicBattle_C_OnStart__DelegateSignature) == 0x000001, "Wrong size on BPC_PsychicBattle_C_OnStart__DelegateSignature");
static_assert(offsetof(BPC_PsychicBattle_C_OnStart__DelegateSignature, PsychicBattleType) == 0x000000, "Member 'BPC_PsychicBattle_C_OnStart__DelegateSignature::PsychicBattleType' has a wrong offset!");

// Function BPC_PsychicBattle.BPC_PsychicBattle_C.OnBattleStart__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BPC_PsychicBattle_C_OnBattleStart__DelegateSignature final
{
public:
	EPsychicBattleType                            PsychicBattleType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PsychicBattle_C_OnBattleStart__DelegateSignature) == 0x000001, "Wrong alignment on BPC_PsychicBattle_C_OnBattleStart__DelegateSignature");
static_assert(sizeof(BPC_PsychicBattle_C_OnBattleStart__DelegateSignature) == 0x000001, "Wrong size on BPC_PsychicBattle_C_OnBattleStart__DelegateSignature");
static_assert(offsetof(BPC_PsychicBattle_C_OnBattleStart__DelegateSignature, PsychicBattleType) == 0x000000, "Member 'BPC_PsychicBattle_C_OnBattleStart__DelegateSignature::PsychicBattleType' has a wrong offset!");

// Function BPC_PsychicBattle.BPC_PsychicBattle_C.OnBattleFinish__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct BPC_PsychicBattle_C_OnBattleFinish__DelegateSignature final
{
public:
	EPsychicBattleType                            PsychicBattleType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Win;                                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_PsychicBattle_C_OnBattleFinish__DelegateSignature) == 0x000001, "Wrong alignment on BPC_PsychicBattle_C_OnBattleFinish__DelegateSignature");
static_assert(sizeof(BPC_PsychicBattle_C_OnBattleFinish__DelegateSignature) == 0x000002, "Wrong size on BPC_PsychicBattle_C_OnBattleFinish__DelegateSignature");
static_assert(offsetof(BPC_PsychicBattle_C_OnBattleFinish__DelegateSignature, PsychicBattleType) == 0x000000, "Member 'BPC_PsychicBattle_C_OnBattleFinish__DelegateSignature::PsychicBattleType' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_OnBattleFinish__DelegateSignature, Win) == 0x000001, "Member 'BPC_PsychicBattle_C_OnBattleFinish__DelegateSignature::Win' has a wrong offset!");

// Function BPC_PsychicBattle.BPC_PsychicBattle_C.ExecuteUbergraph_BPC_PsychicBattle
// 0x0028 (0x0028 - 0x0000)
struct BPC_PsychicBattle_C_ExecuteUbergraph_BPC_PsychicBattle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87AD[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPsychicBattleAnimationPhaseType              K2Node_CustomEvent_BattlePhase;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87AE[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PsychicBattleObject_C> K2Node_DynamicCast_AsBPI_Psychic_Battle_Object;    // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_PsychicBattle_C_ExecuteUbergraph_BPC_PsychicBattle) == 0x000008, "Wrong alignment on BPC_PsychicBattle_C_ExecuteUbergraph_BPC_PsychicBattle");
static_assert(sizeof(BPC_PsychicBattle_C_ExecuteUbergraph_BPC_PsychicBattle) == 0x000028, "Wrong size on BPC_PsychicBattle_C_ExecuteUbergraph_BPC_PsychicBattle");
static_assert(offsetof(BPC_PsychicBattle_C_ExecuteUbergraph_BPC_PsychicBattle, EntryPoint) == 0x000000, "Member 'BPC_PsychicBattle_C_ExecuteUbergraph_BPC_PsychicBattle::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ExecuteUbergraph_BPC_PsychicBattle, K2Node_Event_EndPlayReason) == 0x000004, "Member 'BPC_PsychicBattle_C_ExecuteUbergraph_BPC_PsychicBattle::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ExecuteUbergraph_BPC_PsychicBattle, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BPC_PsychicBattle_C_ExecuteUbergraph_BPC_PsychicBattle::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ExecuteUbergraph_BPC_PsychicBattle, K2Node_CustomEvent_BattlePhase) == 0x00000C, "Member 'BPC_PsychicBattle_C_ExecuteUbergraph_BPC_PsychicBattle::K2Node_CustomEvent_BattlePhase' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ExecuteUbergraph_BPC_PsychicBattle, CallFunc_IsValid_ReturnValue) == 0x00000D, "Member 'BPC_PsychicBattle_C_ExecuteUbergraph_BPC_PsychicBattle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ExecuteUbergraph_BPC_PsychicBattle, K2Node_DynamicCast_AsBPI_Psychic_Battle_Object) == 0x000010, "Member 'BPC_PsychicBattle_C_ExecuteUbergraph_BPC_PsychicBattle::K2Node_DynamicCast_AsBPI_Psychic_Battle_Object' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ExecuteUbergraph_BPC_PsychicBattle, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BPC_PsychicBattle_C_ExecuteUbergraph_BPC_PsychicBattle::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BPC_PsychicBattle.BPC_PsychicBattle_C.PlayBatleObjectAnimation
// 0x0001 (0x0001 - 0x0000)
struct BPC_PsychicBattle_C_PlayBatleObjectAnimation final
{
public:
	EPsychicBattleAnimationPhaseType              BattlePhase;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PsychicBattle_C_PlayBatleObjectAnimation) == 0x000001, "Wrong alignment on BPC_PsychicBattle_C_PlayBatleObjectAnimation");
static_assert(sizeof(BPC_PsychicBattle_C_PlayBatleObjectAnimation) == 0x000001, "Wrong size on BPC_PsychicBattle_C_PlayBatleObjectAnimation");
static_assert(offsetof(BPC_PsychicBattle_C_PlayBatleObjectAnimation, BattlePhase) == 0x000000, "Member 'BPC_PsychicBattle_C_PlayBatleObjectAnimation::BattlePhase' has a wrong offset!");

// Function BPC_PsychicBattle.BPC_PsychicBattle_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BPC_PsychicBattle_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PsychicBattle_C_ReceiveTick) == 0x000004, "Wrong alignment on BPC_PsychicBattle_C_ReceiveTick");
static_assert(sizeof(BPC_PsychicBattle_C_ReceiveTick) == 0x000004, "Wrong size on BPC_PsychicBattle_C_ReceiveTick");
static_assert(offsetof(BPC_PsychicBattle_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BPC_PsychicBattle_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BPC_PsychicBattle.BPC_PsychicBattle_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BPC_PsychicBattle_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PsychicBattle_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BPC_PsychicBattle_C_ReceiveEndPlay");
static_assert(sizeof(BPC_PsychicBattle_C_ReceiveEndPlay) == 0x000001, "Wrong size on BPC_PsychicBattle_C_ReceiveEndPlay");
static_assert(offsetof(BPC_PsychicBattle_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BPC_PsychicBattle_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BPC_PsychicBattle.BPC_PsychicBattle_C.Start
// 0x00F0 (0x00F0 - 0x0000)
struct BPC_PsychicBattle_C_Start final
{
public:
	EPsychicBattleType                            PsychicBattleType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87AF[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattleCharacter_C*                   User;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARsBattleHero_C*                        K2Node_DynamicCast_AsRs_Battle_Hero;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87B0[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleCharacterInterface_C> K2Node_DynamicCast_AsBPI_Battle_Character_Interface; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87B1[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetLockOnTargetInterface_TargetActor;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLockTarget_ReturnValue;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87B2[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87B3[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0078(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PsychicBattle_C_Start) == 0x000008, "Wrong alignment on BPC_PsychicBattle_C_Start");
static_assert(sizeof(BPC_PsychicBattle_C_Start) == 0x0000F0, "Wrong size on BPC_PsychicBattle_C_Start");
static_assert(offsetof(BPC_PsychicBattle_C_Start, PsychicBattleType) == 0x000000, "Member 'BPC_PsychicBattle_C_Start::PsychicBattleType' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Start, User) == 0x000008, "Member 'BPC_PsychicBattle_C_Start::User' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Start, K2Node_DynamicCast_AsRs_Battle_Hero) == 0x000010, "Member 'BPC_PsychicBattle_C_Start::K2Node_DynamicCast_AsRs_Battle_Hero' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Start, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BPC_PsychicBattle_C_Start::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Start, K2Node_DynamicCast_AsBPI_Battle_Character_Interface) == 0x000020, "Member 'BPC_PsychicBattle_C_Start::K2Node_DynamicCast_AsBPI_Battle_Character_Interface' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Start, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BPC_PsychicBattle_C_Start::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Start, CallFunc_GetLockOnTargetInterface_TargetActor) == 0x000038, "Member 'BPC_PsychicBattle_C_Start::CallFunc_GetLockOnTargetInterface_TargetActor' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Start, CallFunc_IsLockTarget_ReturnValue) == 0x000040, "Member 'BPC_PsychicBattle_C_Start::CallFunc_IsLockTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Start, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000041, "Member 'BPC_PsychicBattle_C_Start::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Start, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000048, "Member 'BPC_PsychicBattle_C_Start::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Start, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BPC_PsychicBattle_C_Start::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Start, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'BPC_PsychicBattle_C_Start::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Start, K2Node_MakeStruct_FormatArgumentData) == 0x000078, "Member 'BPC_PsychicBattle_C_Start::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Start, K2Node_MakeArray_Array) == 0x0000B8, "Member 'BPC_PsychicBattle_C_Start::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Start, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'BPC_PsychicBattle_C_Start::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Start, CallFunc_Conv_TextToString_ReturnValue) == 0x0000E0, "Member 'BPC_PsychicBattle_C_Start::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function BPC_PsychicBattle.BPC_PsychicBattle_C.ProtectedInitialize
// 0x00B0 (0x00B0 - 0x0000)
struct BPC_PsychicBattle_C_ProtectedInitialize final
{
public:
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87B4[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	class ABP_SeamlessCameraRoot_C*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSLevelSequenceActor*                  CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87B5[0x6];                                     // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PsychicBattle_C_ProtectedInitialize) == 0x000010, "Wrong alignment on BPC_PsychicBattle_C_ProtectedInitialize");
static_assert(sizeof(BPC_PsychicBattle_C_ProtectedInitialize) == 0x0000B0, "Wrong size on BPC_PsychicBattle_C_ProtectedInitialize");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedInitialize, CallFunc_MakeTransform_ReturnValue) == 0x000000, "Member 'BPC_PsychicBattle_C_ProtectedInitialize::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedInitialize, CallFunc_MakeLiteralInt_ReturnValue) == 0x000030, "Member 'BPC_PsychicBattle_C_ProtectedInitialize::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedInitialize, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000038, "Member 'BPC_PsychicBattle_C_ProtectedInitialize::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedInitialize, CallFunc_MakeTransform_ReturnValue_1) == 0x000040, "Member 'BPC_PsychicBattle_C_ProtectedInitialize::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedInitialize, CallFunc_FinishSpawningActor_ReturnValue) == 0x000070, "Member 'BPC_PsychicBattle_C_ProtectedInitialize::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedInitialize, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000078, "Member 'BPC_PsychicBattle_C_ProtectedInitialize::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedInitialize, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000080, "Member 'BPC_PsychicBattle_C_ProtectedInitialize::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedInitialize, CallFunc_MakeLiteralByte_ReturnValue) == 0x000088, "Member 'BPC_PsychicBattle_C_ProtectedInitialize::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedInitialize, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000089, "Member 'BPC_PsychicBattle_C_ProtectedInitialize::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedInitialize, CallFunc_GetOwner_ReturnValue) == 0x000090, "Member 'BPC_PsychicBattle_C_ProtectedInitialize::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedInitialize, K2Node_MakeArray_Array) == 0x000098, "Member 'BPC_PsychicBattle_C_ProtectedInitialize::K2Node_MakeArray_Array' has a wrong offset!");

// Function BPC_PsychicBattle.BPC_PsychicBattle_C.ProtectedFinalize
// 0x0004 (0x0004 - 0x0000)
struct BPC_PsychicBattle_C_ProtectedFinalize final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_PsychicBattle_C_ProtectedFinalize) == 0x000001, "Wrong alignment on BPC_PsychicBattle_C_ProtectedFinalize");
static_assert(sizeof(BPC_PsychicBattle_C_ProtectedFinalize) == 0x000004, "Wrong size on BPC_PsychicBattle_C_ProtectedFinalize");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedFinalize, EndPlayReason) == 0x000000, "Member 'BPC_PsychicBattle_C_ProtectedFinalize::EndPlayReason' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedFinalize, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'BPC_PsychicBattle_C_ProtectedFinalize::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedFinalize, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'BPC_PsychicBattle_C_ProtectedFinalize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedFinalize, CallFunc_IsValid_ReturnValue_1) == 0x000003, "Member 'BPC_PsychicBattle_C_ProtectedFinalize::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BPC_PsychicBattle.BPC_PsychicBattle_C.ProtectedOnFinishedSequencer
// 0x0038 (0x0038 - 0x0000)
struct BPC_PsychicBattle_C_ProtectedOnFinishedSequencer final
{
public:
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87B6[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       K2Node_DynamicCast_AsRSCharacter_Base;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87B7[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      CallFunc_GetMainPlayer_Player;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87B8[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PsychicBattle_C_ProtectedOnFinishedSequencer) == 0x000008, "Wrong alignment on BPC_PsychicBattle_C_ProtectedOnFinishedSequencer");
static_assert(sizeof(BPC_PsychicBattle_C_ProtectedOnFinishedSequencer) == 0x000038, "Wrong size on BPC_PsychicBattle_C_ProtectedOnFinishedSequencer");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedOnFinishedSequencer, CallFunc_GetPlayerManager_PlayerManager) == 0x000000, "Member 'BPC_PsychicBattle_C_ProtectedOnFinishedSequencer::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedOnFinishedSequencer, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BPC_PsychicBattle_C_ProtectedOnFinishedSequencer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedOnFinishedSequencer, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'BPC_PsychicBattle_C_ProtectedOnFinishedSequencer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedOnFinishedSequencer, K2Node_DynamicCast_AsRSCharacter_Base) == 0x000010, "Member 'BPC_PsychicBattle_C_ProtectedOnFinishedSequencer::K2Node_DynamicCast_AsRSCharacter_Base' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedOnFinishedSequencer, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BPC_PsychicBattle_C_ProtectedOnFinishedSequencer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedOnFinishedSequencer, CallFunc_GetMainPlayer_Player) == 0x000020, "Member 'BPC_PsychicBattle_C_ProtectedOnFinishedSequencer::CallFunc_GetMainPlayer_Player' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedOnFinishedSequencer, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000028, "Member 'BPC_PsychicBattle_C_ProtectedOnFinishedSequencer::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedOnFinishedSequencer, CallFunc_GetSequencePlayer_ReturnValue) == 0x000030, "Member 'BPC_PsychicBattle_C_ProtectedOnFinishedSequencer::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");

// Function BPC_PsychicBattle.BPC_PsychicBattle_C.LoadAsset
// 0x0168 (0x0168 - 0x0000)
struct BPC_PsychicBattle_C_LoadAsset final
{
public:
	EPsychicBattleType                            PsychicBattleType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     UserPlayerID;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87B9[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ProtectedIsPlayerCh0100_Ch0100;           // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87BA[0x1];                                     // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87BB[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0090(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87BC[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0098(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0100(0x0018)()
	TSoftObjectPtr<class ULevelSequence>          CallFunc_ProtectedGetSequencerAsset_LevelSequence; // 0x0118(0x0028)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue;               // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         K2Node_DynamicCast_AsLevel_Sequence;               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_PsychicBattle_C_LoadAsset) == 0x000008, "Wrong alignment on BPC_PsychicBattle_C_LoadAsset");
static_assert(sizeof(BPC_PsychicBattle_C_LoadAsset) == 0x000168, "Wrong size on BPC_PsychicBattle_C_LoadAsset");
static_assert(offsetof(BPC_PsychicBattle_C_LoadAsset, PsychicBattleType) == 0x000000, "Member 'BPC_PsychicBattle_C_LoadAsset::PsychicBattleType' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_LoadAsset, UserPlayerID) == 0x000001, "Member 'BPC_PsychicBattle_C_LoadAsset::UserPlayerID' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_LoadAsset, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'BPC_PsychicBattle_C_LoadAsset::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_LoadAsset, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000008, "Member 'BPC_PsychicBattle_C_LoadAsset::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_LoadAsset, K2Node_SwitchEnum_CmpSuccess) == 0x00000C, "Member 'BPC_PsychicBattle_C_LoadAsset::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_LoadAsset, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00000D, "Member 'BPC_PsychicBattle_C_LoadAsset::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_LoadAsset, CallFunc_ProtectedIsPlayerCh0100_Ch0100) == 0x00000E, "Member 'BPC_PsychicBattle_C_LoadAsset::CallFunc_ProtectedIsPlayerCh0100_Ch0100' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_LoadAsset, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000010, "Member 'BPC_PsychicBattle_C_LoadAsset::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_LoadAsset, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'BPC_PsychicBattle_C_LoadAsset::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_LoadAsset, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'BPC_PsychicBattle_C_LoadAsset::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_LoadAsset, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000078, "Member 'BPC_PsychicBattle_C_LoadAsset::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_LoadAsset, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000080, "Member 'BPC_PsychicBattle_C_LoadAsset::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_LoadAsset, Temp_bool_Variable) == 0x000090, "Member 'BPC_PsychicBattle_C_LoadAsset::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_LoadAsset, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000098, "Member 'BPC_PsychicBattle_C_LoadAsset::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_LoadAsset, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B0, "Member 'BPC_PsychicBattle_C_LoadAsset::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_LoadAsset, K2Node_MakeArray_Array) == 0x0000F0, "Member 'BPC_PsychicBattle_C_LoadAsset::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_LoadAsset, CallFunc_Format_ReturnValue) == 0x000100, "Member 'BPC_PsychicBattle_C_LoadAsset::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_LoadAsset, CallFunc_ProtectedGetSequencerAsset_LevelSequence) == 0x000118, "Member 'BPC_PsychicBattle_C_LoadAsset::CallFunc_ProtectedGetSequencerAsset_LevelSequence' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_LoadAsset, CallFunc_Conv_TextToString_ReturnValue) == 0x000140, "Member 'BPC_PsychicBattle_C_LoadAsset::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_LoadAsset, CallFunc_LoadSoftObject_ReturnValue) == 0x000150, "Member 'BPC_PsychicBattle_C_LoadAsset::CallFunc_LoadSoftObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_LoadAsset, K2Node_DynamicCast_AsLevel_Sequence) == 0x000158, "Member 'BPC_PsychicBattle_C_LoadAsset::K2Node_DynamicCast_AsLevel_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_LoadAsset, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'BPC_PsychicBattle_C_LoadAsset::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_LoadAsset, CallFunc_IsValid_ReturnValue) == 0x000161, "Member 'BPC_PsychicBattle_C_LoadAsset::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BPC_PsychicBattle.BPC_PsychicBattle_C.GetParameter
// 0x0290 (0x0290 - 0x0000)
struct BPC_PsychicBattle_C_GetParameter final
{
public:
	EPsychicBattleType                            PsychicBattleType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87BD[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPsychicBattleParameter                Parameter;                                         // 0x0008(0x0098)(Parm, OutParm)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87BE[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B8(0x0018)()
	struct FPsychicBattleParameter                K2Node_MakeStruct_PsychicBattleParameter;          // 0x00D0(0x0098)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0168(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01A8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x01B8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01C8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FPsychicBattleParameter                CallFunc_GetDataTableRowFromName_OutRow;           // 0x01F0(0x0098)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_PsychicBattle_C_GetParameter) == 0x000008, "Wrong alignment on BPC_PsychicBattle_C_GetParameter");
static_assert(sizeof(BPC_PsychicBattle_C_GetParameter) == 0x000290, "Wrong size on BPC_PsychicBattle_C_GetParameter");
static_assert(offsetof(BPC_PsychicBattle_C_GetParameter, PsychicBattleType) == 0x000000, "Member 'BPC_PsychicBattle_C_GetParameter::PsychicBattleType' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_GetParameter, Parameter) == 0x000008, "Member 'BPC_PsychicBattle_C_GetParameter::Parameter' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_GetParameter, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0000A0, "Member 'BPC_PsychicBattle_C_GetParameter::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_GetParameter, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000B0, "Member 'BPC_PsychicBattle_C_GetParameter::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_GetParameter, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B8, "Member 'BPC_PsychicBattle_C_GetParameter::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_GetParameter, K2Node_MakeStruct_PsychicBattleParameter) == 0x0000D0, "Member 'BPC_PsychicBattle_C_GetParameter::K2Node_MakeStruct_PsychicBattleParameter' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_GetParameter, K2Node_MakeStruct_FormatArgumentData) == 0x000168, "Member 'BPC_PsychicBattle_C_GetParameter::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_GetParameter, K2Node_MakeArray_Array) == 0x0001A8, "Member 'BPC_PsychicBattle_C_GetParameter::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_GetParameter, CallFunc_GetDataTableRowNames_OutRowNames) == 0x0001B8, "Member 'BPC_PsychicBattle_C_GetParameter::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_GetParameter, CallFunc_Format_ReturnValue) == 0x0001C8, "Member 'BPC_PsychicBattle_C_GetParameter::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_GetParameter, CallFunc_Conv_TextToString_ReturnValue) == 0x0001E0, "Member 'BPC_PsychicBattle_C_GetParameter::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_GetParameter, CallFunc_GetDataTableRowFromName_OutRow) == 0x0001F0, "Member 'BPC_PsychicBattle_C_GetParameter::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_GetParameter, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000288, "Member 'BPC_PsychicBattle_C_GetParameter::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_GetParameter, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000289, "Member 'BPC_PsychicBattle_C_GetParameter::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function BPC_PsychicBattle.BPC_PsychicBattle_C.ProtectedGetSequencerAsset
// 0x0120 (0x0120 - 0x0000)
struct BPC_PsychicBattle_C_ProtectedGetSequencerAsset final
{
public:
	EPsychicBattleType                            PsychicBattleType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     UserPlayerID;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87BF[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ULevelSequence>          LevelSequence;                                     // 0x0008(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87C0[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPsychicBattleParameter                CallFunc_GetParameter_Parameter;                   // 0x0038(0x0098)()
	bool                                          CallFunc_ProtectedIsPlayerCh0100_Ch0100;           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87C1[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPsychicBattleSequenceData             K2Node_Select_Default;                             // 0x00D8(0x0048)(ConstParm)
};
static_assert(alignof(BPC_PsychicBattle_C_ProtectedGetSequencerAsset) == 0x000008, "Wrong alignment on BPC_PsychicBattle_C_ProtectedGetSequencerAsset");
static_assert(sizeof(BPC_PsychicBattle_C_ProtectedGetSequencerAsset) == 0x000120, "Wrong size on BPC_PsychicBattle_C_ProtectedGetSequencerAsset");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedGetSequencerAsset, PsychicBattleType) == 0x000000, "Member 'BPC_PsychicBattle_C_ProtectedGetSequencerAsset::PsychicBattleType' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedGetSequencerAsset, UserPlayerID) == 0x000001, "Member 'BPC_PsychicBattle_C_ProtectedGetSequencerAsset::UserPlayerID' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedGetSequencerAsset, LevelSequence) == 0x000008, "Member 'BPC_PsychicBattle_C_ProtectedGetSequencerAsset::LevelSequence' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedGetSequencerAsset, Temp_bool_Variable) == 0x000030, "Member 'BPC_PsychicBattle_C_ProtectedGetSequencerAsset::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedGetSequencerAsset, CallFunc_GetParameter_Parameter) == 0x000038, "Member 'BPC_PsychicBattle_C_ProtectedGetSequencerAsset::CallFunc_GetParameter_Parameter' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedGetSequencerAsset, CallFunc_ProtectedIsPlayerCh0100_Ch0100) == 0x0000D0, "Member 'BPC_PsychicBattle_C_ProtectedGetSequencerAsset::CallFunc_ProtectedIsPlayerCh0100_Ch0100' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedGetSequencerAsset, K2Node_Select_Default) == 0x0000D8, "Member 'BPC_PsychicBattle_C_ProtectedGetSequencerAsset::K2Node_Select_Default' has a wrong offset!");

// Function BPC_PsychicBattle.BPC_PsychicBattle_C.Reset
// 0x0038 (0x0038 - 0x0000)
struct BPC_PsychicBattle_C_Reset final
{
public:
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87C2[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87C3[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87C4[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0029(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87C5[0x5];                                     // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_1;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PsychicBattle_C_Reset) == 0x000008, "Wrong alignment on BPC_PsychicBattle_C_Reset");
static_assert(sizeof(BPC_PsychicBattle_C_Reset) == 0x000038, "Wrong size on BPC_PsychicBattle_C_Reset");
static_assert(offsetof(BPC_PsychicBattle_C_Reset, Temp_int_Loop_Num_Variable) == 0x000000, "Member 'BPC_PsychicBattle_C_Reset::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Reset, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BPC_PsychicBattle_C_Reset::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Reset, CallFunc_Less_IntInt_ReturnValue) == 0x000008, "Member 'BPC_PsychicBattle_C_Reset::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Reset, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BPC_PsychicBattle_C_Reset::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Reset, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BPC_PsychicBattle_C_Reset::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Reset, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'BPC_PsychicBattle_C_Reset::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Reset, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BPC_PsychicBattle_C_Reset::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Reset, CallFunc_GetSequencePlayer_ReturnValue) == 0x000020, "Member 'BPC_PsychicBattle_C_Reset::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Reset, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'BPC_PsychicBattle_C_Reset::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Reset, Temp_bool_Variable) == 0x000029, "Member 'BPC_PsychicBattle_C_Reset::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Reset, CallFunc_IsValid_ReturnValue_2) == 0x00002A, "Member 'BPC_PsychicBattle_C_Reset::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_Reset, CallFunc_GetSequencePlayer_ReturnValue_1) == 0x000030, "Member 'BPC_PsychicBattle_C_Reset::CallFunc_GetSequencePlayer_ReturnValue_1' has a wrong offset!");

// Function BPC_PsychicBattle.BPC_PsychicBattle_C.ProtectedGetLevelSequence
// 0x0030 (0x0030 - 0x0000)
struct BPC_PsychicBattle_C_ProtectedGetLevelSequence final
{
public:
	EPsychicBattleType                            PsychicBattleType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     UserPlayerID;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87C6[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         Asset;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         RetAsset;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProtectedIsPlayerCh0100_Ch0100;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87C7[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         CallFunc_ProtectedGetLevelSequenceInternal_Asset;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         CallFunc_ProtectedGetLevelSequenceInternal_Asset_1; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PsychicBattle_C_ProtectedGetLevelSequence) == 0x000008, "Wrong alignment on BPC_PsychicBattle_C_ProtectedGetLevelSequence");
static_assert(sizeof(BPC_PsychicBattle_C_ProtectedGetLevelSequence) == 0x000030, "Wrong size on BPC_PsychicBattle_C_ProtectedGetLevelSequence");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedGetLevelSequence, PsychicBattleType) == 0x000000, "Member 'BPC_PsychicBattle_C_ProtectedGetLevelSequence::PsychicBattleType' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedGetLevelSequence, UserPlayerID) == 0x000001, "Member 'BPC_PsychicBattle_C_ProtectedGetLevelSequence::UserPlayerID' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedGetLevelSequence, Asset) == 0x000008, "Member 'BPC_PsychicBattle_C_ProtectedGetLevelSequence::Asset' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedGetLevelSequence, RetAsset) == 0x000010, "Member 'BPC_PsychicBattle_C_ProtectedGetLevelSequence::RetAsset' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedGetLevelSequence, CallFunc_ProtectedIsPlayerCh0100_Ch0100) == 0x000018, "Member 'BPC_PsychicBattle_C_ProtectedGetLevelSequence::CallFunc_ProtectedIsPlayerCh0100_Ch0100' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedGetLevelSequence, CallFunc_ProtectedGetLevelSequenceInternal_Asset) == 0x000020, "Member 'BPC_PsychicBattle_C_ProtectedGetLevelSequence::CallFunc_ProtectedGetLevelSequenceInternal_Asset' has a wrong offset!");
static_assert(offsetof(BPC_PsychicBattle_C_ProtectedGetLevelSequence, CallFunc_ProtectedGetLevelSequenceInternal_Asset_1) == 0x000028, "Member 'BPC_PsychicBattle_C_ProtectedGetLevelSequence::CallFunc_ProtectedGetLevelSequenceInternal_Asset_1' has a wrong offset!");

// Function BPC_PsychicBattle.BPC_PsychicBattle_C.EventEndBattleSequence
// 0x0498 (0x0498 - 0x0000)
struct BPC_PsychicBattle_C_EventEndBattleSequence final
{
public:
	bool                                          IsWin;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87C8[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LoseShotName;                                      // 0x0008(0x0018)(Edit, BlueprintVisible)
	class FText                                   WinShotName;                                       // 0x0020(0x0018)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87C9[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface;         // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayerCameraReset_Dummy;                  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87CA[0x5];                                     // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0090(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00E8(0x0040)(HasGetValueTypeHash)
