#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_RenderScarComponent

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPC_RenderScarComponent.BPC_RenderScarComponent_C.ExecuteUbergraph_BPC_RenderScarComponent
// 0x0004 (0x0004 - 0x0000)
struct BPC_RenderScarComponent_C_ExecuteUbergraph_BPC_RenderScarComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_RenderScarComponent_C_ExecuteUbergraph_BPC_RenderScarComponent) == 0x000004, "Wrong alignment on BPC_RenderScarComponent_C_ExecuteUbergraph_BPC_RenderScarComponent");
static_assert(sizeof(BPC_RenderScarComponent_C_ExecuteUbergraph_BPC_RenderScarComponent) == 0x000004, "Wrong size on BPC_RenderScarComponent_C_ExecuteUbergraph_BPC_RenderScarComponent");
static_assert(offsetof(BPC_RenderScarComponent_C_ExecuteUbergraph_BPC_RenderScarComponent, EntryPoint) == 0x000000, "Member 'BPC_RenderScarComponent_C_ExecuteUbergraph_BPC_RenderScarComponent::EntryPoint' has a wrong offset!");

// Function BPC_RenderScarComponent.BPC_RenderScarComponent_C.Initialize
// 0x00F8 (0x00F8 - 0x0000)
struct BPC_RenderScarComponent_C_Initialize final
{
public:
	class UMeshComponent*                         TargetComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMeshComp;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComp;                                    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LoopLastIndex;                                     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumMaterials;                                      // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61B9[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61BA[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array_1;                          // 0x0048(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61BB[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLinearColor>                   K2Node_MakeArray_Array_2;                          // 0x0060(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61BC[0x5];                                     // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array_3;                          // 0x0080(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component_1;    // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61BD[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_AddActorComponent_ReturnValue;            // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component_2;    // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61BE[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component_1;      // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61BF[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        CallFunc_AddActorComponent_ReturnValue_1;          // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61C0[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component_2;      // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_RenderScarComponent_C_Initialize) == 0x000008, "Wrong alignment on BPC_RenderScarComponent_C_Initialize");
static_assert(sizeof(BPC_RenderScarComponent_C_Initialize) == 0x0000F8, "Wrong size on BPC_RenderScarComponent_C_Initialize");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, TargetComponent) == 0x000000, "Member 'BPC_RenderScarComponent_C_Initialize::TargetComponent' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, SkeletalMeshComp) == 0x000008, "Member 'BPC_RenderScarComponent_C_Initialize::SkeletalMeshComp' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, StaticMeshComp) == 0x000010, "Member 'BPC_RenderScarComponent_C_Initialize::StaticMeshComp' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, LoopLastIndex) == 0x000018, "Member 'BPC_RenderScarComponent_C_Initialize::LoopLastIndex' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, NumMaterials) == 0x00001C, "Member 'BPC_RenderScarComponent_C_Initialize::NumMaterials' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BPC_RenderScarComponent_C_Initialize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, K2Node_MakeArray_Array) == 0x000028, "Member 'BPC_RenderScarComponent_C_Initialize::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, K2Node_DynamicCast_AsStatic_Mesh_Component) == 0x000038, "Member 'BPC_RenderScarComponent_C_Initialize::K2Node_DynamicCast_AsStatic_Mesh_Component' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BPC_RenderScarComponent_C_Initialize::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'BPC_RenderScarComponent_C_Initialize::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, K2Node_MakeArray_Array_1) == 0x000048, "Member 'BPC_RenderScarComponent_C_Initialize::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, CallFunc_IsValid_ReturnValue_2) == 0x000058, "Member 'BPC_RenderScarComponent_C_Initialize::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, K2Node_MakeArray_Array_2) == 0x000060, "Member 'BPC_RenderScarComponent_C_Initialize::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x000070, "Member 'BPC_RenderScarComponent_C_Initialize::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'BPC_RenderScarComponent_C_Initialize::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000079, "Member 'BPC_RenderScarComponent_C_Initialize::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, CallFunc_IsValid_ReturnValue_3) == 0x00007A, "Member 'BPC_RenderScarComponent_C_Initialize::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, K2Node_MakeArray_Array_3) == 0x000080, "Member 'BPC_RenderScarComponent_C_Initialize::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, CallFunc_GetOwner_ReturnValue) == 0x000090, "Member 'BPC_RenderScarComponent_C_Initialize::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, K2Node_DynamicCast_AsSkeletal_Mesh_Component_1) == 0x000098, "Member 'BPC_RenderScarComponent_C_Initialize::K2Node_DynamicCast_AsSkeletal_Mesh_Component_1' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'BPC_RenderScarComponent_C_Initialize::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, CallFunc_AddActorComponent_ReturnValue) == 0x0000A8, "Member 'BPC_RenderScarComponent_C_Initialize::CallFunc_AddActorComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, K2Node_DynamicCast_AsSkeletal_Mesh_Component_2) == 0x0000B0, "Member 'BPC_RenderScarComponent_C_Initialize::K2Node_DynamicCast_AsSkeletal_Mesh_Component_2' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, K2Node_DynamicCast_bSuccess_3) == 0x0000B8, "Member 'BPC_RenderScarComponent_C_Initialize::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, K2Node_DynamicCast_AsStatic_Mesh_Component_1) == 0x0000C0, "Member 'BPC_RenderScarComponent_C_Initialize::K2Node_DynamicCast_AsStatic_Mesh_Component_1' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, K2Node_DynamicCast_bSuccess_4) == 0x0000C8, "Member 'BPC_RenderScarComponent_C_Initialize::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, CallFunc_GetOwner_ReturnValue_1) == 0x0000D0, "Member 'BPC_RenderScarComponent_C_Initialize::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, CallFunc_AddActorComponent_ReturnValue_1) == 0x0000D8, "Member 'BPC_RenderScarComponent_C_Initialize::CallFunc_AddActorComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, CallFunc_SetStaticMesh_ReturnValue) == 0x0000E0, "Member 'BPC_RenderScarComponent_C_Initialize::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, K2Node_DynamicCast_AsStatic_Mesh_Component_2) == 0x0000E8, "Member 'BPC_RenderScarComponent_C_Initialize::K2Node_DynamicCast_AsStatic_Mesh_Component_2' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_Initialize, K2Node_DynamicCast_bSuccess_5) == 0x0000F0, "Member 'BPC_RenderScarComponent_C_Initialize::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");

// Function BPC_RenderScarComponent.BPC_RenderScarComponent_C.AddScarMatrix
// 0x00B8 (0x00B8 - 0x0000)
struct BPC_RenderScarComponent_C_AddScarMatrix final
{
public:
	float                                         RadiusSideScale;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RadiusFrontScale;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ThicknessScale;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MatrixForward;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MatrixRight;                                       // 0x0024(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MatrixUpper;                                       // 0x0030(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SkillAttribute;                                    // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHDamageEffectType                            DamageEffectType;                                  // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UsePriority;                                       // 0x0041(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61C1[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Handle;                                            // 0x0044(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       Player;                                            // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Priority;                                          // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetHandle;                                         // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPC_RenderScarManage_C*                ScarManage;                                        // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleCharacterInterface_C> K2Node_DynamicCast_AsBPI_Battle_Character_Interface; // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61C2[0x6];                                     // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetLockOnTargetInterface_TargetActor;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue;                    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61C3[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61C4[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BattleManager_C*                    CallFunc_GetBattleManager_BattleManager;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddScarMatrix_Handle;                     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_RenderScarComponent_C_AddScarMatrix) == 0x000008, "Wrong alignment on BPC_RenderScarComponent_C_AddScarMatrix");
static_assert(sizeof(BPC_RenderScarComponent_C_AddScarMatrix) == 0x0000B8, "Wrong size on BPC_RenderScarComponent_C_AddScarMatrix");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, RadiusSideScale) == 0x000000, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::RadiusSideScale' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, RadiusFrontScale) == 0x000004, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::RadiusFrontScale' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, ThicknessScale) == 0x000008, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::ThicknessScale' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, Location) == 0x00000C, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::Location' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, MatrixForward) == 0x000018, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::MatrixForward' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, MatrixRight) == 0x000024, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::MatrixRight' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, MatrixUpper) == 0x000030, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::MatrixUpper' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, SkillAttribute) == 0x00003C, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::SkillAttribute' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, DamageEffectType) == 0x000040, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::DamageEffectType' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, UsePriority) == 0x000041, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::UsePriority' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, Handle) == 0x000044, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::Handle' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, Player) == 0x000048, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::Player' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, Priority) == 0x000050, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::Priority' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, RetHandle) == 0x000054, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::RetHandle' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, ScarManage) == 0x000058, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::ScarManage' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, CallFunc_GetPlayerManager_PlayerManager) == 0x000060, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, K2Node_DynamicCast_AsBPI_Battle_Character_Interface) == 0x000068, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::K2Node_DynamicCast_AsBPI_Battle_Character_Interface' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, CallFunc_IsValid_ReturnValue) == 0x000079, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, CallFunc_GetLockOnTargetInterface_TargetActor) == 0x000080, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::CallFunc_GetLockOnTargetInterface_TargetActor' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, CallFunc_GetPlayer_ReturnValue) == 0x000088, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::CallFunc_GetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, CallFunc_IsValid_ReturnValue_1) == 0x000090, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, CallFunc_GetOwner_ReturnValue) == 0x000098, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000A0, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, CallFunc_SelectInt_ReturnValue) == 0x0000A4, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, CallFunc_GetBattleManager_BattleManager) == 0x0000A8, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::CallFunc_GetBattleManager_BattleManager' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, CallFunc_AddScarMatrix_Handle) == 0x0000B0, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::CallFunc_AddScarMatrix_Handle' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarMatrix, CallFunc_IsValid_ReturnValue_2) == 0x0000B4, "Member 'BPC_RenderScarComponent_C_AddScarMatrix::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function BPC_RenderScarComponent.BPC_RenderScarComponent_C.PrivateInitializeSetupTexture
// 0x0001 (0x0001 - 0x0000)
struct BPC_RenderScarComponent_C_PrivateInitializeSetupTexture final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_RenderScarComponent_C_PrivateInitializeSetupTexture) == 0x000001, "Wrong alignment on BPC_RenderScarComponent_C_PrivateInitializeSetupTexture");
static_assert(sizeof(BPC_RenderScarComponent_C_PrivateInitializeSetupTexture) == 0x000001, "Wrong size on BPC_RenderScarComponent_C_PrivateInitializeSetupTexture");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupTexture, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupTexture::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BPC_RenderScarComponent.BPC_RenderScarComponent_C.PrivateInitializeSetupMaterial
// 0x0098 (0x0098 - 0x0000)
struct BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial final
{
public:
	class UTexture*                               ScarTexture;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LoopLastIndex;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61C5[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_RenderScarManage_C*                ScarManage;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxMaterialLastIndex;                              // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumMaterials;                                      // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     BaseMaterial;                                      // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61C6[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61C7[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMeshRenderMaterial_Material;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BattleManager_C*                    CallFunc_GetBattleManager_BattleManager;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61C8[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61C9[0x2];                                     // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61CA[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61CB[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61CC[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial) == 0x000008, "Wrong alignment on BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial");
static_assert(sizeof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial) == 0x000098, "Wrong size on BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, ScarTexture) == 0x000000, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::ScarTexture' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, LoopLastIndex) == 0x000008, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::LoopLastIndex' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, ScarManage) == 0x000010, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::ScarManage' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, MaxMaterialLastIndex) == 0x000018, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::MaxMaterialLastIndex' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, NumMaterials) == 0x00001C, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::NumMaterials' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, BaseMaterial) == 0x000020, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::BaseMaterial' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, Temp_bool_True_if_break_was_hit_Variable) == 0x000031, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, Temp_int_Variable) == 0x000034, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, CallFunc_Not_PreBool_ReturnValue) == 0x00003C, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, CallFunc_IsValid_ReturnValue_1) == 0x00003D, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, CallFunc_GetMeshRenderMaterial_Material) == 0x000040, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::CallFunc_GetMeshRenderMaterial_Material' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, CallFunc_GetBattleManager_BattleManager) == 0x000048, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::CallFunc_GetBattleManager_BattleManager' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, CallFunc_IsValid_ReturnValue_2) == 0x000050, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, CallFunc_IsValid_ReturnValue_3) == 0x000051, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, Temp_int_Loop_Num_Variable) == 0x000054, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, CallFunc_BooleanAND_ReturnValue) == 0x000059, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, CallFunc_GetNumMaterials_ReturnValue) == 0x00005C, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000060, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, CallFunc_GetMaterial_ReturnValue) == 0x000068, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, Temp_int_Array_Index_Variable) == 0x000070, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, K2Node_DynamicCast_AsMaterial_Instance) == 0x000078, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::K2Node_DynamicCast_AsMaterial_Instance' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, CallFunc_Array_Length_ReturnValue) == 0x000084, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000088, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, CallFunc_Subtract_IntInt_ReturnValue) == 0x00008C, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000090, "Member 'BPC_RenderScarComponent_C_PrivateInitializeSetupMaterial::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BPC_RenderScarComponent.BPC_RenderScarComponent_C.AddScarFromHitResult
// 0x02B0 (0x02B0 - 0x0000)
struct BPC_RenderScarComponent_C_AddScarFromHitResult final
{
public:
	class AActor*                                 DamageActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHCHitResult                           HitResult;                                         // 0x0008(0x01C0)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	bool                                          DebugUseScar;                                      // 0x01C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61CD[0x3];                                     // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SizeThick;                                         // 0x01CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SizeFront;                                         // 0x01D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SizeSide;                                          // 0x01D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FrontVector;                                       // 0x01D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x01E4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                UpperVector;                                       // 0x01F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RightVector;                                       // 0x01FC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHCSkillExtraType                             Temp_byte_Variable;                                // 0x0208(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61CE[0x7];                                     // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager;           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61CF[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue;                    // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleCharacterInterface_C> K2Node_DynamicCast_AsBPI_Battle_Character_Interface; // 0x0228(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61D0[0x3];                                     // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayer_bPlayer;                         // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61D1[0x1];                                     // 0x0243(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddScarMatrix_Handle;                     // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0248(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0254(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0284(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_1;         // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_2;                     // 0x029C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_RenderScarComponent_C_AddScarFromHitResult) == 0x000008, "Wrong alignment on BPC_RenderScarComponent_C_AddScarFromHitResult");
static_assert(sizeof(BPC_RenderScarComponent_C_AddScarFromHitResult) == 0x0002B0, "Wrong size on BPC_RenderScarComponent_C_AddScarFromHitResult");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, DamageActor) == 0x000000, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::DamageActor' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, HitResult) == 0x000008, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::HitResult' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, DebugUseScar) == 0x0001C8, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::DebugUseScar' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, SizeThick) == 0x0001CC, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::SizeThick' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, SizeFront) == 0x0001D0, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::SizeFront' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, SizeSide) == 0x0001D4, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::SizeSide' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, FrontVector) == 0x0001D8, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::FrontVector' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, Location) == 0x0001E4, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::Location' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, UpperVector) == 0x0001F0, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::UpperVector' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, RightVector) == 0x0001FC, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::RightVector' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, Temp_byte_Variable) == 0x000208, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, CallFunc_GetPlayerManager_PlayerManager) == 0x000210, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, CallFunc_IsValid_ReturnValue) == 0x000218, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, CallFunc_GetPlayer_ReturnValue) == 0x000220, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::CallFunc_GetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, K2Node_DynamicCast_AsBPI_Battle_Character_Interface) == 0x000228, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::K2Node_DynamicCast_AsBPI_Battle_Character_Interface' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, K2Node_DynamicCast_bSuccess) == 0x000238, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, CallFunc_Array_Find_ReturnValue) == 0x00023C, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, CallFunc_IsPlayer_bPlayer) == 0x000240, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::CallFunc_IsPlayer_bPlayer' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, CallFunc_Less_IntInt_ReturnValue) == 0x000241, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000242, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, CallFunc_AddScarMatrix_Handle) == 0x000244, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::CallFunc_AddScarMatrix_Handle' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, CallFunc_Cross_VectorVector_ReturnValue) == 0x000248, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, CallFunc_Normal_ReturnValue) == 0x000254, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, CallFunc_GetRightVector_ReturnValue) == 0x000260, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00026C, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000278, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, CallFunc_Normal_ReturnValue_1) == 0x000284, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, CallFunc_Cross_VectorVector_ReturnValue_1) == 0x000290, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::CallFunc_Cross_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, CallFunc_Normal_ReturnValue_2) == 0x00029C, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::CallFunc_Normal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, CallFunc_VSizeSquared_ReturnValue) == 0x0002A8, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_RenderScarComponent_C_AddScarFromHitResult, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x0002AC, "Member 'BPC_RenderScarComponent_C_AddScarFromHitResult::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BPC_RenderScarComponent.BPC_RenderScarComponent_C.AddScarFromHitDamageInfo
// 0x0110 (0x0110 - 0x0000)
struct BPC_RenderScarComponent_C_AddScarFromHitDamageInfo final
{
public:
	class AActor*                                 DamageActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61D2[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitDamageInfo                         HitDamageInfo;                                     // 0x0010(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class ARSCharacterBase*                       MainPlayer;                                        // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SizeThick;                                         // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SizeFront;                                         // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SizeSide;                                          // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61D3[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
