#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_EventBindingPlayers

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "Engine_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function BPC_EventBindingPlayers.BPC_EventBindingPlayers_C.ExecuteUbergraph_BPC_EventBindingPlayers
// 0x0010 (0x0010 - 0x0000)
struct BPC_EventBindingPlayers_C_ExecuteUbergraph_BPC_EventBindingPlayers final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PrivateGetPlayerWeaponNum_Num;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_EventBindingPlayers_C_ExecuteUbergraph_BPC_EventBindingPlayers) == 0x000004, "Wrong alignment on BPC_EventBindingPlayers_C_ExecuteUbergraph_BPC_EventBindingPlayers");
static_assert(sizeof(BPC_EventBindingPlayers_C_ExecuteUbergraph_BPC_EventBindingPlayers) == 0x000010, "Wrong size on BPC_EventBindingPlayers_C_ExecuteUbergraph_BPC_EventBindingPlayers");
static_assert(offsetof(BPC_EventBindingPlayers_C_ExecuteUbergraph_BPC_EventBindingPlayers, EntryPoint) == 0x000000, "Member 'BPC_EventBindingPlayers_C_ExecuteUbergraph_BPC_EventBindingPlayers::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_ExecuteUbergraph_BPC_EventBindingPlayers, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BPC_EventBindingPlayers_C_ExecuteUbergraph_BPC_EventBindingPlayers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_ExecuteUbergraph_BPC_EventBindingPlayers, CallFunc_PrivateGetPlayerWeaponNum_Num) == 0x000008, "Member 'BPC_EventBindingPlayers_C_ExecuteUbergraph_BPC_EventBindingPlayers::CallFunc_PrivateGetPlayerWeaponNum_Num' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_ExecuteUbergraph_BPC_EventBindingPlayers, CallFunc_Multiply_IntInt_ReturnValue) == 0x00000C, "Member 'BPC_EventBindingPlayers_C_ExecuteUbergraph_BPC_EventBindingPlayers::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");

// Function BPC_EventBindingPlayers.BPC_EventBindingPlayers_C.SetupBinding
// 0x0A30 (0x0A30 - 0x0000)
struct BPC_EventBindingPlayers_C_SetupBinding final
{
public:
	class ARSLevelSequenceActor*                  Sequencer;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsChangeOwnerShip;                                 // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          BindInGamePlayer;                                  // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LightweightBinding;                                // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43C1[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARSCharacterBase*>               BindindInGamePlayers;                              // 0x0010(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	TArray<class ARSCharacterBase*>               NoBindindInGamePlayers;                            // 0x0020(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	TArray<class ABP_MenuPlayerBase_C*>           BindingSpawnInstance;                              // 0x0030(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	TArray<class ASkeletalMeshActor*>             BindingSpawnWeaponInstance;                        // 0x0040(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	class ABP_EventManager_C*                     EventManager;                                      // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayerWeaponBinding;                               // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43C2[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NewBindGamePlayerID;                               // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_WeaponBase_C*>               WeaponList;                                        // 0x0060(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	TArray<struct FMovieSceneObjectBindingID>     PlayerBindingIDs;                                  // 0x0070(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          IsPlayerBinding;                                   // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CommandWeaponVisible;                              // 0x0081(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43C3[0x6];                                     // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_WeaponBase_C*                       WeaponBase;                                        // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ASkeletalMeshActor*>             BindingWeaponInstance;                             // 0x0090(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	TArray<class AActor*>                         TmpBindingArray;                                   // 0x00A0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	class ABP_StageParameterSettingVolumeManager_C* StageParamManage;                                  // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<bool>                                  TmpBool;                                           // 0x00B8(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<bool>                                  IsBindingWeapon;                                   // 0x00C8(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class ABP_MenuPlayerBase_C*                   SpawnInstance;                                     // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ARSCharacterBase*>               NoBindingInGamePlayers;                            // 0x00E0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	TArray<class ARSCharacterBase*>               BindingInGamePlayers;                              // 0x00F0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	TArray<class ABP_MenuPlayerBase_C*>           BindingInstance;                                   // 0x0100(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	int32                                         InstanceIndex;                                     // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43C4[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           ObjNames;                                          // 0x0118(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FText                                   IdName;                                            // 0x0128(0x0018)(Edit, BlueprintVisible)
	class ARSCharacterBase*                       Player;                                            // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ARSCharacterBase*>               PlayerList;                                        // 0x0148(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	int32                                         Binding;                                           // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43C5[0x3];                                     // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43C6[0x1];                                     // 0x0183(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BitShiftLeft_ReturnValue;                 // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43C7[0x3];                                     // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_2;                      // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43C8[0x3];                                     // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable_3;                      // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43C9[0x3];                                     // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWeaponVisibility_Visibillity;           // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43CA[0x3];                                     // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43CB[0x4];                                     // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01D0(0x0040)(HasGetValueTypeHash)
	EPlayerID                                     Temp_byte_Variable;                                // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     Temp_byte_Variable_1;                              // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetPlayerCostumeSettings_DefaultCostume;  // 0x0213(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetPlayerCostumeSettings_NoAttachments;   // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43CC[0x3];                                     // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43CD[0x3];                                     // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BitShiftLeft_ReturnValue_1;               // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43CE[0x4];                                     // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      K2Node_DynamicCast_AsPlayer_Interface;             // 0x0228(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue;                  // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43CF[0x6];                                     // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      K2Node_DynamicCast_AsPlayer_Interface_1;           // 0x0240(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue_1;                // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0253(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43D0[0x3];                                     // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43D1[0x1];                                     // 0x0263(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleCharacterInterface_C> K2Node_DynamicCast_AsBPI_Battle_Character_Interface; // 0x0268(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43D2[0x3];                                     // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCharacterVisibility_bDummy;            // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43D3[0x3];                                     // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43D4[0x4];                                     // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           CallFunc_GetSequencerWeaponSuffixNoList_List;      // 0x0290(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FText>                           CallFunc_GetSequencerSuffixNoList_List;            // 0x02A0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x02B0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_1;                          // 0x02C0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_2;                          // 0x02D0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43D5[0x3];                                     // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43D6[0x4];                                     // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_3;                          // 0x02F0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array_4;                          // 0x0300(0x0010)(ReferenceParm, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0310(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_5;                          // 0x0350(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43D7[0x4];                                     // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0368(0x0018)()
	TArray<class FText>                           K2Node_MakeArray_Array_6;                          // 0x0380(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<struct FMovieSceneObjectBindingID>     CallFunc_GetSequenceObjectBindingIDInternal_BindingIDs; // 0x0390(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_GetSequenceObjectBindingIDInternal_IsFind; // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43D8[0x7];                                     // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetSequenceObjectBindingIDInternal_BindingNames; // 0x03A8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	EPlayerID                                     Temp_byte_Variable_2;                              // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43D9[0x7];                                     // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x03C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x03D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x03E0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x03F8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0410(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0450(0x0040)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_2; // 0x0490(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x04A0(0x0018)()
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43DA[0x4];                                     // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x04C0(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_BitShiftLeft_ReturnValue_2;               // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43DB[0x4];                                     // 0x0504(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0508(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0520(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_7;                          // 0x0560(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0570(0x0018)()
	TArray<class FText>                           K2Node_MakeArray_Array_8;                          // 0x0588(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_9;                          // 0x0598(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_10;                         // 0x05A8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_11;                         // 0x05B8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_BindingEventCharacterBase_IsBinding;      // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BindingEventCharacterBase_IsBindingPlayer; // 0x05C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BindingEventCharacterBase_IsBindingSASCode; // 0x05CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BindingEventCharacterBase_IsBindingBrainCode; // 0x05CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43DC[0x4];                                     // 0x05CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  CallFunc_BindingEventCharacterBase_IsBindingWeapon; // 0x05D0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43DD[0x3];                                     // 0x05E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43DE[0x3];                                     // 0x05E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43DF[0x3];                                     // 0x05F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x05FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue_1;            // 0x0600(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0618(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_12;                         // 0x0658(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0668(0x0018)()
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0684(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43E0[0x3];                                     // 0x0689(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0690(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43E1[0x4];                                     // 0x0694(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_StageParameterSettingVolumeManager_C* CallFunc_GetStageParameterSettingManager_SettingManager; // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x06A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43E2[0x3];                                     // 0x06A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable_4;                      // 0x06A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x06AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43E3[0x3];                                     // 0x06AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x06B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43E4[0x4];                                     // 0x06B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FArrayOfBool                           K2Node_MakeStruct_ArrayOfBool;                     // 0x06B8(0x0010)()
	TScriptInterface<class IPlayerInterface>      K2Node_DynamicCast_AsPlayer_Interface_2;           // 0x06C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     Temp_byte_Variable_3;                              // 0x06D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue_2;                // 0x06DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43E5[0x1];                                     // 0x06DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_And_IntInt_ReturnValue;                   // 0x06DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43E6[0x7];                                     // 0x06E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43E7[0x7];                                     // 0x06F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue_2;            // 0x06F8(0x0018)()
	TScriptInterface<class IPlayerInterface>      K2Node_DynamicCast_AsPlayer_Interface_3;           // 0x0710(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43E8[0x7];                                     // 0x0721(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0728(0x0040)(HasGetValueTypeHash)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue_3;                // 0x0768(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43E9[0x7];                                     // 0x0769(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_13;                         // 0x0770(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0780(0x0018)()
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_GetPlayerWeaponList_self_CastInput;       // 0x0798(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class ABP_WeaponBase_C*>               CallFunc_GetPlayerWeaponList_WeaponList;           // 0x07A8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class ABP_WeaponBase_C*                       CallFunc_Array_Get_Item;                           // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorRelativeLocation_SweepHitResult; // 0x07C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0848(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x084C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNoBattleWeaponDispOff_bOff;             // 0x084D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43EA[0x2];                                     // 0x084E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASkeletalMeshActor*>             CallFunc_PrivateBindingWeapon_BindingSpawnInstances; // 0x0850(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0860(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0864(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0865(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0866(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43EB[0x1];                                     // 0x0867(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_GetPlayerWeaponList_self_CastInput_1;     // 0x0868(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class ABP_WeaponBase_C*>               CallFunc_GetPlayerWeaponList_WeaponList_1;         // 0x0878(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0888(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43EC[0x4];                                     // 0x088C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MenuPlayerBase_C*                   CallFunc_PrivateGetOrSpawnInstance_Instance;       // 0x0890(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEventInterface>       K2Node_DynamicCast_AsEvent_Interface;              // 0x0898(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x08A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetEventVisible_ReturnValue;              // 0x08A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x08AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43ED[0x1];                                     // 0x08AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x08AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Subtract_ByteByte_ReturnValue;            // 0x08B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43EE[0x3];                                     // 0x08B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x08B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x08B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43EF[0x4];                                     // 0x08BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MenuPlayerBase_C*                   CallFunc_PrivateGetOrSpawnInstance_Instance_1;     // 0x08C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ASkeletalMeshActor*>             CallFunc_PrivateBindingWeapon_BindingSpawnInstances_1; // 0x08C8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x08D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43F0[0x4];                                     // 0x08DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x08E0(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0920(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43F1[0x7];                                     // 0x0921(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue_3;            // 0x0928(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_9;            // 0x0940(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_14;                         // 0x0980(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x0990(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x09A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     Temp_byte_Variable_4;                              // 0x09A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43F2[0x2];                                     // 0x09AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_And_IntInt_ReturnValue_1;                 // 0x09AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x09B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x09B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43F3[0x6];                                     // 0x09B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array_15;                         // 0x09B8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<struct FMovieSceneObjectBindingID>     CallFunc_GetSequenceObjectBindingIDPlayer_BindingIDs; // 0x09C8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_GetSequenceObjectBindingIDPlayer_IsFind;  // 0x09D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43F4[0x3];                                     // 0x09D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Or_IntInt_ReturnValue;                    // 0x09DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IPlayerInterface>      K2Node_DynamicCast_AsPlayer_Interface_4;           // 0x09E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x09F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue_4;                // 0x09F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BindingEventCharacterBase_IsBinding_1;    // 0x09F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BindingEventCharacterBase_IsBindingPlayer_1; // 0x09F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BindingEventCharacterBase_IsBindingSASCode_1; // 0x09F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BindingEventCharacterBase_IsBindingBrainCode_1; // 0x09F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43F5[0x2];                                     // 0x09F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  CallFunc_BindingEventCharacterBase_IsBindingWeapon_1; // 0x09F8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0A08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43F6[0x7];                                     // 0x0A09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager;           // 0x0A10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ARSCharacterBase*>               CallFunc_GetPlayerList_ReturnValue;                // 0x0A18(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0A28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_EventBindingPlayers_C_SetupBinding) == 0x000008, "Wrong alignment on BPC_EventBindingPlayers_C_SetupBinding");
static_assert(sizeof(BPC_EventBindingPlayers_C_SetupBinding) == 0x000A30, "Wrong size on BPC_EventBindingPlayers_C_SetupBinding");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, Sequencer) == 0x000000, "Member 'BPC_EventBindingPlayers_C_SetupBinding::Sequencer' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, IsChangeOwnerShip) == 0x000008, "Member 'BPC_EventBindingPlayers_C_SetupBinding::IsChangeOwnerShip' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, BindInGamePlayer) == 0x000009, "Member 'BPC_EventBindingPlayers_C_SetupBinding::BindInGamePlayer' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, LightweightBinding) == 0x00000A, "Member 'BPC_EventBindingPlayers_C_SetupBinding::LightweightBinding' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, BindindInGamePlayers) == 0x000010, "Member 'BPC_EventBindingPlayers_C_SetupBinding::BindindInGamePlayers' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, NoBindindInGamePlayers) == 0x000020, "Member 'BPC_EventBindingPlayers_C_SetupBinding::NoBindindInGamePlayers' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, BindingSpawnInstance) == 0x000030, "Member 'BPC_EventBindingPlayers_C_SetupBinding::BindingSpawnInstance' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, BindingSpawnWeaponInstance) == 0x000040, "Member 'BPC_EventBindingPlayers_C_SetupBinding::BindingSpawnWeaponInstance' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, EventManager) == 0x000050, "Member 'BPC_EventBindingPlayers_C_SetupBinding::EventManager' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, PlayerWeaponBinding) == 0x000058, "Member 'BPC_EventBindingPlayers_C_SetupBinding::PlayerWeaponBinding' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, NewBindGamePlayerID) == 0x00005C, "Member 'BPC_EventBindingPlayers_C_SetupBinding::NewBindGamePlayerID' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, WeaponList) == 0x000060, "Member 'BPC_EventBindingPlayers_C_SetupBinding::WeaponList' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, PlayerBindingIDs) == 0x000070, "Member 'BPC_EventBindingPlayers_C_SetupBinding::PlayerBindingIDs' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, IsPlayerBinding) == 0x000080, "Member 'BPC_EventBindingPlayers_C_SetupBinding::IsPlayerBinding' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, CommandWeaponVisible) == 0x000081, "Member 'BPC_EventBindingPlayers_C_SetupBinding::CommandWeaponVisible' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, WeaponBase) == 0x000088, "Member 'BPC_EventBindingPlayers_C_SetupBinding::WeaponBase' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, BindingWeaponInstance) == 0x000090, "Member 'BPC_EventBindingPlayers_C_SetupBinding::BindingWeaponInstance' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, TmpBindingArray) == 0x0000A0, "Member 'BPC_EventBindingPlayers_C_SetupBinding::TmpBindingArray' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, StageParamManage) == 0x0000B0, "Member 'BPC_EventBindingPlayers_C_SetupBinding::StageParamManage' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, TmpBool) == 0x0000B8, "Member 'BPC_EventBindingPlayers_C_SetupBinding::TmpBool' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, IsBindingWeapon) == 0x0000C8, "Member 'BPC_EventBindingPlayers_C_SetupBinding::IsBindingWeapon' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, SpawnInstance) == 0x0000D8, "Member 'BPC_EventBindingPlayers_C_SetupBinding::SpawnInstance' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, NoBindingInGamePlayers) == 0x0000E0, "Member 'BPC_EventBindingPlayers_C_SetupBinding::NoBindingInGamePlayers' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, BindingInGamePlayers) == 0x0000F0, "Member 'BPC_EventBindingPlayers_C_SetupBinding::BindingInGamePlayers' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, BindingInstance) == 0x000100, "Member 'BPC_EventBindingPlayers_C_SetupBinding::BindingInstance' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, InstanceIndex) == 0x000110, "Member 'BPC_EventBindingPlayers_C_SetupBinding::InstanceIndex' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, ObjNames) == 0x000118, "Member 'BPC_EventBindingPlayers_C_SetupBinding::ObjNames' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, IdName) == 0x000128, "Member 'BPC_EventBindingPlayers_C_SetupBinding::IdName' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, Player) == 0x000140, "Member 'BPC_EventBindingPlayers_C_SetupBinding::Player' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, PlayerList) == 0x000148, "Member 'BPC_EventBindingPlayers_C_SetupBinding::PlayerList' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, Binding) == 0x000158, "Member 'BPC_EventBindingPlayers_C_SetupBinding::Binding' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, CallFunc_IsValid_ReturnValue) == 0x00015C, "Member 'BPC_EventBindingPlayers_C_SetupBinding::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, Temp_int_Loop_Num_Variable) == 0x000160, "Member 'BPC_EventBindingPlayers_C_SetupBinding::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, Temp_int_Loop_Counter_Variable) == 0x000164, "Member 'BPC_EventBindingPlayers_C_SetupBinding::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, Temp_int_Array_Index_Variable) == 0x000168, "Member 'BPC_EventBindingPlayers_C_SetupBinding::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, CallFunc_Add_IntInt_ReturnValue) == 0x00016C, "Member 'BPC_EventBindingPlayers_C_SetupBinding::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, Temp_int_Loop_Counter_Variable_1) == 0x000170, "Member 'BPC_EventBindingPlayers_C_SetupBinding::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, CallFunc_Add_IntInt_ReturnValue_1) == 0x000174, "Member 'BPC_EventBindingPlayers_C_SetupBinding::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, Temp_int_Array_Index_Variable_1) == 0x000178, "Member 'BPC_EventBindingPlayers_C_SetupBinding::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, Temp_int_Loop_Num_Variable_1) == 0x00017C, "Member 'BPC_EventBindingPlayers_C_SetupBinding::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, CallFunc_Less_IntInt_ReturnValue) == 0x000180, "Member 'BPC_EventBindingPlayers_C_SetupBinding::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, CallFunc_MakeLiteralByte_ReturnValue) == 0x000181, "Member 'BPC_EventBindingPlayers_C_SetupBinding::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000182, "Member 'BPC_EventBindingPlayers_C_SetupBinding::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000184, "Member 'BPC_EventBindingPlayers_C_SetupBinding::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000188, "Member 'BPC_EventBindingPlayers_C_SetupBinding::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, Temp_int_Loop_Counter_Variable_2) == 0x00018C, "Member 'BPC_EventBindingPlayers_C_SetupBinding::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, Temp_int_Variable) == 0x000190, "Member 'BPC_EventBindingPlayers_C_SetupBinding::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, CallFunc_BitShiftLeft_ReturnValue) == 0x000194, "Member 'BPC_EventBindingPlayers_C_SetupBinding::CallFunc_BitShiftLeft_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, CallFunc_Add_IntInt_ReturnValue_2) == 0x000198, "Member 'BPC_EventBindingPlayers_C_SetupBinding::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_EventBindingPlayers_C_SetupBinding, CallFunc_Less_IntInt_ReturnValue_1) == 0x00019C, "Member 'BPC_EventBindingPlayers_C_SetupBinding::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
