#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_RenderingOption

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPFL_RenderingOption.BPFL_RenderingOption_C.SetOptionDisplayBrightness
// 0x0010 (0x0010 - 0x0000)
struct BPFL_RenderingOption_C_SetOptionDisplayBrightness final
{
public:
	int32                                         Brightness;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B47[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_RenderingOption_C_SetOptionDisplayBrightness) == 0x000008, "Wrong alignment on BPFL_RenderingOption_C_SetOptionDisplayBrightness");
static_assert(sizeof(BPFL_RenderingOption_C_SetOptionDisplayBrightness) == 0x000010, "Wrong size on BPFL_RenderingOption_C_SetOptionDisplayBrightness");
static_assert(offsetof(BPFL_RenderingOption_C_SetOptionDisplayBrightness, Brightness) == 0x000000, "Member 'BPFL_RenderingOption_C_SetOptionDisplayBrightness::Brightness' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_SetOptionDisplayBrightness, __WorldContext) == 0x000008, "Member 'BPFL_RenderingOption_C_SetOptionDisplayBrightness::__WorldContext' has a wrong offset!");

// Function BPFL_RenderingOption.BPFL_RenderingOption_C.GetScreenResolutionList
// 0x0040 (0x0040 - 0x0000)
struct BPFL_RenderingOption_C_GetScreenResolutionList final
{
public:
	bool                                          IgnoreRefreshRate;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B48[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B49[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FScreenResolutionSetting>       Resolutions;                                       // 0x0018(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	TArray<struct FScreenResolutionSetting>       CallFunc_GetSystemAvailableResolutions_Resolutions; // 0x0028(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_GetSystemAvailableResolutions_ReturnValue; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_RenderingOption_C_GetScreenResolutionList) == 0x000008, "Wrong alignment on BPFL_RenderingOption_C_GetScreenResolutionList");
static_assert(sizeof(BPFL_RenderingOption_C_GetScreenResolutionList) == 0x000040, "Wrong size on BPFL_RenderingOption_C_GetScreenResolutionList");
static_assert(offsetof(BPFL_RenderingOption_C_GetScreenResolutionList, IgnoreRefreshRate) == 0x000000, "Member 'BPFL_RenderingOption_C_GetScreenResolutionList::IgnoreRefreshRate' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_GetScreenResolutionList, __WorldContext) == 0x000008, "Member 'BPFL_RenderingOption_C_GetScreenResolutionList::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_GetScreenResolutionList, Success) == 0x000010, "Member 'BPFL_RenderingOption_C_GetScreenResolutionList::Success' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_GetScreenResolutionList, Resolutions) == 0x000018, "Member 'BPFL_RenderingOption_C_GetScreenResolutionList::Resolutions' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_GetScreenResolutionList, CallFunc_GetSystemAvailableResolutions_Resolutions) == 0x000028, "Member 'BPFL_RenderingOption_C_GetScreenResolutionList::CallFunc_GetSystemAvailableResolutions_Resolutions' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_GetScreenResolutionList, CallFunc_GetSystemAvailableResolutions_ReturnValue) == 0x000038, "Member 'BPFL_RenderingOption_C_GetScreenResolutionList::CallFunc_GetSystemAvailableResolutions_ReturnValue' has a wrong offset!");

// Function BPFL_RenderingOption.BPFL_RenderingOption_C.SetScreenResolution
// 0x0020 (0x0020 - 0x0000)
struct BPFL_RenderingOption_C_SetScreenResolution final
{
public:
	int32                                         Width;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Height;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint;                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_RenderingOption_C_SetScreenResolution) == 0x000008, "Wrong alignment on BPFL_RenderingOption_C_SetScreenResolution");
static_assert(sizeof(BPFL_RenderingOption_C_SetScreenResolution) == 0x000020, "Wrong size on BPFL_RenderingOption_C_SetScreenResolution");
static_assert(offsetof(BPFL_RenderingOption_C_SetScreenResolution, Width) == 0x000000, "Member 'BPFL_RenderingOption_C_SetScreenResolution::Width' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_SetScreenResolution, Height) == 0x000004, "Member 'BPFL_RenderingOption_C_SetScreenResolution::Height' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_SetScreenResolution, __WorldContext) == 0x000008, "Member 'BPFL_RenderingOption_C_SetScreenResolution::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_SetScreenResolution, CallFunc_GetGameUserSettings_ReturnValue) == 0x000010, "Member 'BPFL_RenderingOption_C_SetScreenResolution::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_SetScreenResolution, K2Node_MakeStruct_IntPoint) == 0x000018, "Member 'BPFL_RenderingOption_C_SetScreenResolution::K2Node_MakeStruct_IntPoint' has a wrong offset!");

// Function BPFL_RenderingOption.BPFL_RenderingOption_C.SetWindowMode
// 0x0018 (0x0018 - 0x0000)
struct BPFL_RenderingOption_C_SetWindowMode final
{
public:
	EWindowMode                                   WindowMode;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_RenderingOption_C_SetWindowMode) == 0x000008, "Wrong alignment on BPFL_RenderingOption_C_SetWindowMode");
static_assert(sizeof(BPFL_RenderingOption_C_SetWindowMode) == 0x000018, "Wrong size on BPFL_RenderingOption_C_SetWindowMode");
static_assert(offsetof(BPFL_RenderingOption_C_SetWindowMode, WindowMode) == 0x000000, "Member 'BPFL_RenderingOption_C_SetWindowMode::WindowMode' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_SetWindowMode, __WorldContext) == 0x000008, "Member 'BPFL_RenderingOption_C_SetWindowMode::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_SetWindowMode, CallFunc_GetGameUserSettings_ReturnValue) == 0x000010, "Member 'BPFL_RenderingOption_C_SetWindowMode::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");

// Function BPFL_RenderingOption.BPFL_RenderingOption_C.UseRenderingOptionPPMSoftFocus
// 0x0030 (0x0030 - 0x0000)
struct BPFL_RenderingOption_C_UseRenderingOptionPPMSoftFocus final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               Quality;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4B[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserParamManager*                      UserParamManager;                                  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               TmpQuality;                                        // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality; // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B4C[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PostProcessManager_C*               CallFunc_PrivateGetDebugQualityPPManager_PPManager; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               CallFunc_PrivateGetOptionPostQuality_Quality;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_RenderingOption_C_UseRenderingOptionPPMSoftFocus) == 0x000008, "Wrong alignment on BPFL_RenderingOption_C_UseRenderingOptionPPMSoftFocus");
static_assert(sizeof(BPFL_RenderingOption_C_UseRenderingOptionPPMSoftFocus) == 0x000030, "Wrong size on BPFL_RenderingOption_C_UseRenderingOptionPPMSoftFocus");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMSoftFocus, __WorldContext) == 0x000000, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMSoftFocus::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMSoftFocus, Quality) == 0x000008, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMSoftFocus::Quality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMSoftFocus, UserParamManager) == 0x000010, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMSoftFocus::UserParamManager' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMSoftFocus, TmpQuality) == 0x000018, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMSoftFocus::TmpQuality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMSoftFocus, CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality) == 0x000019, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMSoftFocus::CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMSoftFocus, CallFunc_PrivateGetDebugQualityPPManager_PPManager) == 0x000020, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMSoftFocus::CallFunc_PrivateGetDebugQualityPPManager_PPManager' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMSoftFocus, CallFunc_PrivateGetOptionPostQuality_Quality) == 0x000028, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMSoftFocus::CallFunc_PrivateGetOptionPostQuality_Quality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMSoftFocus, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMSoftFocus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMSoftFocus, K2Node_SwitchEnum_CmpSuccess) == 0x00002A, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMSoftFocus::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BPFL_RenderingOption.BPFL_RenderingOption_C.UseRenderingOptionPPMLuminousSmudge 
// 0x0020 (0x0020 - 0x0000)
struct BPFL_RenderingOption_C_UseRenderingOptionPPMLuminousSmudge_ final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               Quality;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               TmpQuality;                                        // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality; // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B4D[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PostProcessManager_C*               CallFunc_PrivateGetDebugQualityPPManager_PPManager; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               CallFunc_PrivateGetOptionPostQuality_Quality;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_RenderingOption_C_UseRenderingOptionPPMLuminousSmudge_) == 0x000008, "Wrong alignment on BPFL_RenderingOption_C_UseRenderingOptionPPMLuminousSmudge_");
static_assert(sizeof(BPFL_RenderingOption_C_UseRenderingOptionPPMLuminousSmudge_) == 0x000020, "Wrong size on BPFL_RenderingOption_C_UseRenderingOptionPPMLuminousSmudge_");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMLuminousSmudge_, __WorldContext) == 0x000000, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMLuminousSmudge_::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMLuminousSmudge_, Quality) == 0x000008, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMLuminousSmudge_::Quality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMLuminousSmudge_, TmpQuality) == 0x000009, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMLuminousSmudge_::TmpQuality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMLuminousSmudge_, CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality) == 0x00000A, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMLuminousSmudge_::CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMLuminousSmudge_, CallFunc_PrivateGetDebugQualityPPManager_PPManager) == 0x000010, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMLuminousSmudge_::CallFunc_PrivateGetDebugQualityPPManager_PPManager' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMLuminousSmudge_, CallFunc_PrivateGetOptionPostQuality_Quality) == 0x000018, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMLuminousSmudge_::CallFunc_PrivateGetOptionPostQuality_Quality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMLuminousSmudge_, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMLuminousSmudge_::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMLuminousSmudge_, K2Node_SwitchEnum_CmpSuccess) == 0x00001A, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMLuminousSmudge_::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BPFL_RenderingOption.BPFL_RenderingOption_C.UseRenderingOptionPPMGradScreenMask
// 0x0020 (0x0020 - 0x0000)
struct BPFL_RenderingOption_C_UseRenderingOptionPPMGradScreenMask final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               Quality;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               TmpQuality;                                        // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality; // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B4E[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PostProcessManager_C*               CallFunc_PrivateGetDebugQualityPPManager_PPManager; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               CallFunc_PrivateGetOptionPostQuality_Quality;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_RenderingOption_C_UseRenderingOptionPPMGradScreenMask) == 0x000008, "Wrong alignment on BPFL_RenderingOption_C_UseRenderingOptionPPMGradScreenMask");
static_assert(sizeof(BPFL_RenderingOption_C_UseRenderingOptionPPMGradScreenMask) == 0x000020, "Wrong size on BPFL_RenderingOption_C_UseRenderingOptionPPMGradScreenMask");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMGradScreenMask, __WorldContext) == 0x000000, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMGradScreenMask::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMGradScreenMask, Quality) == 0x000008, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMGradScreenMask::Quality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMGradScreenMask, TmpQuality) == 0x000009, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMGradScreenMask::TmpQuality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMGradScreenMask, CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality) == 0x00000A, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMGradScreenMask::CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMGradScreenMask, CallFunc_PrivateGetDebugQualityPPManager_PPManager) == 0x000010, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMGradScreenMask::CallFunc_PrivateGetDebugQualityPPManager_PPManager' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMGradScreenMask, CallFunc_PrivateGetOptionPostQuality_Quality) == 0x000018, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMGradScreenMask::CallFunc_PrivateGetOptionPostQuality_Quality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMGradScreenMask, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMGradScreenMask::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMGradScreenMask, K2Node_SwitchEnum_CmpSuccess) == 0x00001A, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMGradScreenMask::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BPFL_RenderingOption.BPFL_RenderingOption_C.UseRenderingOptionPPMBothSideRim
// 0x0020 (0x0020 - 0x0000)
struct BPFL_RenderingOption_C_UseRenderingOptionPPMBothSideRim final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               Quality;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               TmpQuality;                                        // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality; // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B4F[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PostProcessManager_C*               CallFunc_PrivateGetDebugQualityPPManager_PPManager; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               CallFunc_PrivateGetOptionPostQuality_Quality;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_RenderingOption_C_UseRenderingOptionPPMBothSideRim) == 0x000008, "Wrong alignment on BPFL_RenderingOption_C_UseRenderingOptionPPMBothSideRim");
static_assert(sizeof(BPFL_RenderingOption_C_UseRenderingOptionPPMBothSideRim) == 0x000020, "Wrong size on BPFL_RenderingOption_C_UseRenderingOptionPPMBothSideRim");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMBothSideRim, __WorldContext) == 0x000000, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMBothSideRim::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMBothSideRim, Quality) == 0x000008, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMBothSideRim::Quality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMBothSideRim, TmpQuality) == 0x000009, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMBothSideRim::TmpQuality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMBothSideRim, CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality) == 0x00000A, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMBothSideRim::CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMBothSideRim, CallFunc_PrivateGetDebugQualityPPManager_PPManager) == 0x000010, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMBothSideRim::CallFunc_PrivateGetDebugQualityPPManager_PPManager' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMBothSideRim, CallFunc_PrivateGetOptionPostQuality_Quality) == 0x000018, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMBothSideRim::CallFunc_PrivateGetOptionPostQuality_Quality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMBothSideRim, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMBothSideRim::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMBothSideRim, K2Node_SwitchEnum_CmpSuccess) == 0x00001A, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMBothSideRim::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BPFL_RenderingOption.BPFL_RenderingOption_C.UseRenderingOptionPPMLightUp
// 0x0020 (0x0020 - 0x0000)
struct BPFL_RenderingOption_C_UseRenderingOptionPPMLightUp final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               Quality;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               TmpQuality;                                        // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality; // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B50[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PostProcessManager_C*               CallFunc_PrivateGetDebugQualityPPManager_PPManager; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               CallFunc_PrivateGetOptionPostQuality_Quality;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_RenderingOption_C_UseRenderingOptionPPMLightUp) == 0x000008, "Wrong alignment on BPFL_RenderingOption_C_UseRenderingOptionPPMLightUp");
static_assert(sizeof(BPFL_RenderingOption_C_UseRenderingOptionPPMLightUp) == 0x000020, "Wrong size on BPFL_RenderingOption_C_UseRenderingOptionPPMLightUp");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMLightUp, __WorldContext) == 0x000000, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMLightUp::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMLightUp, Quality) == 0x000008, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMLightUp::Quality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMLightUp, TmpQuality) == 0x000009, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMLightUp::TmpQuality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMLightUp, CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality) == 0x00000A, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMLightUp::CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMLightUp, CallFunc_PrivateGetDebugQualityPPManager_PPManager) == 0x000010, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMLightUp::CallFunc_PrivateGetDebugQualityPPManager_PPManager' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMLightUp, CallFunc_PrivateGetOptionPostQuality_Quality) == 0x000018, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMLightUp::CallFunc_PrivateGetOptionPostQuality_Quality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMLightUp, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMLightUp::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMLightUp, K2Node_SwitchEnum_CmpSuccess) == 0x00001A, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMLightUp::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BPFL_RenderingOption.BPFL_RenderingOption_C.UseRenderingOptionPPMFieldBlur
// 0x0020 (0x0020 - 0x0000)
struct BPFL_RenderingOption_C_UseRenderingOptionPPMFieldBlur final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               Quality;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               TmpQuality;                                        // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality; // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B51[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PostProcessManager_C*               CallFunc_PrivateGetDebugQualityPPManager_PPManager; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               CallFunc_PrivateGetOptionPostQuality_Quality;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_RenderingOption_C_UseRenderingOptionPPMFieldBlur) == 0x000008, "Wrong alignment on BPFL_RenderingOption_C_UseRenderingOptionPPMFieldBlur");
static_assert(sizeof(BPFL_RenderingOption_C_UseRenderingOptionPPMFieldBlur) == 0x000020, "Wrong size on BPFL_RenderingOption_C_UseRenderingOptionPPMFieldBlur");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMFieldBlur, __WorldContext) == 0x000000, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMFieldBlur::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMFieldBlur, Quality) == 0x000008, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMFieldBlur::Quality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMFieldBlur, TmpQuality) == 0x000009, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMFieldBlur::TmpQuality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMFieldBlur, CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality) == 0x00000A, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMFieldBlur::CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMFieldBlur, CallFunc_PrivateGetDebugQualityPPManager_PPManager) == 0x000010, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMFieldBlur::CallFunc_PrivateGetDebugQualityPPManager_PPManager' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMFieldBlur, CallFunc_PrivateGetOptionPostQuality_Quality) == 0x000018, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMFieldBlur::CallFunc_PrivateGetOptionPostQuality_Quality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMFieldBlur, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMFieldBlur::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMFieldBlur, K2Node_SwitchEnum_CmpSuccess) == 0x00001A, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMFieldBlur::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BPFL_RenderingOption.BPFL_RenderingOption_C.UseRenderingOptionPPMLightShaft
// 0x0020 (0x0020 - 0x0000)
struct BPFL_RenderingOption_C_UseRenderingOptionPPMLightShaft final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               Quality;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               TmpQuality;                                        // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality; // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B52[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PostProcessManager_C*               CallFunc_PrivateGetDebugQualityPPManager_PPManager; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               CallFunc_PrivateGetOptionPostQuality_Quality;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_RenderingOption_C_UseRenderingOptionPPMLightShaft) == 0x000008, "Wrong alignment on BPFL_RenderingOption_C_UseRenderingOptionPPMLightShaft");
static_assert(sizeof(BPFL_RenderingOption_C_UseRenderingOptionPPMLightShaft) == 0x000020, "Wrong size on BPFL_RenderingOption_C_UseRenderingOptionPPMLightShaft");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMLightShaft, __WorldContext) == 0x000000, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMLightShaft::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMLightShaft, Quality) == 0x000008, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMLightShaft::Quality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMLightShaft, TmpQuality) == 0x000009, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMLightShaft::TmpQuality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMLightShaft, CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality) == 0x00000A, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMLightShaft::CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMLightShaft, CallFunc_PrivateGetDebugQualityPPManager_PPManager) == 0x000010, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMLightShaft::CallFunc_PrivateGetDebugQualityPPManager_PPManager' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMLightShaft, CallFunc_PrivateGetOptionPostQuality_Quality) == 0x000018, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMLightShaft::CallFunc_PrivateGetOptionPostQuality_Quality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMLightShaft, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMLightShaft::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMLightShaft, K2Node_SwitchEnum_CmpSuccess) == 0x00001A, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMLightShaft::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BPFL_RenderingOption.BPFL_RenderingOption_C.UseRenderingOptionPPMDrivePlane
// 0x0020 (0x0020 - 0x0000)
struct BPFL_RenderingOption_C_UseRenderingOptionPPMDrivePlane final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               Quality;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               TmpQuality;                                        // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality; // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B53[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PostProcessManager_C*               CallFunc_PrivateGetDebugQualityPPManager_PPManager; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               CallFunc_PrivateGetOptionPostQuality_Quality;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_RenderingOption_C_UseRenderingOptionPPMDrivePlane) == 0x000008, "Wrong alignment on BPFL_RenderingOption_C_UseRenderingOptionPPMDrivePlane");
static_assert(sizeof(BPFL_RenderingOption_C_UseRenderingOptionPPMDrivePlane) == 0x000020, "Wrong size on BPFL_RenderingOption_C_UseRenderingOptionPPMDrivePlane");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMDrivePlane, __WorldContext) == 0x000000, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMDrivePlane::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMDrivePlane, Quality) == 0x000008, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMDrivePlane::Quality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMDrivePlane, TmpQuality) == 0x000009, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMDrivePlane::TmpQuality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMDrivePlane, CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality) == 0x00000A, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMDrivePlane::CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMDrivePlane, CallFunc_PrivateGetDebugQualityPPManager_PPManager) == 0x000010, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMDrivePlane::CallFunc_PrivateGetDebugQualityPPManager_PPManager' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMDrivePlane, CallFunc_PrivateGetOptionPostQuality_Quality) == 0x000018, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMDrivePlane::CallFunc_PrivateGetOptionPostQuality_Quality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMDrivePlane, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMDrivePlane::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMDrivePlane, K2Node_SwitchEnum_CmpSuccess) == 0x00001A, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMDrivePlane::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BPFL_RenderingOption.BPFL_RenderingOption_C.UseRenderingOptionPPMSAS
// 0x0020 (0x0020 - 0x0000)
struct BPFL_RenderingOption_C_UseRenderingOptionPPMSAS final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               Quality;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               TmpQuality;                                        // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality; // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B54[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PostProcessManager_C*               CallFunc_PrivateGetDebugQualityPPManager_PPManager; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               CallFunc_PrivateGetOptionPostQuality_Quality;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_RenderingOption_C_UseRenderingOptionPPMSAS) == 0x000008, "Wrong alignment on BPFL_RenderingOption_C_UseRenderingOptionPPMSAS");
static_assert(sizeof(BPFL_RenderingOption_C_UseRenderingOptionPPMSAS) == 0x000020, "Wrong size on BPFL_RenderingOption_C_UseRenderingOptionPPMSAS");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMSAS, __WorldContext) == 0x000000, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMSAS::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMSAS, Quality) == 0x000008, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMSAS::Quality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMSAS, TmpQuality) == 0x000009, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMSAS::TmpQuality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMSAS, CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality) == 0x00000A, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMSAS::CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMSAS, CallFunc_PrivateGetDebugQualityPPManager_PPManager) == 0x000010, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMSAS::CallFunc_PrivateGetDebugQualityPPManager_PPManager' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMSAS, CallFunc_PrivateGetOptionPostQuality_Quality) == 0x000018, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMSAS::CallFunc_PrivateGetOptionPostQuality_Quality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMSAS, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMSAS::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMSAS, K2Node_SwitchEnum_CmpSuccess) == 0x00001A, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMSAS::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BPFL_RenderingOption.BPFL_RenderingOption_C.PrivateGetOptionPostQuality
// 0x0030 (0x0030 - 0x0000)
struct BPFL_RenderingOption_C_PrivateGetOptionPostQuality final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               Quality;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B55[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserParamManager*                      UserParamManager;                                  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserParamManager*                      CallFunc_GetUserParamManager_User_Param_Manager;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOptionParam*                           CallFunc_GetOptionParam_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGradualQuality                               CallFunc_GetPostQuality_ReturnValue;               // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_RenderingOption_C_PrivateGetOptionPostQuality) == 0x000008, "Wrong alignment on BPFL_RenderingOption_C_PrivateGetOptionPostQuality");
static_assert(sizeof(BPFL_RenderingOption_C_PrivateGetOptionPostQuality) == 0x000030, "Wrong size on BPFL_RenderingOption_C_PrivateGetOptionPostQuality");
static_assert(offsetof(BPFL_RenderingOption_C_PrivateGetOptionPostQuality, __WorldContext) == 0x000000, "Member 'BPFL_RenderingOption_C_PrivateGetOptionPostQuality::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_PrivateGetOptionPostQuality, Quality) == 0x000008, "Member 'BPFL_RenderingOption_C_PrivateGetOptionPostQuality::Quality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_PrivateGetOptionPostQuality, UserParamManager) == 0x000010, "Member 'BPFL_RenderingOption_C_PrivateGetOptionPostQuality::UserParamManager' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_PrivateGetOptionPostQuality, CallFunc_GetUserParamManager_User_Param_Manager) == 0x000018, "Member 'BPFL_RenderingOption_C_PrivateGetOptionPostQuality::CallFunc_GetUserParamManager_User_Param_Manager' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_PrivateGetOptionPostQuality, CallFunc_GetOptionParam_ReturnValue) == 0x000020, "Member 'BPFL_RenderingOption_C_PrivateGetOptionPostQuality::CallFunc_GetOptionParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_PrivateGetOptionPostQuality, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BPFL_RenderingOption_C_PrivateGetOptionPostQuality::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_PrivateGetOptionPostQuality, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'BPFL_RenderingOption_C_PrivateGetOptionPostQuality::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_PrivateGetOptionPostQuality, CallFunc_GetPostQuality_ReturnValue) == 0x00002A, "Member 'BPFL_RenderingOption_C_PrivateGetOptionPostQuality::CallFunc_GetPostQuality_ReturnValue' has a wrong offset!");

// Function BPFL_RenderingOption.BPFL_RenderingOption_C.UseRenderingOptionPPMBrainCrash
// 0x0020 (0x0020 - 0x0000)
struct BPFL_RenderingOption_C_UseRenderingOptionPPMBrainCrash final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               Quality;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               TmpQuality;                                        // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality; // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B56[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PostProcessManager_C*               CallFunc_PrivateGetDebugQualityPPManager_PPManager; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGradualQuality                               CallFunc_PrivateGetOptionPostQuality_Quality;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_RenderingOption_C_UseRenderingOptionPPMBrainCrash) == 0x000008, "Wrong alignment on BPFL_RenderingOption_C_UseRenderingOptionPPMBrainCrash");
static_assert(sizeof(BPFL_RenderingOption_C_UseRenderingOptionPPMBrainCrash) == 0x000020, "Wrong size on BPFL_RenderingOption_C_UseRenderingOptionPPMBrainCrash");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMBrainCrash, __WorldContext) == 0x000000, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMBrainCrash::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMBrainCrash, Quality) == 0x000008, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMBrainCrash::Quality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMBrainCrash, TmpQuality) == 0x000009, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMBrainCrash::TmpQuality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMBrainCrash, CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality) == 0x00000A, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMBrainCrash::CallFunc_PrivateGetDebugQualityPPManager_UseDebugQuality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMBrainCrash, CallFunc_PrivateGetDebugQualityPPManager_PPManager) == 0x000010, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMBrainCrash::CallFunc_PrivateGetDebugQualityPPManager_PPManager' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMBrainCrash, CallFunc_PrivateGetOptionPostQuality_Quality) == 0x000018, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMBrainCrash::CallFunc_PrivateGetOptionPostQuality_Quality' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMBrainCrash, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMBrainCrash::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_UseRenderingOptionPPMBrainCrash, K2Node_SwitchEnum_CmpSuccess) == 0x00001A, "Member 'BPFL_RenderingOption_C_UseRenderingOptionPPMBrainCrash::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BPFL_RenderingOption.BPFL_RenderingOption_C.PrivateGetDebugQualityPPManager
// 0x0030 (0x0030 - 0x0000)
struct BPFL_RenderingOption_C_PrivateGetDebugQualityPPManager final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseDebugQuality;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B57[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PostProcessManager_C*               PPManager;                                         // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserParamManager*                      UserParamManager;                                  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PostProcessManager_C*               CallFunc_GetPostProcessManager_Manager;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_RenderingOption_C_PrivateGetDebugQualityPPManager) == 0x000008, "Wrong alignment on BPFL_RenderingOption_C_PrivateGetDebugQualityPPManager");
static_assert(sizeof(BPFL_RenderingOption_C_PrivateGetDebugQualityPPManager) == 0x000030, "Wrong size on BPFL_RenderingOption_C_PrivateGetDebugQualityPPManager");
static_assert(offsetof(BPFL_RenderingOption_C_PrivateGetDebugQualityPPManager, __WorldContext) == 0x000000, "Member 'BPFL_RenderingOption_C_PrivateGetDebugQualityPPManager::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_RenderingOption_C_PrivateGetDebugQualityPPManager, UseDebugQuality) == 0x000008, "Member 'BPFL_RenderingOption_C_PrivateGetDebugQualityPPManager::UseDebugQuality' has a wrong offset!");
