#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_GameUtility

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CinematicCamera_structs.hpp"
#include "E_SASKind_structs.hpp"
#include "Engine_structs.hpp"
#include "MovieScene_structs.hpp"
#include "CascadeExtensionPlugin_structs.hpp"


namespace SDK::Params
{

// Function BPFL_GameUtility.BPFL_GameUtility_C.GetLowLODIndex
// 0x0020 (0x0020 - 0x0000)
struct BPFL_GameUtility_C_GetLowLODIndex final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumLODs_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_GameUtility_C_GetLowLODIndex) == 0x000008, "Wrong alignment on BPFL_GameUtility_C_GetLowLODIndex");
static_assert(sizeof(BPFL_GameUtility_C_GetLowLODIndex) == 0x000020, "Wrong size on BPFL_GameUtility_C_GetLowLODIndex");
static_assert(offsetof(BPFL_GameUtility_C_GetLowLODIndex, StaticMesh) == 0x000000, "Member 'BPFL_GameUtility_C_GetLowLODIndex::StaticMesh' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_GetLowLODIndex, __WorldContext) == 0x000008, "Member 'BPFL_GameUtility_C_GetLowLODIndex::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_GetLowLODIndex, Param_Index) == 0x000010, "Member 'BPFL_GameUtility_C_GetLowLODIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_GetLowLODIndex, CallFunc_GetNumLODs_ReturnValue) == 0x000014, "Member 'BPFL_GameUtility_C_GetLowLODIndex::CallFunc_GetNumLODs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_GetLowLODIndex, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'BPFL_GameUtility_C_GetLowLODIndex::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_GetLowLODIndex, CallFunc_Max_ReturnValue) == 0x00001C, "Member 'BPFL_GameUtility_C_GetLowLODIndex::CallFunc_Max_ReturnValue' has a wrong offset!");

// Function BPFL_GameUtility.BPFL_GameUtility_C.SearchMaterialFromName
// 0x0080 (0x0080 - 0x0000)
struct BPFL_GameUtility_C_SearchMaterialFromName final
{
public:
	class UPrimitiveComponent*                    Primitive;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 SearchSubStirng;                                   // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     FindMaterial;                                      // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetIndex;                                          // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Ret;                                               // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Material;                                          // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LoopLastIndex;                                     // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8130[0x1];                                     // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8131[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPathName_ReturnValue;                  // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_GameUtility_C_SearchMaterialFromName) == 0x000008, "Wrong alignment on BPFL_GameUtility_C_SearchMaterialFromName");
static_assert(sizeof(BPFL_GameUtility_C_SearchMaterialFromName) == 0x000080, "Wrong size on BPFL_GameUtility_C_SearchMaterialFromName");
static_assert(offsetof(BPFL_GameUtility_C_SearchMaterialFromName, Primitive) == 0x000000, "Member 'BPFL_GameUtility_C_SearchMaterialFromName::Primitive' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMaterialFromName, SearchSubStirng) == 0x000008, "Member 'BPFL_GameUtility_C_SearchMaterialFromName::SearchSubStirng' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMaterialFromName, __WorldContext) == 0x000018, "Member 'BPFL_GameUtility_C_SearchMaterialFromName::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMaterialFromName, FindMaterial) == 0x000020, "Member 'BPFL_GameUtility_C_SearchMaterialFromName::FindMaterial' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMaterialFromName, Param_Index) == 0x000028, "Member 'BPFL_GameUtility_C_SearchMaterialFromName::Param_Index' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMaterialFromName, RetIndex) == 0x00002C, "Member 'BPFL_GameUtility_C_SearchMaterialFromName::RetIndex' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMaterialFromName, Ret) == 0x000030, "Member 'BPFL_GameUtility_C_SearchMaterialFromName::Ret' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMaterialFromName, Material) == 0x000038, "Member 'BPFL_GameUtility_C_SearchMaterialFromName::Material' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMaterialFromName, LoopLastIndex) == 0x000040, "Member 'BPFL_GameUtility_C_SearchMaterialFromName::LoopLastIndex' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMaterialFromName, Temp_bool_Variable) == 0x000044, "Member 'BPFL_GameUtility_C_SearchMaterialFromName::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMaterialFromName, CallFunc_IsValid_ReturnValue) == 0x000045, "Member 'BPFL_GameUtility_C_SearchMaterialFromName::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMaterialFromName, CallFunc_Not_PreBool_ReturnValue) == 0x000046, "Member 'BPFL_GameUtility_C_SearchMaterialFromName::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMaterialFromName, Temp_int_Variable) == 0x000048, "Member 'BPFL_GameUtility_C_SearchMaterialFromName::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMaterialFromName, CallFunc_GetNumMaterials_ReturnValue) == 0x00004C, "Member 'BPFL_GameUtility_C_SearchMaterialFromName::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMaterialFromName, CallFunc_GetMaterial_ReturnValue) == 0x000050, "Member 'BPFL_GameUtility_C_SearchMaterialFromName::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMaterialFromName, CallFunc_Subtract_IntInt_ReturnValue) == 0x000058, "Member 'BPFL_GameUtility_C_SearchMaterialFromName::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMaterialFromName, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'BPFL_GameUtility_C_SearchMaterialFromName::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMaterialFromName, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000060, "Member 'BPFL_GameUtility_C_SearchMaterialFromName::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMaterialFromName, CallFunc_BooleanAND_ReturnValue) == 0x000061, "Member 'BPFL_GameUtility_C_SearchMaterialFromName::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMaterialFromName, CallFunc_GetPathName_ReturnValue) == 0x000068, "Member 'BPFL_GameUtility_C_SearchMaterialFromName::CallFunc_GetPathName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMaterialFromName, CallFunc_FindSubstring_ReturnValue) == 0x000078, "Member 'BPFL_GameUtility_C_SearchMaterialFromName::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMaterialFromName, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00007C, "Member 'BPFL_GameUtility_C_SearchMaterialFromName::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BPFL_GameUtility.BPFL_GameUtility_C.SearchMeshMaterialFromSlot
// 0x00B8 (0x00B8 - 0x0000)
struct BPFL_GameUtility_C_SearchMeshMaterialFromSlot final
{
public:
	class USkinnedMeshComponent*                  Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 SearchSubStirng;                                   // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     FindMaterial;                                      // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8132[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           SlotNames;                                         // 0x0030(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         RetIndex;                                          // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8133[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Ret;                                               // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LoopLastIndex;                                     // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8134[0x2];                                     // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8135[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8136[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8137[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8138[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8139[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue;         // 0x00A0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot) == 0x000008, "Wrong alignment on BPFL_GameUtility_C_SearchMeshMaterialFromSlot");
static_assert(sizeof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot) == 0x0000B8, "Wrong size on BPFL_GameUtility_C_SearchMeshMaterialFromSlot");
static_assert(offsetof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot, Mesh) == 0x000000, "Member 'BPFL_GameUtility_C_SearchMeshMaterialFromSlot::Mesh' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot, SearchSubStirng) == 0x000008, "Member 'BPFL_GameUtility_C_SearchMeshMaterialFromSlot::SearchSubStirng' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot, __WorldContext) == 0x000018, "Member 'BPFL_GameUtility_C_SearchMeshMaterialFromSlot::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot, FindMaterial) == 0x000020, "Member 'BPFL_GameUtility_C_SearchMeshMaterialFromSlot::FindMaterial' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot, Param_Index) == 0x000028, "Member 'BPFL_GameUtility_C_SearchMeshMaterialFromSlot::Param_Index' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot, SlotNames) == 0x000030, "Member 'BPFL_GameUtility_C_SearchMeshMaterialFromSlot::SlotNames' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot, RetIndex) == 0x000040, "Member 'BPFL_GameUtility_C_SearchMeshMaterialFromSlot::RetIndex' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot, Ret) == 0x000048, "Member 'BPFL_GameUtility_C_SearchMeshMaterialFromSlot::Ret' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot, LoopLastIndex) == 0x000050, "Member 'BPFL_GameUtility_C_SearchMeshMaterialFromSlot::LoopLastIndex' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot, Temp_int_Array_Index_Variable) == 0x000054, "Member 'BPFL_GameUtility_C_SearchMeshMaterialFromSlot::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BPFL_GameUtility_C_SearchMeshMaterialFromSlot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot, Temp_bool_True_if_break_was_hit_Variable) == 0x000059, "Member 'BPFL_GameUtility_C_SearchMeshMaterialFromSlot::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot, CallFunc_Array_Get_Item) == 0x00005C, "Member 'BPFL_GameUtility_C_SearchMeshMaterialFromSlot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot, CallFunc_Conv_NameToString_ReturnValue) == 0x000068, "Member 'BPFL_GameUtility_C_SearchMeshMaterialFromSlot::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot, CallFunc_Not_PreBool_ReturnValue) == 0x000078, "Member 'BPFL_GameUtility_C_SearchMeshMaterialFromSlot::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'BPFL_GameUtility_C_SearchMeshMaterialFromSlot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot, Temp_int_Loop_Counter_Variable) == 0x000080, "Member 'BPFL_GameUtility_C_SearchMeshMaterialFromSlot::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot, CallFunc_GetMaterial_ReturnValue) == 0x000088, "Member 'BPFL_GameUtility_C_SearchMeshMaterialFromSlot::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'BPFL_GameUtility_C_SearchMeshMaterialFromSlot::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'BPFL_GameUtility_C_SearchMeshMaterialFromSlot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot, CallFunc_BooleanAND_ReturnValue) == 0x000098, "Member 'BPFL_GameUtility_C_SearchMeshMaterialFromSlot::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot, CallFunc_GetMaterialSlotNames_ReturnValue) == 0x0000A0, "Member 'BPFL_GameUtility_C_SearchMeshMaterialFromSlot::CallFunc_GetMaterialSlotNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot, CallFunc_FindSubstring_ReturnValue) == 0x0000B0, "Member 'BPFL_GameUtility_C_SearchMeshMaterialFromSlot::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SearchMeshMaterialFromSlot, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000B4, "Member 'BPFL_GameUtility_C_SearchMeshMaterialFromSlot::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BPFL_GameUtility.BPFL_GameUtility_C.SetHoodVisible
// 0x0018 (0x0018 - 0x0000)
struct BPFL_GameUtility_C_SetHoodVisible final
{
public:
	class USkinnedMeshComponent*                  Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Visible;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ForceReset;                                        // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InvisibleMask;                                     // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InvisibleBFHood;                                   // 0x000B(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_813A[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_GameUtility_C_SetHoodVisible) == 0x000008, "Wrong alignment on BPFL_GameUtility_C_SetHoodVisible");
static_assert(sizeof(BPFL_GameUtility_C_SetHoodVisible) == 0x000018, "Wrong size on BPFL_GameUtility_C_SetHoodVisible");
static_assert(offsetof(BPFL_GameUtility_C_SetHoodVisible, Mesh) == 0x000000, "Member 'BPFL_GameUtility_C_SetHoodVisible::Mesh' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SetHoodVisible, Visible) == 0x000008, "Member 'BPFL_GameUtility_C_SetHoodVisible::Visible' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SetHoodVisible, ForceReset) == 0x000009, "Member 'BPFL_GameUtility_C_SetHoodVisible::ForceReset' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SetHoodVisible, InvisibleMask) == 0x00000A, "Member 'BPFL_GameUtility_C_SetHoodVisible::InvisibleMask' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SetHoodVisible, InvisibleBFHood) == 0x00000B, "Member 'BPFL_GameUtility_C_SetHoodVisible::InvisibleBFHood' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SetHoodVisible, __WorldContext) == 0x000010, "Member 'BPFL_GameUtility_C_SetHoodVisible::__WorldContext' has a wrong offset!");

// Function BPFL_GameUtility.BPFL_GameUtility_C.CreateAllDynamicMaterialInstance
// 0x0050 (0x0050 - 0x0000)
struct BPFL_GameUtility_C_CreateAllDynamicMaterialInstance final
{
public:
	class UMeshComponent*                         Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       DMArray;                                           // 0x0010(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       TmpMDArray;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_813B[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_GameUtility_C_CreateAllDynamicMaterialInstance) == 0x000008, "Wrong alignment on BPFL_GameUtility_C_CreateAllDynamicMaterialInstance");
static_assert(sizeof(BPFL_GameUtility_C_CreateAllDynamicMaterialInstance) == 0x000050, "Wrong size on BPFL_GameUtility_C_CreateAllDynamicMaterialInstance");
static_assert(offsetof(BPFL_GameUtility_C_CreateAllDynamicMaterialInstance, Mesh) == 0x000000, "Member 'BPFL_GameUtility_C_CreateAllDynamicMaterialInstance::Mesh' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_CreateAllDynamicMaterialInstance, __WorldContext) == 0x000008, "Member 'BPFL_GameUtility_C_CreateAllDynamicMaterialInstance::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_CreateAllDynamicMaterialInstance, DMArray) == 0x000010, "Member 'BPFL_GameUtility_C_CreateAllDynamicMaterialInstance::DMArray' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_CreateAllDynamicMaterialInstance, TmpMDArray) == 0x000020, "Member 'BPFL_GameUtility_C_CreateAllDynamicMaterialInstance::TmpMDArray' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_CreateAllDynamicMaterialInstance, Temp_int_Variable) == 0x000030, "Member 'BPFL_GameUtility_C_CreateAllDynamicMaterialInstance::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_CreateAllDynamicMaterialInstance, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000038, "Member 'BPFL_GameUtility_C_CreateAllDynamicMaterialInstance::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_CreateAllDynamicMaterialInstance, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BPFL_GameUtility_C_CreateAllDynamicMaterialInstance::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_CreateAllDynamicMaterialInstance, CallFunc_GetNumMaterials_ReturnValue) == 0x000044, "Member 'BPFL_GameUtility_C_CreateAllDynamicMaterialInstance::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_CreateAllDynamicMaterialInstance, CallFunc_Subtract_IntInt_ReturnValue) == 0x000048, "Member 'BPFL_GameUtility_C_CreateAllDynamicMaterialInstance::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_CreateAllDynamicMaterialInstance, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00004C, "Member 'BPFL_GameUtility_C_CreateAllDynamicMaterialInstance::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BPFL_GameUtility.BPFL_GameUtility_C.BindingEventPlayer
// 0x00C0 (0x00C0 - 0x0000)
struct BPFL_GameUtility_C_BindingEventPlayer final
{
public:
	class ARSCharacterBase*                       Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSLevelSequenceActor*                  Sequencer;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BindSASCode;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          BindBrainCode;                                     // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Weapon;                                            // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsChangeOwnerShip;                                 // 0x0013(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AllowSuffixNo;                                     // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_813C[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBinding;                                         // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsBindingPlayer;                                   // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsBindingSASCode;                                  // 0x0022(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsBindingBrainCode;                                // 0x0023(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_813D[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  IsBindingWeapon;                                   // 0x0028(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	class FText                                   IDText;                                            // 0x0038(0x0018)(Edit, BlueprintVisible)
	int32                                         TmpIndex;                                          // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_813E[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Param_Name;                                        // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FText>                           CallFunc_GetSequencerSuffixNoList_List;            // 0x0078(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_1;                          // 0x0088(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_2;                          // 0x0098(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_BindingEventCharacterBase_IsBinding;      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BindingEventCharacterBase_IsBindingPlayer; // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BindingEventCharacterBase_IsBindingSASCode; // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BindingEventCharacterBase_IsBindingBrainCode; // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_813F[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  CallFunc_BindingEventCharacterBase_IsBindingWeapon; // 0x00B0(0x0010)(ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_GameUtility_C_BindingEventPlayer) == 0x000008, "Wrong alignment on BPFL_GameUtility_C_BindingEventPlayer");
static_assert(sizeof(BPFL_GameUtility_C_BindingEventPlayer) == 0x0000C0, "Wrong size on BPFL_GameUtility_C_BindingEventPlayer");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, Player) == 0x000000, "Member 'BPFL_GameUtility_C_BindingEventPlayer::Player' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, Sequencer) == 0x000008, "Member 'BPFL_GameUtility_C_BindingEventPlayer::Sequencer' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, BindSASCode) == 0x000010, "Member 'BPFL_GameUtility_C_BindingEventPlayer::BindSASCode' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, BindBrainCode) == 0x000011, "Member 'BPFL_GameUtility_C_BindingEventPlayer::BindBrainCode' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, Weapon) == 0x000012, "Member 'BPFL_GameUtility_C_BindingEventPlayer::Weapon' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, IsChangeOwnerShip) == 0x000013, "Member 'BPFL_GameUtility_C_BindingEventPlayer::IsChangeOwnerShip' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, AllowSuffixNo) == 0x000014, "Member 'BPFL_GameUtility_C_BindingEventPlayer::AllowSuffixNo' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, __WorldContext) == 0x000018, "Member 'BPFL_GameUtility_C_BindingEventPlayer::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, IsBinding) == 0x000020, "Member 'BPFL_GameUtility_C_BindingEventPlayer::IsBinding' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, IsBindingPlayer) == 0x000021, "Member 'BPFL_GameUtility_C_BindingEventPlayer::IsBindingPlayer' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, IsBindingSASCode) == 0x000022, "Member 'BPFL_GameUtility_C_BindingEventPlayer::IsBindingSASCode' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, IsBindingBrainCode) == 0x000023, "Member 'BPFL_GameUtility_C_BindingEventPlayer::IsBindingBrainCode' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, IsBindingWeapon) == 0x000028, "Member 'BPFL_GameUtility_C_BindingEventPlayer::IsBindingWeapon' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, IDText) == 0x000038, "Member 'BPFL_GameUtility_C_BindingEventPlayer::IDText' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, TmpIndex) == 0x000050, "Member 'BPFL_GameUtility_C_BindingEventPlayer::TmpIndex' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, Param_Name) == 0x000058, "Member 'BPFL_GameUtility_C_BindingEventPlayer::Param_Name' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, K2Node_MakeArray_Array) == 0x000068, "Member 'BPFL_GameUtility_C_BindingEventPlayer::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, CallFunc_GetSequencerSuffixNoList_List) == 0x000078, "Member 'BPFL_GameUtility_C_BindingEventPlayer::CallFunc_GetSequencerSuffixNoList_List' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, K2Node_MakeArray_Array_1) == 0x000088, "Member 'BPFL_GameUtility_C_BindingEventPlayer::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, K2Node_MakeArray_Array_2) == 0x000098, "Member 'BPFL_GameUtility_C_BindingEventPlayer::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, CallFunc_BindingEventCharacterBase_IsBinding) == 0x0000A8, "Member 'BPFL_GameUtility_C_BindingEventPlayer::CallFunc_BindingEventCharacterBase_IsBinding' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, CallFunc_BindingEventCharacterBase_IsBindingPlayer) == 0x0000A9, "Member 'BPFL_GameUtility_C_BindingEventPlayer::CallFunc_BindingEventCharacterBase_IsBindingPlayer' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, CallFunc_BindingEventCharacterBase_IsBindingSASCode) == 0x0000AA, "Member 'BPFL_GameUtility_C_BindingEventPlayer::CallFunc_BindingEventCharacterBase_IsBindingSASCode' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, CallFunc_BindingEventCharacterBase_IsBindingBrainCode) == 0x0000AB, "Member 'BPFL_GameUtility_C_BindingEventPlayer::CallFunc_BindingEventCharacterBase_IsBindingBrainCode' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_BindingEventPlayer, CallFunc_BindingEventCharacterBase_IsBindingWeapon) == 0x0000B0, "Member 'BPFL_GameUtility_C_BindingEventPlayer::CallFunc_BindingEventCharacterBase_IsBindingWeapon' has a wrong offset!");

// Function BPFL_GameUtility.BPFL_GameUtility_C.Private_BindingEventPlayer
// 0x0070 (0x0070 - 0x0000)
struct BPFL_GameUtility_C_Private_BindingEventPlayer final
{
public:
	TArray<class AActor*>                         BindingActors;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	TArray<class FText>                           BindingNames;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class ARSLevelSequenceActor*                  Sequencer;                                         // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsChangeOwnerShip;                                 // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8140[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBinding;                                         // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8141[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMovieSceneObjectBindingID>     CallFunc_GetSequenceObjectBindingIDList_OutBindingIDList; // 0x0040(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_GetSequenceObjectBindingIDList_IsFind;    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8142[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8143[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8144[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_GameUtility_C_Private_BindingEventPlayer) == 0x000008, "Wrong alignment on BPFL_GameUtility_C_Private_BindingEventPlayer");
static_assert(sizeof(BPFL_GameUtility_C_Private_BindingEventPlayer) == 0x000070, "Wrong size on BPFL_GameUtility_C_Private_BindingEventPlayer");
static_assert(offsetof(BPFL_GameUtility_C_Private_BindingEventPlayer, BindingActors) == 0x000000, "Member 'BPFL_GameUtility_C_Private_BindingEventPlayer::BindingActors' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_Private_BindingEventPlayer, BindingNames) == 0x000010, "Member 'BPFL_GameUtility_C_Private_BindingEventPlayer::BindingNames' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_Private_BindingEventPlayer, Sequencer) == 0x000020, "Member 'BPFL_GameUtility_C_Private_BindingEventPlayer::Sequencer' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_Private_BindingEventPlayer, IsChangeOwnerShip) == 0x000028, "Member 'BPFL_GameUtility_C_Private_BindingEventPlayer::IsChangeOwnerShip' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_Private_BindingEventPlayer, __WorldContext) == 0x000030, "Member 'BPFL_GameUtility_C_Private_BindingEventPlayer::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_Private_BindingEventPlayer, IsBinding) == 0x000038, "Member 'BPFL_GameUtility_C_Private_BindingEventPlayer::IsBinding' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_Private_BindingEventPlayer, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'BPFL_GameUtility_C_Private_BindingEventPlayer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_Private_BindingEventPlayer, CallFunc_GetSequenceObjectBindingIDList_OutBindingIDList) == 0x000040, "Member 'BPFL_GameUtility_C_Private_BindingEventPlayer::CallFunc_GetSequenceObjectBindingIDList_OutBindingIDList' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_Private_BindingEventPlayer, CallFunc_GetSequenceObjectBindingIDList_IsFind) == 0x000050, "Member 'BPFL_GameUtility_C_Private_BindingEventPlayer::CallFunc_GetSequenceObjectBindingIDList_IsFind' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_Private_BindingEventPlayer, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'BPFL_GameUtility_C_Private_BindingEventPlayer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_Private_BindingEventPlayer, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'BPFL_GameUtility_C_Private_BindingEventPlayer::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_Private_BindingEventPlayer, Temp_int_Loop_Num_Variable) == 0x00005C, "Member 'BPFL_GameUtility_C_Private_BindingEventPlayer::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_Private_BindingEventPlayer, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'BPFL_GameUtility_C_Private_BindingEventPlayer::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_Private_BindingEventPlayer, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'BPFL_GameUtility_C_Private_BindingEventPlayer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_Private_BindingEventPlayer, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'BPFL_GameUtility_C_Private_BindingEventPlayer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_Private_BindingEventPlayer, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'BPFL_GameUtility_C_Private_BindingEventPlayer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BPFL_GameUtility.BPFL_GameUtility_C.SetAllEnableTick
// 0x0058 (0x0058 - 0x0000)
struct BPFL_GameUtility_C_SetAllEnableTick final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableTick;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8145[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UActorComponent*>                LComponents;                                       // 0x0018(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UActorComponent*>                CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_GameUtility_C_SetAllEnableTick) == 0x000008, "Wrong alignment on BPFL_GameUtility_C_SetAllEnableTick");
static_assert(sizeof(BPFL_GameUtility_C_SetAllEnableTick) == 0x000058, "Wrong size on BPFL_GameUtility_C_SetAllEnableTick");
static_assert(offsetof(BPFL_GameUtility_C_SetAllEnableTick, Actor) == 0x000000, "Member 'BPFL_GameUtility_C_SetAllEnableTick::Actor' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SetAllEnableTick, EnableTick) == 0x000008, "Member 'BPFL_GameUtility_C_SetAllEnableTick::EnableTick' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SetAllEnableTick, __WorldContext) == 0x000010, "Member 'BPFL_GameUtility_C_SetAllEnableTick::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SetAllEnableTick, LComponents) == 0x000018, "Member 'BPFL_GameUtility_C_SetAllEnableTick::LComponents' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SetAllEnableTick, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000028, "Member 'BPFL_GameUtility_C_SetAllEnableTick::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SetAllEnableTick, Temp_int_Array_Index_Variable) == 0x000038, "Member 'BPFL_GameUtility_C_SetAllEnableTick::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SetAllEnableTick, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'BPFL_GameUtility_C_SetAllEnableTick::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SetAllEnableTick, CallFunc_Array_Get_Item) == 0x000040, "Member 'BPFL_GameUtility_C_SetAllEnableTick::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SetAllEnableTick, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BPFL_GameUtility_C_SetAllEnableTick::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SetAllEnableTick, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'BPFL_GameUtility_C_SetAllEnableTick::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_SetAllEnableTick, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BPFL_GameUtility_C_SetAllEnableTick::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BPFL_GameUtility.BPFL_GameUtility_C.CreateAllDynamicMaterialInstanceFromParticle
// 0x0058 (0x0058 - 0x0000)
struct BPFL_GameUtility_C_CreateAllDynamicMaterialInstanceFromParticle final
{
public:
	class UParticleSystemComponent*               Particle;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       DMArray;                                           // 0x0010(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	int32                                         MatNum;                                            // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8146[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       TmpMDArray;                                        // 0x0028(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8147[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8148[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_GameUtility_C_CreateAllDynamicMaterialInstanceFromParticle) == 0x000008, "Wrong alignment on BPFL_GameUtility_C_CreateAllDynamicMaterialInstanceFromParticle");
static_assert(sizeof(BPFL_GameUtility_C_CreateAllDynamicMaterialInstanceFromParticle) == 0x000058, "Wrong size on BPFL_GameUtility_C_CreateAllDynamicMaterialInstanceFromParticle");
static_assert(offsetof(BPFL_GameUtility_C_CreateAllDynamicMaterialInstanceFromParticle, Particle) == 0x000000, "Member 'BPFL_GameUtility_C_CreateAllDynamicMaterialInstanceFromParticle::Particle' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_CreateAllDynamicMaterialInstanceFromParticle, __WorldContext) == 0x000008, "Member 'BPFL_GameUtility_C_CreateAllDynamicMaterialInstanceFromParticle::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_CreateAllDynamicMaterialInstanceFromParticle, DMArray) == 0x000010, "Member 'BPFL_GameUtility_C_CreateAllDynamicMaterialInstanceFromParticle::DMArray' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_CreateAllDynamicMaterialInstanceFromParticle, MatNum) == 0x000020, "Member 'BPFL_GameUtility_C_CreateAllDynamicMaterialInstanceFromParticle::MatNum' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_CreateAllDynamicMaterialInstanceFromParticle, TmpMDArray) == 0x000028, "Member 'BPFL_GameUtility_C_CreateAllDynamicMaterialInstanceFromParticle::TmpMDArray' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_CreateAllDynamicMaterialInstanceFromParticle, CallFunc_GetNumMaterials_ReturnValue) == 0x000038, "Member 'BPFL_GameUtility_C_CreateAllDynamicMaterialInstanceFromParticle::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_CreateAllDynamicMaterialInstanceFromParticle, CallFunc_Subtract_IntInt_ReturnValue) == 0x00003C, "Member 'BPFL_GameUtility_C_CreateAllDynamicMaterialInstanceFromParticle::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_CreateAllDynamicMaterialInstanceFromParticle, Temp_int_Variable) == 0x000040, "Member 'BPFL_GameUtility_C_CreateAllDynamicMaterialInstanceFromParticle::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_GameUtility_C_CreateAllDynamicMaterialInstanceFromParticle, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000048, "Member 'BPFL_GameUtility_C_CreateAllDynamicMaterialInstanceFromParticle::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
