#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_BattleSimulatorManagerFunctionLibrary

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPFL_BattleSimulatorManagerFunctionLibrary.BPFL_BattleSimulatorManagerFunctionLibrary_C.GetBattleSimulatorManager
// 0x0030 (0x0030 - 0x0000)
struct BPFL_BattleSimulatorManagerFunctionLibrary_C_GetBattleSimulatorManager final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleSimulatorManager*                BattleSimulatorManager;                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSGameInstance*                        K2Node_DynamicCast_AsRSGame_Instance;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38BD[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleSimulatorManager*                CallFunc_GetBattleSimulatorManager_ReturnValue;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_BattleSimulatorManagerFunctionLibrary_C_GetBattleSimulatorManager) == 0x000008, "Wrong alignment on BPFL_BattleSimulatorManagerFunctionLibrary_C_GetBattleSimulatorManager");
static_assert(sizeof(BPFL_BattleSimulatorManagerFunctionLibrary_C_GetBattleSimulatorManager) == 0x000030, "Wrong size on BPFL_BattleSimulatorManagerFunctionLibrary_C_GetBattleSimulatorManager");
static_assert(offsetof(BPFL_BattleSimulatorManagerFunctionLibrary_C_GetBattleSimulatorManager, __WorldContext) == 0x000000, "Member 'BPFL_BattleSimulatorManagerFunctionLibrary_C_GetBattleSimulatorManager::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_BattleSimulatorManagerFunctionLibrary_C_GetBattleSimulatorManager, BattleSimulatorManager) == 0x000008, "Member 'BPFL_BattleSimulatorManagerFunctionLibrary_C_GetBattleSimulatorManager::BattleSimulatorManager' has a wrong offset!");
static_assert(offsetof(BPFL_BattleSimulatorManagerFunctionLibrary_C_GetBattleSimulatorManager, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPFL_BattleSimulatorManagerFunctionLibrary_C_GetBattleSimulatorManager::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BattleSimulatorManagerFunctionLibrary_C_GetBattleSimulatorManager, K2Node_DynamicCast_AsRSGame_Instance) == 0x000018, "Member 'BPFL_BattleSimulatorManagerFunctionLibrary_C_GetBattleSimulatorManager::K2Node_DynamicCast_AsRSGame_Instance' has a wrong offset!");
static_assert(offsetof(BPFL_BattleSimulatorManagerFunctionLibrary_C_GetBattleSimulatorManager, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BPFL_BattleSimulatorManagerFunctionLibrary_C_GetBattleSimulatorManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_BattleSimulatorManagerFunctionLibrary_C_GetBattleSimulatorManager, CallFunc_GetBattleSimulatorManager_ReturnValue) == 0x000028, "Member 'BPFL_BattleSimulatorManagerFunctionLibrary_C_GetBattleSimulatorManager::CallFunc_GetBattleSimulatorManager_ReturnValue' has a wrong offset!");

}

