#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_HUDMainGameFunctionLibrary

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPFL_HUDMainGameFunctionLibrary.BPFL_HUDMainGameFunctionLibrary_C.GetHUDMainGame
// 0x0038 (0x0038 - 0x0000)
struct BPFL_HUDMainGameFunctionLibrary_C_GetHUDMainGame final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         HUDMainGame;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AFE[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         K2Node_DynamicCast_AsHUDMain_Game;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_HUDMainGameFunctionLibrary_C_GetHUDMainGame) == 0x000008, "Wrong alignment on BPFL_HUDMainGameFunctionLibrary_C_GetHUDMainGame");
static_assert(sizeof(BPFL_HUDMainGameFunctionLibrary_C_GetHUDMainGame) == 0x000038, "Wrong size on BPFL_HUDMainGameFunctionLibrary_C_GetHUDMainGame");
static_assert(offsetof(BPFL_HUDMainGameFunctionLibrary_C_GetHUDMainGame, __WorldContext) == 0x000000, "Member 'BPFL_HUDMainGameFunctionLibrary_C_GetHUDMainGame::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_HUDMainGameFunctionLibrary_C_GetHUDMainGame, HUDMainGame) == 0x000008, "Member 'BPFL_HUDMainGameFunctionLibrary_C_GetHUDMainGame::HUDMainGame' has a wrong offset!");
static_assert(offsetof(BPFL_HUDMainGameFunctionLibrary_C_GetHUDMainGame, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'BPFL_HUDMainGameFunctionLibrary_C_GetHUDMainGame::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_HUDMainGameFunctionLibrary_C_GetHUDMainGame, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BPFL_HUDMainGameFunctionLibrary_C_GetHUDMainGame::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_HUDMainGameFunctionLibrary_C_GetHUDMainGame, CallFunc_GetHUD_ReturnValue) == 0x000020, "Member 'BPFL_HUDMainGameFunctionLibrary_C_GetHUDMainGame::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_HUDMainGameFunctionLibrary_C_GetHUDMainGame, K2Node_DynamicCast_AsHUDMain_Game) == 0x000028, "Member 'BPFL_HUDMainGameFunctionLibrary_C_GetHUDMainGame::K2Node_DynamicCast_AsHUDMain_Game' has a wrong offset!");
static_assert(offsetof(BPFL_HUDMainGameFunctionLibrary_C_GetHUDMainGame, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BPFL_HUDMainGameFunctionLibrary_C_GetHUDMainGame::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

