#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_PlayerManagerFunctionLibrary

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPFL_PlayerManagerFunctionLibrary.BPFL_PlayerManagerFunctionLibrary_C.GetPlayerManager
// 0x0040 (0x0040 - 0x0000)
struct BPFL_PlayerManagerFunctionLibrary_C_GetPlayerManager final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerManager_C*                    PlayerManager;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSGameInstance*                        K2Node_DynamicCast_AsRSGame_Instance;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59C9[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerManager*                         CallFunc_GetPlayerManager_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerManager_C*                    K2Node_DynamicCast_AsBP_Player_Manager;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_PlayerManagerFunctionLibrary_C_GetPlayerManager) == 0x000008, "Wrong alignment on BPFL_PlayerManagerFunctionLibrary_C_GetPlayerManager");
static_assert(sizeof(BPFL_PlayerManagerFunctionLibrary_C_GetPlayerManager) == 0x000040, "Wrong size on BPFL_PlayerManagerFunctionLibrary_C_GetPlayerManager");
static_assert(offsetof(BPFL_PlayerManagerFunctionLibrary_C_GetPlayerManager, __WorldContext) == 0x000000, "Member 'BPFL_PlayerManagerFunctionLibrary_C_GetPlayerManager::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerManagerFunctionLibrary_C_GetPlayerManager, PlayerManager) == 0x000008, "Member 'BPFL_PlayerManagerFunctionLibrary_C_GetPlayerManager::PlayerManager' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerManagerFunctionLibrary_C_GetPlayerManager, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPFL_PlayerManagerFunctionLibrary_C_GetPlayerManager::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerManagerFunctionLibrary_C_GetPlayerManager, K2Node_DynamicCast_AsRSGame_Instance) == 0x000018, "Member 'BPFL_PlayerManagerFunctionLibrary_C_GetPlayerManager::K2Node_DynamicCast_AsRSGame_Instance' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerManagerFunctionLibrary_C_GetPlayerManager, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BPFL_PlayerManagerFunctionLibrary_C_GetPlayerManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerManagerFunctionLibrary_C_GetPlayerManager, CallFunc_GetPlayerManager_ReturnValue) == 0x000028, "Member 'BPFL_PlayerManagerFunctionLibrary_C_GetPlayerManager::CallFunc_GetPlayerManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerManagerFunctionLibrary_C_GetPlayerManager, K2Node_DynamicCast_AsBP_Player_Manager) == 0x000030, "Member 'BPFL_PlayerManagerFunctionLibrary_C_GetPlayerManager::K2Node_DynamicCast_AsBP_Player_Manager' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerManagerFunctionLibrary_C_GetPlayerManager, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BPFL_PlayerManagerFunctionLibrary_C_GetPlayerManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BPFL_PlayerManagerFunctionLibrary.BPFL_PlayerManagerFunctionLibrary_C.GetPlayerFixParam
// 0x0020 (0x0020 - 0x0000)
struct BPFL_PlayerManagerFunctionLibrary_C_GetPlayerFixParam final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayerFixParamater_C*               Param;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_PlayerManagerFunctionLibrary_C_GetPlayerFixParam) == 0x000008, "Wrong alignment on BPFL_PlayerManagerFunctionLibrary_C_GetPlayerFixParam");
static_assert(sizeof(BPFL_PlayerManagerFunctionLibrary_C_GetPlayerFixParam) == 0x000020, "Wrong size on BPFL_PlayerManagerFunctionLibrary_C_GetPlayerFixParam");
static_assert(offsetof(BPFL_PlayerManagerFunctionLibrary_C_GetPlayerFixParam, __WorldContext) == 0x000000, "Member 'BPFL_PlayerManagerFunctionLibrary_C_GetPlayerFixParam::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerManagerFunctionLibrary_C_GetPlayerFixParam, Param) == 0x000008, "Member 'BPFL_PlayerManagerFunctionLibrary_C_GetPlayerFixParam::Param' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerManagerFunctionLibrary_C_GetPlayerFixParam, CallFunc_GetPlayerManager_PlayerManager) == 0x000010, "Member 'BPFL_PlayerManagerFunctionLibrary_C_GetPlayerFixParam::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerManagerFunctionLibrary_C_GetPlayerFixParam, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BPFL_PlayerManagerFunctionLibrary_C_GetPlayerFixParam::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

