#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_PlayerFunctionLibrary

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EPlayerAIBattleThinkType_structs.hpp"
#include "EPlayerAIBattleThinkTransition_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "FPlayerWeaponLoadData_structs.hpp"
#include "EPlayerAIMoveMode_structs.hpp"
#include "EPlayerAIThinkTableType_structs.hpp"
#include "EPlayerAIBattleThinkParam_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPFL_PlayerFunctionLibrary.BPFL_PlayerFunctionLibrary_C.CalcArrowRainLocation
// 0x04C0 (0x04C0 - 0x0000)
struct BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation final
{
public:
	class AActor*                                 PlayerActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CheckUnderHeight;                                  // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CHeckUpperHeight;                                  // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0020(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LPoint;                                            // 0x002C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LTargetLocation;                                   // 0x0038(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_397F[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0048(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3980[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3981[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3982[0x3];                                     // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3983[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_1;                          // 0x0108(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0118(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0140(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3984[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_2;                            // 0x01D0(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3985[0x2];                                     // 0x01E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3986[0x4];                                     // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0248(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0254(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit_1;       // 0x026C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue_1;  // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x02F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x02F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3987[0x1];                                     // 0x02F7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x030C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0318(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0324(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0340(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0364(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_2;                          // 0x0370(0x0010)(ReferenceParm, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit_2;       // 0x038C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue_2;  // 0x0414(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3988[0x3];                                     // 0x0415(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x0418(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x0424(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x0425(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3989[0x2];                                     // 0x0426(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x0430(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x043C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x0448(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x0454(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x0470(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x0488(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x0494(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_5;           // 0x04AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation) == 0x000008, "Wrong alignment on BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation");
static_assert(sizeof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation) == 0x0004C0, "Wrong size on BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, PlayerActor) == 0x000000, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::PlayerActor' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, TargetActor) == 0x000008, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::TargetActor' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CheckUnderHeight) == 0x000010, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CheckUnderHeight' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CHeckUpperHeight) == 0x000014, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CHeckUpperHeight' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, __WorldContext) == 0x000018, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, Location) == 0x000020, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::Location' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, LPoint) == 0x00002C, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::LPoint' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, LTargetLocation) == 0x000038, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::LTargetLocation' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, Temp_object_Variable) == 0x000048, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_MakeVector_ReturnValue) == 0x00005C, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x000068, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_MakeVector_ReturnValue_1) == 0x000074, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_MakeVector_ReturnValue_2) == 0x000080, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_MakeVector_ReturnValue_3) == 0x00008C, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000098, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000A4, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_GetActorForwardVector_ReturnValue) == 0x0000B0, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000BC, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0000C8, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, K2Node_MakeArray_Array) == 0x0000D8, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000E8, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_IsValid_ReturnValue_1) == 0x0000F4, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakVector_X) == 0x0000F8, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakVector_Y) == 0x0000FC, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakVector_Z) == 0x000100, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, K2Node_MakeArray_Array_1) == 0x000108, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, Temp_object_Variable_1) == 0x000118, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000128, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000134, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000140, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0001C8, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, Temp_object_Variable_2) == 0x0001D0, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_bBlockingHit) == 0x0001E0, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001E1, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_Time) == 0x0001E4, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_Distance) == 0x0001E8, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_Location) == 0x0001EC, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_ImpactPoint) == 0x0001F8, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_Normal) == 0x000204, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_ImpactNormal) == 0x000210, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_PhysMat) == 0x000220, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_HitActor) == 0x000228, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_HitComponent) == 0x000230, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_HitBoneName) == 0x000238, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_HitItem) == 0x000240, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_FaceIndex) == 0x000244, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_TraceStart) == 0x000248, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_TraceEnd) == 0x000254, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000260, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_LineTraceSingleForObjects_OutHit_1) == 0x00026C, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_LineTraceSingleForObjects_OutHit_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_LineTraceSingleForObjects_ReturnValue_1) == 0x0002F4, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_LineTraceSingleForObjects_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_bBlockingHit_1) == 0x0002F5, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x0002F6, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_Time_1) == 0x0002F8, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_Distance_1) == 0x0002FC, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_Location_1) == 0x000300, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_ImpactPoint_1) == 0x00030C, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_Normal_1) == 0x000318, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000324, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_PhysMat_1) == 0x000330, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_HitActor_1) == 0x000338, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_HitComponent_1) == 0x000340, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_HitBoneName_1) == 0x000348, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_HitItem_1) == 0x000350, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_FaceIndex_1) == 0x000354, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_TraceStart_1) == 0x000358, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_TraceEnd_1) == 0x000364, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, K2Node_MakeArray_Array_2) == 0x000370, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000380, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_LineTraceSingleForObjects_OutHit_2) == 0x00038C, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_LineTraceSingleForObjects_OutHit_2' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_LineTraceSingleForObjects_ReturnValue_2) == 0x000414, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_LineTraceSingleForObjects_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_Add_VectorVector_ReturnValue_4) == 0x000418, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_bBlockingHit_2) == 0x000424, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_bBlockingHit_2' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_bInitialOverlap_2) == 0x000425, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_bInitialOverlap_2' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_Time_2) == 0x000428, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_Time_2' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_Distance_2) == 0x00042C, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_Distance_2' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_Location_2) == 0x000430, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_Location_2' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_ImpactPoint_2) == 0x00043C, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_ImpactPoint_2' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_Normal_2) == 0x000448, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_Normal_2' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_ImpactNormal_2) == 0x000454, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_ImpactNormal_2' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_PhysMat_2) == 0x000460, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_PhysMat_2' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_HitActor_2) == 0x000468, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_HitActor_2' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_HitComponent_2) == 0x000470, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_HitComponent_2' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_HitBoneName_2) == 0x000478, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_HitBoneName_2' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_HitItem_2) == 0x000480, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_HitItem_2' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_FaceIndex_2) == 0x000484, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_FaceIndex_2' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_TraceStart_2) == 0x000488, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_TraceStart_2' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakHitResult_TraceEnd_2) == 0x000494, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakHitResult_TraceEnd_2' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakVector_X_1) == 0x0004A0, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakVector_Y_1) == 0x0004A4, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_BreakVector_Z_1) == 0x0004A8, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_Add_VectorVector_ReturnValue_5) == 0x0004AC, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_Add_VectorVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0004B8, "Member 'BPFL_PlayerFunctionLibrary_C_CalcArrowRainLocation::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BPFL_PlayerFunctionLibrary.BPFL_PlayerFunctionLibrary_C.Change Player Materials from Slot
// 0x01A8 (0x01A8 - 0x0000)
struct BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot final
{
public:
	class USkeletalMeshComponent*                 SkelMeshComp;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MaterialBody;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MaterialEye;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MaterialHair;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MaterialSkin;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MaterialOutline;                                   // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MaterialWire0;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MaterialWire1;                                     // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MaterialMask;                                      // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MaterialOther;                                     // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HitIndex;                                          // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_398A[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     ChangeBaseMaterial;                                // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaterialIndex;                                     // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_398B[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SlotName;                                          // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FName>                           SlotNames;                                         // 0x0088(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             ChangeSlotMaterials;                               // 0x0098(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class FString>                         ChangeSlotStrings;                                 // 0x00A8(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_398C[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_398D[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_398E[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array_1;                          // 0x00E8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_398F[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3990[0x2];                                     // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3991[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3992[0x4];                                     // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue;         // 0x0138(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3993[0x3];                                     // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3994[0x3];                                     // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance;            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3995[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMaterialOverrideParameters            CallFunc_GetMaterialOverrideParametersALLHierarchy_OutParam; // 0x0170(0x0030)()
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot) == 0x000008, "Wrong alignment on BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot");
static_assert(sizeof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot) == 0x0001A8, "Wrong size on BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot, SkelMeshComp) == 0x000000, "Member 'BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot::SkelMeshComp' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot, MaterialBody) == 0x000008, "Member 'BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot::MaterialBody' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot, MaterialEye) == 0x000010, "Member 'BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot::MaterialEye' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot, MaterialHair) == 0x000018, "Member 'BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot::MaterialHair' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot, MaterialSkin) == 0x000020, "Member 'BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot::MaterialSkin' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot, MaterialOutline) == 0x000028, "Member 'BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot::MaterialOutline' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot, MaterialWire0) == 0x000030, "Member 'BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot::MaterialWire0' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot, MaterialWire1) == 0x000038, "Member 'BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot::MaterialWire1' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot, MaterialMask) == 0x000040, "Member 'BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot::MaterialMask' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot, MaterialOther) == 0x000048, "Member 'BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot::MaterialOther' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot, __WorldContext) == 0x000050, "Member 'BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot, HitIndex) == 0x000058, "Member 'BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot::HitIndex' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot, ChangeBaseMaterial) == 0x000060, "Member 'BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot::ChangeBaseMaterial' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot, Mid) == 0x000068, "Member 'BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot::Mid' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot, MaterialIndex) == 0x000070, "Member 'BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot::MaterialIndex' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot, SlotName) == 0x000078, "Member 'BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot::SlotName' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot, SlotNames) == 0x000088, "Member 'BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot::SlotNames' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot, ChangeSlotMaterials) == 0x000098, "Member 'BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot::ChangeSlotMaterials' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot, ChangeSlotStrings) == 0x0000A8, "Member 'BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot::ChangeSlotStrings' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot, Temp_bool_True_if_break_was_hit_Variable) == 0x0000B8, "Member 'BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot, K2Node_MakeArray_Array) == 0x0000C0, "Member 'BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot, CallFunc_Not_PreBool_ReturnValue) == 0x0000D0, "Member 'BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot, Temp_int_Loop_Counter_Variable) == 0x0000D4, "Member 'BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot, CallFunc_Add_IntInt_ReturnValue) == 0x0000D8, "Member 'BPFL_PlayerFunctionLibrary_C_Change_Player_Materials_from_Slot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
