#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_EnvironmentUtility

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPFL_EnvironmentUtility.BPFL_EnvironmentUtility_C.CalcSplineBound
// 0x0440 (0x0440 - 0x0000)
struct BPFL_EnvironmentUtility_C_CalcSplineBound final
{
public:
	TArray<class USplineMeshComponent*>           Splines;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	ESplineMeshAxis                               ForwardAxis;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_834D[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               BaseRotator;                                       // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OneStaticMesh;                                     // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_834E[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoxCenter;                                         // 0x0030(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoxExtent;                                         // 0x003C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoxMin;                                            // 0x0048(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoxMax;                                            // 0x0054(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoundMax;                                          // 0x0060(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoundMin;                                          // 0x006C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EndPosition;                                       // 0x0078(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartPosition;                                     // 0x0084(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   SplineMeshComponent;                               // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalBoundMax;                                     // 0x0098(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalBoundMin;                                     // 0x00A4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TmpVector2;                                        // 0x00B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TmpVector1;                                        // 0x00BC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Temp_struct_Variable;                              // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_834F[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USplineMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Temp_struct_Variable_1;                            // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               Temp_struct_Variable_2;                            // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FBoxSphereBounds                       CallFunc_GetBounds_ReturnValue;                    // 0x0110(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESplineMeshAxis                               Temp_byte_Variable;                                // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8350[0x3];                                     // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0160(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8351[0xC];                                     // 0x01B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01C0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x01F0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetWorldBound_BoundMin;                   // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWorldBound_BoundMax;                   // 0x022C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWorldBound_BoundMin_1;                 // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWorldBound_BoundMax_1;                 // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_4;                          // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_4;                          // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_4;                          // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue_1;                       // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue_2;                       // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_2;                       // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_3;                       // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_4;                       // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_5;                       // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_5;                          // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_5;                          // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_5;                          // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue_3;                       // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue_4;                       // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue_5;                       // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetStartPosition_ReturnValue;             // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8352[0xC];                                     // 0x02D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x02E0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0310(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x031C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8353[0x8];                                     // 0x0328(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_2;     // 0x0330(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0360(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetEndPosition_ReturnValue;               // 0x036C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0378(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue_1;          // 0x0384(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Select_Default;                             // 0x0390(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue_1; // 0x03AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue_2; // 0x03B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue_3; // 0x03C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8354[0x3];                                     // 0x03D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_6;                          // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_6;                          // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_6;                          // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_7;                          // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_7;                          // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_7;                          // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_6;                       // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_8;                          // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_8;                          // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_8;                          // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_7;                       // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_8;                       // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x040C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_9;                          // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_9;                          // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_9;                          // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue_6;                       // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue_7;                       // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue_8;                       // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0430(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_EnvironmentUtility_C_CalcSplineBound) == 0x000010, "Wrong alignment on BPFL_EnvironmentUtility_C_CalcSplineBound");
static_assert(sizeof(BPFL_EnvironmentUtility_C_CalcSplineBound) == 0x000440, "Wrong size on BPFL_EnvironmentUtility_C_CalcSplineBound");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, Splines) == 0x000000, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::Splines' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, ForwardAxis) == 0x000010, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::ForwardAxis' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, BaseRotator) == 0x000014, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::BaseRotator' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, OneStaticMesh) == 0x000020, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::OneStaticMesh' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, __WorldContext) == 0x000028, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, BoxCenter) == 0x000030, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::BoxCenter' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, BoxExtent) == 0x00003C, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::BoxExtent' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, BoxMin) == 0x000048, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::BoxMin' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, BoxMax) == 0x000054, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::BoxMax' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, BoundMax) == 0x000060, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::BoundMax' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, BoundMin) == 0x00006C, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::BoundMin' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, EndPosition) == 0x000078, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::EndPosition' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, StartPosition) == 0x000084, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::StartPosition' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, SplineMeshComponent) == 0x000090, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::SplineMeshComponent' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, LocalBoundMax) == 0x000098, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::LocalBoundMax' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, LocalBoundMin) == 0x0000A4, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::LocalBoundMin' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, TmpVector2) == 0x0000B0, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::TmpVector2' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, TmpVector1) == 0x0000BC, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::TmpVector1' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, Temp_struct_Variable) == 0x0000C8, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_Array_Length_ReturnValue) == 0x0000D4, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000D8, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, Temp_int_Array_Index_Variable) == 0x0000DC, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, Temp_int_Loop_Num_Variable) == 0x0000E0, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000E4, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, Temp_struct_Variable_1) == 0x0000F8, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, Temp_struct_Variable_2) == 0x000104, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_GetBounds_ReturnValue) == 0x000110, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_GetBounds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, Temp_byte_Variable) == 0x00012C, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_Add_VectorVector_ReturnValue) == 0x000130, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_X) == 0x00013C, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_Y) == 0x000140, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_Z) == 0x000144, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000148, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_X_1) == 0x000154, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_Y_1) == 0x000158, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_Z_1) == 0x00015C, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000160, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakTransform_Location) == 0x000190, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakTransform_Rotation) == 0x00019C, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakTransform_Scale) == 0x0001A8, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_MakeTransform_ReturnValue) == 0x0001C0, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_MakeTransform_ReturnValue_1) == 0x0001F0, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_GetWorldBound_BoundMin) == 0x000220, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_GetWorldBound_BoundMin' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_GetWorldBound_BoundMax) == 0x00022C, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_GetWorldBound_BoundMax' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_GetWorldBound_BoundMin_1) == 0x000238, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_GetWorldBound_BoundMin_1' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_GetWorldBound_BoundMax_1) == 0x000244, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_GetWorldBound_BoundMax_1' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_X_2) == 0x000250, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_Y_2) == 0x000254, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_Z_2) == 0x000258, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_X_3) == 0x00025C, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_Y_3) == 0x000260, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_Z_3) == 0x000264, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_X_4) == 0x000268, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_Y_4) == 0x00026C, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_Z_4) == 0x000270, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_FMax_ReturnValue) == 0x000274, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_FMin_ReturnValue) == 0x000278, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_FMax_ReturnValue_1) == 0x00027C, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_FMin_ReturnValue_1) == 0x000280, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_FMin_ReturnValue_2) == 0x000284, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_FMin_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_FMax_ReturnValue_2) == 0x000288, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_FMax_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_FMax_ReturnValue_3) == 0x00028C, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_FMax_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_FMax_ReturnValue_4) == 0x000290, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_FMax_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_FMax_ReturnValue_5) == 0x000294, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_FMax_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_X_5) == 0x000298, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_X_5' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_Y_5) == 0x00029C, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_Y_5' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_Z_5) == 0x0002A0, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_Z_5' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_MakeVector_ReturnValue) == 0x0002A4, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_FMin_ReturnValue_3) == 0x0002B0, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_FMin_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_FMin_ReturnValue_4) == 0x0002B4, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_FMin_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_FMin_ReturnValue_5) == 0x0002B8, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_FMin_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_MakeVector_ReturnValue_1) == 0x0002BC, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_GetStartPosition_ReturnValue) == 0x0002C8, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_GetStartPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x0002E0, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_TransformLocation_ReturnValue) == 0x000310, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x00031C, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_K2_GetComponentToWorld_ReturnValue_2) == 0x000330, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_K2_GetComponentToWorld_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000360, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_GetEndPosition_ReturnValue) == 0x00036C, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_GetEndPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000378, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_TransformLocation_ReturnValue_1) == 0x000384, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_TransformLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, K2Node_Select_Default) == 0x000390, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_Array_Length_ReturnValue_1) == 0x00039C, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x0003A0, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_GreaterGreater_VectorRotator_ReturnValue_1) == 0x0003AC, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_GreaterGreater_VectorRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_GreaterGreater_VectorRotator_ReturnValue_2) == 0x0003B8, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_GreaterGreater_VectorRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_GreaterGreater_VectorRotator_ReturnValue_3) == 0x0003C4, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_GreaterGreater_VectorRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, Temp_int_Loop_Counter_Variable) == 0x0003D0, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_Less_IntInt_ReturnValue) == 0x0003D4, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_Add_IntInt_ReturnValue) == 0x0003D8, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_X_6) == 0x0003DC, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_X_6' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_Y_6) == 0x0003E0, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_Y_6' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_Z_6) == 0x0003E4, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_Z_6' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_X_7) == 0x0003E8, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_X_7' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_Y_7) == 0x0003EC, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_Y_7' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_Z_7) == 0x0003F0, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_Z_7' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_FMax_ReturnValue_6) == 0x0003F4, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_FMax_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_X_8) == 0x0003F8, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_X_8' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_Y_8) == 0x0003FC, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_Y_8' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_Z_8) == 0x000400, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_Z_8' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_FMax_ReturnValue_7) == 0x000404, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_FMax_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_FMax_ReturnValue_8) == 0x000408, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_FMax_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_MakeVector_ReturnValue_2) == 0x00040C, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_X_9) == 0x000418, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_X_9' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_Y_9) == 0x00041C, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_Y_9' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_BreakVector_Z_9) == 0x000420, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_BreakVector_Z_9' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_FMin_ReturnValue_6) == 0x000424, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_FMin_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_FMin_ReturnValue_7) == 0x000428, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_FMin_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_FMin_ReturnValue_8) == 0x00042C, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_FMin_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPFL_EnvironmentUtility_C_CalcSplineBound, CallFunc_MakeVector_ReturnValue_3) == 0x000430, "Member 'BPFL_EnvironmentUtility_C_CalcSplineBound::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");

// Function BPFL_EnvironmentUtility.BPFL_EnvironmentUtility_C.GetWorldBound
// 0x02B0 (0x02B0 - 0x0000)
struct BPFL_EnvironmentUtility_C_GetWorldBound final
{
public:
	struct FVector                                LocalBoundMin;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalBoundMax;                                     // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8355[0x8];                                     // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             WorldTransform;                                    // 0x0020(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoundMin;                                          // 0x0058(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoundMax;                                          // 0x0064(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        VertexList;                                        // 0x0070(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FVector                                Max;                                               // 0x0080(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Min;                                               // 0x008C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8356[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_2;                       // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue_1;                       // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue_2;                       // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_4;                          // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_4;                          // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_4;                          // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8357[0x3];                                     // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_5;                          // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_5;                          // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_5;                          // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_6;                          // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_6;                          // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_6;                          // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_7;                          // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_7;                          // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_7;                          // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_8;                          // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_8;                          // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_8;                          // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_9;                          // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_9;                          // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_9;                          // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_10;                         // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
