#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_GameSystemManagerFunctionLibrary

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPFL_GameSystemManagerFunctionLibrary.BPFL_GameSystemManagerFunctionLibrary_C.GetGameSystemManager
// 0x0040 (0x0040 - 0x0000)
struct BPFL_GameSystemManagerFunctionLibrary_C_GetGameSystemManager final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameSystemManager_C*                Manager;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSGameInstance*                        K2Node_DynamicCast_AsRSGame_Instance;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_785B[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetGameSystemManager_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameSystemManager_C*                K2Node_DynamicCast_AsBP_Game_System_Manager;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_GameSystemManagerFunctionLibrary_C_GetGameSystemManager) == 0x000008, "Wrong alignment on BPFL_GameSystemManagerFunctionLibrary_C_GetGameSystemManager");
static_assert(sizeof(BPFL_GameSystemManagerFunctionLibrary_C_GetGameSystemManager) == 0x000040, "Wrong size on BPFL_GameSystemManagerFunctionLibrary_C_GetGameSystemManager");
static_assert(offsetof(BPFL_GameSystemManagerFunctionLibrary_C_GetGameSystemManager, __WorldContext) == 0x000000, "Member 'BPFL_GameSystemManagerFunctionLibrary_C_GetGameSystemManager::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_GameSystemManagerFunctionLibrary_C_GetGameSystemManager, Manager) == 0x000008, "Member 'BPFL_GameSystemManagerFunctionLibrary_C_GetGameSystemManager::Manager' has a wrong offset!");
static_assert(offsetof(BPFL_GameSystemManagerFunctionLibrary_C_GetGameSystemManager, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPFL_GameSystemManagerFunctionLibrary_C_GetGameSystemManager::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameSystemManagerFunctionLibrary_C_GetGameSystemManager, K2Node_DynamicCast_AsRSGame_Instance) == 0x000018, "Member 'BPFL_GameSystemManagerFunctionLibrary_C_GetGameSystemManager::K2Node_DynamicCast_AsRSGame_Instance' has a wrong offset!");
static_assert(offsetof(BPFL_GameSystemManagerFunctionLibrary_C_GetGameSystemManager, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BPFL_GameSystemManagerFunctionLibrary_C_GetGameSystemManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_GameSystemManagerFunctionLibrary_C_GetGameSystemManager, CallFunc_GetGameSystemManager_ReturnValue) == 0x000028, "Member 'BPFL_GameSystemManagerFunctionLibrary_C_GetGameSystemManager::CallFunc_GetGameSystemManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameSystemManagerFunctionLibrary_C_GetGameSystemManager, K2Node_DynamicCast_AsBP_Game_System_Manager) == 0x000030, "Member 'BPFL_GameSystemManagerFunctionLibrary_C_GetGameSystemManager::K2Node_DynamicCast_AsBP_Game_System_Manager' has a wrong offset!");
static_assert(offsetof(BPFL_GameSystemManagerFunctionLibrary_C_GetGameSystemManager, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BPFL_GameSystemManagerFunctionLibrary_C_GetGameSystemManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

