#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_ParticleSystem

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BPFL_ParticleSystem.BPFL_ParticleSystem_C.SetupParticleManagerLocation
// 0x0088 (0x0088 - 0x0000)
struct BPFL_ParticleSystem_C_SetupParticleManagerLocation final
{
public:
	int32                                         LocationId;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AreaId;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FParticleSystemBackGroundParameter     K2Node_MakeStruct_ParticleSystemBackGroundParameter; // 0x0010(0x0010)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	class ARSParticleSystemManager*               CallFunc_GetParticleSystemManager_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46D6[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46D7[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSystemBackGroundParameter     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0070(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_ParticleSystem_C_SetupParticleManagerLocation) == 0x000008, "Wrong alignment on BPFL_ParticleSystem_C_SetupParticleManagerLocation");
static_assert(sizeof(BPFL_ParticleSystem_C_SetupParticleManagerLocation) == 0x000088, "Wrong size on BPFL_ParticleSystem_C_SetupParticleManagerLocation");
static_assert(offsetof(BPFL_ParticleSystem_C_SetupParticleManagerLocation, LocationId) == 0x000000, "Member 'BPFL_ParticleSystem_C_SetupParticleManagerLocation::LocationId' has a wrong offset!");
static_assert(offsetof(BPFL_ParticleSystem_C_SetupParticleManagerLocation, AreaId) == 0x000004, "Member 'BPFL_ParticleSystem_C_SetupParticleManagerLocation::AreaId' has a wrong offset!");
static_assert(offsetof(BPFL_ParticleSystem_C_SetupParticleManagerLocation, __WorldContext) == 0x000008, "Member 'BPFL_ParticleSystem_C_SetupParticleManagerLocation::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_ParticleSystem_C_SetupParticleManagerLocation, K2Node_MakeStruct_ParticleSystemBackGroundParameter) == 0x000010, "Member 'BPFL_ParticleSystem_C_SetupParticleManagerLocation::K2Node_MakeStruct_ParticleSystemBackGroundParameter' has a wrong offset!");
static_assert(offsetof(BPFL_ParticleSystem_C_SetupParticleManagerLocation, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'BPFL_ParticleSystem_C_SetupParticleManagerLocation::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ParticleSystem_C_SetupParticleManagerLocation, CallFunc_GetParticleSystemManager_ReturnValue) == 0x000038, "Member 'BPFL_ParticleSystem_C_SetupParticleManagerLocation::CallFunc_GetParticleSystemManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ParticleSystem_C_SetupParticleManagerLocation, CallFunc_Conv_TextToString_ReturnValue) == 0x000040, "Member 'BPFL_ParticleSystem_C_SetupParticleManagerLocation::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ParticleSystem_C_SetupParticleManagerLocation, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'BPFL_ParticleSystem_C_SetupParticleManagerLocation::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ParticleSystem_C_SetupParticleManagerLocation, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BPFL_ParticleSystem_C_SetupParticleManagerLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ParticleSystem_C_SetupParticleManagerLocation, CallFunc_Conv_StringToName_ReturnValue) == 0x000064, "Member 'BPFL_ParticleSystem_C_SetupParticleManagerLocation::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_ParticleSystem_C_SetupParticleManagerLocation, CallFunc_GetDataTableRowFromName_OutRow) == 0x000070, "Member 'BPFL_ParticleSystem_C_SetupParticleManagerLocation::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPFL_ParticleSystem_C_SetupParticleManagerLocation, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000080, "Member 'BPFL_ParticleSystem_C_SetupParticleManagerLocation::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

}

