#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_EventUtility

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "MovieScene_structs.hpp"
#include "Engine_structs.hpp"
#include "FScenarioFlagCheckData_structs.hpp"


namespace SDK::Params
{

// Function BPFL_EventUtility.BPFL_EventUtility_C.CheckProgressID
// 0x0060 (0x0060 - 0x0000)
struct BPFL_EventUtility_C_CheckProgressID final
{
public:
	int32                                         MinProgressID;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxProgressID;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnEnable1;                                     // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnEnable;                                      // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61DC[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_GetProgressID_self_CastInput;             // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetProgressID_ProgressID;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61DD[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_GetProgressID_self_CastInput_1;           // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetProgressID_ProgressID_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_IntInt_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_EventUtility_C_CheckProgressID) == 0x000008, "Wrong alignment on BPFL_EventUtility_C_CheckProgressID");
static_assert(sizeof(BPFL_EventUtility_C_CheckProgressID) == 0x000060, "Wrong size on BPFL_EventUtility_C_CheckProgressID");
static_assert(offsetof(BPFL_EventUtility_C_CheckProgressID, MinProgressID) == 0x000000, "Member 'BPFL_EventUtility_C_CheckProgressID::MinProgressID' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckProgressID, MaxProgressID) == 0x000004, "Member 'BPFL_EventUtility_C_CheckProgressID::MaxProgressID' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckProgressID, __WorldContext) == 0x000008, "Member 'BPFL_EventUtility_C_CheckProgressID::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckProgressID, ReturnEnable1) == 0x000010, "Member 'BPFL_EventUtility_C_CheckProgressID::ReturnEnable1' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckProgressID, ReturnEnable) == 0x000011, "Member 'BPFL_EventUtility_C_CheckProgressID::ReturnEnable' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckProgressID, CallFunc_GetEventManager_EventManager) == 0x000018, "Member 'BPFL_EventUtility_C_CheckProgressID::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckProgressID, CallFunc_GetEventManager_EventManager_1) == 0x000020, "Member 'BPFL_EventUtility_C_CheckProgressID::CallFunc_GetEventManager_EventManager_1' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckProgressID, CallFunc_GetProgressID_self_CastInput) == 0x000028, "Member 'BPFL_EventUtility_C_CheckProgressID::CallFunc_GetProgressID_self_CastInput' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckProgressID, CallFunc_GetProgressID_ProgressID) == 0x000038, "Member 'BPFL_EventUtility_C_CheckProgressID::CallFunc_GetProgressID_ProgressID' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckProgressID, CallFunc_GetProgressID_self_CastInput_1) == 0x000040, "Member 'BPFL_EventUtility_C_CheckProgressID::CallFunc_GetProgressID_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckProgressID, CallFunc_GetProgressID_ProgressID_1) == 0x000050, "Member 'BPFL_EventUtility_C_CheckProgressID::CallFunc_GetProgressID_ProgressID_1' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckProgressID, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000054, "Member 'BPFL_EventUtility_C_CheckProgressID::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckProgressID, CallFunc_IsValid_ReturnValue) == 0x000055, "Member 'BPFL_EventUtility_C_CheckProgressID::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckProgressID, CallFunc_IsValid_ReturnValue_1) == 0x000056, "Member 'BPFL_EventUtility_C_CheckProgressID::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckProgressID, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000057, "Member 'BPFL_EventUtility_C_CheckProgressID::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckProgressID, CallFunc_InRange_IntInt_ReturnValue) == 0x000058, "Member 'BPFL_EventUtility_C_CheckProgressID::CallFunc_InRange_IntInt_ReturnValue' has a wrong offset!");

// Function BPFL_EventUtility.BPFL_EventUtility_C.CheckScenarioFlagList
// 0x0058 (0x0058 - 0x0000)
struct BPFL_EventUtility_C_CheckScenarioFlagList final
{
public:
	TArray<struct FFScenarioFlagCheckData>        ScenarioFlagList;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnBool;                                        // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnEnable;                                      // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61DE[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61DF[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFScenarioFlagCheckData                CallFunc_Array_Get_Item;                           // 0x0030(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckScenarioFlag_ReturnValue;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61E0[0x1];                                     // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61E1[0x2];                                     // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_EventUtility_C_CheckScenarioFlagList) == 0x000008, "Wrong alignment on BPFL_EventUtility_C_CheckScenarioFlagList");
static_assert(sizeof(BPFL_EventUtility_C_CheckScenarioFlagList) == 0x000058, "Wrong size on BPFL_EventUtility_C_CheckScenarioFlagList");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagList, ScenarioFlagList) == 0x000000, "Member 'BPFL_EventUtility_C_CheckScenarioFlagList::ScenarioFlagList' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagList, __WorldContext) == 0x000010, "Member 'BPFL_EventUtility_C_CheckScenarioFlagList::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagList, ReturnBool) == 0x000018, "Member 'BPFL_EventUtility_C_CheckScenarioFlagList::ReturnBool' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagList, ReturnEnable) == 0x000019, "Member 'BPFL_EventUtility_C_CheckScenarioFlagList::ReturnEnable' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagList, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BPFL_EventUtility_C_CheckScenarioFlagList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagList, CallFunc_GetSceneManager_SceneManager) == 0x000020, "Member 'BPFL_EventUtility_C_CheckScenarioFlagList::CallFunc_GetSceneManager_SceneManager' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagList, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BPFL_EventUtility_C_CheckScenarioFlagList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagList, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'BPFL_EventUtility_C_CheckScenarioFlagList::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagList, CallFunc_Array_Get_Item) == 0x000030, "Member 'BPFL_EventUtility_C_CheckScenarioFlagList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagList, CallFunc_Array_Length_ReturnValue_1) == 0x000040, "Member 'BPFL_EventUtility_C_CheckScenarioFlagList::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagList, CallFunc_CheckScenarioFlag_ReturnValue) == 0x000044, "Member 'BPFL_EventUtility_C_CheckScenarioFlagList::CallFunc_CheckScenarioFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagList, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000045, "Member 'BPFL_EventUtility_C_CheckScenarioFlagList::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagList, K2Node_SwitchEnum_CmpSuccess) == 0x000046, "Member 'BPFL_EventUtility_C_CheckScenarioFlagList::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagList, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BPFL_EventUtility_C_CheckScenarioFlagList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagList, CallFunc_BooleanOR_ReturnValue) == 0x00004C, "Member 'BPFL_EventUtility_C_CheckScenarioFlagList::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagList, CallFunc_Less_IntInt_ReturnValue) == 0x00004D, "Member 'BPFL_EventUtility_C_CheckScenarioFlagList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagList, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BPFL_EventUtility_C_CheckScenarioFlagList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagList, CallFunc_BooleanAND_ReturnValue) == 0x000054, "Member 'BPFL_EventUtility_C_CheckScenarioFlagList::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BPFL_EventUtility.BPFL_EventUtility_C.GetCharaAnimInstance
// 0x0060 (0x0060 - 0x0000)
struct BPFL_EventUtility_C_GetCharaAnimInstance final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ChataAnimInstancePath;                             // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_RightChop_ReturnValue;                    // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetAnimBPGeneratedClassFromPath_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_EventUtility_C_GetCharaAnimInstance) == 0x000008, "Wrong alignment on BPFL_EventUtility_C_GetCharaAnimInstance");
static_assert(sizeof(BPFL_EventUtility_C_GetCharaAnimInstance) == 0x000060, "Wrong size on BPFL_EventUtility_C_GetCharaAnimInstance");
static_assert(offsetof(BPFL_EventUtility_C_GetCharaAnimInstance, Object) == 0x000000, "Member 'BPFL_EventUtility_C_GetCharaAnimInstance::Object' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetCharaAnimInstance, __WorldContext) == 0x000008, "Member 'BPFL_EventUtility_C_GetCharaAnimInstance::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetCharaAnimInstance, ReturnValue) == 0x000010, "Member 'BPFL_EventUtility_C_GetCharaAnimInstance::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetCharaAnimInstance, ChataAnimInstancePath) == 0x000018, "Member 'BPFL_EventUtility_C_GetCharaAnimInstance::ChataAnimInstancePath' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetCharaAnimInstance, CallFunc_GetObjectName_ReturnValue) == 0x000028, "Member 'BPFL_EventUtility_C_GetCharaAnimInstance::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetCharaAnimInstance, CallFunc_RightChop_ReturnValue) == 0x000038, "Member 'BPFL_EventUtility_C_GetCharaAnimInstance::CallFunc_RightChop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetCharaAnimInstance, CallFunc_Replace_ReturnValue) == 0x000048, "Member 'BPFL_EventUtility_C_GetCharaAnimInstance::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetCharaAnimInstance, CallFunc_GetAnimBPGeneratedClassFromPath_ReturnValue) == 0x000058, "Member 'BPFL_EventUtility_C_GetCharaAnimInstance::CallFunc_GetAnimBPGeneratedClassFromPath_ReturnValue' has a wrong offset!");

// Function BPFL_EventUtility.BPFL_EventUtility_C.GetCharaFaceAnimMontage
// 0x0060 (0x0060 - 0x0000)
struct BPFL_EventUtility_C_GetCharaFaceAnimMontage final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimationAsset*                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CharaFaceAnimPath;                                 // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_RightChop_ReturnValue;                    // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimationAsset*                        CallFunc_GetAnimSequenceFromPath_ReturnValue;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_EventUtility_C_GetCharaFaceAnimMontage) == 0x000008, "Wrong alignment on BPFL_EventUtility_C_GetCharaFaceAnimMontage");
static_assert(sizeof(BPFL_EventUtility_C_GetCharaFaceAnimMontage) == 0x000060, "Wrong size on BPFL_EventUtility_C_GetCharaFaceAnimMontage");
static_assert(offsetof(BPFL_EventUtility_C_GetCharaFaceAnimMontage, Object) == 0x000000, "Member 'BPFL_EventUtility_C_GetCharaFaceAnimMontage::Object' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetCharaFaceAnimMontage, __WorldContext) == 0x000008, "Member 'BPFL_EventUtility_C_GetCharaFaceAnimMontage::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetCharaFaceAnimMontage, ReturnValue) == 0x000010, "Member 'BPFL_EventUtility_C_GetCharaFaceAnimMontage::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetCharaFaceAnimMontage, CharaFaceAnimPath) == 0x000018, "Member 'BPFL_EventUtility_C_GetCharaFaceAnimMontage::CharaFaceAnimPath' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetCharaFaceAnimMontage, CallFunc_GetObjectName_ReturnValue) == 0x000028, "Member 'BPFL_EventUtility_C_GetCharaFaceAnimMontage::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetCharaFaceAnimMontage, CallFunc_RightChop_ReturnValue) == 0x000038, "Member 'BPFL_EventUtility_C_GetCharaFaceAnimMontage::CallFunc_RightChop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetCharaFaceAnimMontage, CallFunc_Replace_ReturnValue) == 0x000048, "Member 'BPFL_EventUtility_C_GetCharaFaceAnimMontage::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetCharaFaceAnimMontage, CallFunc_GetAnimSequenceFromPath_ReturnValue) == 0x000058, "Member 'BPFL_EventUtility_C_GetCharaFaceAnimMontage::CallFunc_GetAnimSequenceFromPath_ReturnValue' has a wrong offset!");

// Function BPFL_EventUtility.BPFL_EventUtility_C.GetCharaBodyAnimMontage
// 0x0060 (0x0060 - 0x0000)
struct BPFL_EventUtility_C_GetCharaBodyAnimMontage final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimationAsset*                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CharaBodyAnimPath;                                 // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_RightChop_ReturnValue;                    // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimationAsset*                        CallFunc_GetAnimSequenceFromPath_ReturnValue;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_EventUtility_C_GetCharaBodyAnimMontage) == 0x000008, "Wrong alignment on BPFL_EventUtility_C_GetCharaBodyAnimMontage");
static_assert(sizeof(BPFL_EventUtility_C_GetCharaBodyAnimMontage) == 0x000060, "Wrong size on BPFL_EventUtility_C_GetCharaBodyAnimMontage");
static_assert(offsetof(BPFL_EventUtility_C_GetCharaBodyAnimMontage, Object) == 0x000000, "Member 'BPFL_EventUtility_C_GetCharaBodyAnimMontage::Object' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetCharaBodyAnimMontage, __WorldContext) == 0x000008, "Member 'BPFL_EventUtility_C_GetCharaBodyAnimMontage::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetCharaBodyAnimMontage, ReturnValue) == 0x000010, "Member 'BPFL_EventUtility_C_GetCharaBodyAnimMontage::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetCharaBodyAnimMontage, CharaBodyAnimPath) == 0x000018, "Member 'BPFL_EventUtility_C_GetCharaBodyAnimMontage::CharaBodyAnimPath' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetCharaBodyAnimMontage, CallFunc_GetObjectName_ReturnValue) == 0x000028, "Member 'BPFL_EventUtility_C_GetCharaBodyAnimMontage::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetCharaBodyAnimMontage, CallFunc_RightChop_ReturnValue) == 0x000038, "Member 'BPFL_EventUtility_C_GetCharaBodyAnimMontage::CallFunc_RightChop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetCharaBodyAnimMontage, CallFunc_Replace_ReturnValue) == 0x000048, "Member 'BPFL_EventUtility_C_GetCharaBodyAnimMontage::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetCharaBodyAnimMontage, CallFunc_GetAnimSequenceFromPath_ReturnValue) == 0x000058, "Member 'BPFL_EventUtility_C_GetCharaBodyAnimMontage::CallFunc_GetAnimSequenceFromPath_ReturnValue' has a wrong offset!");

// Function BPFL_EventUtility.BPFL_EventUtility_C.CheckScenarioFlag
// 0x0028 (0x0028 - 0x0000)
struct BPFL_EventUtility_C_CheckScenarioFlag final
{
public:
	class FName                                   ScenarioFlag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlagValue;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnEnable;                                      // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61E2[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckScenarioFlag_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_EventUtility_C_CheckScenarioFlag) == 0x000008, "Wrong alignment on BPFL_EventUtility_C_CheckScenarioFlag");
static_assert(sizeof(BPFL_EventUtility_C_CheckScenarioFlag) == 0x000028, "Wrong size on BPFL_EventUtility_C_CheckScenarioFlag");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlag, ScenarioFlag) == 0x000000, "Member 'BPFL_EventUtility_C_CheckScenarioFlag::ScenarioFlag' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlag, __WorldContext) == 0x000008, "Member 'BPFL_EventUtility_C_CheckScenarioFlag::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlag, FlagValue) == 0x000010, "Member 'BPFL_EventUtility_C_CheckScenarioFlag::FlagValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlag, ReturnEnable) == 0x000011, "Member 'BPFL_EventUtility_C_CheckScenarioFlag::ReturnEnable' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlag, CallFunc_GetSceneManager_SceneManager) == 0x000018, "Member 'BPFL_EventUtility_C_CheckScenarioFlag::CallFunc_GetSceneManager_SceneManager' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlag, CallFunc_CheckScenarioFlag_ReturnValue) == 0x000020, "Member 'BPFL_EventUtility_C_CheckScenarioFlag::CallFunc_CheckScenarioFlag_ReturnValue' has a wrong offset!");

// Function BPFL_EventUtility.BPFL_EventUtility_C.SetScenarioFlag
// 0x0028 (0x0028 - 0x0000)
struct BPFL_EventUtility_C_SetScenarioFlag final
{
public:
	class FName                                   ScenarioFlag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Value;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61E3[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnEnable;                                      // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61E4[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_EventUtility_C_SetScenarioFlag) == 0x000008, "Wrong alignment on BPFL_EventUtility_C_SetScenarioFlag");
static_assert(sizeof(BPFL_EventUtility_C_SetScenarioFlag) == 0x000028, "Wrong size on BPFL_EventUtility_C_SetScenarioFlag");
static_assert(offsetof(BPFL_EventUtility_C_SetScenarioFlag, ScenarioFlag) == 0x000000, "Member 'BPFL_EventUtility_C_SetScenarioFlag::ScenarioFlag' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_SetScenarioFlag, Value) == 0x000008, "Member 'BPFL_EventUtility_C_SetScenarioFlag::Value' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_SetScenarioFlag, __WorldContext) == 0x000010, "Member 'BPFL_EventUtility_C_SetScenarioFlag::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_SetScenarioFlag, ReturnEnable) == 0x000018, "Member 'BPFL_EventUtility_C_SetScenarioFlag::ReturnEnable' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_SetScenarioFlag, CallFunc_GetSceneManager_SceneManager) == 0x000020, "Member 'BPFL_EventUtility_C_SetScenarioFlag::CallFunc_GetSceneManager_SceneManager' has a wrong offset!");

// Function BPFL_EventUtility.BPFL_EventUtility_C.CheckScenarioFlagListC
// 0x0058 (0x0058 - 0x0000)
struct BPFL_EventUtility_C_CheckScenarioFlagListC final
{
public:
	TArray<struct FShowDestinationFlgCheck>       ScenarioFlagList;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnBool;                                        // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnEnable;                                      // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61E5[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61E6[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FShowDestinationFlgCheck               CallFunc_Array_Get_Item;                           // 0x0030(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckScenarioFlag_ReturnValue;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61E7[0x1];                                     // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61E8[0x2];                                     // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_EventUtility_C_CheckScenarioFlagListC) == 0x000008, "Wrong alignment on BPFL_EventUtility_C_CheckScenarioFlagListC");
static_assert(sizeof(BPFL_EventUtility_C_CheckScenarioFlagListC) == 0x000058, "Wrong size on BPFL_EventUtility_C_CheckScenarioFlagListC");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagListC, ScenarioFlagList) == 0x000000, "Member 'BPFL_EventUtility_C_CheckScenarioFlagListC::ScenarioFlagList' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagListC, __WorldContext) == 0x000010, "Member 'BPFL_EventUtility_C_CheckScenarioFlagListC::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagListC, ReturnBool) == 0x000018, "Member 'BPFL_EventUtility_C_CheckScenarioFlagListC::ReturnBool' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagListC, ReturnEnable) == 0x000019, "Member 'BPFL_EventUtility_C_CheckScenarioFlagListC::ReturnEnable' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagListC, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BPFL_EventUtility_C_CheckScenarioFlagListC::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagListC, CallFunc_GetSceneManager_SceneManager) == 0x000020, "Member 'BPFL_EventUtility_C_CheckScenarioFlagListC::CallFunc_GetSceneManager_SceneManager' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagListC, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BPFL_EventUtility_C_CheckScenarioFlagListC::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagListC, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'BPFL_EventUtility_C_CheckScenarioFlagListC::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagListC, CallFunc_Array_Get_Item) == 0x000030, "Member 'BPFL_EventUtility_C_CheckScenarioFlagListC::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagListC, CallFunc_Array_Length_ReturnValue_1) == 0x000040, "Member 'BPFL_EventUtility_C_CheckScenarioFlagListC::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagListC, CallFunc_CheckScenarioFlag_ReturnValue) == 0x000044, "Member 'BPFL_EventUtility_C_CheckScenarioFlagListC::CallFunc_CheckScenarioFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagListC, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000045, "Member 'BPFL_EventUtility_C_CheckScenarioFlagListC::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagListC, K2Node_SwitchEnum_CmpSuccess) == 0x000046, "Member 'BPFL_EventUtility_C_CheckScenarioFlagListC::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagListC, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BPFL_EventUtility_C_CheckScenarioFlagListC::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagListC, CallFunc_BooleanOR_ReturnValue) == 0x00004C, "Member 'BPFL_EventUtility_C_CheckScenarioFlagListC::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagListC, CallFunc_Less_IntInt_ReturnValue) == 0x00004D, "Member 'BPFL_EventUtility_C_CheckScenarioFlagListC::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagListC, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BPFL_EventUtility_C_CheckScenarioFlagListC::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_CheckScenarioFlagListC, CallFunc_BooleanAND_ReturnValue) == 0x000054, "Member 'BPFL_EventUtility_C_CheckScenarioFlagListC::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BPFL_EventUtility.BPFL_EventUtility_C.GetEventAttachedMesh
// 0x0060 (0x0060 - 0x0000)
struct BPFL_EventUtility_C_GetEventAttachedMesh final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      Player;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuPlayerBase_C*                   MenuPlayer;                                        // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMeshComp;                                  // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    PrimitiveComp;                                     // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ParentActor;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      CallFunc_GetEventMesh_Player;                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MenuPlayerBase_C*                   CallFunc_GetEventMesh_MenuPlayer;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetEventMesh_SkeletalMeshComp;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_GetEventMesh_PrimitiveComp;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_EventUtility_C_GetEventAttachedMesh) == 0x000008, "Wrong alignment on BPFL_EventUtility_C_GetEventAttachedMesh");
static_assert(sizeof(BPFL_EventUtility_C_GetEventAttachedMesh) == 0x000060, "Wrong size on BPFL_EventUtility_C_GetEventAttachedMesh");
static_assert(offsetof(BPFL_EventUtility_C_GetEventAttachedMesh, Actor) == 0x000000, "Member 'BPFL_EventUtility_C_GetEventAttachedMesh::Actor' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetEventAttachedMesh, __WorldContext) == 0x000008, "Member 'BPFL_EventUtility_C_GetEventAttachedMesh::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetEventAttachedMesh, Player) == 0x000010, "Member 'BPFL_EventUtility_C_GetEventAttachedMesh::Player' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetEventAttachedMesh, MenuPlayer) == 0x000018, "Member 'BPFL_EventUtility_C_GetEventAttachedMesh::MenuPlayer' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetEventAttachedMesh, SkeletalMeshComp) == 0x000020, "Member 'BPFL_EventUtility_C_GetEventAttachedMesh::SkeletalMeshComp' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetEventAttachedMesh, PrimitiveComp) == 0x000028, "Member 'BPFL_EventUtility_C_GetEventAttachedMesh::PrimitiveComp' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetEventAttachedMesh, ParentActor) == 0x000030, "Member 'BPFL_EventUtility_C_GetEventAttachedMesh::ParentActor' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetEventAttachedMesh, CallFunc_GetEventMesh_Player) == 0x000038, "Member 'BPFL_EventUtility_C_GetEventAttachedMesh::CallFunc_GetEventMesh_Player' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetEventAttachedMesh, CallFunc_GetEventMesh_MenuPlayer) == 0x000040, "Member 'BPFL_EventUtility_C_GetEventAttachedMesh::CallFunc_GetEventMesh_MenuPlayer' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetEventAttachedMesh, CallFunc_GetEventMesh_SkeletalMeshComp) == 0x000048, "Member 'BPFL_EventUtility_C_GetEventAttachedMesh::CallFunc_GetEventMesh_SkeletalMeshComp' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetEventAttachedMesh, CallFunc_GetEventMesh_PrimitiveComp) == 0x000050, "Member 'BPFL_EventUtility_C_GetEventAttachedMesh::CallFunc_GetEventMesh_PrimitiveComp' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetEventAttachedMesh, CallFunc_GetAttachParentActor_ReturnValue) == 0x000058, "Member 'BPFL_EventUtility_C_GetEventAttachedMesh::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");

// Function BPFL_EventUtility.BPFL_EventUtility_C.GetSequenceObjectBindingIDPlayer
// 0x0200 (0x0200 - 0x0000)
struct BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer final
{
public:
	class ARSLevelSequenceActor*                  Sequencer;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   PlayerId;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	TArray<class FName>                           ObjTags;                                           // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          AllowSuffixNo;                                     // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61E9[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMovieSceneObjectBindingID>     BindingIds;                                        // 0x0040(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          IsFind;                                            // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61EA[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_1;                          // 0x0068(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61EB[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0080(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x00C0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_Select_Default;                             // 0x00D0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00F8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0138(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0178(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x0188(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0198(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x01B0(0x0018)()
	TArray<class FText>                           K2Node_MakeArray_Array_5;                          // 0x01C8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<struct FMovieSceneObjectBindingID>     CallFunc_GetSequenceObjectBindingIDInternal_BindingIDs; // 0x01D8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_GetSequenceObjectBindingIDInternal_IsFind; // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61EC[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetSequenceObjectBindingIDInternal_BindingNames; // 0x01F0(0x0010)(ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer) == 0x000008, "Wrong alignment on BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer");
static_assert(sizeof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer) == 0x000200, "Wrong size on BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer");
static_assert(offsetof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer, Sequencer) == 0x000000, "Member 'BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer::Sequencer' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer, PlayerId) == 0x000008, "Member 'BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer::PlayerId' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer, ObjTags) == 0x000020, "Member 'BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer::ObjTags' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer, AllowSuffixNo) == 0x000030, "Member 'BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer::AllowSuffixNo' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer, __WorldContext) == 0x000038, "Member 'BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer, BindingIds) == 0x000040, "Member 'BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer::BindingIds' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer, IsFind) == 0x000050, "Member 'BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer::IsFind' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer, K2Node_MakeArray_Array) == 0x000058, "Member 'BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer, K2Node_MakeArray_Array_1) == 0x000068, "Member 'BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer, Temp_bool_Variable) == 0x000078, "Member 'BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer, K2Node_MakeStruct_FormatArgumentData) == 0x000080, "Member 'BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer, K2Node_MakeArray_Array_2) == 0x0000C0, "Member 'BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer, K2Node_Select_Default) == 0x0000D0, "Member 'BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000F8, "Member 'BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer, K2Node_MakeStruct_FormatArgumentData_2) == 0x000138, "Member 'BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer, K2Node_MakeArray_Array_3) == 0x000178, "Member 'BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer, K2Node_MakeArray_Array_4) == 0x000188, "Member 'BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer, CallFunc_Format_ReturnValue_1) == 0x000198, "Member 'BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer, CallFunc_Format_ReturnValue_2) == 0x0001B0, "Member 'BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer, K2Node_MakeArray_Array_5) == 0x0001C8, "Member 'BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer, CallFunc_GetSequenceObjectBindingIDInternal_BindingIDs) == 0x0001D8, "Member 'BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer::CallFunc_GetSequenceObjectBindingIDInternal_BindingIDs' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer, CallFunc_GetSequenceObjectBindingIDInternal_IsFind) == 0x0001E8, "Member 'BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer::CallFunc_GetSequenceObjectBindingIDInternal_IsFind' has a wrong offset!");
static_assert(offsetof(BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer, CallFunc_GetSequenceObjectBindingIDInternal_BindingNames) == 0x0001F0, "Member 'BPFL_EventUtility_C_GetSequenceObjectBindingIDPlayer::CallFunc_GetSequenceObjectBindingIDInternal_BindingNames' has a wrong offset!");

// Function BPFL_EventUtility.BPFL_EventUtility_C.GetSequenceObjectBindingIDWeapon
// 0x0208 (0x0208 - 0x0000)
struct BPFL_EventUtility_C_GetSequenceObjectBindingIDWeapon final
{
public:
	class ARSLevelSequenceActor*                  Sequencer;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   WeaponId;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	TArray<class FName>                           ObjTags;                                           // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          AllowSuffixNo;                                     // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61ED[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMovieSceneObjectBindingID>     BindingIds;                                        // 0x0040(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          IsFind;                                            // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61EE[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         BindingNames;                                      // 0x0058(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	class FString                                 MatchText;                                         // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FMovieSceneObjectBindingID>     RetBindingList;                                    // 0x0078(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class FText>                           CallFunc_GetSequencerWeaponSuffixNoList_List;      // 0x0088(0x0010)(ReferenceParm, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0098(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0118(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0128(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0138(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0150(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0168(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x01A8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x01B8(0x0018)()
	TArray<class FText>                           K2Node_MakeArray_Array_3;                          // 0x01D0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<struct FMovieSceneObjectBindingID>     CallFunc_GetSequenceObjectBindingIDInternal_BindingIDs; // 0x01E0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_GetSequenceObjectBindingIDInternal_IsFind; // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
