#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_PsychicObjectManagerFunctionLibrary

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPFL_PsychicObjectManagerFunctionLibrary.BPFL_PsychicObjectManagerFunctionLibrary_C.GetPsychicObjectManager
// 0x0040 (0x0040 - 0x0000)
struct BPFL_PsychicObjectManagerFunctionLibrary_C_GetPsychicObjectManager final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APsychicObjectManager_C*                PsyObjManager;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSGameInstance*                        K2Node_DynamicCast_AsRSGame_Instance;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D64[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APsychicObjectManager*                  CallFunc_GetPsychicObjectManager_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APsychicObjectManager_C*                K2Node_DynamicCast_AsPsychic_Object_Manager;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_PsychicObjectManagerFunctionLibrary_C_GetPsychicObjectManager) == 0x000008, "Wrong alignment on BPFL_PsychicObjectManagerFunctionLibrary_C_GetPsychicObjectManager");
static_assert(sizeof(BPFL_PsychicObjectManagerFunctionLibrary_C_GetPsychicObjectManager) == 0x000040, "Wrong size on BPFL_PsychicObjectManagerFunctionLibrary_C_GetPsychicObjectManager");
static_assert(offsetof(BPFL_PsychicObjectManagerFunctionLibrary_C_GetPsychicObjectManager, __WorldContext) == 0x000000, "Member 'BPFL_PsychicObjectManagerFunctionLibrary_C_GetPsychicObjectManager::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_PsychicObjectManagerFunctionLibrary_C_GetPsychicObjectManager, PsyObjManager) == 0x000008, "Member 'BPFL_PsychicObjectManagerFunctionLibrary_C_GetPsychicObjectManager::PsyObjManager' has a wrong offset!");
static_assert(offsetof(BPFL_PsychicObjectManagerFunctionLibrary_C_GetPsychicObjectManager, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPFL_PsychicObjectManagerFunctionLibrary_C_GetPsychicObjectManager::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PsychicObjectManagerFunctionLibrary_C_GetPsychicObjectManager, K2Node_DynamicCast_AsRSGame_Instance) == 0x000018, "Member 'BPFL_PsychicObjectManagerFunctionLibrary_C_GetPsychicObjectManager::K2Node_DynamicCast_AsRSGame_Instance' has a wrong offset!");
static_assert(offsetof(BPFL_PsychicObjectManagerFunctionLibrary_C_GetPsychicObjectManager, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BPFL_PsychicObjectManagerFunctionLibrary_C_GetPsychicObjectManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_PsychicObjectManagerFunctionLibrary_C_GetPsychicObjectManager, CallFunc_GetPsychicObjectManager_ReturnValue) == 0x000028, "Member 'BPFL_PsychicObjectManagerFunctionLibrary_C_GetPsychicObjectManager::CallFunc_GetPsychicObjectManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_PsychicObjectManagerFunctionLibrary_C_GetPsychicObjectManager, K2Node_DynamicCast_AsPsychic_Object_Manager) == 0x000030, "Member 'BPFL_PsychicObjectManagerFunctionLibrary_C_GetPsychicObjectManager::K2Node_DynamicCast_AsPsychic_Object_Manager' has a wrong offset!");
static_assert(offsetof(BPFL_PsychicObjectManagerFunctionLibrary_C_GetPsychicObjectManager, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BPFL_PsychicObjectManagerFunctionLibrary_C_GetPsychicObjectManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

