#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_UtilityNoHardRef

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPFL_UtilityNoHardRef.BPFL_UtilityNoHardRef_C.SetHoodVisibleNoHardRef
// 0x00D8 (0x00D8 - 0x0000)
struct BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef final
{
public:
	class USkinnedMeshComponent*                  Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Visible;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ForceReset;                                        // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InvisibleMask;                                     // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InvisibleBFHood;                                   // 0x000B(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50C7[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TmpMatNum;                                         // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasHood;                                           // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50C8[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C9[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_SearchMeshMaterialFromSlotName_ReturnValue; // 0x0030(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50CA[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50CB[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Attachment_C>     K2Node_DynamicCast_AsBPI_Attachment;               // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AttachmentVisibilityOffOnHead_bDummy;     // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50CC[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50CD[0x1];                                     // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50CE[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50CF[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 K2Node_MakeArray_Array_1;                          // 0x00C0(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef) == 0x000008, "Wrong alignment on BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef");
static_assert(sizeof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef) == 0x0000D8, "Wrong size on BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, Mesh) == 0x000000, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::Mesh' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, Visible) == 0x000008, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::Visible' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, ForceReset) == 0x000009, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::ForceReset' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, InvisibleMask) == 0x00000A, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::InvisibleMask' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, InvisibleBFHood) == 0x00000B, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::InvisibleBFHood' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, __WorldContext) == 0x000010, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, TmpMatNum) == 0x000018, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::TmpMatNum' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, HasHood) == 0x00001C, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::HasHood' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, CallFunc_IsValid_ReturnValue) == 0x00001D, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, CallFunc_GetNumMaterials_ReturnValue) == 0x000024, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, CallFunc_SearchMeshMaterialFromSlotName_ReturnValue) == 0x000030, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::CallFunc_SearchMeshMaterialFromSlotName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, CallFunc_Array_Get_Item) == 0x000040, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, CallFunc_GetMaterial_ReturnValue) == 0x000048, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, CallFunc_Array_Length_ReturnValue_1) == 0x000050, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, K2Node_DynamicCast_AsMaterial_Instance_Dynamic) == 0x000058, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::K2Node_DynamicCast_AsMaterial_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, CallFunc_Greater_IntInt_ReturnValue) == 0x000061, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, CallFunc_GetOwner_ReturnValue) == 0x000068, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, K2Node_DynamicCast_AsBPI_Attachment) == 0x000070, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::K2Node_DynamicCast_AsBPI_Attachment' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, CallFunc_IsValid_ReturnValue_1) == 0x000081, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, CallFunc_AttachmentVisibilityOffOnHead_bDummy) == 0x000082, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::CallFunc_AttachmentVisibilityOffOnHead_bDummy' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, CallFunc_Not_PreBool_ReturnValue) == 0x000083, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, CallFunc_SelectFloat_ReturnValue) == 0x000084, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, CallFunc_SelectFloat_ReturnValue_1) == 0x000088, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, K2Node_MakeArray_Array) == 0x000090, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, Temp_int_Variable) == 0x0000A0, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, CallFunc_Add_IntInt_ReturnValue) == 0x0000A4, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000A8, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, Temp_bool_Variable) == 0x0000A9, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, Temp_bool_Variable_1) == 0x0000AA, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, Temp_int_Loop_Counter_Variable) == 0x0000AC, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, K2Node_Select_Default) == 0x0000B0, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, CallFunc_SelectFloat_ReturnValue_2) == 0x0000B4, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, K2Node_MakeArray_Array_1) == 0x0000C0, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000D0, "Member 'BPFL_UtilityNoHardRef_C_SetHoodVisibleNoHardRef::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BPFL_UtilityNoHardRef.BPFL_UtilityNoHardRef_C.SetNearClipNoHardRef
// 0x0030 (0x0030 - 0x0000)
struct BPFL_UtilityNoHardRef_C_SetNearClipNoHardRef final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50D0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_UtilityNoHardRef_C_SetNearClipNoHardRef) == 0x000008, "Wrong alignment on BPFL_UtilityNoHardRef_C_SetNearClipNoHardRef");
static_assert(sizeof(BPFL_UtilityNoHardRef_C_SetNearClipNoHardRef) == 0x000030, "Wrong size on BPFL_UtilityNoHardRef_C_SetNearClipNoHardRef");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetNearClipNoHardRef, Value) == 0x000000, "Member 'BPFL_UtilityNoHardRef_C_SetNearClipNoHardRef::Value' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetNearClipNoHardRef, __WorldContext) == 0x000008, "Member 'BPFL_UtilityNoHardRef_C_SetNearClipNoHardRef::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetNearClipNoHardRef, CallFunc_Conv_FloatToString_ReturnValue) == 0x000010, "Member 'BPFL_UtilityNoHardRef_C_SetNearClipNoHardRef::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_SetNearClipNoHardRef, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'BPFL_UtilityNoHardRef_C_SetNearClipNoHardRef::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BPFL_UtilityNoHardRef.BPFL_UtilityNoHardRef_C.ResetNearClipNoHardRef
// 0x0008 (0x0008 - 0x0000)
struct BPFL_UtilityNoHardRef_C_ResetNearClipNoHardRef final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_UtilityNoHardRef_C_ResetNearClipNoHardRef) == 0x000008, "Wrong alignment on BPFL_UtilityNoHardRef_C_ResetNearClipNoHardRef");
static_assert(sizeof(BPFL_UtilityNoHardRef_C_ResetNearClipNoHardRef) == 0x000008, "Wrong size on BPFL_UtilityNoHardRef_C_ResetNearClipNoHardRef");
static_assert(offsetof(BPFL_UtilityNoHardRef_C_ResetNearClipNoHardRef, __WorldContext) == 0x000000, "Member 'BPFL_UtilityNoHardRef_C_ResetNearClipNoHardRef::__WorldContext' has a wrong offset!");

}

