#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_EnemyManagerFunctionLibrary

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPFL_EnemyManagerFunctionLibrary.BPFL_EnemyManagerFunctionLibrary_C.GetEnemyManager
// 0x0040 (0x0040 - 0x0000)
struct BPFL_EnemyManagerFunctionLibrary_C_GetEnemyManager final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EnemyManager_C*                     Manager;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSGameInstance*                        K2Node_DynamicCast_AsRSGame_Instance;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47B0[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEnemyManager*                          CallFunc_GetEnemyManager_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EnemyManager_C*                     K2Node_DynamicCast_AsBP_Enemy_Manager;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_EnemyManagerFunctionLibrary_C_GetEnemyManager) == 0x000008, "Wrong alignment on BPFL_EnemyManagerFunctionLibrary_C_GetEnemyManager");
static_assert(sizeof(BPFL_EnemyManagerFunctionLibrary_C_GetEnemyManager) == 0x000040, "Wrong size on BPFL_EnemyManagerFunctionLibrary_C_GetEnemyManager");
static_assert(offsetof(BPFL_EnemyManagerFunctionLibrary_C_GetEnemyManager, __WorldContext) == 0x000000, "Member 'BPFL_EnemyManagerFunctionLibrary_C_GetEnemyManager::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_EnemyManagerFunctionLibrary_C_GetEnemyManager, Manager) == 0x000008, "Member 'BPFL_EnemyManagerFunctionLibrary_C_GetEnemyManager::Manager' has a wrong offset!");
static_assert(offsetof(BPFL_EnemyManagerFunctionLibrary_C_GetEnemyManager, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPFL_EnemyManagerFunctionLibrary_C_GetEnemyManager::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EnemyManagerFunctionLibrary_C_GetEnemyManager, K2Node_DynamicCast_AsRSGame_Instance) == 0x000018, "Member 'BPFL_EnemyManagerFunctionLibrary_C_GetEnemyManager::K2Node_DynamicCast_AsRSGame_Instance' has a wrong offset!");
static_assert(offsetof(BPFL_EnemyManagerFunctionLibrary_C_GetEnemyManager, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BPFL_EnemyManagerFunctionLibrary_C_GetEnemyManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_EnemyManagerFunctionLibrary_C_GetEnemyManager, CallFunc_GetEnemyManager_ReturnValue) == 0x000028, "Member 'BPFL_EnemyManagerFunctionLibrary_C_GetEnemyManager::CallFunc_GetEnemyManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_EnemyManagerFunctionLibrary_C_GetEnemyManager, K2Node_DynamicCast_AsBP_Enemy_Manager) == 0x000030, "Member 'BPFL_EnemyManagerFunctionLibrary_C_GetEnemyManager::K2Node_DynamicCast_AsBP_Enemy_Manager' has a wrong offset!");
static_assert(offsetof(BPFL_EnemyManagerFunctionLibrary_C_GetEnemyManager, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BPFL_EnemyManagerFunctionLibrary_C_GetEnemyManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BPFL_EnemyManagerFunctionLibrary.BPFL_EnemyManagerFunctionLibrary_C.GetEnemyFixParam
// 0x0020 (0x0020 - 0x0000)
struct BPFL_EnemyManagerFunctionLibrary_C_GetEnemyFixParam final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_EnemyFixParam_C*                    Param;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EnemyManager_C*                     CallFunc_GetEnemyManager_Manager;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_EnemyManagerFunctionLibrary_C_GetEnemyFixParam) == 0x000008, "Wrong alignment on BPFL_EnemyManagerFunctionLibrary_C_GetEnemyFixParam");
static_assert(sizeof(BPFL_EnemyManagerFunctionLibrary_C_GetEnemyFixParam) == 0x000020, "Wrong size on BPFL_EnemyManagerFunctionLibrary_C_GetEnemyFixParam");
static_assert(offsetof(BPFL_EnemyManagerFunctionLibrary_C_GetEnemyFixParam, __WorldContext) == 0x000000, "Member 'BPFL_EnemyManagerFunctionLibrary_C_GetEnemyFixParam::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_EnemyManagerFunctionLibrary_C_GetEnemyFixParam, Param) == 0x000008, "Member 'BPFL_EnemyManagerFunctionLibrary_C_GetEnemyFixParam::Param' has a wrong offset!");
static_assert(offsetof(BPFL_EnemyManagerFunctionLibrary_C_GetEnemyFixParam, CallFunc_GetEnemyManager_Manager) == 0x000010, "Member 'BPFL_EnemyManagerFunctionLibrary_C_GetEnemyFixParam::CallFunc_GetEnemyManager_Manager' has a wrong offset!");
static_assert(offsetof(BPFL_EnemyManagerFunctionLibrary_C_GetEnemyFixParam, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BPFL_EnemyManagerFunctionLibrary_C_GetEnemyFixParam::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

