#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_BrainCrashUtility

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPFL_BrainCrashUtility.BPFL_BrainCrashUtility_C.GetSafePointEnemyIndexFromName
// 0x0070 (0x0070 - 0x0000)
struct BPFL_BrainCrashUtility_C_GetSafePointEnemyIndexFromName final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EnemyIndex;                                        // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Valid;                                             // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E42[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBrainCrashSequenceSettings            CallFunc_GetSafePointSettingsFromEmName_Settings;  // 0x0018(0x0050)()
	bool                                          CallFunc_GetSafePointSettingsFromEmName_Find;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_BrainCrashUtility_C_GetSafePointEnemyIndexFromName) == 0x000008, "Wrong alignment on BPFL_BrainCrashUtility_C_GetSafePointEnemyIndexFromName");
static_assert(sizeof(BPFL_BrainCrashUtility_C_GetSafePointEnemyIndexFromName) == 0x000070, "Wrong size on BPFL_BrainCrashUtility_C_GetSafePointEnemyIndexFromName");
static_assert(offsetof(BPFL_BrainCrashUtility_C_GetSafePointEnemyIndexFromName, Param_Name) == 0x000000, "Member 'BPFL_BrainCrashUtility_C_GetSafePointEnemyIndexFromName::Param_Name' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_GetSafePointEnemyIndexFromName, __WorldContext) == 0x000008, "Member 'BPFL_BrainCrashUtility_C_GetSafePointEnemyIndexFromName::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_GetSafePointEnemyIndexFromName, EnemyIndex) == 0x000010, "Member 'BPFL_BrainCrashUtility_C_GetSafePointEnemyIndexFromName::EnemyIndex' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_GetSafePointEnemyIndexFromName, Valid) == 0x000014, "Member 'BPFL_BrainCrashUtility_C_GetSafePointEnemyIndexFromName::Valid' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_GetSafePointEnemyIndexFromName, CallFunc_GetSafePointSettingsFromEmName_Settings) == 0x000018, "Member 'BPFL_BrainCrashUtility_C_GetSafePointEnemyIndexFromName::CallFunc_GetSafePointSettingsFromEmName_Settings' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_GetSafePointEnemyIndexFromName, CallFunc_GetSafePointSettingsFromEmName_Find) == 0x000068, "Member 'BPFL_BrainCrashUtility_C_GetSafePointEnemyIndexFromName::CallFunc_GetSafePointSettingsFromEmName_Find' has a wrong offset!");

// Function BPFL_BrainCrashUtility.BPFL_BrainCrashUtility_C.GetSafePointRotationAngle
// 0x0010 (0x0010 - 0x0000)
struct BPFL_BrainCrashUtility_C_GetSafePointRotationAngle final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Angle;                                             // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_BrainCrashUtility_C_GetSafePointRotationAngle) == 0x000008, "Wrong alignment on BPFL_BrainCrashUtility_C_GetSafePointRotationAngle");
static_assert(sizeof(BPFL_BrainCrashUtility_C_GetSafePointRotationAngle) == 0x000010, "Wrong size on BPFL_BrainCrashUtility_C_GetSafePointRotationAngle");
static_assert(offsetof(BPFL_BrainCrashUtility_C_GetSafePointRotationAngle, __WorldContext) == 0x000000, "Member 'BPFL_BrainCrashUtility_C_GetSafePointRotationAngle::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_GetSafePointRotationAngle, Angle) == 0x000008, "Member 'BPFL_BrainCrashUtility_C_GetSafePointRotationAngle::Angle' has a wrong offset!");

// Function BPFL_BrainCrashUtility.BPFL_BrainCrashUtility_C.GetSafePointRotationAngleNum
// 0x0018 (0x0018 - 0x0000)
struct BPFL_BrainCrashUtility_C_GetSafePointRotationAngleNum final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Num;                                               // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSafePointRotationAngle_Angle;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_BrainCrashUtility_C_GetSafePointRotationAngleNum) == 0x000008, "Wrong alignment on BPFL_BrainCrashUtility_C_GetSafePointRotationAngleNum");
static_assert(sizeof(BPFL_BrainCrashUtility_C_GetSafePointRotationAngleNum) == 0x000018, "Wrong size on BPFL_BrainCrashUtility_C_GetSafePointRotationAngleNum");
static_assert(offsetof(BPFL_BrainCrashUtility_C_GetSafePointRotationAngleNum, __WorldContext) == 0x000000, "Member 'BPFL_BrainCrashUtility_C_GetSafePointRotationAngleNum::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_GetSafePointRotationAngleNum, Num) == 0x000008, "Member 'BPFL_BrainCrashUtility_C_GetSafePointRotationAngleNum::Num' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_GetSafePointRotationAngleNum, CallFunc_GetSafePointRotationAngle_Angle) == 0x00000C, "Member 'BPFL_BrainCrashUtility_C_GetSafePointRotationAngleNum::CallFunc_GetSafePointRotationAngle_Angle' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_GetSafePointRotationAngleNum, CallFunc_Divide_IntInt_ReturnValue) == 0x000010, "Member 'BPFL_BrainCrashUtility_C_GetSafePointRotationAngleNum::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");

// Function BPFL_BrainCrashUtility.BPFL_BrainCrashUtility_C.GetSafePointSettingsFromEmName
// 0x0190 (0x0190 - 0x0000)
struct BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName final
{
public:
	class FName                                   EmName;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBrainCrashSequenceSettings            Settings;                                          // 0x0010(0x0050)(Parm, OutParm)
	bool                                          Find;                                              // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E43[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBrainCrashSequenceSettingsData        K2Node_MakeStruct_BrainCrashSequenceSettingsData;  // 0x0064(0x0048)(NoDestructor)
	uint8                                         Pad_3E44[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FBrainCrashSequenceSettings            K2Node_MakeStruct_BrainCrashSequenceSettings;      // 0x00C0(0x0050)()
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBrainCrashSequenceSettings            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0138(0x0050)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName) == 0x000008, "Wrong alignment on BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName");
static_assert(sizeof(BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName) == 0x000190, "Wrong size on BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName");
static_assert(offsetof(BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName, EmName) == 0x000000, "Member 'BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName::EmName' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName, __WorldContext) == 0x000008, "Member 'BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName, Settings) == 0x000010, "Member 'BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName::Settings' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName, Find) == 0x000060, "Member 'BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName::Find' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName, K2Node_MakeStruct_BrainCrashSequenceSettingsData) == 0x000064, "Member 'BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName::K2Node_MakeStruct_BrainCrashSequenceSettingsData' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName, CallFunc_Conv_NameToString_ReturnValue) == 0x0000B0, "Member 'BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName, K2Node_MakeStruct_BrainCrashSequenceSettings) == 0x0000C0, "Member 'BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName::K2Node_MakeStruct_BrainCrashSequenceSettings' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName, CallFunc_GetSubstring_ReturnValue) == 0x000110, "Member 'BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName, CallFunc_Concat_StrStr_ReturnValue) == 0x000120, "Member 'BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName, CallFunc_Conv_StringToName_ReturnValue) == 0x000130, "Member 'BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName, CallFunc_GetDataTableRowFromName_OutRow) == 0x000138, "Member 'BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000188, "Member 'BPFL_BrainCrashUtility_C_GetSafePointSettingsFromEmName::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function BPFL_BrainCrashUtility.BPFL_BrainCrashUtility_C.SearchSafePoint
// 0x0430 (0x0430 - 0x0000)
struct BPFL_BrainCrashUtility_C_SearchSafePoint final
{
public:
	TArray<struct FBrainCrashSafePoint>           SafePoints;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class FName                                   EnemyName;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation;                                    // 0x0024(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_SplineMesh_C*>               BattleFieldActors;                                 // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	TArray<class ATriggerBox*>                    EventTriggerActors;                                // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hit;                                               // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E45[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SafePointTransform;                                // 0x0060(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
	struct FTransform                             SequencerRootTransform;                            // 0x0090(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
	float                                         Length;                                            // 0x00C0(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E46[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USplineMeshComponent*>           BFSplineMeshComps;                                 // 0x00C8(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	class USplineMeshComponent*                   BFSplineMeshComp;                                  // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SplineMesh_C*                       BFActor;                                           // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBrainCrashSequenceSettings            SequenceSetting;                                   // 0x00E8(0x0050)(Edit, BlueprintVisible)
	float                                         NearAngleSearchAngle;                              // 0x0138(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetNearAngleHit;                                   // 0x013C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E47[0x3];                                     // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NearAngleSearchLength;                             // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E48[0xC];                                     // 0x0144(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             NearAngleSafePointTransform;                       // 0x0150(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	float                                         NearLocSearchLength;                               // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E49[0xC];                                     // 0x0184(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             NearLocSafePointTransform;                         // 0x0190(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class UBrainCrashParam*                       BCParam;                                           // 0x01C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SeqeuncerCenterLocation;                           // 0x01C8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4A[0xC];                                     // 0x01D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RetRootTransform;                                  // 0x01E0(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	float                                         TargetNormalizedDir;                               // 0x0210(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RetNearLocHit;                                     // 0x0214(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E4B[0xB];                                     // 0x0215(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RetSafePointTransform;                             // 0x0220(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	float                                         RetSearchLength;                                   // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetRawDir;                                      // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RotationBit;                                       // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EnemyIndex;                                        // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBrainCrashSafePoint                   TmpSafePoint;                                      // 0x0260(0x0020)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSafePointRotationAngle_Angle;          // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E4C[0x3];                                     // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SearchBCSafePointList_HitNearLocation;    // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E4D[0x7];                                     // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_SearchBCSafePointList_NearLocationTransform; // 0x02B0(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_SearchBCSafePointList_NearLocationLength; // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SearchBCSafePointList_HitNearAngle;       // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E4E[0xB];                                     // 0x02E5(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_SearchBCSafePointList_NearAngleTransform; // 0x02F0(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_SearchBCSafePointList_NearAngleLength;    // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E4F[0x3];                                     // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBrainCrashSequenceSettings            CallFunc_GetSafePointSettingsFromEmName_Settings;  // 0x0330(0x0050)()
	bool                                          CallFunc_GetSafePointSettingsFromEmName_Find;      // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E50[0x3];                                     // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0384(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0390(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x039C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x03A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x03B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x03C0(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0400(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x040C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x040D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E51[0x2];                                     // 0x040E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PrivateSearchSafePointNormalizeRotation_RawDir; // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PrivateSearchSafePointNormalizeRotation_NormalizedDir; // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E52[0x3];                                     // 0x0419(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSafePointEnemyIndexFromName_EnemyIndex; // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSafePointEnemyIndexFromName_Valid;     // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_BrainCrashUtility_C_SearchSafePoint) == 0x000010, "Wrong alignment on BPFL_BrainCrashUtility_C_SearchSafePoint");
static_assert(sizeof(BPFL_BrainCrashUtility_C_SearchSafePoint) == 0x000430, "Wrong size on BPFL_BrainCrashUtility_C_SearchSafePoint");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, SafePoints) == 0x000000, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::SafePoints' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, EnemyName) == 0x000010, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::EnemyName' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, Location) == 0x000018, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::Location' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, TargetLocation) == 0x000024, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::TargetLocation' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, BattleFieldActors) == 0x000030, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::BattleFieldActors' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, EventTriggerActors) == 0x000040, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::EventTriggerActors' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, __WorldContext) == 0x000050, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, Hit) == 0x000058, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::Hit' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, SafePointTransform) == 0x000060, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::SafePointTransform' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, SequencerRootTransform) == 0x000090, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::SequencerRootTransform' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, Length) == 0x0000C0, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::Length' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, BFSplineMeshComps) == 0x0000C8, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::BFSplineMeshComps' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, BFSplineMeshComp) == 0x0000D8, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::BFSplineMeshComp' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, BFActor) == 0x0000E0, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::BFActor' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, SequenceSetting) == 0x0000E8, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::SequenceSetting' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, NearAngleSearchAngle) == 0x000138, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::NearAngleSearchAngle' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, RetNearAngleHit) == 0x00013C, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::RetNearAngleHit' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, NearAngleSearchLength) == 0x000140, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::NearAngleSearchLength' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, NearAngleSafePointTransform) == 0x000150, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::NearAngleSafePointTransform' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, NearLocSearchLength) == 0x000180, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::NearLocSearchLength' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, NearLocSafePointTransform) == 0x000190, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::NearLocSafePointTransform' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, BCParam) == 0x0001C0, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::BCParam' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, SeqeuncerCenterLocation) == 0x0001C8, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::SeqeuncerCenterLocation' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, RetRootTransform) == 0x0001E0, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::RetRootTransform' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, TargetNormalizedDir) == 0x000210, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::TargetNormalizedDir' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, RetNearLocHit) == 0x000214, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::RetNearLocHit' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, RetSafePointTransform) == 0x000220, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::RetSafePointTransform' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, RetSearchLength) == 0x000250, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::RetSearchLength' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, TargetRawDir) == 0x000254, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::TargetRawDir' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, RotationBit) == 0x000258, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::RotationBit' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, EnemyIndex) == 0x00025C, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::EnemyIndex' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, TmpSafePoint) == 0x000260, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::TmpSafePoint' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, Temp_int_Loop_Num_Variable) == 0x000280, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, Temp_int_Array_Index_Variable) == 0x000284, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_Array_Length_ReturnValue) == 0x000288, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_Array_Length_ReturnValue_1) == 0x00028C, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_Array_Add_ReturnValue) == 0x000290, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_GetSafePointRotationAngle_Angle) == 0x000294, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_GetSafePointRotationAngle_Angle' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, Temp_int_Loop_Counter_Variable) == 0x000298, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_Less_IntInt_ReturnValue) == 0x00029C, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_Add_IntInt_ReturnValue) == 0x0002A0, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, Temp_int_Loop_Counter_Variable_1) == 0x0002A4, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_SearchBCSafePointList_HitNearLocation) == 0x0002A8, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_SearchBCSafePointList_HitNearLocation' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_SearchBCSafePointList_NearLocationTransform) == 0x0002B0, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_SearchBCSafePointList_NearLocationTransform' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_SearchBCSafePointList_NearLocationLength) == 0x0002E0, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_SearchBCSafePointList_NearLocationLength' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_SearchBCSafePointList_HitNearAngle) == 0x0002E4, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_SearchBCSafePointList_HitNearAngle' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_SearchBCSafePointList_NearAngleTransform) == 0x0002F0, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_SearchBCSafePointList_NearAngleTransform' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_SearchBCSafePointList_NearAngleLength) == 0x000320, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_SearchBCSafePointList_NearAngleLength' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_Add_IntInt_ReturnValue_1) == 0x000324, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, Temp_int_Loop_Num_Variable_1) == 0x000328, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_Less_IntInt_ReturnValue_1) == 0x00032C, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_GetSafePointSettingsFromEmName_Settings) == 0x000330, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_GetSafePointSettingsFromEmName_Settings' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_GetSafePointSettingsFromEmName_Find) == 0x000380, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_GetSafePointSettingsFromEmName_Find' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_BreakTransform_Location) == 0x000384, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_BreakTransform_Rotation) == 0x000390, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_BreakTransform_Scale) == 0x00039C, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x0003A8, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0003B4, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_MakeTransform_ReturnValue) == 0x0003C0, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_BreakVector_X) == 0x0003F0, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_BreakVector_Y) == 0x0003F4, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_BreakVector_Z) == 0x0003F8, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, Temp_int_Array_Index_Variable_1) == 0x0003FC, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_MakeVector_ReturnValue) == 0x000400, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_BooleanOR_ReturnValue) == 0x00040C, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00040D, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_PrivateSearchSafePointNormalizeRotation_RawDir) == 0x000410, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_PrivateSearchSafePointNormalizeRotation_RawDir' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_PrivateSearchSafePointNormalizeRotation_NormalizedDir) == 0x000414, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_PrivateSearchSafePointNormalizeRotation_NormalizedDir' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_IsValid_ReturnValue) == 0x000418, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_GetSafePointEnemyIndexFromName_EnemyIndex) == 0x00041C, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_GetSafePointEnemyIndexFromName_EnemyIndex' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_GetSafePointEnemyIndexFromName_Valid) == 0x000420, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_GetSafePointEnemyIndexFromName_Valid' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_SearchSafePoint, CallFunc_IsValid_ReturnValue_1) == 0x000421, "Member 'BPFL_BrainCrashUtility_C_SearchSafePoint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BPFL_BrainCrashUtility.BPFL_BrainCrashUtility_C.LoadSafePointLocationAsset
// 0x0208 (0x0208 - 0x0000)
struct BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset final
{
public:
	int32                                         LocationId;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AreaId;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBrainCrashLocationSettings*            LocationSetting;                                   // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 AssetPath;                                         // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         TmpAreaID;                                         // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TmpLocationID;                                     // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Path;                                              // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0040(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0068(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        CallFunc_MakeSoftObjectPath_ReturnValue;           // 0x00A8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	struct FBrainCrashLocationAlias               CallFunc_GetDataTableRowFromName_OutRow;           // 0x00C0(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E53[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue; // 0x00D8(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E54[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBrainCrashLocationSettings*            K2Node_DynamicCast_AsBrain_Crash_Location_Settings; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E55[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0120(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0138(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0178(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0190(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01D0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01E0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset) == 0x000008, "Wrong alignment on BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset");
static_assert(sizeof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset) == 0x000208, "Wrong size on BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, LocationId) == 0x000000, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::LocationId' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, AreaId) == 0x000004, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::AreaId' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, __WorldContext) == 0x000008, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, LocationSetting) == 0x000010, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::LocationSetting' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, AssetPath) == 0x000018, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::AssetPath' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, TmpAreaID) == 0x000028, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::TmpAreaID' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, TmpLocationID) == 0x00002C, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::TmpLocationID' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, Path) == 0x000030, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::Path' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, CallFunc_Conv_IntToText_ReturnValue) == 0x000040, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, CallFunc_Conv_TextToString_ReturnValue) == 0x000058, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000068, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000080, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, CallFunc_Concat_StrStr_ReturnValue) == 0x000090, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, CallFunc_Conv_StringToName_ReturnValue) == 0x0000A0, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, CallFunc_MakeSoftObjectPath_ReturnValue) == 0x0000A8, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::CallFunc_MakeSoftObjectPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000C0, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000D0, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue) == 0x0000D8, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, CallFunc_LoadSoftObject_ReturnValue) == 0x000100, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::CallFunc_LoadSoftObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, CallFunc_IsValid_ReturnValue) == 0x000108, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, K2Node_DynamicCast_AsBrain_Crash_Location_Settings) == 0x000110, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::K2Node_DynamicCast_AsBrain_Crash_Location_Settings' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000120, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, K2Node_MakeStruct_FormatArgumentData) == 0x000138, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, CallFunc_Conv_IntToText_ReturnValue_3) == 0x000178, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, K2Node_MakeStruct_FormatArgumentData_1) == 0x000190, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, K2Node_MakeArray_Array) == 0x0001D0, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, CallFunc_Format_ReturnValue) == 0x0001E0, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset, CallFunc_Conv_TextToString_ReturnValue_2) == 0x0001F8, "Member 'BPFL_BrainCrashUtility_C_LoadSafePointLocationAsset::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");

// Function BPFL_BrainCrashUtility.BPFL_BrainCrashUtility_C.SearchSafePointFromLocationSettings
// 0x0180 (0x0180 - 0x0000)
struct BPFL_BrainCrashUtility_C_SearchSafePointFromLocationSettings final
{
public:
	class UBrainCrashLocationSettings*            BCLocationSettings;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EnemyName;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation;                                    // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_SplineMesh_C*>               BattleFieldActors;                                 // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	TArray<class ATriggerBox*>                    EventTriggers;                                     // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hit;                                               // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E56[0xF];                                     // 0x0051(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SafePointTransform;                                // 0x0060(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
	struct FTransform                             SequencerRootTransform;                            // 0x0090(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
	float                                         Length;                                            // 0x00C0(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E57[0xC];                                     // 0x00C4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SearchSafePoint_Hit;                      // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E58[0xE];                                     // 0x0102(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
