#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_KizunaEpisode

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BPFL_KizunaEpisode.BPFL_KizunaEpisode_C.IsNeedKizunaIcon
// 0x00F0 (0x00F0 - 0x0000)
struct BPFL_KizunaEpisode_C_IsNeedKizunaIcon final
{
public:
	EPlayerID                                     PlayerId;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     TargetCharaId;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8643[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedKizunaIcon;                                    // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8644[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EPlayerID>                             CallFunc_GetSelectedTogetherCharID_selectedArray;  // 0x0018(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class ABP_SceneManager_C*                     CallFunc_GetSceneManager_SceneManager;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckScenarioFlag_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8645[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_GetProgressID_self_CastInput;             // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetProgressID_ProgressID;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8646[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserParamManager*                      CallFunc_GetUserParamManager_UserParamManager;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8647[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckKizunaEpisode_DLC2_NeedKizunaIcon;   // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckKizunaLvup_DLC2_NeedKizunaIcon;      // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8648[0x2];                                     // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckKizunaLvup_DLC1_NeedKizunaIcon;      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckKizunaEpisode_DLC1_NeedKizunaIcon;   // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckMatchingAttachment_NeedKizunaIcon;   // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckTwoshotPhoto_NeedKizunaIcon;         // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8649[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CheckStartTeamBondsEpisode_episodeNo;     // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckStartTeamBondsEpisode_ReturnValue;   // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckMemberAlreadyUnion_AlreadyUnion;     // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0087(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckBondsLevelUp_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_864A[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0098(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_864B[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKizunaEpisodeCheckInfo                CallFunc_GetDataTableRowFromName_OutRow;           // 0x00B0(0x0038)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckKizunaEpisode_row_NeedKizunaIcon;    // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon) == 0x000008, "Wrong alignment on BPFL_KizunaEpisode_C_IsNeedKizunaIcon");
static_assert(sizeof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon) == 0x0000F0, "Wrong size on BPFL_KizunaEpisode_C_IsNeedKizunaIcon");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, PlayerId) == 0x000000, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::PlayerId' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, TargetCharaId) == 0x000001, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::TargetCharaId' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, __WorldContext) == 0x000008, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, NeedKizunaIcon) == 0x000010, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::NeedKizunaIcon' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_GetSelectedTogetherCharID_selectedArray) == 0x000018, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_GetSelectedTogetherCharID_selectedArray' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_GetSceneManager_SceneManager) == 0x000028, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_GetSceneManager_SceneManager' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_GetEventManager_EventManager) == 0x000030, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_CheckScenarioFlag_ReturnValue) == 0x000038, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_CheckScenarioFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_GetProgressID_self_CastInput) == 0x000040, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_GetProgressID_self_CastInput' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_GetProgressID_ProgressID) == 0x000050, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_GetProgressID_ProgressID' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_GetUserParamManager_UserParamManager) == 0x000058, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_GetUserParamManager_UserParamManager' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000060, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_Percent_IntInt_ReturnValue) == 0x000064, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_BooleanAND_ReturnValue) == 0x000068, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000069, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_BooleanAND_ReturnValue_1) == 0x00006A, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_BooleanOR_ReturnValue) == 0x00006B, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_CheckKizunaEpisode_DLC2_NeedKizunaIcon) == 0x00006C, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_CheckKizunaEpisode_DLC2_NeedKizunaIcon' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_CheckKizunaLvup_DLC2_NeedKizunaIcon) == 0x00006D, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_CheckKizunaLvup_DLC2_NeedKizunaIcon' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_Array_Find_ReturnValue) == 0x000070, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_CheckKizunaLvup_DLC1_NeedKizunaIcon) == 0x000074, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_CheckKizunaLvup_DLC1_NeedKizunaIcon' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000075, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_CheckKizunaEpisode_DLC1_NeedKizunaIcon) == 0x000076, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_CheckKizunaEpisode_DLC1_NeedKizunaIcon' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_CheckMatchingAttachment_NeedKizunaIcon) == 0x000077, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_CheckMatchingAttachment_NeedKizunaIcon' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, Temp_int_Array_Index_Variable) == 0x000078, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_CheckTwoshotPhoto_NeedKizunaIcon) == 0x00007C, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_CheckTwoshotPhoto_NeedKizunaIcon' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_CheckStartTeamBondsEpisode_episodeNo) == 0x000080, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_CheckStartTeamBondsEpisode_episodeNo' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_CheckStartTeamBondsEpisode_ReturnValue) == 0x000084, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_CheckStartTeamBondsEpisode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000085, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_CheckMemberAlreadyUnion_AlreadyUnion) == 0x000086, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_CheckMemberAlreadyUnion_AlreadyUnion' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_BooleanAND_ReturnValue_2) == 0x000087, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_CheckBondsLevelUp_ReturnValue) == 0x000088, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_CheckBondsLevelUp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_BooleanAND_ReturnValue_3) == 0x000089, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_BooleanAND_ReturnValue_4) == 0x00008A, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_BooleanAND_ReturnValue_5) == 0x00008B, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, Temp_int_Loop_Counter_Variable) == 0x00008C, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000098, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000B0, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000E8, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_Less_IntInt_ReturnValue) == 0x0000E9, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_IsNeedKizunaIcon, CallFunc_CheckKizunaEpisode_row_NeedKizunaIcon) == 0x0000EA, "Member 'BPFL_KizunaEpisode_C_IsNeedKizunaIcon::CallFunc_CheckKizunaEpisode_row_NeedKizunaIcon' has a wrong offset!");

// Function BPFL_KizunaEpisode.BPFL_KizunaEpisode_C.CheckKizunaEpisode_row
// 0x00A8 (0x00A8 - 0x0000)
struct BPFL_KizunaEpisode_C_CheckKizunaEpisode_row final
{
public:
	EPlayerID                                     PlayerId;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     TargetCharaId;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_864C[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKizunaEpisodeCheckInfo                KizunaEpisodeInfo;                                 // 0x0008(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedKizunaIcon;                                    // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameClearState                               CallFunc_GetGameClearState_ReturnValue;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameClearState                               CallFunc_GetGameClearState_ReturnValue_1;          // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_864D[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemNum_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemNum_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_864E[0x2];                                     // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_864F[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8650[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8651[0x1];                                     // 0x0077(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckProgressID_ReturnEnable1;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8652[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckBondsProgressID_ReturnEnable1;       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8653[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckScenarioFlag_FlagValue;              // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8654[0x2];                                     // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8655[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8656[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row) == 0x000008, "Wrong alignment on BPFL_KizunaEpisode_C_CheckKizunaEpisode_row");
static_assert(sizeof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row) == 0x0000A8, "Wrong size on BPFL_KizunaEpisode_C_CheckKizunaEpisode_row");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, PlayerId) == 0x000000, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::PlayerId' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, TargetCharaId) == 0x000001, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::TargetCharaId' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, KizunaEpisodeInfo) == 0x000008, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::KizunaEpisodeInfo' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, __WorldContext) == 0x000040, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, NeedKizunaIcon) == 0x000048, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::NeedKizunaIcon' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_GetGameClearState_ReturnValue) == 0x000049, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_GetGameClearState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_GetGameClearState_ReturnValue_1) == 0x00004A, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_GetGameClearState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00004B, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00004C, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_GetItemNum_ReturnValue) == 0x000050, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_GetItemNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_GetItemNum_ReturnValue_1) == 0x000054, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_GetItemNum_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000058, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000059, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_BooleanAND_ReturnValue) == 0x00005A, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_BooleanAND_ReturnValue_1) == 0x00005B, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_BooleanAND_ReturnValue_2) == 0x00005C, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_BooleanAND_ReturnValue_3) == 0x00005D, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000064, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x00006C, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000074, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000075, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_BooleanAND_ReturnValue_4) == 0x000076, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, Temp_int_Array_Index_Variable) == 0x000078, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, Temp_int_Array_Index_Variable_1) == 0x00007C, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_CheckProgressID_ReturnEnable1) == 0x000080, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_CheckProgressID_ReturnEnable1' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, Temp_int_Loop_Num_Variable) == 0x000084, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_CheckBondsProgressID_ReturnEnable1) == 0x000088, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_CheckBondsProgressID_ReturnEnable1' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, Temp_int_Loop_Counter_Variable_1) == 0x00008C, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_CheckScenarioFlag_FlagValue) == 0x000091, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_CheckScenarioFlag_FlagValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_Array_Length_ReturnValue_1) == 0x000094, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_Less_IntInt_ReturnValue_1) == 0x000098, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_Array_Length_ReturnValue_2) == 0x00009C, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_Greater_IntInt_ReturnValue) == 0x0000A0, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckKizunaEpisode_row, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A4, "Member 'BPFL_KizunaEpisode_C_CheckKizunaEpisode_row::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BPFL_KizunaEpisode.BPFL_KizunaEpisode_C.CheckMemberAlreadyUnion
// 0x0100 (0x0100 - 0x0000)
struct BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion final
{
public:
	EPlayerID                                     PlayerId;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     TargetCharaId;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8657[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AlreadyUnion;                                      // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsExistPartyMember_IsExist;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8658[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_GetProgressID_self_CastInput;             // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetProgressID_ProgressID;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8659[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_1;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_865A[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_GetProgressID_self_CastInput_1;           // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetProgressID_ProgressID_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExistPartyMember_IsExist_1;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_865B[0x1];                                     // 0x005F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_2;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_GetProgressID_self_CastInput_2;           // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetProgressID_ProgressID_2;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_865C[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_3;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_865D[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_GetProgressID_self_CastInput_3;           // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetProgressID_ProgressID_3;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExistPartyMember_IsExist_2;             // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_865E[0x1];                                     // 0x00A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_4;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_GetProgressID_self_CastInput_4;           // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetProgressID_ProgressID_4;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExistPartyMember_IsExist_3;             // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_4;           // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_865F[0x1];                                     // 0x00C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager_5;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EventManager_C>   CallFunc_GetProgressID_self_CastInput_5;           // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetProgressID_ProgressID_5;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_5;           // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x00E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x00EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_11;                // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_12;                // 0x00F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x00F7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_13;                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_14;                // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_15;                // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion) == 0x000008, "Wrong alignment on BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion");
static_assert(sizeof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion) == 0x000100, "Wrong size on BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, PlayerId) == 0x000000, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::PlayerId' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, TargetCharaId) == 0x000001, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::TargetCharaId' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, __WorldContext) == 0x000008, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, AlreadyUnion) == 0x000010, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::AlreadyUnion' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_IsExistPartyMember_IsExist) == 0x000011, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_IsExistPartyMember_IsExist' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, K2Node_SwitchEnum_CmpSuccess) == 0x000012, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_BooleanAND_ReturnValue) == 0x000013, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_GetEventManager_EventManager) == 0x000018, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_GetProgressID_self_CastInput) == 0x000020, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_GetProgressID_self_CastInput' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_GetProgressID_ProgressID) == 0x000030, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_GetProgressID_ProgressID' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_GetEventManager_EventManager_1) == 0x000038, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_GetEventManager_EventManager_1' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000040, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_GetProgressID_self_CastInput_1) == 0x000048, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_GetProgressID_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_GetProgressID_ProgressID_1) == 0x000058, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_GetProgressID_ProgressID_1' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_IsExistPartyMember_IsExist_1) == 0x00005C, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_IsExistPartyMember_IsExist_1' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00005D, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_BooleanAND_ReturnValue_1) == 0x00005E, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_GetEventManager_EventManager_2) == 0x000060, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_GetEventManager_EventManager_2' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_GetProgressID_self_CastInput_2) == 0x000068, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_GetProgressID_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_GetProgressID_ProgressID_2) == 0x000078, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_GetProgressID_ProgressID_2' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_GetEventManager_EventManager_3) == 0x000080, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_GetEventManager_EventManager_3' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x000088, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_GetProgressID_self_CastInput_3) == 0x000090, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_GetProgressID_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_GetProgressID_ProgressID_3) == 0x0000A0, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_GetProgressID_ProgressID_3' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_IsExistPartyMember_IsExist_2) == 0x0000A4, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_IsExistPartyMember_IsExist_2' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_LessEqual_IntInt_ReturnValue_3) == 0x0000A5, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_LessEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_BooleanAND_ReturnValue_2) == 0x0000A6, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_GetEventManager_EventManager_4) == 0x0000A8, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_GetEventManager_EventManager_4' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_GetProgressID_self_CastInput_4) == 0x0000B0, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_GetProgressID_self_CastInput_4' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_GetProgressID_ProgressID_4) == 0x0000C0, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_GetProgressID_ProgressID_4' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_IsExistPartyMember_IsExist_3) == 0x0000C4, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_IsExistPartyMember_IsExist_3' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_LessEqual_IntInt_ReturnValue_4) == 0x0000C5, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_LessEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_BooleanAND_ReturnValue_3) == 0x0000C6, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_GetEventManager_EventManager_5) == 0x0000C8, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_GetEventManager_EventManager_5' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_GetProgressID_self_CastInput_5) == 0x0000D0, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_GetProgressID_self_CastInput_5' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_GetProgressID_ProgressID_5) == 0x0000E0, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_GetProgressID_ProgressID_5' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_LessEqual_IntInt_ReturnValue_5) == 0x0000E4, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_LessEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000E5, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_BooleanAND_ReturnValue_4) == 0x0000E6, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000E7, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_BooleanAND_ReturnValue_5) == 0x0000E8, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_BooleanAND_ReturnValue_6) == 0x0000E9, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_Not_PreBool_ReturnValue) == 0x0000EA, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_BooleanAND_ReturnValue_7) == 0x0000EB, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000EC, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0000ED, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion, CallFunc_BooleanAND_ReturnValue_8) == 0x0000EE, "Member 'BPFL_KizunaEpisode_C_CheckMemberAlreadyUnion::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
