#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_SoundManagerFunctionLibrary

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BPFL_SoundManagerFunctionLibrary.BPFL_SoundManagerFunctionLibrary_C.GetSoundManager
// 0x0040 (0x0040 - 0x0000)
struct BPFL_SoundManagerFunctionLibrary_C_GetSoundManager final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SoundManager_C*                     SoundManager;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSGameInstance*                        K2Node_DynamicCast_AsRSGame_Instance;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381C[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSSoundManager*                        CallFunc_GetSoundManager_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SoundManager_C*                     K2Node_DynamicCast_AsBP_Sound_Manager;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_SoundManagerFunctionLibrary_C_GetSoundManager) == 0x000008, "Wrong alignment on BPFL_SoundManagerFunctionLibrary_C_GetSoundManager");
static_assert(sizeof(BPFL_SoundManagerFunctionLibrary_C_GetSoundManager) == 0x000040, "Wrong size on BPFL_SoundManagerFunctionLibrary_C_GetSoundManager");
static_assert(offsetof(BPFL_SoundManagerFunctionLibrary_C_GetSoundManager, __WorldContext) == 0x000000, "Member 'BPFL_SoundManagerFunctionLibrary_C_GetSoundManager::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_SoundManagerFunctionLibrary_C_GetSoundManager, SoundManager) == 0x000008, "Member 'BPFL_SoundManagerFunctionLibrary_C_GetSoundManager::SoundManager' has a wrong offset!");
static_assert(offsetof(BPFL_SoundManagerFunctionLibrary_C_GetSoundManager, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPFL_SoundManagerFunctionLibrary_C_GetSoundManager::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_SoundManagerFunctionLibrary_C_GetSoundManager, K2Node_DynamicCast_AsRSGame_Instance) == 0x000018, "Member 'BPFL_SoundManagerFunctionLibrary_C_GetSoundManager::K2Node_DynamicCast_AsRSGame_Instance' has a wrong offset!");
static_assert(offsetof(BPFL_SoundManagerFunctionLibrary_C_GetSoundManager, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BPFL_SoundManagerFunctionLibrary_C_GetSoundManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_SoundManagerFunctionLibrary_C_GetSoundManager, CallFunc_GetSoundManager_ReturnValue) == 0x000028, "Member 'BPFL_SoundManagerFunctionLibrary_C_GetSoundManager::CallFunc_GetSoundManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_SoundManagerFunctionLibrary_C_GetSoundManager, K2Node_DynamicCast_AsBP_Sound_Manager) == 0x000030, "Member 'BPFL_SoundManagerFunctionLibrary_C_GetSoundManager::K2Node_DynamicCast_AsBP_Sound_Manager' has a wrong offset!");
static_assert(offsetof(BPFL_SoundManagerFunctionLibrary_C_GetSoundManager, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BPFL_SoundManagerFunctionLibrary_C_GetSoundManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BPFL_SoundManagerFunctionLibrary.BPFL_SoundManagerFunctionLibrary_C.GetPlayerCharaID
// 0x0040 (0x0040 - 0x0000)
struct BPFL_SoundManagerFunctionLibrary_C_GetPlayerCharaID final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381D[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381E[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      K2Node_DynamicCast_AsPlayer_Interface;             // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_SoundManagerFunctionLibrary_C_GetPlayerCharaID) == 0x000008, "Wrong alignment on BPFL_SoundManagerFunctionLibrary_C_GetPlayerCharaID");
static_assert(sizeof(BPFL_SoundManagerFunctionLibrary_C_GetPlayerCharaID) == 0x000040, "Wrong size on BPFL_SoundManagerFunctionLibrary_C_GetPlayerCharaID");
static_assert(offsetof(BPFL_SoundManagerFunctionLibrary_C_GetPlayerCharaID, __WorldContext) == 0x000000, "Member 'BPFL_SoundManagerFunctionLibrary_C_GetPlayerCharaID::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_SoundManagerFunctionLibrary_C_GetPlayerCharaID, ReturnValue) == 0x000008, "Member 'BPFL_SoundManagerFunctionLibrary_C_GetPlayerCharaID::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_SoundManagerFunctionLibrary_C_GetPlayerCharaID, Temp_byte_Variable) == 0x000009, "Member 'BPFL_SoundManagerFunctionLibrary_C_GetPlayerCharaID::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_SoundManagerFunctionLibrary_C_GetPlayerCharaID, CallFunc_GetPlayerManager_PlayerManager) == 0x000010, "Member 'BPFL_SoundManagerFunctionLibrary_C_GetPlayerCharaID::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BPFL_SoundManagerFunctionLibrary_C_GetPlayerCharaID, CallFunc_GetPlayer_ReturnValue) == 0x000018, "Member 'BPFL_SoundManagerFunctionLibrary_C_GetPlayerCharaID::CallFunc_GetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_SoundManagerFunctionLibrary_C_GetPlayerCharaID, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BPFL_SoundManagerFunctionLibrary_C_GetPlayerCharaID::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_SoundManagerFunctionLibrary_C_GetPlayerCharaID, K2Node_DynamicCast_AsPlayer_Interface) == 0x000028, "Member 'BPFL_SoundManagerFunctionLibrary_C_GetPlayerCharaID::K2Node_DynamicCast_AsPlayer_Interface' has a wrong offset!");
static_assert(offsetof(BPFL_SoundManagerFunctionLibrary_C_GetPlayerCharaID, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BPFL_SoundManagerFunctionLibrary_C_GetPlayerCharaID::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_SoundManagerFunctionLibrary_C_GetPlayerCharaID, CallFunc_GetPlayerID_ReturnValue) == 0x000039, "Member 'BPFL_SoundManagerFunctionLibrary_C_GetPlayerCharaID::CallFunc_GetPlayerID_ReturnValue' has a wrong offset!");

}

