#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_GameMainManagerFunctionLibrary

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPFL_GameMainManagerFunctionLibrary.BPFL_GameMainManagerFunctionLibrary_C.GetGameMainManager
// 0x0040 (0x0040 - 0x0000)
struct BPFL_GameMainManagerFunctionLibrary_C_GetGameMainManager final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameMainManager_C*                  GameMainManager;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSGameInstance*                        K2Node_DynamicCast_AsRSGame_Instance;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E7D[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameMainManager*                       CallFunc_GetGameMainManager_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameMainManager_C*                  K2Node_DynamicCast_AsBP_Game_Main_Manager;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_GameMainManagerFunctionLibrary_C_GetGameMainManager) == 0x000008, "Wrong alignment on BPFL_GameMainManagerFunctionLibrary_C_GetGameMainManager");
static_assert(sizeof(BPFL_GameMainManagerFunctionLibrary_C_GetGameMainManager) == 0x000040, "Wrong size on BPFL_GameMainManagerFunctionLibrary_C_GetGameMainManager");
static_assert(offsetof(BPFL_GameMainManagerFunctionLibrary_C_GetGameMainManager, __WorldContext) == 0x000000, "Member 'BPFL_GameMainManagerFunctionLibrary_C_GetGameMainManager::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_GameMainManagerFunctionLibrary_C_GetGameMainManager, GameMainManager) == 0x000008, "Member 'BPFL_GameMainManagerFunctionLibrary_C_GetGameMainManager::GameMainManager' has a wrong offset!");
static_assert(offsetof(BPFL_GameMainManagerFunctionLibrary_C_GetGameMainManager, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BPFL_GameMainManagerFunctionLibrary_C_GetGameMainManager::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameMainManagerFunctionLibrary_C_GetGameMainManager, K2Node_DynamicCast_AsRSGame_Instance) == 0x000018, "Member 'BPFL_GameMainManagerFunctionLibrary_C_GetGameMainManager::K2Node_DynamicCast_AsRSGame_Instance' has a wrong offset!");
static_assert(offsetof(BPFL_GameMainManagerFunctionLibrary_C_GetGameMainManager, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BPFL_GameMainManagerFunctionLibrary_C_GetGameMainManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_GameMainManagerFunctionLibrary_C_GetGameMainManager, CallFunc_GetGameMainManager_ReturnValue) == 0x000028, "Member 'BPFL_GameMainManagerFunctionLibrary_C_GetGameMainManager::CallFunc_GetGameMainManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameMainManagerFunctionLibrary_C_GetGameMainManager, K2Node_DynamicCast_AsBP_Game_Main_Manager) == 0x000030, "Member 'BPFL_GameMainManagerFunctionLibrary_C_GetGameMainManager::K2Node_DynamicCast_AsBP_Game_Main_Manager' has a wrong offset!");
static_assert(offsetof(BPFL_GameMainManagerFunctionLibrary_C_GetGameMainManager, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BPFL_GameMainManagerFunctionLibrary_C_GetGameMainManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BPFL_GameMainManagerFunctionLibrary.BPFL_GameMainManagerFunctionLibrary_C.SaveRetryDataExec
// 0x0020 (0x0020 - 0x0000)
struct BPFL_GameMainManagerFunctionLibrary_C_SaveRetryDataExec final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E7E[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameMainManager_C*                  CallFunc_GetGameMainManager_GameMainManager;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SaveRetryDataExec_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_GameMainManagerFunctionLibrary_C_SaveRetryDataExec) == 0x000008, "Wrong alignment on BPFL_GameMainManagerFunctionLibrary_C_SaveRetryDataExec");
static_assert(sizeof(BPFL_GameMainManagerFunctionLibrary_C_SaveRetryDataExec) == 0x000020, "Wrong size on BPFL_GameMainManagerFunctionLibrary_C_SaveRetryDataExec");
static_assert(offsetof(BPFL_GameMainManagerFunctionLibrary_C_SaveRetryDataExec, __WorldContext) == 0x000000, "Member 'BPFL_GameMainManagerFunctionLibrary_C_SaveRetryDataExec::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_GameMainManagerFunctionLibrary_C_SaveRetryDataExec, Result) == 0x000008, "Member 'BPFL_GameMainManagerFunctionLibrary_C_SaveRetryDataExec::Result' has a wrong offset!");
static_assert(offsetof(BPFL_GameMainManagerFunctionLibrary_C_SaveRetryDataExec, CallFunc_GetGameMainManager_GameMainManager) == 0x000010, "Member 'BPFL_GameMainManagerFunctionLibrary_C_SaveRetryDataExec::CallFunc_GetGameMainManager_GameMainManager' has a wrong offset!");
static_assert(offsetof(BPFL_GameMainManagerFunctionLibrary_C_SaveRetryDataExec, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BPFL_GameMainManagerFunctionLibrary_C_SaveRetryDataExec::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameMainManagerFunctionLibrary_C_SaveRetryDataExec, CallFunc_SaveRetryDataExec_ReturnValue) == 0x000019, "Member 'BPFL_GameMainManagerFunctionLibrary_C_SaveRetryDataExec::CallFunc_SaveRetryDataExec_ReturnValue' has a wrong offset!");

// Function BPFL_GameMainManagerFunctionLibrary.BPFL_GameMainManagerFunctionLibrary_C.AutoSaveExec
// 0x0020 (0x0020 - 0x0000)
struct BPFL_GameMainManagerFunctionLibrary_C_AutoSaveExec final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E7F[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameMainManager_C*                  CallFunc_GetGameMainManager_GameMainManager;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AutoSaveExec_ReturnValue;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_GameMainManagerFunctionLibrary_C_AutoSaveExec) == 0x000008, "Wrong alignment on BPFL_GameMainManagerFunctionLibrary_C_AutoSaveExec");
static_assert(sizeof(BPFL_GameMainManagerFunctionLibrary_C_AutoSaveExec) == 0x000020, "Wrong size on BPFL_GameMainManagerFunctionLibrary_C_AutoSaveExec");
static_assert(offsetof(BPFL_GameMainManagerFunctionLibrary_C_AutoSaveExec, __WorldContext) == 0x000000, "Member 'BPFL_GameMainManagerFunctionLibrary_C_AutoSaveExec::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_GameMainManagerFunctionLibrary_C_AutoSaveExec, Result) == 0x000008, "Member 'BPFL_GameMainManagerFunctionLibrary_C_AutoSaveExec::Result' has a wrong offset!");
static_assert(offsetof(BPFL_GameMainManagerFunctionLibrary_C_AutoSaveExec, CallFunc_GetGameMainManager_GameMainManager) == 0x000010, "Member 'BPFL_GameMainManagerFunctionLibrary_C_AutoSaveExec::CallFunc_GetGameMainManager_GameMainManager' has a wrong offset!");
static_assert(offsetof(BPFL_GameMainManagerFunctionLibrary_C_AutoSaveExec, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BPFL_GameMainManagerFunctionLibrary_C_AutoSaveExec::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_GameMainManagerFunctionLibrary_C_AutoSaveExec, CallFunc_AutoSaveExec_ReturnValue) == 0x000019, "Member 'BPFL_GameMainManagerFunctionLibrary_C_AutoSaveExec::CallFunc_AutoSaveExec_ReturnValue' has a wrong offset!");

}

