#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_WireNeon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BPFL_WireNeon.BPFL_WireNeon_C.SetWireNeonState
// 0x0090 (0x0090 - 0x0000)
struct BPFL_WireNeon_C_SetWireNeonState final
{
public:
	struct FWireNeon                              WireNeonState;                                     // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UBP_PlayerMaterialManageComponent_C*    PlayerMaterialManageComponent;                     // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84DE[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 K2Node_MakeArray_Array_1;                          // 0x0060(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<struct FLinearColor>                   K2Node_MakeArray_Array_2;                          // 0x0070(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array_3;                          // 0x0080(0x0010)(ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_WireNeon_C_SetWireNeonState) == 0x000008, "Wrong alignment on BPFL_WireNeon_C_SetWireNeonState");
static_assert(sizeof(BPFL_WireNeon_C_SetWireNeonState) == 0x000090, "Wrong size on BPFL_WireNeon_C_SetWireNeonState");
static_assert(offsetof(BPFL_WireNeon_C_SetWireNeonState, WireNeonState) == 0x000000, "Member 'BPFL_WireNeon_C_SetWireNeonState::WireNeonState' has a wrong offset!");
static_assert(offsetof(BPFL_WireNeon_C_SetWireNeonState, PlayerMaterialManageComponent) == 0x000038, "Member 'BPFL_WireNeon_C_SetWireNeonState::PlayerMaterialManageComponent' has a wrong offset!");
static_assert(offsetof(BPFL_WireNeon_C_SetWireNeonState, __WorldContext) == 0x000040, "Member 'BPFL_WireNeon_C_SetWireNeonState::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_WireNeon_C_SetWireNeonState, K2Node_MakeArray_Array) == 0x000048, "Member 'BPFL_WireNeon_C_SetWireNeonState::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPFL_WireNeon_C_SetWireNeonState, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BPFL_WireNeon_C_SetWireNeonState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_WireNeon_C_SetWireNeonState, K2Node_MakeArray_Array_1) == 0x000060, "Member 'BPFL_WireNeon_C_SetWireNeonState::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPFL_WireNeon_C_SetWireNeonState, K2Node_MakeArray_Array_2) == 0x000070, "Member 'BPFL_WireNeon_C_SetWireNeonState::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BPFL_WireNeon_C_SetWireNeonState, K2Node_MakeArray_Array_3) == 0x000080, "Member 'BPFL_WireNeon_C_SetWireNeonState::K2Node_MakeArray_Array_3' has a wrong offset!");

// Function BPFL_WireNeon.BPFL_WireNeon_C.SetWireNeonStateSkelMesh
// 0x00E8 (0x00E8 - 0x0000)
struct BPFL_WireNeon_C_SetWireNeonStateSkelMesh final
{
public:
	struct FWireNeon                              WireNeonState;                                     // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	class USkeletalMeshComponent*                 SkeletalMeshComp;                                  // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84DF[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue_1;   // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLinearColor>                   K2Node_MakeArray_Array_1;                          // 0x0098(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array_2;                          // 0x00A8(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array_3;                          // 0x00B8(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_SearchMeshMaterialsFromSlot_FindMaterial; // 0x00C8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_SearchMeshMaterialsFromSlot_Index;        // 0x00D8(0x0010)(ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_WireNeon_C_SetWireNeonStateSkelMesh) == 0x000008, "Wrong alignment on BPFL_WireNeon_C_SetWireNeonStateSkelMesh");
static_assert(sizeof(BPFL_WireNeon_C_SetWireNeonStateSkelMesh) == 0x0000E8, "Wrong size on BPFL_WireNeon_C_SetWireNeonStateSkelMesh");
static_assert(offsetof(BPFL_WireNeon_C_SetWireNeonStateSkelMesh, WireNeonState) == 0x000000, "Member 'BPFL_WireNeon_C_SetWireNeonStateSkelMesh::WireNeonState' has a wrong offset!");
static_assert(offsetof(BPFL_WireNeon_C_SetWireNeonStateSkelMesh, SkeletalMeshComp) == 0x000038, "Member 'BPFL_WireNeon_C_SetWireNeonStateSkelMesh::SkeletalMeshComp' has a wrong offset!");
static_assert(offsetof(BPFL_WireNeon_C_SetWireNeonStateSkelMesh, __WorldContext) == 0x000040, "Member 'BPFL_WireNeon_C_SetWireNeonStateSkelMesh::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_WireNeon_C_SetWireNeonStateSkelMesh, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BPFL_WireNeon_C_SetWireNeonStateSkelMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_WireNeon_C_SetWireNeonStateSkelMesh, K2Node_MakeArray_Array) == 0x000050, "Member 'BPFL_WireNeon_C_SetWireNeonStateSkelMesh::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPFL_WireNeon_C_SetWireNeonStateSkelMesh, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000060, "Member 'BPFL_WireNeon_C_SetWireNeonStateSkelMesh::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_WireNeon_C_SetWireNeonStateSkelMesh, CallFunc_Conv_LinearColorToVector_ReturnValue_1) == 0x00006C, "Member 'BPFL_WireNeon_C_SetWireNeonStateSkelMesh::CallFunc_Conv_LinearColorToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_WireNeon_C_SetWireNeonStateSkelMesh, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000078, "Member 'BPFL_WireNeon_C_SetWireNeonStateSkelMesh::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_WireNeon_C_SetWireNeonStateSkelMesh, CallFunc_Conv_VectorToLinearColor_ReturnValue_1) == 0x000088, "Member 'BPFL_WireNeon_C_SetWireNeonStateSkelMesh::CallFunc_Conv_VectorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_WireNeon_C_SetWireNeonStateSkelMesh, K2Node_MakeArray_Array_1) == 0x000098, "Member 'BPFL_WireNeon_C_SetWireNeonStateSkelMesh::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPFL_WireNeon_C_SetWireNeonStateSkelMesh, K2Node_MakeArray_Array_2) == 0x0000A8, "Member 'BPFL_WireNeon_C_SetWireNeonStateSkelMesh::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BPFL_WireNeon_C_SetWireNeonStateSkelMesh, K2Node_MakeArray_Array_3) == 0x0000B8, "Member 'BPFL_WireNeon_C_SetWireNeonStateSkelMesh::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BPFL_WireNeon_C_SetWireNeonStateSkelMesh, CallFunc_SearchMeshMaterialsFromSlot_FindMaterial) == 0x0000C8, "Member 'BPFL_WireNeon_C_SetWireNeonStateSkelMesh::CallFunc_SearchMeshMaterialsFromSlot_FindMaterial' has a wrong offset!");
static_assert(offsetof(BPFL_WireNeon_C_SetWireNeonStateSkelMesh, CallFunc_SearchMeshMaterialsFromSlot_Index) == 0x0000D8, "Member 'BPFL_WireNeon_C_SetWireNeonStateSkelMesh::CallFunc_SearchMeshMaterialsFromSlot_Index' has a wrong offset!");

}

