#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_DropItem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BPFL_DropItem.BPFL_DropItem_C.SpawnCoreDrop
// 0x00B8 (0x00B8 - 0x0000)
struct BPFL_DropItem_C_SpawnCoreDrop final
{
public:
	class ADropItemManager*                       Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemRarity                                   ItemRarity;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6011[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpawnLocation;                                     // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ItemId;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemNum;                                           // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6012[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystem*>                AquParticle;                                       // 0x0030(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class UParticleSystem*>                GetParticle;                                       // 0x0040(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class UParticleSystem*>                DropParticle;                                      // 0x0050(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         UseParticleIndex;                                  // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6013[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UParticleSystem*>                K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6014[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UParticleSystem*>                K2Node_MakeArray_Array_1;                          // 0x0080(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class UParticleSystem*>                K2Node_MakeArray_Array_2;                          // 0x0090(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class UParticleSystem*                        CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        CallFunc_Array_Get_Item_1;                         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        CallFunc_Array_Get_Item_2;                         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_DropItem_C_SpawnCoreDrop) == 0x000008, "Wrong alignment on BPFL_DropItem_C_SpawnCoreDrop");
static_assert(sizeof(BPFL_DropItem_C_SpawnCoreDrop) == 0x0000B8, "Wrong size on BPFL_DropItem_C_SpawnCoreDrop");
static_assert(offsetof(BPFL_DropItem_C_SpawnCoreDrop, Target) == 0x000000, "Member 'BPFL_DropItem_C_SpawnCoreDrop::Target' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnCoreDrop, ItemRarity) == 0x000008, "Member 'BPFL_DropItem_C_SpawnCoreDrop::ItemRarity' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnCoreDrop, SpawnLocation) == 0x00000C, "Member 'BPFL_DropItem_C_SpawnCoreDrop::SpawnLocation' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnCoreDrop, ItemId) == 0x000018, "Member 'BPFL_DropItem_C_SpawnCoreDrop::ItemId' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnCoreDrop, ItemNum) == 0x000020, "Member 'BPFL_DropItem_C_SpawnCoreDrop::ItemNum' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnCoreDrop, __WorldContext) == 0x000028, "Member 'BPFL_DropItem_C_SpawnCoreDrop::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnCoreDrop, AquParticle) == 0x000030, "Member 'BPFL_DropItem_C_SpawnCoreDrop::AquParticle' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnCoreDrop, GetParticle) == 0x000040, "Member 'BPFL_DropItem_C_SpawnCoreDrop::GetParticle' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnCoreDrop, DropParticle) == 0x000050, "Member 'BPFL_DropItem_C_SpawnCoreDrop::DropParticle' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnCoreDrop, UseParticleIndex) == 0x000060, "Member 'BPFL_DropItem_C_SpawnCoreDrop::UseParticleIndex' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnCoreDrop, K2Node_MakeArray_Array) == 0x000068, "Member 'BPFL_DropItem_C_SpawnCoreDrop::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnCoreDrop, K2Node_SwitchEnum_CmpSuccess) == 0x000078, "Member 'BPFL_DropItem_C_SpawnCoreDrop::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnCoreDrop, K2Node_MakeArray_Array_1) == 0x000080, "Member 'BPFL_DropItem_C_SpawnCoreDrop::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnCoreDrop, K2Node_MakeArray_Array_2) == 0x000090, "Member 'BPFL_DropItem_C_SpawnCoreDrop::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnCoreDrop, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'BPFL_DropItem_C_SpawnCoreDrop::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnCoreDrop, CallFunc_Array_Get_Item_1) == 0x0000A8, "Member 'BPFL_DropItem_C_SpawnCoreDrop::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnCoreDrop, CallFunc_Array_Get_Item_2) == 0x0000B0, "Member 'BPFL_DropItem_C_SpawnCoreDrop::CallFunc_Array_Get_Item_2' has a wrong offset!");

// Function BPFL_DropItem.BPFL_DropItem_C.SpawnDataDrop
// 0x01D8 (0x01D8 - 0x0000)
struct BPFL_DropItem_C_SpawnDataDrop final
{
public:
	class ADropItemManager*                       Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemRarity                                   ItemRarity;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6015[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpawnLocation;                                     // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ItemId;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemNum;                                           // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CharID;                                            // 0x0024(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6016[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ArrangedEnemyID;                                   // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          LbAutoTaken;                                       // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6017[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UParticleSystem*>                AueParticle;                                       // 0x0050(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class UParticleSystem*>                GetParticle;                                       // 0x0060(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class UParticleSystem*>                DropParticle;                                      // 0x0070(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         UseParticleIndex;                                  // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6018[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrainCrashManager_C*                CallFunc_GetBrainCrashManager_Manager;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6019[0x2];                                     // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetCrashTargetEnemyGeneralNames_targetEnemyNames; // 0x0098(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_GetCrashTargetEnemyGeneralNames_targetNum; // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCrashTargetEnemyGeneralNames_bGeneral; // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_601A[0x2];                                     // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ConvertEnemyID_ConvertString;             // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABattleSimulatorManager*                CallFunc_GetBattleSimulatorManager_BattleSimulatorManager; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_601B[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMissionID_ReturnValue;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_601C[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_601D[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UParticleSystem*>                K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UParticleSystem*>                K2Node_MakeArray_Array_1;                          // 0x0110(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class UParticleSystem*                        CallFunc_Array_Get_Item;                           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        CallFunc_Array_Get_Item_1;                         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        CallFunc_Array_Get_Item_2;                         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystem*>                K2Node_MakeArray_Array_2;                          // 0x0138(0x0010)(ReferenceParm, HasGetValueTypeHash)
	struct FDataItemSpawnState                    K2Node_MakeStruct_DataItemSpawnState;              // 0x0148(0x0040)(NoDestructor)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      CallFunc_GetMainPlayer_Player;                     // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_IsAutoTakenItem_self_CastInput;           // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAutoTakenItem_bAuto;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_601E[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        CallFunc_Array_Get_Item_3;                         // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        CallFunc_Array_Get_Item_4;                         // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        CallFunc_Array_Get_Item_5;                         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_DropItem_C_SpawnDataDrop) == 0x000008, "Wrong alignment on BPFL_DropItem_C_SpawnDataDrop");
static_assert(sizeof(BPFL_DropItem_C_SpawnDataDrop) == 0x0001D8, "Wrong size on BPFL_DropItem_C_SpawnDataDrop");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, Target) == 0x000000, "Member 'BPFL_DropItem_C_SpawnDataDrop::Target' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, ItemRarity) == 0x000008, "Member 'BPFL_DropItem_C_SpawnDataDrop::ItemRarity' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, SpawnLocation) == 0x00000C, "Member 'BPFL_DropItem_C_SpawnDataDrop::SpawnLocation' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, ItemId) == 0x000018, "Member 'BPFL_DropItem_C_SpawnDataDrop::ItemId' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, ItemNum) == 0x000020, "Member 'BPFL_DropItem_C_SpawnDataDrop::ItemNum' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CharID) == 0x000024, "Member 'BPFL_DropItem_C_SpawnDataDrop::CharID' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, __WorldContext) == 0x000030, "Member 'BPFL_DropItem_C_SpawnDataDrop::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, ArrangedEnemyID) == 0x000038, "Member 'BPFL_DropItem_C_SpawnDataDrop::ArrangedEnemyID' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, LbAutoTaken) == 0x000048, "Member 'BPFL_DropItem_C_SpawnDataDrop::LbAutoTaken' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, AueParticle) == 0x000050, "Member 'BPFL_DropItem_C_SpawnDataDrop::AueParticle' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, GetParticle) == 0x000060, "Member 'BPFL_DropItem_C_SpawnDataDrop::GetParticle' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, DropParticle) == 0x000070, "Member 'BPFL_DropItem_C_SpawnDataDrop::DropParticle' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, UseParticleIndex) == 0x000080, "Member 'BPFL_DropItem_C_SpawnDataDrop::UseParticleIndex' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_GetBrainCrashManager_Manager) == 0x000088, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_GetBrainCrashManager_Manager' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_Len_ReturnValue) == 0x000090, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_IsValid_ReturnValue) == 0x000094, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000095, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_GetCrashTargetEnemyGeneralNames_targetEnemyNames) == 0x000098, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_GetCrashTargetEnemyGeneralNames_targetEnemyNames' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_GetCrashTargetEnemyGeneralNames_targetNum) == 0x0000A8, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_GetCrashTargetEnemyGeneralNames_targetNum' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_GetCrashTargetEnemyGeneralNames_bGeneral) == 0x0000AC, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_GetCrashTargetEnemyGeneralNames_bGeneral' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, K2Node_SwitchEnum_CmpSuccess) == 0x0000AD, "Member 'BPFL_DropItem_C_SpawnDataDrop::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_ConvertEnemyID_ConvertString) == 0x0000B0, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_ConvertEnemyID_ConvertString' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_GetBattleSimulatorManager_BattleSimulatorManager) == 0x0000C0, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_GetBattleSimulatorManager_BattleSimulatorManager' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_IsValid_ReturnValue_1) == 0x0000C8, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_GetMissionID_ReturnValue) == 0x0000CC, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_GetMissionID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000D0, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_Array_Find_ReturnValue) == 0x0000D4, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000D8, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_Concat_StrStr_ReturnValue) == 0x0000E0, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, K2Node_MakeArray_Array) == 0x0000F0, "Member 'BPFL_DropItem_C_SpawnDataDrop::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_Conv_NameToString_ReturnValue) == 0x000100, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, K2Node_MakeArray_Array_1) == 0x000110, "Member 'BPFL_DropItem_C_SpawnDataDrop::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_Array_Get_Item) == 0x000120, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_Array_Get_Item_1) == 0x000128, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_Array_Get_Item_2) == 0x000130, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, K2Node_MakeArray_Array_2) == 0x000138, "Member 'BPFL_DropItem_C_SpawnDataDrop::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, K2Node_MakeStruct_DataItemSpawnState) == 0x000148, "Member 'BPFL_DropItem_C_SpawnDataDrop::K2Node_MakeStruct_DataItemSpawnState' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000188, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_GetPlayerManager_PlayerManager) == 0x000198, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_GetMainPlayer_Player) == 0x0001A0, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_GetMainPlayer_Player' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_IsAutoTakenItem_self_CastInput) == 0x0001A8, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_IsAutoTakenItem_self_CastInput' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_IsAutoTakenItem_bAuto) == 0x0001B8, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_IsAutoTakenItem_bAuto' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_Array_Get_Item_3) == 0x0001C0, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_Array_Get_Item_4) == 0x0001C8, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_SpawnDataDrop, CallFunc_Array_Get_Item_5) == 0x0001D0, "Member 'BPFL_DropItem_C_SpawnDataDrop::CallFunc_Array_Get_Item_5' has a wrong offset!");

// Function BPFL_DropItem.BPFL_DropItem_C.ConvertEnemyID
// 0x00C8 (0x00C8 - 0x0000)
struct BPFL_DropItem_C_ConvertEnemyID final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ConvertString;                                     // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	EPlayerID                                     Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601F[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6020[0x2];                                     // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_8;                               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_9;                               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_10;                              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_11;                              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_12;                              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_13;                              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_14;                              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_15;                              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_16;                              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_17;                              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_18;                              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_19;                              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_20;                              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_21;                              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_22;                              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_23;                              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_24;                              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_25;                              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_26;                              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6021[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_DropItem_C_ConvertEnemyID) == 0x000008, "Wrong alignment on BPFL_DropItem_C_ConvertEnemyID");
static_assert(sizeof(BPFL_DropItem_C_ConvertEnemyID) == 0x0000C8, "Wrong size on BPFL_DropItem_C_ConvertEnemyID");
static_assert(offsetof(BPFL_DropItem_C_ConvertEnemyID, Param_Name) == 0x000000, "Member 'BPFL_DropItem_C_ConvertEnemyID::Param_Name' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_ConvertEnemyID, __WorldContext) == 0x000008, "Member 'BPFL_DropItem_C_ConvertEnemyID::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_ConvertEnemyID, ConvertString) == 0x000010, "Member 'BPFL_DropItem_C_ConvertEnemyID::ConvertString' has a wrong offset!");
static_assert(offsetof(BPFL_DropItem_C_ConvertEnemyID, Temp_byte_Variable) == 0x000020, "Member 'BPFL_DropItem_C_ConvertEnemyID::Temp_byte_Variable' has a wrong offset!");
