#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_PlayerProxyAttacker

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_PlayerProxyAttacker.BPI_PlayerProxyAttacker_C.GetProxyRequestedPlayer
// 0x0008 (0x0008 - 0x0000)
struct BPI_PlayerProxyAttacker_C_GetProxyRequestedPlayer final
{
public:
	class ARSBattlePlayer_C*                      Player;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_PlayerProxyAttacker_C_GetProxyRequestedPlayer) == 0x000008, "Wrong alignment on BPI_PlayerProxyAttacker_C_GetProxyRequestedPlayer");
static_assert(sizeof(BPI_PlayerProxyAttacker_C_GetProxyRequestedPlayer) == 0x000008, "Wrong size on BPI_PlayerProxyAttacker_C_GetProxyRequestedPlayer");
static_assert(offsetof(BPI_PlayerProxyAttacker_C_GetProxyRequestedPlayer, Player) == 0x000000, "Member 'BPI_PlayerProxyAttacker_C_GetProxyRequestedPlayer::Player' has a wrong offset!");

// Function BPI_PlayerProxyAttacker.BPI_PlayerProxyAttacker_C.GetProxyMesh
// 0x0008 (0x0008 - 0x0000)
struct BPI_PlayerProxyAttacker_C_GetProxyMesh final
{
public:
	class UMeshComponent*                         Mesh;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_PlayerProxyAttacker_C_GetProxyMesh) == 0x000008, "Wrong alignment on BPI_PlayerProxyAttacker_C_GetProxyMesh");
static_assert(sizeof(BPI_PlayerProxyAttacker_C_GetProxyMesh) == 0x000008, "Wrong size on BPI_PlayerProxyAttacker_C_GetProxyMesh");
static_assert(offsetof(BPI_PlayerProxyAttacker_C_GetProxyMesh, Mesh) == 0x000000, "Member 'BPI_PlayerProxyAttacker_C_GetProxyMesh::Mesh' has a wrong offset!");

}

