#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_Ajito_ch0700

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_Ajito_ch0700.BPI_Ajito_ch0700_C.I_SetStealthForce
// 0x0001 (0x0001 - 0x0000)
struct BPI_Ajito_ch0700_C_I_SetStealthForce final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_Ajito_ch0700_C_I_SetStealthForce) == 0x000001, "Wrong alignment on BPI_Ajito_ch0700_C_I_SetStealthForce");
static_assert(sizeof(BPI_Ajito_ch0700_C_I_SetStealthForce) == 0x000001, "Wrong size on BPI_Ajito_ch0700_C_I_SetStealthForce");
static_assert(offsetof(BPI_Ajito_ch0700_C_I_SetStealthForce, On) == 0x000000, "Member 'BPI_Ajito_ch0700_C_I_SetStealthForce::On' has a wrong offset!");

// Function BPI_Ajito_ch0700.BPI_Ajito_ch0700_C.IsStealth
// 0x0001 (0x0001 - 0x0000)
struct BPI_Ajito_ch0700_C_IsStealth final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_Ajito_ch0700_C_IsStealth) == 0x000001, "Wrong alignment on BPI_Ajito_ch0700_C_IsStealth");
static_assert(sizeof(BPI_Ajito_ch0700_C_IsStealth) == 0x000001, "Wrong size on BPI_Ajito_ch0700_C_IsStealth");
static_assert(offsetof(BPI_Ajito_ch0700_C_IsStealth, Return) == 0x000000, "Member 'BPI_Ajito_ch0700_C_IsStealth::Return' has a wrong offset!");

}

