#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_ENpcInterface

#include "Basic.hpp"

#include "EPlayerAIBattleThinkType_structs.hpp"
#include "EBattlePhase_em8210_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "EBattleVoice_em8200_structs.hpp"
#include "Enum_BattleType_em8000_structs.hpp"
#include "FRegisterShotData_structs.hpp"
#include "EBulletType_structs.hpp"
#include "ST_em8220_CableInfo_structs.hpp"
#include "Enum_BattleType_em8010_structs.hpp"
#include "E_SASKind_structs.hpp"
#include "ETelepoMoveType_em8200_structs.hpp"


namespace SDK::Params
{

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.GetBarrierComponent
// 0x0008 (0x0008 - 0x0000)
struct BPI_ENpcInterface_C_GetBarrierComponent final
{
public:
	class UBP_EnemyBarrierComponent_C*            Component;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_ENpcInterface_C_GetBarrierComponent) == 0x000008, "Wrong alignment on BPI_ENpcInterface_C_GetBarrierComponent");
static_assert(sizeof(BPI_ENpcInterface_C_GetBarrierComponent) == 0x000008, "Wrong size on BPI_ENpcInterface_C_GetBarrierComponent");
static_assert(offsetof(BPI_ENpcInterface_C_GetBarrierComponent, Component) == 0x000000, "Member 'BPI_ENpcInterface_C_GetBarrierComponent::Component' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.GetEnpcComponent
// 0x0008 (0x0008 - 0x0000)
struct BPI_ENpcInterface_C_GetEnpcComponent final
{
public:
	class UBP_ENpcComponent_C*                    Component;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_ENpcInterface_C_GetEnpcComponent) == 0x000008, "Wrong alignment on BPI_ENpcInterface_C_GetEnpcComponent");
static_assert(sizeof(BPI_ENpcInterface_C_GetEnpcComponent) == 0x000008, "Wrong size on BPI_ENpcInterface_C_GetEnpcComponent");
static_assert(offsetof(BPI_ENpcInterface_C_GetEnpcComponent, Component) == 0x000000, "Member 'BPI_ENpcInterface_C_GetEnpcComponent::Component' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.GetEnpcSequencerComponent
// 0x0008 (0x0008 - 0x0000)
struct BPI_ENpcInterface_C_GetEnpcSequencerComponent final
{
public:
	class UBP_ENPCSequencerComponent_C*           Component;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_ENpcInterface_C_GetEnpcSequencerComponent) == 0x000008, "Wrong alignment on BPI_ENpcInterface_C_GetEnpcSequencerComponent");
static_assert(sizeof(BPI_ENpcInterface_C_GetEnpcSequencerComponent) == 0x000008, "Wrong size on BPI_ENpcInterface_C_GetEnpcSequencerComponent");
static_assert(offsetof(BPI_ENpcInterface_C_GetEnpcSequencerComponent, Component) == 0x000000, "Member 'BPI_ENpcInterface_C_GetEnpcSequencerComponent::Component' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8000_GetPartner
// 0x0008 (0x0008 - 0x0000)
struct BPI_ENpcInterface_C_Em8000_GetPartner final
{
public:
	class AActor*                                 PartnerActor;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8000_GetPartner) == 0x000008, "Wrong alignment on BPI_ENpcInterface_C_Em8000_GetPartner");
static_assert(sizeof(BPI_ENpcInterface_C_Em8000_GetPartner) == 0x000008, "Wrong size on BPI_ENpcInterface_C_Em8000_GetPartner");
static_assert(offsetof(BPI_ENpcInterface_C_Em8000_GetPartner, PartnerActor) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8000_GetPartner::PartnerActor' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8200_BulletAttackEnd
// 0x0002 (0x0002 - 0x0000)
struct BPI_ENpcInterface_C_Em8200_BulletAttackEnd final
{
public:
	EBulletType                                   BulletType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnd;                                              // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8200_BulletAttackEnd) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_Em8200_BulletAttackEnd");
static_assert(sizeof(BPI_ENpcInterface_C_Em8200_BulletAttackEnd) == 0x000002, "Wrong size on BPI_ENpcInterface_C_Em8200_BulletAttackEnd");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_BulletAttackEnd, BulletType) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8200_BulletAttackEnd::BulletType' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_BulletAttackEnd, bEnd) == 0x000001, "Member 'BPI_ENpcInterface_C_Em8200_BulletAttackEnd::bEnd' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8200_StartTelepoMove
// 0x0001 (0x0001 - 0x0000)
struct BPI_ENpcInterface_C_Em8200_StartTelepoMove final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8200_StartTelepoMove) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_Em8200_StartTelepoMove");
static_assert(sizeof(BPI_ENpcInterface_C_Em8200_StartTelepoMove) == 0x000001, "Wrong size on BPI_ENpcInterface_C_Em8200_StartTelepoMove");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_StartTelepoMove, Dummy) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8200_StartTelepoMove::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8200_EndTelepoMove
// 0x0001 (0x0001 - 0x0000)
struct BPI_ENpcInterface_C_Em8200_EndTelepoMove final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8200_EndTelepoMove) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_Em8200_EndTelepoMove");
static_assert(sizeof(BPI_ENpcInterface_C_Em8200_EndTelepoMove) == 0x000001, "Wrong size on BPI_ENpcInterface_C_Em8200_EndTelepoMove");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_EndTelepoMove, Dummy) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8200_EndTelepoMove::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8200_CalcTelepoMoveLocation
// 0x0010 (0x0010 - 0x0000)
struct BPI_ENpcInterface_C_Em8200_CalcTelepoMoveLocation final
{
public:
	ETelepoMoveType_em8200                        TelepoType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B3E[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TelepoMoveLocation;                                // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8200_CalcTelepoMoveLocation) == 0x000004, "Wrong alignment on BPI_ENpcInterface_C_Em8200_CalcTelepoMoveLocation");
static_assert(sizeof(BPI_ENpcInterface_C_Em8200_CalcTelepoMoveLocation) == 0x000010, "Wrong size on BPI_ENpcInterface_C_Em8200_CalcTelepoMoveLocation");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_CalcTelepoMoveLocation, TelepoType) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8200_CalcTelepoMoveLocation::TelepoType' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_CalcTelepoMoveLocation, TelepoMoveLocation) == 0x000004, "Member 'BPI_ENpcInterface_C_Em8200_CalcTelepoMoveLocation::TelepoMoveLocation' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8200_GetTelepoMoveLocation
// 0x000C (0x000C - 0x0000)
struct BPI_ENpcInterface_C_Em8200_GetTelepoMoveLocation final
{
public:
	struct FVector                                OutputTelepoMoveLocation;                          // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8200_GetTelepoMoveLocation) == 0x000004, "Wrong alignment on BPI_ENpcInterface_C_Em8200_GetTelepoMoveLocation");
static_assert(sizeof(BPI_ENpcInterface_C_Em8200_GetTelepoMoveLocation) == 0x00000C, "Wrong size on BPI_ENpcInterface_C_Em8200_GetTelepoMoveLocation");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_GetTelepoMoveLocation, OutputTelepoMoveLocation) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8200_GetTelepoMoveLocation::OutputTelepoMoveLocation' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8200_SetTelepoMoveLocation
// 0x0010 (0x0010 - 0x0000)
struct BPI_ENpcInterface_C_Em8200_SetTelepoMoveLocation final
{
public:
	struct FVector                                InputTelepoMoveLocation;                           // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8200_SetTelepoMoveLocation) == 0x000004, "Wrong alignment on BPI_ENpcInterface_C_Em8200_SetTelepoMoveLocation");
static_assert(sizeof(BPI_ENpcInterface_C_Em8200_SetTelepoMoveLocation) == 0x000010, "Wrong size on BPI_ENpcInterface_C_Em8200_SetTelepoMoveLocation");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_SetTelepoMoveLocation, InputTelepoMoveLocation) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8200_SetTelepoMoveLocation::InputTelepoMoveLocation' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_SetTelepoMoveLocation, Dummy) == 0x00000C, "Member 'BPI_ENpcInterface_C_Em8200_SetTelepoMoveLocation::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8200_CopyActorPlayMontage
// 0x0018 (0x0018 - 0x0000)
struct BPI_ENpcInterface_C_Em8200_CopyActorPlayMontage final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B3F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Montage;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8200_CopyActorPlayMontage) == 0x000008, "Wrong alignment on BPI_ENpcInterface_C_Em8200_CopyActorPlayMontage");
static_assert(sizeof(BPI_ENpcInterface_C_Em8200_CopyActorPlayMontage) == 0x000018, "Wrong size on BPI_ENpcInterface_C_Em8200_CopyActorPlayMontage");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_CopyActorPlayMontage, Param_Index) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8200_CopyActorPlayMontage::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_CopyActorPlayMontage, Montage) == 0x000008, "Member 'BPI_ENpcInterface_C_Em8200_CopyActorPlayMontage::Montage' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_CopyActorPlayMontage, Dummy) == 0x000010, "Member 'BPI_ENpcInterface_C_Em8200_CopyActorPlayMontage::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8200_CopyActorUpdate
// 0x0010 (0x0010 - 0x0000)
struct BPI_ENpcInterface_C_Em8200_CopyActorUpdate final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSec;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NextState;                                         // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnd;                                              // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8200_CopyActorUpdate) == 0x000004, "Wrong alignment on BPI_ENpcInterface_C_Em8200_CopyActorUpdate");
static_assert(sizeof(BPI_ENpcInterface_C_Em8200_CopyActorUpdate) == 0x000010, "Wrong size on BPI_ENpcInterface_C_Em8200_CopyActorUpdate");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_CopyActorUpdate, Param_Index) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8200_CopyActorUpdate::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_CopyActorUpdate, DeltaSec) == 0x000004, "Member 'BPI_ENpcInterface_C_Em8200_CopyActorUpdate::DeltaSec' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_CopyActorUpdate, NextState) == 0x000008, "Member 'BPI_ENpcInterface_C_Em8200_CopyActorUpdate::NextState' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_CopyActorUpdate, bEnd) == 0x00000C, "Member 'BPI_ENpcInterface_C_Em8200_CopyActorUpdate::bEnd' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8200_UpdateMoveAssultAttack
// 0x000C (0x000C - 0x0000)
struct BPI_ENpcInterface_C_Em8200_UpdateMoveAssultAttack final
{
public:
	int32                                         NewParam;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewParam1;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewParam2;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8200_UpdateMoveAssultAttack) == 0x000004, "Wrong alignment on BPI_ENpcInterface_C_Em8200_UpdateMoveAssultAttack");
static_assert(sizeof(BPI_ENpcInterface_C_Em8200_UpdateMoveAssultAttack) == 0x00000C, "Wrong size on BPI_ENpcInterface_C_Em8200_UpdateMoveAssultAttack");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_UpdateMoveAssultAttack, NewParam) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8200_UpdateMoveAssultAttack::NewParam' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_UpdateMoveAssultAttack, NewParam1) == 0x000004, "Member 'BPI_ENpcInterface_C_Em8200_UpdateMoveAssultAttack::NewParam1' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_UpdateMoveAssultAttack, NewParam2) == 0x000008, "Member 'BPI_ENpcInterface_C_Em8200_UpdateMoveAssultAttack::NewParam2' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8200_CopyActorActive
// 0x000C (0x000C - 0x0000)
struct BPI_ENpcInterface_C_Em8200_CopyActorActive final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B40[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param_Index;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8200_CopyActorActive) == 0x000004, "Wrong alignment on BPI_ENpcInterface_C_Em8200_CopyActorActive");
static_assert(sizeof(BPI_ENpcInterface_C_Em8200_CopyActorActive) == 0x00000C, "Wrong size on BPI_ENpcInterface_C_Em8200_CopyActorActive");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_CopyActorActive, bActive) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8200_CopyActorActive::bActive' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_CopyActorActive, Param_Index) == 0x000004, "Member 'BPI_ENpcInterface_C_Em8200_CopyActorActive::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_CopyActorActive, Dummy) == 0x000008, "Member 'BPI_ENpcInterface_C_Em8200_CopyActorActive::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8200_GetCopyActorAssultTotalTime
// 0x0008 (0x0008 - 0x0000)
struct BPI_ENpcInterface_C_Em8200_GetCopyActorAssultTotalTime final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalTime;                                         // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8200_GetCopyActorAssultTotalTime) == 0x000004, "Wrong alignment on BPI_ENpcInterface_C_Em8200_GetCopyActorAssultTotalTime");
static_assert(sizeof(BPI_ENpcInterface_C_Em8200_GetCopyActorAssultTotalTime) == 0x000008, "Wrong size on BPI_ENpcInterface_C_Em8200_GetCopyActorAssultTotalTime");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_GetCopyActorAssultTotalTime, Param_Index) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8200_GetCopyActorAssultTotalTime::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_GetCopyActorAssultTotalTime, TotalTime) == 0x000004, "Member 'BPI_ENpcInterface_C_Em8200_GetCopyActorAssultTotalTime::TotalTime' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8200_GetCopyActorActive
// 0x0008 (0x0008 - 0x0000)
struct BPI_ENpcInterface_C_Em8200_GetCopyActorActive final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bActive;                                           // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8200_GetCopyActorActive) == 0x000004, "Wrong alignment on BPI_ENpcInterface_C_Em8200_GetCopyActorActive");
static_assert(sizeof(BPI_ENpcInterface_C_Em8200_GetCopyActorActive) == 0x000008, "Wrong size on BPI_ENpcInterface_C_Em8200_GetCopyActorActive");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_GetCopyActorActive, Param_Index) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8200_GetCopyActorActive::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_GetCopyActorActive, bActive) == 0x000004, "Member 'BPI_ENpcInterface_C_Em8200_GetCopyActorActive::bActive' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8200_SetCopyActorLocation
// 0x0014 (0x0014 - 0x0000)
struct BPI_ENpcInterface_C_Em8200_SetCopyActorLocation final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewLocation;                                       // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8200_SetCopyActorLocation) == 0x000004, "Wrong alignment on BPI_ENpcInterface_C_Em8200_SetCopyActorLocation");
static_assert(sizeof(BPI_ENpcInterface_C_Em8200_SetCopyActorLocation) == 0x000014, "Wrong size on BPI_ENpcInterface_C_Em8200_SetCopyActorLocation");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_SetCopyActorLocation, Param_Index) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8200_SetCopyActorLocation::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_SetCopyActorLocation, NewLocation) == 0x000004, "Member 'BPI_ENpcInterface_C_Em8200_SetCopyActorLocation::NewLocation' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_SetCopyActorLocation, Dummy) == 0x000010, "Member 'BPI_ENpcInterface_C_Em8200_SetCopyActorLocation::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8200_SetCopyActorRotation
// 0x0014 (0x0014 - 0x0000)
struct BPI_ENpcInterface_C_Em8200_SetCopyActorRotation final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               NewRotation;                                       // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Dummy;                                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8200_SetCopyActorRotation) == 0x000004, "Wrong alignment on BPI_ENpcInterface_C_Em8200_SetCopyActorRotation");
static_assert(sizeof(BPI_ENpcInterface_C_Em8200_SetCopyActorRotation) == 0x000014, "Wrong size on BPI_ENpcInterface_C_Em8200_SetCopyActorRotation");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_SetCopyActorRotation, Param_Index) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8200_SetCopyActorRotation::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_SetCopyActorRotation, NewRotation) == 0x000004, "Member 'BPI_ENpcInterface_C_Em8200_SetCopyActorRotation::NewRotation' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_SetCopyActorRotation, Dummy) == 0x000010, "Member 'BPI_ENpcInterface_C_Em8200_SetCopyActorRotation::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8200_GetTargetableCopyActor
// 0x0010 (0x0010 - 0x0000)
struct BPI_ENpcInterface_C_Em8200_GetTargetableCopyActor final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B41[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattleCharacter_C*                   RSBattleCharacter;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8200_GetTargetableCopyActor) == 0x000008, "Wrong alignment on BPI_ENpcInterface_C_Em8200_GetTargetableCopyActor");
static_assert(sizeof(BPI_ENpcInterface_C_Em8200_GetTargetableCopyActor) == 0x000010, "Wrong size on BPI_ENpcInterface_C_Em8200_GetTargetableCopyActor");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_GetTargetableCopyActor, Param_Index) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8200_GetTargetableCopyActor::Param_Index' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_GetTargetableCopyActor, RSBattleCharacter) == 0x000008, "Member 'BPI_ENpcInterface_C_Em8200_GetTargetableCopyActor::RSBattleCharacter' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8200_StoreHomingElecStartEnd
// 0x001C (0x001C - 0x0000)
struct BPI_ENpcInterface_C_Em8200_StoreHomingElecStartEnd final
{
public:
	struct FVector                                StartLocation;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EndLocation;                                       // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8200_StoreHomingElecStartEnd) == 0x000004, "Wrong alignment on BPI_ENpcInterface_C_Em8200_StoreHomingElecStartEnd");
static_assert(sizeof(BPI_ENpcInterface_C_Em8200_StoreHomingElecStartEnd) == 0x00001C, "Wrong size on BPI_ENpcInterface_C_Em8200_StoreHomingElecStartEnd");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_StoreHomingElecStartEnd, StartLocation) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8200_StoreHomingElecStartEnd::StartLocation' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_StoreHomingElecStartEnd, EndLocation) == 0x00000C, "Member 'BPI_ENpcInterface_C_Em8200_StoreHomingElecStartEnd::EndLocation' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_StoreHomingElecStartEnd, Dummy) == 0x000018, "Member 'BPI_ENpcInterface_C_Em8200_StoreHomingElecStartEnd::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8200_StartSeeThrough
// 0x0001 (0x0001 - 0x0000)
struct BPI_ENpcInterface_C_Em8200_StartSeeThrough final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8200_StartSeeThrough) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_Em8200_StartSeeThrough");
static_assert(sizeof(BPI_ENpcInterface_C_Em8200_StartSeeThrough) == 0x000001, "Wrong size on BPI_ENpcInterface_C_Em8200_StartSeeThrough");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_StartSeeThrough, Dummy) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8200_StartSeeThrough::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.IsSpStart
// 0x0001 (0x0001 - 0x0000)
struct BPI_ENpcInterface_C_IsSpStart final
{
public:
	bool                                          bSpStart;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_IsSpStart) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_IsSpStart");
static_assert(sizeof(BPI_ENpcInterface_C_IsSpStart) == 0x000001, "Wrong size on BPI_ENpcInterface_C_IsSpStart");
static_assert(offsetof(BPI_ENpcInterface_C_IsSpStart, bSpStart) == 0x000000, "Member 'BPI_ENpcInterface_C_IsSpStart::bSpStart' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.SetSpStart
// 0x0002 (0x0002 - 0x0000)
struct BPI_ENpcInterface_C_SetSpStart final
{
public:
	bool                                          bSpStart;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Dummy;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_SetSpStart) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_SetSpStart");
static_assert(sizeof(BPI_ENpcInterface_C_SetSpStart) == 0x000002, "Wrong size on BPI_ENpcInterface_C_SetSpStart");
static_assert(offsetof(BPI_ENpcInterface_C_SetSpStart, bSpStart) == 0x000000, "Member 'BPI_ENpcInterface_C_SetSpStart::bSpStart' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_SetSpStart, Dummy) == 0x000001, "Member 'BPI_ENpcInterface_C_SetSpStart::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8200_PillarIceExtendTime
// 0x0008 (0x0008 - 0x0000)
struct BPI_ENpcInterface_C_Em8200_PillarIceExtendTime final
{
public:
	float                                         ExtendTime;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8200_PillarIceExtendTime) == 0x000004, "Wrong alignment on BPI_ENpcInterface_C_Em8200_PillarIceExtendTime");
static_assert(sizeof(BPI_ENpcInterface_C_Em8200_PillarIceExtendTime) == 0x000008, "Wrong size on BPI_ENpcInterface_C_Em8200_PillarIceExtendTime");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_PillarIceExtendTime, ExtendTime) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8200_PillarIceExtendTime::ExtendTime' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_PillarIceExtendTime, Dummy) == 0x000004, "Member 'BPI_ENpcInterface_C_Em8200_PillarIceExtendTime::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8200_SetSpShockWaveLocation
// 0x0010 (0x0010 - 0x0000)
struct BPI_ENpcInterface_C_Em8200_SetSpShockWaveLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8200_SetSpShockWaveLocation) == 0x000004, "Wrong alignment on BPI_ENpcInterface_C_Em8200_SetSpShockWaveLocation");
static_assert(sizeof(BPI_ENpcInterface_C_Em8200_SetSpShockWaveLocation) == 0x000010, "Wrong size on BPI_ENpcInterface_C_Em8200_SetSpShockWaveLocation");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_SetSpShockWaveLocation, Location) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8200_SetSpShockWaveLocation::Location' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_SetSpShockWaveLocation, Dummy) == 0x00000C, "Member 'BPI_ENpcInterface_C_Em8200_SetSpShockWaveLocation::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8210_ApplyCommonBranch
// 0x0001 (0x0001 - 0x0000)
struct BPI_ENpcInterface_C_Em8210_ApplyCommonBranch final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8210_ApplyCommonBranch) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_Em8210_ApplyCommonBranch");
static_assert(sizeof(BPI_ENpcInterface_C_Em8210_ApplyCommonBranch) == 0x000001, "Wrong size on BPI_ENpcInterface_C_Em8210_ApplyCommonBranch");
static_assert(offsetof(BPI_ENpcInterface_C_Em8210_ApplyCommonBranch, Dummy) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8210_ApplyCommonBranch::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8000_IsAttackDriveMode
// 0x0001 (0x0001 - 0x0000)
struct BPI_ENpcInterface_C_Em8000_IsAttackDriveMode final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8000_IsAttackDriveMode) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_Em8000_IsAttackDriveMode");
static_assert(sizeof(BPI_ENpcInterface_C_Em8000_IsAttackDriveMode) == 0x000001, "Wrong size on BPI_ENpcInterface_C_Em8000_IsAttackDriveMode");
static_assert(offsetof(BPI_ENpcInterface_C_Em8000_IsAttackDriveMode, bEnable) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8000_IsAttackDriveMode::bEnable' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8000_IsAttackBrainField
// 0x0001 (0x0001 - 0x0000)
struct BPI_ENpcInterface_C_Em8000_IsAttackBrainField final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8000_IsAttackBrainField) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_Em8000_IsAttackBrainField");
static_assert(sizeof(BPI_ENpcInterface_C_Em8000_IsAttackBrainField) == 0x000001, "Wrong size on BPI_ENpcInterface_C_Em8000_IsAttackBrainField");
static_assert(offsetof(BPI_ENpcInterface_C_Em8000_IsAttackBrainField, bEnable) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8000_IsAttackBrainField::bEnable' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8000_FireBomb
// 0x0010 (0x0010 - 0x0000)
struct BPI_ENpcInterface_C_Em8000_FireBomb final
{
public:
	class AActor*                                 Parent;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHard;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Dummy;                                             // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8000_FireBomb) == 0x000008, "Wrong alignment on BPI_ENpcInterface_C_Em8000_FireBomb");
static_assert(sizeof(BPI_ENpcInterface_C_Em8000_FireBomb) == 0x000010, "Wrong size on BPI_ENpcInterface_C_Em8000_FireBomb");
static_assert(offsetof(BPI_ENpcInterface_C_Em8000_FireBomb, Parent) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8000_FireBomb::Parent' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8000_FireBomb, bHard) == 0x000008, "Member 'BPI_ENpcInterface_C_Em8000_FireBomb::bHard' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8000_FireBomb, Dummy) == 0x000009, "Member 'BPI_ENpcInterface_C_Em8000_FireBomb::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8000_SetBattleProcess
// 0x0008 (0x0008 - 0x0000)
struct BPI_ENpcInterface_C_Em8000_SetBattleProcess final
{
public:
	int32                                         Process;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8000_SetBattleProcess) == 0x000004, "Wrong alignment on BPI_ENpcInterface_C_Em8000_SetBattleProcess");
static_assert(sizeof(BPI_ENpcInterface_C_Em8000_SetBattleProcess) == 0x000008, "Wrong size on BPI_ENpcInterface_C_Em8000_SetBattleProcess");
static_assert(offsetof(BPI_ENpcInterface_C_Em8000_SetBattleProcess, Process) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8000_SetBattleProcess::Process' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8000_SetBattleProcess, Dummy) == 0x000004, "Member 'BPI_ENpcInterface_C_Em8000_SetBattleProcess::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.CheckAbleInterceptInReactionChance
// 0x0001 (0x0001 - 0x0000)
struct BPI_ENpcInterface_C_CheckAbleInterceptInReactionChance final
{
public:
	bool                                          bAbleIntercept;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_CheckAbleInterceptInReactionChance) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_CheckAbleInterceptInReactionChance");
static_assert(sizeof(BPI_ENpcInterface_C_CheckAbleInterceptInReactionChance) == 0x000001, "Wrong size on BPI_ENpcInterface_C_CheckAbleInterceptInReactionChance");
static_assert(offsetof(BPI_ENpcInterface_C_CheckAbleInterceptInReactionChance, bAbleIntercept) == 0x000000, "Member 'BPI_ENpcInterface_C_CheckAbleInterceptInReactionChance::bAbleIntercept' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8010_SetAutoAimRate
// 0x0008 (0x0008 - 0x0000)
struct BPI_ENpcInterface_C_Em8010_SetAutoAimRate final
{
public:
	float                                         NewRate;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8010_SetAutoAimRate) == 0x000004, "Wrong alignment on BPI_ENpcInterface_C_Em8010_SetAutoAimRate");
static_assert(sizeof(BPI_ENpcInterface_C_Em8010_SetAutoAimRate) == 0x000008, "Wrong size on BPI_ENpcInterface_C_Em8010_SetAutoAimRate");
static_assert(offsetof(BPI_ENpcInterface_C_Em8010_SetAutoAimRate, NewRate) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8010_SetAutoAimRate::NewRate' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8010_SetAutoAimRate, Dummy) == 0x000004, "Member 'BPI_ENpcInterface_C_Em8010_SetAutoAimRate::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Ch0500_StartSeeThrough
// 0x0001 (0x0001 - 0x0000)
struct BPI_ENpcInterface_C_Ch0500_StartSeeThrough final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Ch0500_StartSeeThrough) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_Ch0500_StartSeeThrough");
static_assert(sizeof(BPI_ENpcInterface_C_Ch0500_StartSeeThrough) == 0x000001, "Wrong size on BPI_ENpcInterface_C_Ch0500_StartSeeThrough");
static_assert(offsetof(BPI_ENpcInterface_C_Ch0500_StartSeeThrough, Dummy) == 0x000000, "Member 'BPI_ENpcInterface_C_Ch0500_StartSeeThrough::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8000_SetTriggerLocation
// 0x0001 (0x0001 - 0x0000)
struct BPI_ENpcInterface_C_Em8000_SetTriggerLocation final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8000_SetTriggerLocation) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_Em8000_SetTriggerLocation");
static_assert(sizeof(BPI_ENpcInterface_C_Em8000_SetTriggerLocation) == 0x000001, "Wrong size on BPI_ENpcInterface_C_Em8000_SetTriggerLocation");
static_assert(offsetof(BPI_ENpcInterface_C_Em8000_SetTriggerLocation, Dummy) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8000_SetTriggerLocation::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.SetStealthReactionInterval
// 0x0001 (0x0001 - 0x0000)
struct BPI_ENpcInterface_C_SetStealthReactionInterval final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_SetStealthReactionInterval) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_SetStealthReactionInterval");
static_assert(sizeof(BPI_ENpcInterface_C_SetStealthReactionInterval) == 0x000001, "Wrong size on BPI_ENpcInterface_C_SetStealthReactionInterval");
static_assert(offsetof(BPI_ENpcInterface_C_SetStealthReactionInterval, Dummy) == 0x000000, "Member 'BPI_ENpcInterface_C_SetStealthReactionInterval::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Np1100_SelectChakramCombo
// 0x0010 (0x0010 - 0x0000)
struct BPI_ENpcInterface_C_Np1100_SelectChakramCombo final
{
public:
	class FString                                 ComboType;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_ENpcInterface_C_Np1100_SelectChakramCombo) == 0x000008, "Wrong alignment on BPI_ENpcInterface_C_Np1100_SelectChakramCombo");
static_assert(sizeof(BPI_ENpcInterface_C_Np1100_SelectChakramCombo) == 0x000010, "Wrong size on BPI_ENpcInterface_C_Np1100_SelectChakramCombo");
static_assert(offsetof(BPI_ENpcInterface_C_Np1100_SelectChakramCombo, ComboType) == 0x000000, "Member 'BPI_ENpcInterface_C_Np1100_SelectChakramCombo::ComboType' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Np1100_GetChakramComboList
// 0x0010 (0x0010 - 0x0000)
struct BPI_ENpcInterface_C_Np1100_GetChakramComboList final
{
public:
	TArray<uint8>                                 ChakramComboList;                                  // 0x0000(0x0010)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(BPI_ENpcInterface_C_Np1100_GetChakramComboList) == 0x000008, "Wrong alignment on BPI_ENpcInterface_C_Np1100_GetChakramComboList");
static_assert(sizeof(BPI_ENpcInterface_C_Np1100_GetChakramComboList) == 0x000010, "Wrong size on BPI_ENpcInterface_C_Np1100_GetChakramComboList");
static_assert(offsetof(BPI_ENpcInterface_C_Np1100_GetChakramComboList, ChakramComboList) == 0x000000, "Member 'BPI_ENpcInterface_C_Np1100_GetChakramComboList::ChakramComboList' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Ch0900_CreateCopy
// 0x0001 (0x0001 - 0x0000)
struct BPI_ENpcInterface_C_Ch0900_CreateCopy final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Ch0900_CreateCopy) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_Ch0900_CreateCopy");
static_assert(sizeof(BPI_ENpcInterface_C_Ch0900_CreateCopy) == 0x000001, "Wrong size on BPI_ENpcInterface_C_Ch0900_CreateCopy");
static_assert(offsetof(BPI_ENpcInterface_C_Ch0900_CreateCopy, Dummy) == 0x000000, "Member 'BPI_ENpcInterface_C_Ch0900_CreateCopy::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Np1100_StartHidden
// 0x0001 (0x0001 - 0x0000)
struct BPI_ENpcInterface_C_Np1100_StartHidden final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Np1100_StartHidden) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_Np1100_StartHidden");
static_assert(sizeof(BPI_ENpcInterface_C_Np1100_StartHidden) == 0x000001, "Wrong size on BPI_ENpcInterface_C_Np1100_StartHidden");
static_assert(offsetof(BPI_ENpcInterface_C_Np1100_StartHidden, Dummy) == 0x000000, "Member 'BPI_ENpcInterface_C_Np1100_StartHidden::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Np1100_EndHidden
// 0x0001 (0x0001 - 0x0000)
struct BPI_ENpcInterface_C_Np1100_EndHidden final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Np1100_EndHidden) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_Np1100_EndHidden");
static_assert(sizeof(BPI_ENpcInterface_C_Np1100_EndHidden) == 0x000001, "Wrong size on BPI_ENpcInterface_C_Np1100_EndHidden");
static_assert(offsetof(BPI_ENpcInterface_C_Np1100_EndHidden, Dummy) == 0x000000, "Member 'BPI_ENpcInterface_C_Np1100_EndHidden::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Np1100_SetBattlePhase
// 0x0008 (0x0008 - 0x0000)
struct BPI_ENpcInterface_C_Np1100_SetBattlePhase final
{
public:
	int32                                         Phase;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Np1100_SetBattlePhase) == 0x000004, "Wrong alignment on BPI_ENpcInterface_C_Np1100_SetBattlePhase");
static_assert(sizeof(BPI_ENpcInterface_C_Np1100_SetBattlePhase) == 0x000008, "Wrong size on BPI_ENpcInterface_C_Np1100_SetBattlePhase");
static_assert(offsetof(BPI_ENpcInterface_C_Np1100_SetBattlePhase, Phase) == 0x000000, "Member 'BPI_ENpcInterface_C_Np1100_SetBattlePhase::Phase' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Np1100_SetBattlePhase, Dummy) == 0x000004, "Member 'BPI_ENpcInterface_C_Np1100_SetBattlePhase::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8000_SetChangeEm8010Process
// 0x0008 (0x0008 - 0x0000)
struct BPI_ENpcInterface_C_Em8000_SetChangeEm8010Process final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8000_SetChangeEm8010Process) == 0x000004, "Wrong alignment on BPI_ENpcInterface_C_Em8000_SetChangeEm8010Process");
static_assert(sizeof(BPI_ENpcInterface_C_Em8000_SetChangeEm8010Process) == 0x000008, "Wrong size on BPI_ENpcInterface_C_Em8000_SetChangeEm8010Process");
static_assert(offsetof(BPI_ENpcInterface_C_Em8000_SetChangeEm8010Process, Value) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8000_SetChangeEm8010Process::Value' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8000_SetChangeEm8010Process, Dummy) == 0x000004, "Member 'BPI_ENpcInterface_C_Em8000_SetChangeEm8010Process::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8000_GetChangeEm8010Process
// 0x0004 (0x0004 - 0x0000)
struct BPI_ENpcInterface_C_Em8000_GetChangeEm8010Process final
{
public:
	int32                                         Process;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8000_GetChangeEm8010Process) == 0x000004, "Wrong alignment on BPI_ENpcInterface_C_Em8000_GetChangeEm8010Process");
static_assert(sizeof(BPI_ENpcInterface_C_Em8000_GetChangeEm8010Process) == 0x000004, "Wrong size on BPI_ENpcInterface_C_Em8000_GetChangeEm8010Process");
static_assert(offsetof(BPI_ENpcInterface_C_Em8000_GetChangeEm8010Process, Process) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8000_GetChangeEm8010Process::Process' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8000_ExecChangeEm8010
// 0x0001 (0x0001 - 0x0000)
struct BPI_ENpcInterface_C_Em8000_ExecChangeEm8010 final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8000_ExecChangeEm8010) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_Em8000_ExecChangeEm8010");
static_assert(sizeof(BPI_ENpcInterface_C_Em8000_ExecChangeEm8010) == 0x000001, "Wrong size on BPI_ENpcInterface_C_Em8000_ExecChangeEm8010");
static_assert(offsetof(BPI_ENpcInterface_C_Em8000_ExecChangeEm8010, Dummy) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8000_ExecChangeEm8010::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Np1100_SetThrowCount
// 0x0002 (0x0002 - 0x0000)
struct BPI_ENpcInterface_C_Np1100_SetThrowCount final
{
public:
	bool                                          bAdd;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Dummy;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Np1100_SetThrowCount) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_Np1100_SetThrowCount");
static_assert(sizeof(BPI_ENpcInterface_C_Np1100_SetThrowCount) == 0x000002, "Wrong size on BPI_ENpcInterface_C_Np1100_SetThrowCount");
static_assert(offsetof(BPI_ENpcInterface_C_Np1100_SetThrowCount, bAdd) == 0x000000, "Member 'BPI_ENpcInterface_C_Np1100_SetThrowCount::bAdd' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Np1100_SetThrowCount, Dummy) == 0x000001, "Member 'BPI_ENpcInterface_C_Np1100_SetThrowCount::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.ForceFinishMetamorphosis
// 0x0002 (0x0002 - 0x0000)
struct BPI_ENpcInterface_C_ForceFinishMetamorphosis final
{
public:
	bool                                          bBrainFieldCancel;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Dummy;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_ForceFinishMetamorphosis) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_ForceFinishMetamorphosis");
static_assert(sizeof(BPI_ENpcInterface_C_ForceFinishMetamorphosis) == 0x000002, "Wrong size on BPI_ENpcInterface_C_ForceFinishMetamorphosis");
static_assert(offsetof(BPI_ENpcInterface_C_ForceFinishMetamorphosis, bBrainFieldCancel) == 0x000000, "Member 'BPI_ENpcInterface_C_ForceFinishMetamorphosis::bBrainFieldCancel' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_ForceFinishMetamorphosis, Dummy) == 0x000001, "Member 'BPI_ENpcInterface_C_ForceFinishMetamorphosis::Dummy' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Np1100_UseAttack_BrainTalk
// 0x0001 (0x0001 - 0x0000)
struct BPI_ENpcInterface_C_Np1100_UseAttack_BrainTalk final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Np1100_UseAttack_BrainTalk) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_Np1100_UseAttack_BrainTalk");
static_assert(sizeof(BPI_ENpcInterface_C_Np1100_UseAttack_BrainTalk) == 0x000001, "Wrong size on BPI_ENpcInterface_C_Np1100_UseAttack_BrainTalk");
static_assert(offsetof(BPI_ENpcInterface_C_Np1100_UseAttack_BrainTalk, Return) == 0x000000, "Member 'BPI_ENpcInterface_C_Np1100_UseAttack_BrainTalk::Return' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Np1100_UseSpTrigger_BrainTalk
// 0x0001 (0x0001 - 0x0000)
struct BPI_ENpcInterface_C_Np1100_UseSpTrigger_BrainTalk final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Np1100_UseSpTrigger_BrainTalk) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_Np1100_UseSpTrigger_BrainTalk");
static_assert(sizeof(BPI_ENpcInterface_C_Np1100_UseSpTrigger_BrainTalk) == 0x000001, "Wrong size on BPI_ENpcInterface_C_Np1100_UseSpTrigger_BrainTalk");
static_assert(offsetof(BPI_ENpcInterface_C_Np1100_UseSpTrigger_BrainTalk, Return) == 0x000000, "Member 'BPI_ENpcInterface_C_Np1100_UseSpTrigger_BrainTalk::Return' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8200_UseAttackEnd_BrainTalk
// 0x0001 (0x0001 - 0x0000)
struct BPI_ENpcInterface_C_Em8200_UseAttackEnd_BrainTalk final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8200_UseAttackEnd_BrainTalk) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_Em8200_UseAttackEnd_BrainTalk");
static_assert(sizeof(BPI_ENpcInterface_C_Em8200_UseAttackEnd_BrainTalk) == 0x000001, "Wrong size on BPI_ENpcInterface_C_Em8200_UseAttackEnd_BrainTalk");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_UseAttackEnd_BrainTalk, Return) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8200_UseAttackEnd_BrainTalk::Return' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Np1100UseAfterSpAttack_BrainTalk
// 0x0001 (0x0001 - 0x0000)
struct BPI_ENpcInterface_C_Np1100UseAfterSpAttack_BrainTalk final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Np1100UseAfterSpAttack_BrainTalk) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_Np1100UseAfterSpAttack_BrainTalk");
static_assert(sizeof(BPI_ENpcInterface_C_Np1100UseAfterSpAttack_BrainTalk) == 0x000001, "Wrong size on BPI_ENpcInterface_C_Np1100UseAfterSpAttack_BrainTalk");
static_assert(offsetof(BPI_ENpcInterface_C_Np1100UseAfterSpAttack_BrainTalk, NewParam) == 0x000000, "Member 'BPI_ENpcInterface_C_Np1100UseAfterSpAttack_BrainTalk::NewParam' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Np1100_StartSpTriggerMove
// 0x0001 (0x0001 - 0x0000)
struct BPI_ENpcInterface_C_Np1100_StartSpTriggerMove final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Np1100_StartSpTriggerMove) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_Np1100_StartSpTriggerMove");
static_assert(sizeof(BPI_ENpcInterface_C_Np1100_StartSpTriggerMove) == 0x000001, "Wrong size on BPI_ENpcInterface_C_Np1100_StartSpTriggerMove");
static_assert(offsetof(BPI_ENpcInterface_C_Np1100_StartSpTriggerMove, NewParam) == 0x000000, "Member 'BPI_ENpcInterface_C_Np1100_StartSpTriggerMove::NewParam' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Np1100_EndSpTriggerMove
// 0x0001 (0x0001 - 0x0000)
struct BPI_ENpcInterface_C_Np1100_EndSpTriggerMove final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Np1100_EndSpTriggerMove) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_Np1100_EndSpTriggerMove");
static_assert(sizeof(BPI_ENpcInterface_C_Np1100_EndSpTriggerMove) == 0x000001, "Wrong size on BPI_ENpcInterface_C_Np1100_EndSpTriggerMove");
static_assert(offsetof(BPI_ENpcInterface_C_Np1100_EndSpTriggerMove, NewParam) == 0x000000, "Member 'BPI_ENpcInterface_C_Np1100_EndSpTriggerMove::NewParam' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8200_SetBattlePhase
// 0x0002 (0x0002 - 0x0000)
struct BPI_ENpcInterface_C_Em8200_SetBattlePhase final
{
public:
	EBattlePhase_em8210                           BattlePhase;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8200_SetBattlePhase) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_Em8200_SetBattlePhase");
static_assert(sizeof(BPI_ENpcInterface_C_Em8200_SetBattlePhase) == 0x000002, "Wrong size on BPI_ENpcInterface_C_Em8200_SetBattlePhase");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_SetBattlePhase, BattlePhase) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8200_SetBattlePhase::BattlePhase' has a wrong offset!");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_SetBattlePhase, Return) == 0x000001, "Member 'BPI_ENpcInterface_C_Em8200_SetBattlePhase::Return' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8200_GetBattlePhase
// 0x0001 (0x0001 - 0x0000)
struct BPI_ENpcInterface_C_Em8200_GetBattlePhase final
{
public:
	EBattlePhase_em8210                           BattlePhase;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_ENpcInterface_C_Em8200_GetBattlePhase) == 0x000001, "Wrong alignment on BPI_ENpcInterface_C_Em8200_GetBattlePhase");
static_assert(sizeof(BPI_ENpcInterface_C_Em8200_GetBattlePhase) == 0x000001, "Wrong size on BPI_ENpcInterface_C_Em8200_GetBattlePhase");
static_assert(offsetof(BPI_ENpcInterface_C_Em8200_GetBattlePhase, BattlePhase) == 0x000000, "Member 'BPI_ENpcInterface_C_Em8200_GetBattlePhase::BattlePhase' has a wrong offset!");

// Function BPI_ENpcInterface.BPI_ENpcInterface_C.Em8200_CanPlayExtraSasCutin
// 0x0002 (0x0002 - 0x0000)
struct BPI_ENpcInterface_C_Em8200_CanPlayExtraSasCutin final
{
public:
	ESASCutinExtraID                              CutinID;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
