#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_BrainFieldMonitor

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BPI_BrainFieldMonitor.BPI_BrainFieldMonitor_C.SetMonitorActive
// 0x0010 (0x0010 - 0x0000)
struct BPI_BrainFieldMonitor_C_SetMonitorActive final
{
public:
	bool                                          Activate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46BF[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 BrainFieldUser;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BrainFieldMonitor_C_SetMonitorActive) == 0x000008, "Wrong alignment on BPI_BrainFieldMonitor_C_SetMonitorActive");
static_assert(sizeof(BPI_BrainFieldMonitor_C_SetMonitorActive) == 0x000010, "Wrong size on BPI_BrainFieldMonitor_C_SetMonitorActive");
static_assert(offsetof(BPI_BrainFieldMonitor_C_SetMonitorActive, Activate) == 0x000000, "Member 'BPI_BrainFieldMonitor_C_SetMonitorActive::Activate' has a wrong offset!");
static_assert(offsetof(BPI_BrainFieldMonitor_C_SetMonitorActive, BrainFieldUser) == 0x000008, "Member 'BPI_BrainFieldMonitor_C_SetMonitorActive::BrainFieldUser' has a wrong offset!");

// Function BPI_BrainFieldMonitor.BPI_BrainFieldMonitor_C.SetUserPlayerID
// 0x0001 (0x0001 - 0x0000)
struct BPI_BrainFieldMonitor_C_SetUserPlayerID final
{
public:
	EPlayerID                                     PlayerId;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BrainFieldMonitor_C_SetUserPlayerID) == 0x000001, "Wrong alignment on BPI_BrainFieldMonitor_C_SetUserPlayerID");
static_assert(sizeof(BPI_BrainFieldMonitor_C_SetUserPlayerID) == 0x000001, "Wrong size on BPI_BrainFieldMonitor_C_SetUserPlayerID");
static_assert(offsetof(BPI_BrainFieldMonitor_C_SetUserPlayerID, PlayerId) == 0x000000, "Member 'BPI_BrainFieldMonitor_C_SetUserPlayerID::PlayerId' has a wrong offset!");

}

