#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_MapGimmick

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function BPI_MapGimmick.BPI_MapGimmick_C.CanUseMapGimmick
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapGimmick_C_CanUseMapGimmick final
{
public:
	bool                                          UseOk;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MapGimmick_C_CanUseMapGimmick) == 0x000001, "Wrong alignment on BPI_MapGimmick_C_CanUseMapGimmick");
static_assert(sizeof(BPI_MapGimmick_C_CanUseMapGimmick) == 0x000001, "Wrong size on BPI_MapGimmick_C_CanUseMapGimmick");
static_assert(offsetof(BPI_MapGimmick_C_CanUseMapGimmick, UseOk) == 0x000000, "Member 'BPI_MapGimmick_C_CanUseMapGimmick::UseOk' has a wrong offset!");

// Function BPI_MapGimmick.BPI_MapGimmick_C.GetMapGimmickType
// 0x0001 (0x0001 - 0x0000)
struct BPI_MapGimmick_C_GetMapGimmickType final
{
public:
	EMapGimmickType                               Type;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_MapGimmick_C_GetMapGimmickType) == 0x000001, "Wrong alignment on BPI_MapGimmick_C_GetMapGimmickType");
static_assert(sizeof(BPI_MapGimmick_C_GetMapGimmickType) == 0x000001, "Wrong size on BPI_MapGimmick_C_GetMapGimmickType");
static_assert(offsetof(BPI_MapGimmick_C_GetMapGimmickType, Type) == 0x000000, "Member 'BPI_MapGimmick_C_GetMapGimmickType::Type' has a wrong offset!");

}

