#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_UI_Discover

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPI_UI_Discover.BPI_UI_Discover_C.setEmPosDiscover
// 0x000C (0x000C - 0x0000)
struct BPI_UI_Discover_C_SetEmPosDiscover final
{
public:
	struct FVector                                DiscoverPos;                                       // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_UI_Discover_C_SetEmPosDiscover) == 0x000004, "Wrong alignment on BPI_UI_Discover_C_SetEmPosDiscover");
static_assert(sizeof(BPI_UI_Discover_C_SetEmPosDiscover) == 0x00000C, "Wrong size on BPI_UI_Discover_C_SetEmPosDiscover");
static_assert(offsetof(BPI_UI_Discover_C_SetEmPosDiscover, DiscoverPos) == 0x000000, "Member 'BPI_UI_Discover_C_SetEmPosDiscover::DiscoverPos' has a wrong offset!");

// Function BPI_UI_Discover.BPI_UI_Discover_C.getEmPosDiscover
// 0x000C (0x000C - 0x0000)
struct BPI_UI_Discover_C_GetEmPosDiscover final
{
public:
	struct FVector                                DiscoverPos;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_UI_Discover_C_GetEmPosDiscover) == 0x000004, "Wrong alignment on BPI_UI_Discover_C_GetEmPosDiscover");
static_assert(sizeof(BPI_UI_Discover_C_GetEmPosDiscover) == 0x00000C, "Wrong size on BPI_UI_Discover_C_GetEmPosDiscover");
static_assert(offsetof(BPI_UI_Discover_C_GetEmPosDiscover, DiscoverPos) == 0x000000, "Member 'BPI_UI_Discover_C_GetEmPosDiscover::DiscoverPos' has a wrong offset!");

}

