#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_PlayerInterface

#include "Basic.hpp"

#include "EPlayerAIBattleThinkType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "FPlayerAIBattleThinkTransitionData_structs.hpp"
#include "EBattleBonusAddType_structs.hpp"
#include "EParamAfterEventAction_structs.hpp"
#include "E_SASKind_structs.hpp"
#include "ECharaDeadType_structs.hpp"


namespace SDK::Params
{

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.SetSASCodeVisible
// 0x0002 (0x0002 - 0x0000)
struct BPI_PlayerInterface_C_SetSASCodeVisible final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Dummy;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_SetSASCodeVisible) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_SetSASCodeVisible");
static_assert(sizeof(BPI_PlayerInterface_C_SetSASCodeVisible) == 0x000002, "Wrong size on BPI_PlayerInterface_C_SetSASCodeVisible");
static_assert(offsetof(BPI_PlayerInterface_C_SetSASCodeVisible, bVisible) == 0x000000, "Member 'BPI_PlayerInterface_C_SetSASCodeVisible::bVisible' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_SetSASCodeVisible, Dummy) == 0x000001, "Member 'BPI_PlayerInterface_C_SetSASCodeVisible::Dummy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.EnableRigidBody
// 0x000C (0x000C - 0x0000)
struct BPI_PlayerInterface_C_EnableRigidBody final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84E8[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LerpTime;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDummy;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_EnableRigidBody) == 0x000004, "Wrong alignment on BPI_PlayerInterface_C_EnableRigidBody");
static_assert(sizeof(BPI_PlayerInterface_C_EnableRigidBody) == 0x00000C, "Wrong size on BPI_PlayerInterface_C_EnableRigidBody");
static_assert(offsetof(BPI_PlayerInterface_C_EnableRigidBody, bEnable) == 0x000000, "Member 'BPI_PlayerInterface_C_EnableRigidBody::bEnable' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_EnableRigidBody, LerpTime) == 0x000004, "Member 'BPI_PlayerInterface_C_EnableRigidBody::LerpTime' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_EnableRigidBody, bDummy) == 0x000008, "Member 'BPI_PlayerInterface_C_EnableRigidBody::bDummy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.SetPlayerActionSAS
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerInterface_C_SetPlayerActionSAS final
{
public:
	bool                                          bDummy;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_SetPlayerActionSAS) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_SetPlayerActionSAS");
static_assert(sizeof(BPI_PlayerInterface_C_SetPlayerActionSAS) == 0x000001, "Wrong size on BPI_PlayerInterface_C_SetPlayerActionSAS");
static_assert(offsetof(BPI_PlayerInterface_C_SetPlayerActionSAS, bDummy) == 0x000000, "Member 'BPI_PlayerInterface_C_SetPlayerActionSAS::bDummy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.SetPlayerBattle
// 0x0002 (0x0002 - 0x0000)
struct BPI_PlayerInterface_C_SetPlayerBattle final
{
public:
	bool                                          bBattle;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDummy;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_SetPlayerBattle) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_SetPlayerBattle");
static_assert(sizeof(BPI_PlayerInterface_C_SetPlayerBattle) == 0x000002, "Wrong size on BPI_PlayerInterface_C_SetPlayerBattle");
static_assert(offsetof(BPI_PlayerInterface_C_SetPlayerBattle, bBattle) == 0x000000, "Member 'BPI_PlayerInterface_C_SetPlayerBattle::bBattle' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_SetPlayerBattle, bDummy) == 0x000001, "Member 'BPI_PlayerInterface_C_SetPlayerBattle::bDummy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.SetBrainCodeVisible
// 0x0003 (0x0003 - 0x0000)
struct BPI_PlayerInterface_C_SetBrainCodeVisible final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDrive;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDummy;                                            // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_SetBrainCodeVisible) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_SetBrainCodeVisible");
static_assert(sizeof(BPI_PlayerInterface_C_SetBrainCodeVisible) == 0x000003, "Wrong size on BPI_PlayerInterface_C_SetBrainCodeVisible");
static_assert(offsetof(BPI_PlayerInterface_C_SetBrainCodeVisible, bVisible) == 0x000000, "Member 'BPI_PlayerInterface_C_SetBrainCodeVisible::bVisible' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_SetBrainCodeVisible, bDrive) == 0x000001, "Member 'BPI_PlayerInterface_C_SetBrainCodeVisible::bDrive' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_SetBrainCodeVisible, bDummy) == 0x000002, "Member 'BPI_PlayerInterface_C_SetBrainCodeVisible::bDummy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.SetSASCodeParam
// 0x0008 (0x0008 - 0x0000)
struct BPI_PlayerInterface_C_SetSASCodeParam final
{
public:
	float                                         Param;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDummy;                                            // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_SetSASCodeParam) == 0x000004, "Wrong alignment on BPI_PlayerInterface_C_SetSASCodeParam");
static_assert(sizeof(BPI_PlayerInterface_C_SetSASCodeParam) == 0x000008, "Wrong size on BPI_PlayerInterface_C_SetSASCodeParam");
static_assert(offsetof(BPI_PlayerInterface_C_SetSASCodeParam, Param) == 0x000000, "Member 'BPI_PlayerInterface_C_SetSASCodeParam::Param' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_SetSASCodeParam, bDummy) == 0x000004, "Member 'BPI_PlayerInterface_C_SetSASCodeParam::bDummy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.StartSASCode
// 0x0002 (0x0002 - 0x0000)
struct BPI_PlayerInterface_C_StartSASCode final
{
public:
	E_SASKind                                     SasKind;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDummy;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_StartSASCode) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_StartSASCode");
static_assert(sizeof(BPI_PlayerInterface_C_StartSASCode) == 0x000002, "Wrong size on BPI_PlayerInterface_C_StartSASCode");
static_assert(offsetof(BPI_PlayerInterface_C_StartSASCode, SasKind) == 0x000000, "Member 'BPI_PlayerInterface_C_StartSASCode::SasKind' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_StartSASCode, bDummy) == 0x000001, "Member 'BPI_PlayerInterface_C_StartSASCode::bDummy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.GetSASCodeActorList
// 0x0010 (0x0010 - 0x0000)
struct BPI_PlayerInterface_C_GetSASCodeActorList final
{
public:
	TArray<class ABP_CableBase_C*>                CodeList;                                          // 0x0000(0x0010)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(BPI_PlayerInterface_C_GetSASCodeActorList) == 0x000008, "Wrong alignment on BPI_PlayerInterface_C_GetSASCodeActorList");
static_assert(sizeof(BPI_PlayerInterface_C_GetSASCodeActorList) == 0x000010, "Wrong size on BPI_PlayerInterface_C_GetSASCodeActorList");
static_assert(offsetof(BPI_PlayerInterface_C_GetSASCodeActorList, CodeList) == 0x000000, "Member 'BPI_PlayerInterface_C_GetSASCodeActorList::CodeList' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.GetBrainCodeActorList
// 0x0010 (0x0010 - 0x0000)
struct BPI_PlayerInterface_C_GetBrainCodeActorList final
{
public:
	TArray<class ABP_CableBase_C*>                CodeList;                                          // 0x0000(0x0010)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(BPI_PlayerInterface_C_GetBrainCodeActorList) == 0x000008, "Wrong alignment on BPI_PlayerInterface_C_GetBrainCodeActorList");
static_assert(sizeof(BPI_PlayerInterface_C_GetBrainCodeActorList) == 0x000010, "Wrong size on BPI_PlayerInterface_C_GetBrainCodeActorList");
static_assert(offsetof(BPI_PlayerInterface_C_GetBrainCodeActorList, CodeList) == 0x000000, "Member 'BPI_PlayerInterface_C_GetBrainCodeActorList::CodeList' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.GetBrainFieldTimeRate
// 0x0004 (0x0004 - 0x0000)
struct BPI_PlayerInterface_C_GetBrainFieldTimeRate final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_PlayerInterface_C_GetBrainFieldTimeRate) == 0x000004, "Wrong alignment on BPI_PlayerInterface_C_GetBrainFieldTimeRate");
static_assert(sizeof(BPI_PlayerInterface_C_GetBrainFieldTimeRate) == 0x000004, "Wrong size on BPI_PlayerInterface_C_GetBrainFieldTimeRate");
static_assert(offsetof(BPI_PlayerInterface_C_GetBrainFieldTimeRate, Rate) == 0x000000, "Member 'BPI_PlayerInterface_C_GetBrainFieldTimeRate::Rate' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.IsOpenBrainField
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerInterface_C_IsOpenBrainField final
{
public:
	bool                                          bOpen;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_IsOpenBrainField) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_IsOpenBrainField");
static_assert(sizeof(BPI_PlayerInterface_C_IsOpenBrainField) == 0x000001, "Wrong size on BPI_PlayerInterface_C_IsOpenBrainField");
static_assert(offsetof(BPI_PlayerInterface_C_IsOpenBrainField, bOpen) == 0x000000, "Member 'BPI_PlayerInterface_C_IsOpenBrainField::bOpen' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.PlaySASCodeDirection
// 0x0002 (0x0002 - 0x0000)
struct BPI_PlayerInterface_C_PlaySASCodeDirection final
{
public:
	ERSCableGravityType                           Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDummy;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_PlaySASCodeDirection) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_PlaySASCodeDirection");
static_assert(sizeof(BPI_PlayerInterface_C_PlaySASCodeDirection) == 0x000002, "Wrong size on BPI_PlayerInterface_C_PlaySASCodeDirection");
static_assert(offsetof(BPI_PlayerInterface_C_PlaySASCodeDirection, Type) == 0x000000, "Member 'BPI_PlayerInterface_C_PlaySASCodeDirection::Type' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_PlaySASCodeDirection, bDummy) == 0x000001, "Member 'BPI_PlayerInterface_C_PlaySASCodeDirection::bDummy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.StopSASCodeDirection
// 0x0002 (0x0002 - 0x0000)
struct BPI_PlayerInterface_C_StopSASCodeDirection final
{
public:
	ERSCableGravityType                           Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDummy;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_StopSASCodeDirection) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_StopSASCodeDirection");
static_assert(sizeof(BPI_PlayerInterface_C_StopSASCodeDirection) == 0x000002, "Wrong size on BPI_PlayerInterface_C_StopSASCodeDirection");
static_assert(offsetof(BPI_PlayerInterface_C_StopSASCodeDirection, Type) == 0x000000, "Member 'BPI_PlayerInterface_C_StopSASCodeDirection::Type' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_StopSASCodeDirection, bDummy) == 0x000001, "Member 'BPI_PlayerInterface_C_StopSASCodeDirection::bDummy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.ResetSpecialEffects
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerInterface_C_ResetSpecialEffects final
{
public:
	bool                                          bDummy;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_ResetSpecialEffects) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_ResetSpecialEffects");
static_assert(sizeof(BPI_PlayerInterface_C_ResetSpecialEffects) == 0x000001, "Wrong size on BPI_PlayerInterface_C_ResetSpecialEffects");
static_assert(offsetof(BPI_PlayerInterface_C_ResetSpecialEffects, bDummy) == 0x000000, "Member 'BPI_PlayerInterface_C_ResetSpecialEffects::bDummy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.SetPlayerActionAfterEvent
// 0x0002 (0x0002 - 0x0000)
struct BPI_PlayerInterface_C_SetPlayerActionAfterEvent final
{
public:
	EParamAfterEventAction                        Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDummy;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_SetPlayerActionAfterEvent) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_SetPlayerActionAfterEvent");
static_assert(sizeof(BPI_PlayerInterface_C_SetPlayerActionAfterEvent) == 0x000002, "Wrong size on BPI_PlayerInterface_C_SetPlayerActionAfterEvent");
static_assert(offsetof(BPI_PlayerInterface_C_SetPlayerActionAfterEvent, Param) == 0x000000, "Member 'BPI_PlayerInterface_C_SetPlayerActionAfterEvent::Param' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_SetPlayerActionAfterEvent, bDummy) == 0x000001, "Member 'BPI_PlayerInterface_C_SetPlayerActionAfterEvent::bDummy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.GetSAS_Kind
// 0x0002 (0x0002 - 0x0000)
struct BPI_PlayerInterface_C_GetSAS_Kind final
{
public:
	E_SASButton                                   Button;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SASKind                                     Kind;                                              // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_PlayerInterface_C_GetSAS_Kind) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_GetSAS_Kind");
static_assert(sizeof(BPI_PlayerInterface_C_GetSAS_Kind) == 0x000002, "Wrong size on BPI_PlayerInterface_C_GetSAS_Kind");
static_assert(offsetof(BPI_PlayerInterface_C_GetSAS_Kind, Button) == 0x000000, "Member 'BPI_PlayerInterface_C_GetSAS_Kind::Button' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_GetSAS_Kind, Kind) == 0x000001, "Member 'BPI_PlayerInterface_C_GetSAS_Kind::Kind' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.PlayerCameraReset
// 0x0008 (0x0008 - 0x0000)
struct BPI_PlayerInterface_C_PlayerCameraReset final
{
public:
	float                                         InterpSec;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_PlayerCameraReset) == 0x000004, "Wrong alignment on BPI_PlayerInterface_C_PlayerCameraReset");
static_assert(sizeof(BPI_PlayerInterface_C_PlayerCameraReset) == 0x000008, "Wrong size on BPI_PlayerInterface_C_PlayerCameraReset");
static_assert(offsetof(BPI_PlayerInterface_C_PlayerCameraReset, InterpSec) == 0x000000, "Member 'BPI_PlayerInterface_C_PlayerCameraReset::InterpSec' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_PlayerCameraReset, Dummy) == 0x000004, "Member 'BPI_PlayerInterface_C_PlayerCameraReset::Dummy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.ForceWarp_Interface
// 0x0040 (0x0040 - 0x0000)
struct BPI_PlayerInterface_C_ForceWarp_Interface final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         IdlingSeconds;                                     // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0034(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_ForceWarp_Interface) == 0x000010, "Wrong alignment on BPI_PlayerInterface_C_ForceWarp_Interface");
static_assert(sizeof(BPI_PlayerInterface_C_ForceWarp_Interface) == 0x000040, "Wrong size on BPI_PlayerInterface_C_ForceWarp_Interface");
static_assert(offsetof(BPI_PlayerInterface_C_ForceWarp_Interface, Transform) == 0x000000, "Member 'BPI_PlayerInterface_C_ForceWarp_Interface::Transform' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_ForceWarp_Interface, IdlingSeconds) == 0x000030, "Member 'BPI_PlayerInterface_C_ForceWarp_Interface::IdlingSeconds' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_ForceWarp_Interface, Dummy) == 0x000034, "Member 'BPI_PlayerInterface_C_ForceWarp_Interface::Dummy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.SetPsychicObjectEnableRange
// 0x0008 (0x0008 - 0x0000)
struct BPI_PlayerInterface_C_SetPsychicObjectEnableRange final
{
public:
	bool                                          Is_Brain_Field_in;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84E9[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Range;                                             // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_PlayerInterface_C_SetPsychicObjectEnableRange) == 0x000004, "Wrong alignment on BPI_PlayerInterface_C_SetPsychicObjectEnableRange");
static_assert(sizeof(BPI_PlayerInterface_C_SetPsychicObjectEnableRange) == 0x000008, "Wrong size on BPI_PlayerInterface_C_SetPsychicObjectEnableRange");
static_assert(offsetof(BPI_PlayerInterface_C_SetPsychicObjectEnableRange, Is_Brain_Field_in) == 0x000000, "Member 'BPI_PlayerInterface_C_SetPsychicObjectEnableRange::Is_Brain_Field_in' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_SetPsychicObjectEnableRange, Range) == 0x000004, "Member 'BPI_PlayerInterface_C_SetPsychicObjectEnableRange::Range' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.SetCanAnimOverrideSASColor
// 0x0002 (0x0002 - 0x0000)
struct BPI_PlayerInterface_C_SetCanAnimOverrideSASColor final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Dummy;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_SetCanAnimOverrideSASColor) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_SetCanAnimOverrideSASColor");
static_assert(sizeof(BPI_PlayerInterface_C_SetCanAnimOverrideSASColor) == 0x000002, "Wrong size on BPI_PlayerInterface_C_SetCanAnimOverrideSASColor");
static_assert(offsetof(BPI_PlayerInterface_C_SetCanAnimOverrideSASColor, Enable) == 0x000000, "Member 'BPI_PlayerInterface_C_SetCanAnimOverrideSASColor::Enable' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_SetCanAnimOverrideSASColor, Dummy) == 0x000001, "Member 'BPI_PlayerInterface_C_SetCanAnimOverrideSASColor::Dummy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.GetCanAnimOverrideSASColor
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerInterface_C_GetCanAnimOverrideSASColor final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_GetCanAnimOverrideSASColor) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_GetCanAnimOverrideSASColor");
static_assert(sizeof(BPI_PlayerInterface_C_GetCanAnimOverrideSASColor) == 0x000001, "Wrong size on BPI_PlayerInterface_C_GetCanAnimOverrideSASColor");
static_assert(offsetof(BPI_PlayerInterface_C_GetCanAnimOverrideSASColor, Enabled) == 0x000000, "Member 'BPI_PlayerInterface_C_GetCanAnimOverrideSASColor::Enabled' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.SetStealth
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerInterface_C_SetStealth final
{
public:
	bool                                          Flag_in;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_SetStealth) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_SetStealth");
static_assert(sizeof(BPI_PlayerInterface_C_SetStealth) == 0x000001, "Wrong size on BPI_PlayerInterface_C_SetStealth");
static_assert(offsetof(BPI_PlayerInterface_C_SetStealth, Flag_in) == 0x000000, "Member 'BPI_PlayerInterface_C_SetStealth::Flag_in' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.AddPsychicFlyObj
// 0x0010 (0x0010 - 0x0000)
struct BPI_PlayerInterface_C_AddPsychicFlyObj final
{
public:
	class ABP_PsychicObjectBasic_C*               FlyObj;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_AddPsychicFlyObj) == 0x000008, "Wrong alignment on BPI_PlayerInterface_C_AddPsychicFlyObj");
static_assert(sizeof(BPI_PlayerInterface_C_AddPsychicFlyObj) == 0x000010, "Wrong size on BPI_PlayerInterface_C_AddPsychicFlyObj");
static_assert(offsetof(BPI_PlayerInterface_C_AddPsychicFlyObj, FlyObj) == 0x000000, "Member 'BPI_PlayerInterface_C_AddPsychicFlyObj::FlyObj' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_AddPsychicFlyObj, Dummy) == 0x000008, "Member 'BPI_PlayerInterface_C_AddPsychicFlyObj::Dummy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.GetPsychicFlyObj
// 0x0010 (0x0010 - 0x0000)
struct BPI_PlayerInterface_C_GetPsychicFlyObj final
{
public:
	TArray<class AActor*>                         FlyObj;                                            // 0x0000(0x0010)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(BPI_PlayerInterface_C_GetPsychicFlyObj) == 0x000008, "Wrong alignment on BPI_PlayerInterface_C_GetPsychicFlyObj");
static_assert(sizeof(BPI_PlayerInterface_C_GetPsychicFlyObj) == 0x000010, "Wrong size on BPI_PlayerInterface_C_GetPsychicFlyObj");
static_assert(offsetof(BPI_PlayerInterface_C_GetPsychicFlyObj, FlyObj) == 0x000000, "Member 'BPI_PlayerInterface_C_GetPsychicFlyObj::FlyObj' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.AddHitPsychicFlyObj
// 0x0010 (0x0010 - 0x0000)
struct BPI_PlayerInterface_C_AddHitPsychicFlyObj final
{
public:
	class ABP_PsychicObjectBasic_C*               HitFlyObj;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAdd;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_AddHitPsychicFlyObj) == 0x000008, "Wrong alignment on BPI_PlayerInterface_C_AddHitPsychicFlyObj");
static_assert(sizeof(BPI_PlayerInterface_C_AddHitPsychicFlyObj) == 0x000010, "Wrong size on BPI_PlayerInterface_C_AddHitPsychicFlyObj");
static_assert(offsetof(BPI_PlayerInterface_C_AddHitPsychicFlyObj, HitFlyObj) == 0x000000, "Member 'BPI_PlayerInterface_C_AddHitPsychicFlyObj::HitFlyObj' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_AddHitPsychicFlyObj, IsAdd) == 0x000008, "Member 'BPI_PlayerInterface_C_AddHitPsychicFlyObj::IsAdd' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.IsUseFog
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerInterface_C_IsUseFog final
{
public:
	bool                                          IsFog;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_IsUseFog) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_IsUseFog");
static_assert(sizeof(BPI_PlayerInterface_C_IsUseFog) == 0x000001, "Wrong size on BPI_PlayerInterface_C_IsUseFog");
static_assert(offsetof(BPI_PlayerInterface_C_IsUseFog, IsFog) == 0x000000, "Member 'BPI_PlayerInterface_C_IsUseFog::IsFog' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.IsEnpcBarrier
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerInterface_C_IsEnpcBarrier final
{
public:
	bool                                          IsBarrier;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_IsEnpcBarrier) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_IsEnpcBarrier");
static_assert(sizeof(BPI_PlayerInterface_C_IsEnpcBarrier) == 0x000001, "Wrong size on BPI_PlayerInterface_C_IsEnpcBarrier");
static_assert(offsetof(BPI_PlayerInterface_C_IsEnpcBarrier, IsBarrier) == 0x000000, "Member 'BPI_PlayerInterface_C_IsEnpcBarrier::IsBarrier' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.CanBattleAction
// 0x0002 (0x0002 - 0x0000)
struct BPI_PlayerInterface_C_CanBattleAction final
{
public:
	EPlayerAIBattleThinkType                      ThinkType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanAction;                                         // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_CanBattleAction) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_CanBattleAction");
static_assert(sizeof(BPI_PlayerInterface_C_CanBattleAction) == 0x000002, "Wrong size on BPI_PlayerInterface_C_CanBattleAction");
static_assert(offsetof(BPI_PlayerInterface_C_CanBattleAction, ThinkType) == 0x000000, "Member 'BPI_PlayerInterface_C_CanBattleAction::ThinkType' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_CanBattleAction, CanAction) == 0x000001, "Member 'BPI_PlayerInterface_C_CanBattleAction::CanAction' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.GetENpcKind
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerInterface_C_GetENpcKind final
{
public:
	ENpcKind                                      ENpcKind;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_PlayerInterface_C_GetENpcKind) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_GetENpcKind");
static_assert(sizeof(BPI_PlayerInterface_C_GetENpcKind) == 0x000001, "Wrong size on BPI_PlayerInterface_C_GetENpcKind");
static_assert(offsetof(BPI_PlayerInterface_C_GetENpcKind, ENpcKind) == 0x000000, "Member 'BPI_PlayerInterface_C_GetENpcKind::ENpcKind' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.IsDodgeTargetRot
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerInterface_C_IsDodgeTargetRot final
{
public:
	bool                                          Param_IsDodgeTargetRot;                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_IsDodgeTargetRot) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_IsDodgeTargetRot");
static_assert(sizeof(BPI_PlayerInterface_C_IsDodgeTargetRot) == 0x000001, "Wrong size on BPI_PlayerInterface_C_IsDodgeTargetRot");
static_assert(offsetof(BPI_PlayerInterface_C_IsDodgeTargetRot, Param_IsDodgeTargetRot) == 0x000000, "Member 'BPI_PlayerInterface_C_IsDodgeTargetRot::Param_IsDodgeTargetRot' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.GetDodgeScale
// 0x0004 (0x0004 - 0x0000)
struct BPI_PlayerInterface_C_GetDodgeScale final
{
public:
	float                                         DodgeScale;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_PlayerInterface_C_GetDodgeScale) == 0x000004, "Wrong alignment on BPI_PlayerInterface_C_GetDodgeScale");
static_assert(sizeof(BPI_PlayerInterface_C_GetDodgeScale) == 0x000004, "Wrong size on BPI_PlayerInterface_C_GetDodgeScale");
static_assert(offsetof(BPI_PlayerInterface_C_GetDodgeScale, DodgeScale) == 0x000000, "Member 'BPI_PlayerInterface_C_GetDodgeScale::DodgeScale' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.IsSpecialDown
// 0x0008 (0x0008 - 0x0000)
struct BPI_PlayerInterface_C_IsSpecialDown final
{
public:
	bool                                          IsSpDown;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84EA[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpDownWince;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_PlayerInterface_C_IsSpecialDown) == 0x000004, "Wrong alignment on BPI_PlayerInterface_C_IsSpecialDown");
static_assert(sizeof(BPI_PlayerInterface_C_IsSpecialDown) == 0x000008, "Wrong size on BPI_PlayerInterface_C_IsSpecialDown");
static_assert(offsetof(BPI_PlayerInterface_C_IsSpecialDown, IsSpDown) == 0x000000, "Member 'BPI_PlayerInterface_C_IsSpecialDown::IsSpDown' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_IsSpecialDown, SpDownWince) == 0x000004, "Member 'BPI_PlayerInterface_C_IsSpecialDown::SpDownWince' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.GetSpecialDownTimer
// 0x0004 (0x0004 - 0x0000)
struct BPI_PlayerInterface_C_GetSpecialDownTimer final
{
public:
	float                                         SpDownTimer;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_PlayerInterface_C_GetSpecialDownTimer) == 0x000004, "Wrong alignment on BPI_PlayerInterface_C_GetSpecialDownTimer");
static_assert(sizeof(BPI_PlayerInterface_C_GetSpecialDownTimer) == 0x000004, "Wrong size on BPI_PlayerInterface_C_GetSpecialDownTimer");
static_assert(offsetof(BPI_PlayerInterface_C_GetSpecialDownTimer, SpDownTimer) == 0x000000, "Member 'BPI_PlayerInterface_C_GetSpecialDownTimer::SpDownTimer' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.ChangeENpcKind
// 0x0002 (0x0002 - 0x0000)
struct BPI_PlayerInterface_C_ChangeENpcKind final
{
public:
	ENpcKind                                      ENpcKind;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_ChangeENpcKind) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_ChangeENpcKind");
static_assert(sizeof(BPI_PlayerInterface_C_ChangeENpcKind) == 0x000002, "Wrong size on BPI_PlayerInterface_C_ChangeENpcKind");
static_assert(offsetof(BPI_PlayerInterface_C_ChangeENpcKind, ENpcKind) == 0x000000, "Member 'BPI_PlayerInterface_C_ChangeENpcKind::ENpcKind' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_ChangeENpcKind, Dummy) == 0x000001, "Member 'BPI_PlayerInterface_C_ChangeENpcKind::Dummy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.GetSkillCoreDropProbability
// 0x0004 (0x0004 - 0x0000)
struct BPI_PlayerInterface_C_GetSkillCoreDropProbability final
{
public:
	float                                         Probability;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_PlayerInterface_C_GetSkillCoreDropProbability) == 0x000004, "Wrong alignment on BPI_PlayerInterface_C_GetSkillCoreDropProbability");
static_assert(sizeof(BPI_PlayerInterface_C_GetSkillCoreDropProbability) == 0x000004, "Wrong size on BPI_PlayerInterface_C_GetSkillCoreDropProbability");
static_assert(offsetof(BPI_PlayerInterface_C_GetSkillCoreDropProbability, Probability) == 0x000000, "Member 'BPI_PlayerInterface_C_GetSkillCoreDropProbability::Probability' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.CanSpecialMoveTrigger
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerInterface_C_CanSpecialMoveTrigger final
{
public:
	bool                                          CanDo;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_CanSpecialMoveTrigger) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_CanSpecialMoveTrigger");
static_assert(sizeof(BPI_PlayerInterface_C_CanSpecialMoveTrigger) == 0x000001, "Wrong size on BPI_PlayerInterface_C_CanSpecialMoveTrigger");
static_assert(offsetof(BPI_PlayerInterface_C_CanSpecialMoveTrigger, CanDo) == 0x000000, "Member 'BPI_PlayerInterface_C_CanSpecialMoveTrigger::CanDo' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.ReturnMetamorphosis
// 0x0028 (0x0028 - 0x0000)
struct BPI_PlayerInterface_C_ReturnMetamorphosis final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class ARSBattlePlayer_C*                      SpecifyPlayer;                                     // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_ReturnMetamorphosis) == 0x000008, "Wrong alignment on BPI_PlayerInterface_C_ReturnMetamorphosis");
static_assert(sizeof(BPI_PlayerInterface_C_ReturnMetamorphosis) == 0x000028, "Wrong size on BPI_PlayerInterface_C_ReturnMetamorphosis");
static_assert(offsetof(BPI_PlayerInterface_C_ReturnMetamorphosis, Location) == 0x000000, "Member 'BPI_PlayerInterface_C_ReturnMetamorphosis::Location' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_ReturnMetamorphosis, Rotation) == 0x00000C, "Member 'BPI_PlayerInterface_C_ReturnMetamorphosis::Rotation' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_ReturnMetamorphosis, SpecifyPlayer) == 0x000018, "Member 'BPI_PlayerInterface_C_ReturnMetamorphosis::SpecifyPlayer' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_ReturnMetamorphosis, Dummy) == 0x000020, "Member 'BPI_PlayerInterface_C_ReturnMetamorphosis::Dummy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.OnAttackedEnemyDead
// 0x0002 (0x0002 - 0x0000)
struct BPI_PlayerInterface_C_OnAttackedEnemyDead final
{
public:
	ECharaDeadType                                DeadType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_OnAttackedEnemyDead) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_OnAttackedEnemyDead");
static_assert(sizeof(BPI_PlayerInterface_C_OnAttackedEnemyDead) == 0x000002, "Wrong size on BPI_PlayerInterface_C_OnAttackedEnemyDead");
static_assert(offsetof(BPI_PlayerInterface_C_OnAttackedEnemyDead, DeadType) == 0x000000, "Member 'BPI_PlayerInterface_C_OnAttackedEnemyDead::DeadType' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_OnAttackedEnemyDead, Dummy) == 0x000001, "Member 'BPI_PlayerInterface_C_OnAttackedEnemyDead::Dummy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.CanEnpcOpenBrainField
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerInterface_C_CanEnpcOpenBrainField final
{
public:
	bool                                          CanDo;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_CanEnpcOpenBrainField) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_CanEnpcOpenBrainField");
static_assert(sizeof(BPI_PlayerInterface_C_CanEnpcOpenBrainField) == 0x000001, "Wrong size on BPI_PlayerInterface_C_CanEnpcOpenBrainField");
static_assert(offsetof(BPI_PlayerInterface_C_CanEnpcOpenBrainField, CanDo) == 0x000000, "Member 'BPI_PlayerInterface_C_CanEnpcOpenBrainField::CanDo' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.EnpcBarrierHitNotify
// 0x01C8 (0x01C8 - 0x0000)
struct BPI_PlayerInterface_C_EnpcBarrierHitNotify final
{
public:
	struct FHCHitResult                           Result;                                            // 0x0000(0x01C0)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	bool                                          Dammy;                                             // 0x01C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_EnpcBarrierHitNotify) == 0x000008, "Wrong alignment on BPI_PlayerInterface_C_EnpcBarrierHitNotify");
static_assert(sizeof(BPI_PlayerInterface_C_EnpcBarrierHitNotify) == 0x0001C8, "Wrong size on BPI_PlayerInterface_C_EnpcBarrierHitNotify");
static_assert(offsetof(BPI_PlayerInterface_C_EnpcBarrierHitNotify, Result) == 0x000000, "Member 'BPI_PlayerInterface_C_EnpcBarrierHitNotify::Result' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_EnpcBarrierHitNotify, Dammy) == 0x0001C0, "Member 'BPI_PlayerInterface_C_EnpcBarrierHitNotify::Dammy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.CreateRedCode
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerInterface_C_CreateRedCode final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_CreateRedCode) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_CreateRedCode");
static_assert(sizeof(BPI_PlayerInterface_C_CreateRedCode) == 0x000001, "Wrong size on BPI_PlayerInterface_C_CreateRedCode");
static_assert(offsetof(BPI_PlayerInterface_C_CreateRedCode, NewParam) == 0x000000, "Member 'BPI_PlayerInterface_C_CreateRedCode::NewParam' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.DestroyRedCode
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerInterface_C_DestroyRedCode final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_DestroyRedCode) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_DestroyRedCode");
static_assert(sizeof(BPI_PlayerInterface_C_DestroyRedCode) == 0x000001, "Wrong size on BPI_PlayerInterface_C_DestroyRedCode");
static_assert(offsetof(BPI_PlayerInterface_C_DestroyRedCode, NewParam) == 0x000000, "Member 'BPI_PlayerInterface_C_DestroyRedCode::NewParam' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.CheckStickInputTurn
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerInterface_C_CheckStickInputTurn final
{
public:
	bool                                          bTurn;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_CheckStickInputTurn) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_CheckStickInputTurn");
static_assert(sizeof(BPI_PlayerInterface_C_CheckStickInputTurn) == 0x000001, "Wrong size on BPI_PlayerInterface_C_CheckStickInputTurn");
static_assert(offsetof(BPI_PlayerInterface_C_CheckStickInputTurn, bTurn) == 0x000000, "Member 'BPI_PlayerInterface_C_CheckStickInputTurn::bTurn' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.GetEnableRigidBody
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerInterface_C_GetEnableRigidBody final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_GetEnableRigidBody) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_GetEnableRigidBody");
static_assert(sizeof(BPI_PlayerInterface_C_GetEnableRigidBody) == 0x000001, "Wrong size on BPI_PlayerInterface_C_GetEnableRigidBody");
static_assert(offsetof(BPI_PlayerInterface_C_GetEnableRigidBody, Enable) == 0x000000, "Member 'BPI_PlayerInterface_C_GetEnableRigidBody::Enable' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.SetPlayerInputRestriction
// 0x0003 (0x0003 - 0x0000)
struct BPI_PlayerInterface_C_SetPlayerInputRestriction final
{
public:
	EPlayerInputRestrictionType                   Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRestriction;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDummy;                                            // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_SetPlayerInputRestriction) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_SetPlayerInputRestriction");
static_assert(sizeof(BPI_PlayerInterface_C_SetPlayerInputRestriction) == 0x000003, "Wrong size on BPI_PlayerInterface_C_SetPlayerInputRestriction");
static_assert(offsetof(BPI_PlayerInterface_C_SetPlayerInputRestriction, Type) == 0x000000, "Member 'BPI_PlayerInterface_C_SetPlayerInputRestriction::Type' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_SetPlayerInputRestriction, bRestriction) == 0x000001, "Member 'BPI_PlayerInterface_C_SetPlayerInputRestriction::bRestriction' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_SetPlayerInputRestriction, bDummy) == 0x000002, "Member 'BPI_PlayerInterface_C_SetPlayerInputRestriction::bDummy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.IsJumpAreaAble
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerInterface_C_IsJumpAreaAble final
{
public:
	bool                                          bAble;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_IsJumpAreaAble) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_IsJumpAreaAble");
static_assert(sizeof(BPI_PlayerInterface_C_IsJumpAreaAble) == 0x000001, "Wrong size on BPI_PlayerInterface_C_IsJumpAreaAble");
static_assert(offsetof(BPI_PlayerInterface_C_IsJumpAreaAble, bAble) == 0x000000, "Member 'BPI_PlayerInterface_C_IsJumpAreaAble::bAble' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.IsEnableInputPsychicCombo
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerInterface_C_IsEnableInputPsychicCombo final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_IsEnableInputPsychicCombo) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_IsEnableInputPsychicCombo");
static_assert(sizeof(BPI_PlayerInterface_C_IsEnableInputPsychicCombo) == 0x000001, "Wrong size on BPI_PlayerInterface_C_IsEnableInputPsychicCombo");
static_assert(offsetof(BPI_PlayerInterface_C_IsEnableInputPsychicCombo, bEnable) == 0x000000, "Member 'BPI_PlayerInterface_C_IsEnableInputPsychicCombo::bEnable' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.SetPsychicEmissionInterface
// 0x000C (0x000C - 0x0000)
struct BPI_PlayerInterface_C_SetPsychicEmissionInterface final
{
public:
	bool                                          bON;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84EB[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ClaimantName;                                      // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_PlayerInterface_C_SetPsychicEmissionInterface) == 0x000004, "Wrong alignment on BPI_PlayerInterface_C_SetPsychicEmissionInterface");
static_assert(sizeof(BPI_PlayerInterface_C_SetPsychicEmissionInterface) == 0x00000C, "Wrong size on BPI_PlayerInterface_C_SetPsychicEmissionInterface");
static_assert(offsetof(BPI_PlayerInterface_C_SetPsychicEmissionInterface, bON) == 0x000000, "Member 'BPI_PlayerInterface_C_SetPsychicEmissionInterface::bON' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_SetPsychicEmissionInterface, ClaimantName) == 0x000004, "Member 'BPI_PlayerInterface_C_SetPsychicEmissionInterface::ClaimantName' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.IsIntense
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerInterface_C_IsIntense final
{
public:
	bool                                          bIntense;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_IsIntense) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_IsIntense");
static_assert(sizeof(BPI_PlayerInterface_C_IsIntense) == 0x000001, "Wrong size on BPI_PlayerInterface_C_IsIntense");
static_assert(offsetof(BPI_PlayerInterface_C_IsIntense, bIntense) == 0x000000, "Member 'BPI_PlayerInterface_C_IsIntense::bIntense' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.IsEnableSeeThrough
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerInterface_C_IsEnableSeeThrough final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_IsEnableSeeThrough) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_IsEnableSeeThrough");
static_assert(sizeof(BPI_PlayerInterface_C_IsEnableSeeThrough) == 0x000001, "Wrong size on BPI_PlayerInterface_C_IsEnableSeeThrough");
static_assert(offsetof(BPI_PlayerInterface_C_IsEnableSeeThrough, bEnable) == 0x000000, "Member 'BPI_PlayerInterface_C_IsEnableSeeThrough::bEnable' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.SetTalkLookAtTurn
// 0x0010 (0x0010 - 0x0000)
struct BPI_PlayerInterface_C_SetTalkLookAtTurn final
{
public:
	struct FVector                                LookAtLocation;                                    // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDummy;                                            // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_SetTalkLookAtTurn) == 0x000004, "Wrong alignment on BPI_PlayerInterface_C_SetTalkLookAtTurn");
static_assert(sizeof(BPI_PlayerInterface_C_SetTalkLookAtTurn) == 0x000010, "Wrong size on BPI_PlayerInterface_C_SetTalkLookAtTurn");
static_assert(offsetof(BPI_PlayerInterface_C_SetTalkLookAtTurn, LookAtLocation) == 0x000000, "Member 'BPI_PlayerInterface_C_SetTalkLookAtTurn::LookAtLocation' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_SetTalkLookAtTurn, bDummy) == 0x00000C, "Member 'BPI_PlayerInterface_C_SetTalkLookAtTurn::bDummy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.EndTalkLookAtTurn
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerInterface_C_EndTalkLookAtTurn final
{
public:
	bool                                          bDummy;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_EndTalkLookAtTurn) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_EndTalkLookAtTurn");
static_assert(sizeof(BPI_PlayerInterface_C_EndTalkLookAtTurn) == 0x000001, "Wrong size on BPI_PlayerInterface_C_EndTalkLookAtTurn");
static_assert(offsetof(BPI_PlayerInterface_C_EndTalkLookAtTurn, bDummy) == 0x000000, "Member 'BPI_PlayerInterface_C_EndTalkLookAtTurn::bDummy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.EnableUseSeeThrough
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerInterface_C_EnableUseSeeThrough final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_EnableUseSeeThrough) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_EnableUseSeeThrough");
static_assert(sizeof(BPI_PlayerInterface_C_EnableUseSeeThrough) == 0x000001, "Wrong size on BPI_PlayerInterface_C_EnableUseSeeThrough");
static_assert(offsetof(BPI_PlayerInterface_C_EnableUseSeeThrough, bEnable) == 0x000000, "Member 'BPI_PlayerInterface_C_EnableUseSeeThrough::bEnable' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.CheckTargetableCharacterENPC
// 0x0010 (0x0010 - 0x0000)
struct BPI_PlayerInterface_C_CheckTargetableCharacterENPC final
{
public:
	class ARSCharacterBase*                       Chara;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_CheckTargetableCharacterENPC) == 0x000008, "Wrong alignment on BPI_PlayerInterface_C_CheckTargetableCharacterENPC");
static_assert(sizeof(BPI_PlayerInterface_C_CheckTargetableCharacterENPC) == 0x000010, "Wrong size on BPI_PlayerInterface_C_CheckTargetableCharacterENPC");
static_assert(offsetof(BPI_PlayerInterface_C_CheckTargetableCharacterENPC, Chara) == 0x000000, "Member 'BPI_PlayerInterface_C_CheckTargetableCharacterENPC::Chara' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_CheckTargetableCharacterENPC, ReturnValue) == 0x000008, "Member 'BPI_PlayerInterface_C_CheckTargetableCharacterENPC::ReturnValue' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.RequestBrainFieldHelp
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerInterface_C_RequestBrainFieldHelp final
{
public:
	bool                                          bDummy;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_RequestBrainFieldHelp) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_RequestBrainFieldHelp");
static_assert(sizeof(BPI_PlayerInterface_C_RequestBrainFieldHelp) == 0x000001, "Wrong size on BPI_PlayerInterface_C_RequestBrainFieldHelp");
static_assert(offsetof(BPI_PlayerInterface_C_RequestBrainFieldHelp, bDummy) == 0x000000, "Member 'BPI_PlayerInterface_C_RequestBrainFieldHelp::bDummy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.SetNpcBrainFieldDrive
// 0x0002 (0x0002 - 0x0000)
struct BPI_PlayerInterface_C_SetNpcBrainFieldDrive final
{
public:
	bool                                          bDrive;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDummy;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_SetNpcBrainFieldDrive) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_SetNpcBrainFieldDrive");
static_assert(sizeof(BPI_PlayerInterface_C_SetNpcBrainFieldDrive) == 0x000002, "Wrong size on BPI_PlayerInterface_C_SetNpcBrainFieldDrive");
static_assert(offsetof(BPI_PlayerInterface_C_SetNpcBrainFieldDrive, bDrive) == 0x000000, "Member 'BPI_PlayerInterface_C_SetNpcBrainFieldDrive::bDrive' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_SetNpcBrainFieldDrive, bDummy) == 0x000001, "Member 'BPI_PlayerInterface_C_SetNpcBrainFieldDrive::bDummy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.OnAnimNotify_EnpcSAS
// 0x0002 (0x0002 - 0x0000)
struct BPI_PlayerInterface_C_OnAnimNotify_EnpcSAS final
{
public:
	E_SASKind                                     Kind;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDummy;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_PlayerInterface_C_OnAnimNotify_EnpcSAS) == 0x000001, "Wrong alignment on BPI_PlayerInterface_C_OnAnimNotify_EnpcSAS");
static_assert(sizeof(BPI_PlayerInterface_C_OnAnimNotify_EnpcSAS) == 0x000002, "Wrong size on BPI_PlayerInterface_C_OnAnimNotify_EnpcSAS");
static_assert(offsetof(BPI_PlayerInterface_C_OnAnimNotify_EnpcSAS, Kind) == 0x000000, "Member 'BPI_PlayerInterface_C_OnAnimNotify_EnpcSAS::Kind' has a wrong offset!");
static_assert(offsetof(BPI_PlayerInterface_C_OnAnimNotify_EnpcSAS, bDummy) == 0x000001, "Member 'BPI_PlayerInterface_C_OnAnimNotify_EnpcSAS::bDummy' has a wrong offset!");

// Function BPI_PlayerInterface.BPI_PlayerInterface_C.BeginEnpcSAS
// 0x0002 (0x0002 - 0x0000)
struct BPI_PlayerInterface_C_BeginEnpcSAS final
{
public:
