#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_SASInterface

#include "Basic.hpp"

#include "FSASPsychicParam_structs.hpp"
#include "FSASStealthParam_structs.hpp"
#include "FSASCopyParam_structs.hpp"
#include "E_SASKind_structs.hpp"
#include "FSASCommand_structs.hpp"
#include "FSASTelepoParam_structs.hpp"
#include "FSASSeeThroughParam_structs.hpp"
#include "FSASMetalParam_structs.hpp"
#include "FSASFireParam_structs.hpp"
#include "FSASElectricParam_structs.hpp"
#include "AcceleratorParam_structs.hpp"


namespace SDK::Params
{

// Function BPI_SASInterface.BPI_SASInterface_C.OnAcceleratorStart
// 0x0020 (0x0020 - 0x0000)
struct BPI_SASInterface_C_OnAcceleratorStart final
{
public:
	struct FAcceleratorParam                      Parameter;                                         // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39CC[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHologram;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_SASInterface_C_OnAcceleratorStart) == 0x000008, "Wrong alignment on BPI_SASInterface_C_OnAcceleratorStart");
static_assert(sizeof(BPI_SASInterface_C_OnAcceleratorStart) == 0x000020, "Wrong size on BPI_SASInterface_C_OnAcceleratorStart");
static_assert(offsetof(BPI_SASInterface_C_OnAcceleratorStart, Parameter) == 0x000000, "Member 'BPI_SASInterface_C_OnAcceleratorStart::Parameter' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnAcceleratorStart, Owner) == 0x000010, "Member 'BPI_SASInterface_C_OnAcceleratorStart::Owner' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnAcceleratorStart, bHologram) == 0x000018, "Member 'BPI_SASInterface_C_OnAcceleratorStart::bHologram' has a wrong offset!");

// Function BPI_SASInterface.BPI_SASInterface_C.OnAcceleratorEnd
// 0x0020 (0x0020 - 0x0000)
struct BPI_SASInterface_C_OnAcceleratorEnd final
{
public:
	struct FAcceleratorParam                      Parameter;                                         // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39CD[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHologram;                                         // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_SASInterface_C_OnAcceleratorEnd) == 0x000008, "Wrong alignment on BPI_SASInterface_C_OnAcceleratorEnd");
static_assert(sizeof(BPI_SASInterface_C_OnAcceleratorEnd) == 0x000020, "Wrong size on BPI_SASInterface_C_OnAcceleratorEnd");
static_assert(offsetof(BPI_SASInterface_C_OnAcceleratorEnd, Parameter) == 0x000000, "Member 'BPI_SASInterface_C_OnAcceleratorEnd::Parameter' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnAcceleratorEnd, Owner) == 0x000010, "Member 'BPI_SASInterface_C_OnAcceleratorEnd::Owner' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnAcceleratorEnd, RemainTime) == 0x000018, "Member 'BPI_SASInterface_C_OnAcceleratorEnd::RemainTime' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnAcceleratorEnd, bHologram) == 0x00001C, "Member 'BPI_SASInterface_C_OnAcceleratorEnd::bHologram' has a wrong offset!");

// Function BPI_SASInterface.BPI_SASInterface_C.OnElectricStart
// 0x0010 (0x0010 - 0x0000)
struct BPI_SASInterface_C_OnElectricStart final
{
public:
	struct FFSASElectricParam                     Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39CE[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_SASInterface_C_OnElectricStart) == 0x000008, "Wrong alignment on BPI_SASInterface_C_OnElectricStart");
static_assert(sizeof(BPI_SASInterface_C_OnElectricStart) == 0x000010, "Wrong size on BPI_SASInterface_C_OnElectricStart");
static_assert(offsetof(BPI_SASInterface_C_OnElectricStart, Param) == 0x000000, "Member 'BPI_SASInterface_C_OnElectricStart::Param' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnElectricStart, Owner) == 0x000008, "Member 'BPI_SASInterface_C_OnElectricStart::Owner' has a wrong offset!");

// Function BPI_SASInterface.BPI_SASInterface_C.OnElectricEnd
// 0x0018 (0x0018 - 0x0000)
struct BPI_SASInterface_C_OnElectricEnd final
{
public:
	struct FFSASElectricParam                     Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39CF[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_SASInterface_C_OnElectricEnd) == 0x000008, "Wrong alignment on BPI_SASInterface_C_OnElectricEnd");
static_assert(sizeof(BPI_SASInterface_C_OnElectricEnd) == 0x000018, "Wrong size on BPI_SASInterface_C_OnElectricEnd");
static_assert(offsetof(BPI_SASInterface_C_OnElectricEnd, Param) == 0x000000, "Member 'BPI_SASInterface_C_OnElectricEnd::Param' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnElectricEnd, Owner) == 0x000008, "Member 'BPI_SASInterface_C_OnElectricEnd::Owner' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnElectricEnd, RemainTime) == 0x000010, "Member 'BPI_SASInterface_C_OnElectricEnd::RemainTime' has a wrong offset!");

// Function BPI_SASInterface.BPI_SASInterface_C.OnFireStart
// 0x0010 (0x0010 - 0x0000)
struct BPI_SASInterface_C_OnFireStart final
{
public:
	struct FFSASFireParam                         Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39D0[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_SASInterface_C_OnFireStart) == 0x000008, "Wrong alignment on BPI_SASInterface_C_OnFireStart");
static_assert(sizeof(BPI_SASInterface_C_OnFireStart) == 0x000010, "Wrong size on BPI_SASInterface_C_OnFireStart");
static_assert(offsetof(BPI_SASInterface_C_OnFireStart, Param) == 0x000000, "Member 'BPI_SASInterface_C_OnFireStart::Param' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnFireStart, Owner) == 0x000008, "Member 'BPI_SASInterface_C_OnFireStart::Owner' has a wrong offset!");

// Function BPI_SASInterface.BPI_SASInterface_C.OnFireEnd
// 0x0018 (0x0018 - 0x0000)
struct BPI_SASInterface_C_OnFireEnd final
{
public:
	struct FFSASFireParam                         Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39D1[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_SASInterface_C_OnFireEnd) == 0x000008, "Wrong alignment on BPI_SASInterface_C_OnFireEnd");
static_assert(sizeof(BPI_SASInterface_C_OnFireEnd) == 0x000018, "Wrong size on BPI_SASInterface_C_OnFireEnd");
static_assert(offsetof(BPI_SASInterface_C_OnFireEnd, Param) == 0x000000, "Member 'BPI_SASInterface_C_OnFireEnd::Param' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnFireEnd, Owner) == 0x000008, "Member 'BPI_SASInterface_C_OnFireEnd::Owner' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnFireEnd, RemainTime) == 0x000010, "Member 'BPI_SASInterface_C_OnFireEnd::RemainTime' has a wrong offset!");

// Function BPI_SASInterface.BPI_SASInterface_C.OnMetalStart
// 0x0010 (0x0010 - 0x0000)
struct BPI_SASInterface_C_OnMetalStart final
{
public:
	struct FFSASMetalParam                        Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39D2[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_SASInterface_C_OnMetalStart) == 0x000008, "Wrong alignment on BPI_SASInterface_C_OnMetalStart");
static_assert(sizeof(BPI_SASInterface_C_OnMetalStart) == 0x000010, "Wrong size on BPI_SASInterface_C_OnMetalStart");
static_assert(offsetof(BPI_SASInterface_C_OnMetalStart, Param) == 0x000000, "Member 'BPI_SASInterface_C_OnMetalStart::Param' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnMetalStart, Owner) == 0x000008, "Member 'BPI_SASInterface_C_OnMetalStart::Owner' has a wrong offset!");

// Function BPI_SASInterface.BPI_SASInterface_C.OnMetalEnd
// 0x0018 (0x0018 - 0x0000)
struct BPI_SASInterface_C_OnMetalEnd final
{
public:
	struct FFSASMetalParam                        Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39D3[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_SASInterface_C_OnMetalEnd) == 0x000008, "Wrong alignment on BPI_SASInterface_C_OnMetalEnd");
static_assert(sizeof(BPI_SASInterface_C_OnMetalEnd) == 0x000018, "Wrong size on BPI_SASInterface_C_OnMetalEnd");
static_assert(offsetof(BPI_SASInterface_C_OnMetalEnd, Param) == 0x000000, "Member 'BPI_SASInterface_C_OnMetalEnd::Param' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnMetalEnd, Owner) == 0x000008, "Member 'BPI_SASInterface_C_OnMetalEnd::Owner' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnMetalEnd, RemainTime) == 0x000010, "Member 'BPI_SASInterface_C_OnMetalEnd::RemainTime' has a wrong offset!");

// Function BPI_SASInterface.BPI_SASInterface_C.OnSeeThroughStart
// 0x0010 (0x0010 - 0x0000)
struct BPI_SASInterface_C_OnSeeThroughStart final
{
public:
	struct FFSASSeeThroughParam                   Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39D4[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_SASInterface_C_OnSeeThroughStart) == 0x000008, "Wrong alignment on BPI_SASInterface_C_OnSeeThroughStart");
static_assert(sizeof(BPI_SASInterface_C_OnSeeThroughStart) == 0x000010, "Wrong size on BPI_SASInterface_C_OnSeeThroughStart");
static_assert(offsetof(BPI_SASInterface_C_OnSeeThroughStart, Param) == 0x000000, "Member 'BPI_SASInterface_C_OnSeeThroughStart::Param' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnSeeThroughStart, Owner) == 0x000008, "Member 'BPI_SASInterface_C_OnSeeThroughStart::Owner' has a wrong offset!");

// Function BPI_SASInterface.BPI_SASInterface_C.OnSeeThroughEnd
// 0x0018 (0x0018 - 0x0000)
struct BPI_SASInterface_C_OnSeeThroughEnd final
{
public:
	struct FFSASSeeThroughParam                   Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39D5[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_SASInterface_C_OnSeeThroughEnd) == 0x000008, "Wrong alignment on BPI_SASInterface_C_OnSeeThroughEnd");
static_assert(sizeof(BPI_SASInterface_C_OnSeeThroughEnd) == 0x000018, "Wrong size on BPI_SASInterface_C_OnSeeThroughEnd");
static_assert(offsetof(BPI_SASInterface_C_OnSeeThroughEnd, Param) == 0x000000, "Member 'BPI_SASInterface_C_OnSeeThroughEnd::Param' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnSeeThroughEnd, Owner) == 0x000008, "Member 'BPI_SASInterface_C_OnSeeThroughEnd::Owner' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnSeeThroughEnd, RemainTime) == 0x000010, "Member 'BPI_SASInterface_C_OnSeeThroughEnd::RemainTime' has a wrong offset!");

// Function BPI_SASInterface.BPI_SASInterface_C.OnTelepoStart
// 0x0010 (0x0010 - 0x0000)
struct BPI_SASInterface_C_OnTelepoStart final
{
public:
	struct FFSASTelepoParam                       Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39D6[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_SASInterface_C_OnTelepoStart) == 0x000008, "Wrong alignment on BPI_SASInterface_C_OnTelepoStart");
static_assert(sizeof(BPI_SASInterface_C_OnTelepoStart) == 0x000010, "Wrong size on BPI_SASInterface_C_OnTelepoStart");
static_assert(offsetof(BPI_SASInterface_C_OnTelepoStart, Param) == 0x000000, "Member 'BPI_SASInterface_C_OnTelepoStart::Param' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnTelepoStart, Owner) == 0x000008, "Member 'BPI_SASInterface_C_OnTelepoStart::Owner' has a wrong offset!");

// Function BPI_SASInterface.BPI_SASInterface_C.OnTelepoEnd
// 0x0018 (0x0018 - 0x0000)
struct BPI_SASInterface_C_OnTelepoEnd final
{
public:
	struct FFSASTelepoParam                       Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39D7[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_SASInterface_C_OnTelepoEnd) == 0x000008, "Wrong alignment on BPI_SASInterface_C_OnTelepoEnd");
static_assert(sizeof(BPI_SASInterface_C_OnTelepoEnd) == 0x000018, "Wrong size on BPI_SASInterface_C_OnTelepoEnd");
static_assert(offsetof(BPI_SASInterface_C_OnTelepoEnd, Param) == 0x000000, "Member 'BPI_SASInterface_C_OnTelepoEnd::Param' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnTelepoEnd, Owner) == 0x000008, "Member 'BPI_SASInterface_C_OnTelepoEnd::Owner' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnTelepoEnd, RemainTime) == 0x000010, "Member 'BPI_SASInterface_C_OnTelepoEnd::RemainTime' has a wrong offset!");

// Function BPI_SASInterface.BPI_SASInterface_C.OnStealthStart
// 0x0010 (0x0010 - 0x0000)
struct BPI_SASInterface_C_OnStealthStart final
{
public:
	struct FFSASStealthParam                      Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39D8[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_SASInterface_C_OnStealthStart) == 0x000008, "Wrong alignment on BPI_SASInterface_C_OnStealthStart");
static_assert(sizeof(BPI_SASInterface_C_OnStealthStart) == 0x000010, "Wrong size on BPI_SASInterface_C_OnStealthStart");
static_assert(offsetof(BPI_SASInterface_C_OnStealthStart, Param) == 0x000000, "Member 'BPI_SASInterface_C_OnStealthStart::Param' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnStealthStart, Owner) == 0x000008, "Member 'BPI_SASInterface_C_OnStealthStart::Owner' has a wrong offset!");

// Function BPI_SASInterface.BPI_SASInterface_C.OnStealthEnd
// 0x0018 (0x0018 - 0x0000)
struct BPI_SASInterface_C_OnStealthEnd final
{
public:
	struct FFSASStealthParam                      Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39D9[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_SASInterface_C_OnStealthEnd) == 0x000008, "Wrong alignment on BPI_SASInterface_C_OnStealthEnd");
static_assert(sizeof(BPI_SASInterface_C_OnStealthEnd) == 0x000018, "Wrong size on BPI_SASInterface_C_OnStealthEnd");
static_assert(offsetof(BPI_SASInterface_C_OnStealthEnd, Param) == 0x000000, "Member 'BPI_SASInterface_C_OnStealthEnd::Param' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnStealthEnd, Owner) == 0x000008, "Member 'BPI_SASInterface_C_OnStealthEnd::Owner' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnStealthEnd, RemainTime) == 0x000010, "Member 'BPI_SASInterface_C_OnStealthEnd::RemainTime' has a wrong offset!");

// Function BPI_SASInterface.BPI_SASInterface_C.OnCopyStart
// 0x0010 (0x0010 - 0x0000)
struct BPI_SASInterface_C_OnCopyStart final
{
public:
	struct FFSASCopyParam                         Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39DA[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_SASInterface_C_OnCopyStart) == 0x000008, "Wrong alignment on BPI_SASInterface_C_OnCopyStart");
static_assert(sizeof(BPI_SASInterface_C_OnCopyStart) == 0x000010, "Wrong size on BPI_SASInterface_C_OnCopyStart");
static_assert(offsetof(BPI_SASInterface_C_OnCopyStart, Param) == 0x000000, "Member 'BPI_SASInterface_C_OnCopyStart::Param' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnCopyStart, Owner) == 0x000008, "Member 'BPI_SASInterface_C_OnCopyStart::Owner' has a wrong offset!");

// Function BPI_SASInterface.BPI_SASInterface_C.OnCopyEnd
// 0x0018 (0x0018 - 0x0000)
struct BPI_SASInterface_C_OnCopyEnd final
{
public:
	struct FFSASCopyParam                         Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39DB[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_SASInterface_C_OnCopyEnd) == 0x000008, "Wrong alignment on BPI_SASInterface_C_OnCopyEnd");
static_assert(sizeof(BPI_SASInterface_C_OnCopyEnd) == 0x000018, "Wrong size on BPI_SASInterface_C_OnCopyEnd");
static_assert(offsetof(BPI_SASInterface_C_OnCopyEnd, Param) == 0x000000, "Member 'BPI_SASInterface_C_OnCopyEnd::Param' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnCopyEnd, Owner) == 0x000008, "Member 'BPI_SASInterface_C_OnCopyEnd::Owner' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnCopyEnd, RemainTime) == 0x000010, "Member 'BPI_SASInterface_C_OnCopyEnd::RemainTime' has a wrong offset!");

// Function BPI_SASInterface.BPI_SASInterface_C.SAS_CommonStart
// 0x0038 (0x0038 - 0x0000)
struct BPI_SASInterface_C_SAS_CommonStart final
{
public:
	struct FFSASCommand                           SAS_Command;                                       // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_SASInterface_C_SAS_CommonStart) == 0x000008, "Wrong alignment on BPI_SASInterface_C_SAS_CommonStart");
static_assert(sizeof(BPI_SASInterface_C_SAS_CommonStart) == 0x000038, "Wrong size on BPI_SASInterface_C_SAS_CommonStart");
static_assert(offsetof(BPI_SASInterface_C_SAS_CommonStart, SAS_Command) == 0x000000, "Member 'BPI_SASInterface_C_SAS_CommonStart::SAS_Command' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_SAS_CommonStart, Dummy) == 0x000030, "Member 'BPI_SASInterface_C_SAS_CommonStart::Dummy' has a wrong offset!");

// Function BPI_SASInterface.BPI_SASInterface_C.SAS_CommonEnd
// 0x0008 (0x0008 - 0x0000)
struct BPI_SASInterface_C_SAS_CommonEnd final
{
public:
	E_SASKind                                     SAS_Kind;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCancelSASCost;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDummy;                                            // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39DC[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RemainTime;                                        // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_SASInterface_C_SAS_CommonEnd) == 0x000004, "Wrong alignment on BPI_SASInterface_C_SAS_CommonEnd");
static_assert(sizeof(BPI_SASInterface_C_SAS_CommonEnd) == 0x000008, "Wrong size on BPI_SASInterface_C_SAS_CommonEnd");
static_assert(offsetof(BPI_SASInterface_C_SAS_CommonEnd, SAS_Kind) == 0x000000, "Member 'BPI_SASInterface_C_SAS_CommonEnd::SAS_Kind' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_SAS_CommonEnd, bCancelSASCost) == 0x000001, "Member 'BPI_SASInterface_C_SAS_CommonEnd::bCancelSASCost' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_SAS_CommonEnd, bDummy) == 0x000002, "Member 'BPI_SASInterface_C_SAS_CommonEnd::bDummy' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_SAS_CommonEnd, RemainTime) == 0x000004, "Member 'BPI_SASInterface_C_SAS_CommonEnd::RemainTime' has a wrong offset!");

// Function BPI_SASInterface.BPI_SASInterface_C.OnPsychicStart
// 0x0010 (0x0010 - 0x0000)
struct BPI_SASInterface_C_OnPsychicStart final
{
public:
	struct FFSASPsychicParam                      Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39DD[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_SASInterface_C_OnPsychicStart) == 0x000008, "Wrong alignment on BPI_SASInterface_C_OnPsychicStart");
static_assert(sizeof(BPI_SASInterface_C_OnPsychicStart) == 0x000010, "Wrong size on BPI_SASInterface_C_OnPsychicStart");
static_assert(offsetof(BPI_SASInterface_C_OnPsychicStart, Param) == 0x000000, "Member 'BPI_SASInterface_C_OnPsychicStart::Param' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnPsychicStart, Owner) == 0x000008, "Member 'BPI_SASInterface_C_OnPsychicStart::Owner' has a wrong offset!");

// Function BPI_SASInterface.BPI_SASInterface_C.OnPsychicEnd
// 0x0018 (0x0018 - 0x0000)
struct BPI_SASInterface_C_OnPsychicEnd final
{
public:
	struct FFSASPsychicParam                      Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39DE[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_SASInterface_C_OnPsychicEnd) == 0x000008, "Wrong alignment on BPI_SASInterface_C_OnPsychicEnd");
static_assert(sizeof(BPI_SASInterface_C_OnPsychicEnd) == 0x000018, "Wrong size on BPI_SASInterface_C_OnPsychicEnd");
static_assert(offsetof(BPI_SASInterface_C_OnPsychicEnd, Param) == 0x000000, "Member 'BPI_SASInterface_C_OnPsychicEnd::Param' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnPsychicEnd, Owner) == 0x000008, "Member 'BPI_SASInterface_C_OnPsychicEnd::Owner' has a wrong offset!");
static_assert(offsetof(BPI_SASInterface_C_OnPsychicEnd, RemainTime) == 0x000010, "Member 'BPI_SASInterface_C_OnPsychicEnd::RemainTime' has a wrong offset!");

// Function BPI_SASInterface.BPI_SASInterface_C.IsAcceleratorValid
// 0x0001 (0x0001 - 0x0000)
struct BPI_SASInterface_C_IsAcceleratorValid final
{
public:
	bool                                          Valid;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_SASInterface_C_IsAcceleratorValid) == 0x000001, "Wrong alignment on BPI_SASInterface_C_IsAcceleratorValid");
static_assert(sizeof(BPI_SASInterface_C_IsAcceleratorValid) == 0x000001, "Wrong size on BPI_SASInterface_C_IsAcceleratorValid");
static_assert(offsetof(BPI_SASInterface_C_IsAcceleratorValid, Valid) == 0x000000, "Member 'BPI_SASInterface_C_IsAcceleratorValid::Valid' has a wrong offset!");

// Function BPI_SASInterface.BPI_SASInterface_C.IsAccelerating
// 0x0001 (0x0001 - 0x0000)
struct BPI_SASInterface_C_IsAccelerating final
{
public:
	bool                                          Accelerating;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_SASInterface_C_IsAccelerating) == 0x000001, "Wrong alignment on BPI_SASInterface_C_IsAccelerating");
static_assert(sizeof(BPI_SASInterface_C_IsAccelerating) == 0x000001, "Wrong size on BPI_SASInterface_C_IsAccelerating");
static_assert(offsetof(BPI_SASInterface_C_IsAccelerating, Accelerating) == 0x000000, "Member 'BPI_SASInterface_C_IsAccelerating::Accelerating' has a wrong offset!");

}

