#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_LevelManager

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_LevelManager.BPI_LevelManager_C.AreaNameToID
// 0x0014 (0x0014 - 0x0000)
struct BPI_LevelManager_C_AreaNameToID final
{
public:
	class FName                                   AreaName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocationId;                                        // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AreaId;                                            // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         VariationID;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_LevelManager_C_AreaNameToID) == 0x000004, "Wrong alignment on BPI_LevelManager_C_AreaNameToID");
static_assert(sizeof(BPI_LevelManager_C_AreaNameToID) == 0x000014, "Wrong size on BPI_LevelManager_C_AreaNameToID");
static_assert(offsetof(BPI_LevelManager_C_AreaNameToID, AreaName) == 0x000000, "Member 'BPI_LevelManager_C_AreaNameToID::AreaName' has a wrong offset!");
static_assert(offsetof(BPI_LevelManager_C_AreaNameToID, LocationId) == 0x000008, "Member 'BPI_LevelManager_C_AreaNameToID::LocationId' has a wrong offset!");
static_assert(offsetof(BPI_LevelManager_C_AreaNameToID, AreaId) == 0x00000C, "Member 'BPI_LevelManager_C_AreaNameToID::AreaId' has a wrong offset!");
static_assert(offsetof(BPI_LevelManager_C_AreaNameToID, VariationID) == 0x000010, "Member 'BPI_LevelManager_C_AreaNameToID::VariationID' has a wrong offset!");

}

