#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_Mesh

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_Mesh.BPI_Mesh_C.GetStaticMesh
// 0x0008 (0x0008 - 0x0000)
struct BPI_Mesh_C_GetStaticMesh final
{
public:
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Mesh_C_GetStaticMesh) == 0x000008, "Wrong alignment on BPI_Mesh_C_GetStaticMesh");
static_assert(sizeof(BPI_Mesh_C_GetStaticMesh) == 0x000008, "Wrong size on BPI_Mesh_C_GetStaticMesh");
static_assert(offsetof(BPI_Mesh_C_GetStaticMesh, StaticMesh) == 0x000000, "Member 'BPI_Mesh_C_GetStaticMesh::StaticMesh' has a wrong offset!");

// Function BPI_Mesh.BPI_Mesh_C.GetSkeletalMesh
// 0x0008 (0x0008 - 0x0000)
struct BPI_Mesh_C_GetSkeletalMesh final
{
public:
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Mesh_C_GetSkeletalMesh) == 0x000008, "Wrong alignment on BPI_Mesh_C_GetSkeletalMesh");
static_assert(sizeof(BPI_Mesh_C_GetSkeletalMesh) == 0x000008, "Wrong size on BPI_Mesh_C_GetSkeletalMesh");
static_assert(offsetof(BPI_Mesh_C_GetSkeletalMesh, SkeletalMesh) == 0x000000, "Member 'BPI_Mesh_C_GetSkeletalMesh::SkeletalMesh' has a wrong offset!");

}

