#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_BackGroundEffect

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_BackGroundEffect.BPI_BackGroundEffect_C.CalledAtEventEnd
// 0x0018 (0x0018 - 0x0000)
struct BPI_BackGroundEffect_C_CalledAtEventEnd final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BackGroundEffect_C_CalledAtEventEnd) == 0x000008, "Wrong alignment on BPI_BackGroundEffect_C_CalledAtEventEnd");
static_assert(sizeof(BPI_BackGroundEffect_C_CalledAtEventEnd) == 0x000018, "Wrong size on BPI_BackGroundEffect_C_CalledAtEventEnd");
static_assert(offsetof(BPI_BackGroundEffect_C_CalledAtEventEnd, EventName) == 0x000000, "Member 'BPI_BackGroundEffect_C_CalledAtEventEnd::EventName' has a wrong offset!");
static_assert(offsetof(BPI_BackGroundEffect_C_CalledAtEventEnd, Dummy) == 0x000010, "Member 'BPI_BackGroundEffect_C_CalledAtEventEnd::Dummy' has a wrong offset!");

// Function BPI_BackGroundEffect.BPI_BackGroundEffect_C.CalledAtEventStart
// 0x0018 (0x0018 - 0x0000)
struct BPI_BackGroundEffect_C_CalledAtEventStart final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Dummy;                                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BackGroundEffect_C_CalledAtEventStart) == 0x000008, "Wrong alignment on BPI_BackGroundEffect_C_CalledAtEventStart");
static_assert(sizeof(BPI_BackGroundEffect_C_CalledAtEventStart) == 0x000018, "Wrong size on BPI_BackGroundEffect_C_CalledAtEventStart");
static_assert(offsetof(BPI_BackGroundEffect_C_CalledAtEventStart, EventName) == 0x000000, "Member 'BPI_BackGroundEffect_C_CalledAtEventStart::EventName' has a wrong offset!");
static_assert(offsetof(BPI_BackGroundEffect_C_CalledAtEventStart, Dummy) == 0x000010, "Member 'BPI_BackGroundEffect_C_CalledAtEventStart::Dummy' has a wrong offset!");

// Function BPI_BackGroundEffect.BPI_BackGroundEffect_C.RegistEffectBackGround
// 0x0010 (0x0010 - 0x0000)
struct BPI_BackGroundEffect_C_RegistEffectBackGround final
{
public:
	class ABP_EffectBackground_C*                 EffectBackground;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ArrayNumber;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BackGroundEffect_C_RegistEffectBackGround) == 0x000008, "Wrong alignment on BPI_BackGroundEffect_C_RegistEffectBackGround");
static_assert(sizeof(BPI_BackGroundEffect_C_RegistEffectBackGround) == 0x000010, "Wrong size on BPI_BackGroundEffect_C_RegistEffectBackGround");
static_assert(offsetof(BPI_BackGroundEffect_C_RegistEffectBackGround, EffectBackground) == 0x000000, "Member 'BPI_BackGroundEffect_C_RegistEffectBackGround::EffectBackground' has a wrong offset!");
static_assert(offsetof(BPI_BackGroundEffect_C_RegistEffectBackGround, ArrayNumber) == 0x000008, "Member 'BPI_BackGroundEffect_C_RegistEffectBackGround::ArrayNumber' has a wrong offset!");

// Function BPI_BackGroundEffect.BPI_BackGroundEffect_C.ResetParticleArray
// 0x0001 (0x0001 - 0x0000)
struct BPI_BackGroundEffect_C_ResetParticleArray final
{
public:
	bool                                          Dummy;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BackGroundEffect_C_ResetParticleArray) == 0x000001, "Wrong alignment on BPI_BackGroundEffect_C_ResetParticleArray");
static_assert(sizeof(BPI_BackGroundEffect_C_ResetParticleArray) == 0x000001, "Wrong size on BPI_BackGroundEffect_C_ResetParticleArray");
static_assert(offsetof(BPI_BackGroundEffect_C_ResetParticleArray, Dummy) == 0x000000, "Member 'BPI_BackGroundEffect_C_ResetParticleArray::Dummy' has a wrong offset!");

// Function BPI_BackGroundEffect.BPI_BackGroundEffect_C.RegistEffectBackGroundMother
// 0x0010 (0x0010 - 0x0000)
struct BPI_BackGroundEffect_C_RegistEffectBackGroundMother final
{
public:
	class ABP_EffectBackGroundMother_C*           MotherActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ArrayNumber;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BackGroundEffect_C_RegistEffectBackGroundMother) == 0x000008, "Wrong alignment on BPI_BackGroundEffect_C_RegistEffectBackGroundMother");
static_assert(sizeof(BPI_BackGroundEffect_C_RegistEffectBackGroundMother) == 0x000010, "Wrong size on BPI_BackGroundEffect_C_RegistEffectBackGroundMother");
static_assert(offsetof(BPI_BackGroundEffect_C_RegistEffectBackGroundMother, MotherActor) == 0x000000, "Member 'BPI_BackGroundEffect_C_RegistEffectBackGroundMother::MotherActor' has a wrong offset!");
static_assert(offsetof(BPI_BackGroundEffect_C_RegistEffectBackGroundMother, ArrayNumber) == 0x000008, "Member 'BPI_BackGroundEffect_C_RegistEffectBackGroundMother::ArrayNumber' has a wrong offset!");

// Function BPI_BackGroundEffect.BPI_BackGroundEffect_C.UnregistEffectBackGround
// 0x0008 (0x0008 - 0x0000)
struct BPI_BackGroundEffect_C_UnregistEffectBackGround final
{
public:
	class ABP_EffectBackground_C*                 EffectBackground;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BackGroundEffect_C_UnregistEffectBackGround) == 0x000008, "Wrong alignment on BPI_BackGroundEffect_C_UnregistEffectBackGround");
static_assert(sizeof(BPI_BackGroundEffect_C_UnregistEffectBackGround) == 0x000008, "Wrong size on BPI_BackGroundEffect_C_UnregistEffectBackGround");
static_assert(offsetof(BPI_BackGroundEffect_C_UnregistEffectBackGround, EffectBackground) == 0x000000, "Member 'BPI_BackGroundEffect_C_UnregistEffectBackGround::EffectBackground' has a wrong offset!");

// Function BPI_BackGroundEffect.BPI_BackGroundEffect_C.UnregistEffectBackGroundMother
// 0x0008 (0x0008 - 0x0000)
struct BPI_BackGroundEffect_C_UnregistEffectBackGroundMother final
{
public:
	class ABP_EffectBackGroundMother_C*           MotherActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BackGroundEffect_C_UnregistEffectBackGroundMother) == 0x000008, "Wrong alignment on BPI_BackGroundEffect_C_UnregistEffectBackGroundMother");
static_assert(sizeof(BPI_BackGroundEffect_C_UnregistEffectBackGroundMother) == 0x000008, "Wrong size on BPI_BackGroundEffect_C_UnregistEffectBackGroundMother");
static_assert(offsetof(BPI_BackGroundEffect_C_UnregistEffectBackGroundMother, MotherActor) == 0x000000, "Member 'BPI_BackGroundEffect_C_UnregistEffectBackGroundMother::MotherActor' has a wrong offset!");

}

