#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPSpecialCaptureActor

#include "Basic.hpp"

#include "ERenderTargetType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPSpecialCaptureActor.BPSpecialCaptureActor_C.ExecuteUbergraph_BPSpecialCaptureActor
// 0x00D0 (0x00D0 - 0x0000)
struct BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A10[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A11[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventCaptureCamera_C*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A12[0x8];                                     // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A13[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSLevelSequenceActor*                  CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A14[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetBP_static_pl_AsCharacter;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_static_pl_C*                        K2Node_DynamicCast_AsBP_Static_Pl;                 // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor) == 0x000010, "Wrong alignment on BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor");
static_assert(sizeof(BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor) == 0x0000D0, "Wrong size on BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor");
static_assert(offsetof(BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor, EntryPoint) == 0x000000, "Member 'BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor, CallFunc_MakeLiteralByte_ReturnValue) == 0x000040, "Member 'BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000048, "Member 'BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor, CallFunc_FinishSpawningActor_ReturnValue) == 0x000050, "Member 'BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor, CallFunc_MakeTransform_ReturnValue_1) == 0x000060, "Member 'BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000090, "Member 'BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0000A0, "Member 'BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor, CallFunc_IsValid_ReturnValue_1) == 0x0000A8, "Member 'BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor, CallFunc_GetBP_static_pl_AsCharacter) == 0x0000B0, "Member 'BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor::CallFunc_GetBP_static_pl_AsCharacter' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor, K2Node_DynamicCast_AsBP_Static_Pl) == 0x0000B8, "Member 'BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor::K2Node_DynamicCast_AsBP_Static_Pl' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'BPSpecialCaptureActor_C_ExecuteUbergraph_BPSpecialCaptureActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BPSpecialCaptureActor.BPSpecialCaptureActor_C.SettingSpecialCapture
// 0x00E8 (0x00E8 - 0x0000)
struct BPSpecialCaptureActor_C_SettingSpecialCapture final
{
public:
	int32                                         BoardMeshIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A15[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetBP_static_pl_AsCharacter;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetBP_static_pl_AsCharacter_1;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A16[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetBP_static_pl_AsCharacter_2;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A17[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorRelativeRotation_SweepHitResult; // 0x002C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_6A18[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A19[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPSpecialCaptureActor_C_SettingSpecialCapture) == 0x000008, "Wrong alignment on BPSpecialCaptureActor_C_SettingSpecialCapture");
static_assert(sizeof(BPSpecialCaptureActor_C_SettingSpecialCapture) == 0x0000E8, "Wrong size on BPSpecialCaptureActor_C_SettingSpecialCapture");
static_assert(offsetof(BPSpecialCaptureActor_C_SettingSpecialCapture, BoardMeshIndex) == 0x000000, "Member 'BPSpecialCaptureActor_C_SettingSpecialCapture::BoardMeshIndex' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_SettingSpecialCapture, CallFunc_GetBP_static_pl_AsCharacter) == 0x000008, "Member 'BPSpecialCaptureActor_C_SettingSpecialCapture::CallFunc_GetBP_static_pl_AsCharacter' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_SettingSpecialCapture, CallFunc_GetBP_static_pl_AsCharacter_1) == 0x000010, "Member 'BPSpecialCaptureActor_C_SettingSpecialCapture::CallFunc_GetBP_static_pl_AsCharacter_1' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_SettingSpecialCapture, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BPSpecialCaptureActor_C_SettingSpecialCapture::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_SettingSpecialCapture, CallFunc_GetBP_static_pl_AsCharacter_2) == 0x000020, "Member 'BPSpecialCaptureActor_C_SettingSpecialCapture::CallFunc_GetBP_static_pl_AsCharacter_2' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_SettingSpecialCapture, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'BPSpecialCaptureActor_C_SettingSpecialCapture::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_SettingSpecialCapture, CallFunc_K2_SetActorRelativeRotation_SweepHitResult) == 0x00002C, "Member 'BPSpecialCaptureActor_C_SettingSpecialCapture::CallFunc_K2_SetActorRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_SettingSpecialCapture, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000B8, "Member 'BPSpecialCaptureActor_C_SettingSpecialCapture::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_SettingSpecialCapture, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'BPSpecialCaptureActor_C_SettingSpecialCapture::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_SettingSpecialCapture, CallFunc_IsValid_ReturnValue_2) == 0x0000C8, "Member 'BPSpecialCaptureActor_C_SettingSpecialCapture::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_SettingSpecialCapture, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0000D0, "Member 'BPSpecialCaptureActor_C_SettingSpecialCapture::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_SettingSpecialCapture, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'BPSpecialCaptureActor_C_SettingSpecialCapture::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_SettingSpecialCapture, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000E0, "Member 'BPSpecialCaptureActor_C_SettingSpecialCapture::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function BPSpecialCaptureActor.BPSpecialCaptureActor_C.SettingSpecialCamera
// 0x0120 (0x0120 - 0x0000)
struct BPSpecialCaptureActor_C_SettingSpecialCamera final
{
public:
	struct FTransform                             CameraTransform;                                   // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         CameraFov;                                         // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A1A[0x8];                                     // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0090(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BPSpecialCaptureActor_C_SettingSpecialCamera) == 0x000010, "Wrong alignment on BPSpecialCaptureActor_C_SettingSpecialCamera");
static_assert(sizeof(BPSpecialCaptureActor_C_SettingSpecialCamera) == 0x000120, "Wrong size on BPSpecialCaptureActor_C_SettingSpecialCamera");
static_assert(offsetof(BPSpecialCaptureActor_C_SettingSpecialCamera, CameraTransform) == 0x000000, "Member 'BPSpecialCaptureActor_C_SettingSpecialCamera::CameraTransform' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_SettingSpecialCamera, CameraFov) == 0x000030, "Member 'BPSpecialCaptureActor_C_SettingSpecialCamera::CameraFov' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_SettingSpecialCamera, CallFunc_BreakTransform_Location) == 0x000034, "Member 'BPSpecialCaptureActor_C_SettingSpecialCamera::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_SettingSpecialCamera, CallFunc_BreakTransform_Rotation) == 0x000040, "Member 'BPSpecialCaptureActor_C_SettingSpecialCamera::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_SettingSpecialCamera, CallFunc_BreakTransform_Scale) == 0x00004C, "Member 'BPSpecialCaptureActor_C_SettingSpecialCamera::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_SettingSpecialCamera, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'BPSpecialCaptureActor_C_SettingSpecialCamera::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_SettingSpecialCamera, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000090, "Member 'BPSpecialCaptureActor_C_SettingSpecialCamera::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");

// Function BPSpecialCaptureActor.BPSpecialCaptureActor_C.SetSpecialRenderTarget
// 0x0018 (0x0018 - 0x0000)
struct BPSpecialCaptureActor_C_SetSpecialRenderTarget final
{
public:
	class ABP_RenderTargetManager_C*              CallFunc_GetRenderTargetManager_Manager;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_GetSpecialCutSceneRenderTarget_RenderTarget; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERenderTargetType                             CallFunc_GetSpecialCutSceneRenderTarget_UsedRenderTargetType; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPSpecialCaptureActor_C_SetSpecialRenderTarget) == 0x000008, "Wrong alignment on BPSpecialCaptureActor_C_SetSpecialRenderTarget");
static_assert(sizeof(BPSpecialCaptureActor_C_SetSpecialRenderTarget) == 0x000018, "Wrong size on BPSpecialCaptureActor_C_SetSpecialRenderTarget");
static_assert(offsetof(BPSpecialCaptureActor_C_SetSpecialRenderTarget, CallFunc_GetRenderTargetManager_Manager) == 0x000000, "Member 'BPSpecialCaptureActor_C_SetSpecialRenderTarget::CallFunc_GetRenderTargetManager_Manager' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_SetSpecialRenderTarget, CallFunc_GetSpecialCutSceneRenderTarget_RenderTarget) == 0x000008, "Member 'BPSpecialCaptureActor_C_SetSpecialRenderTarget::CallFunc_GetSpecialCutSceneRenderTarget_RenderTarget' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_SetSpecialRenderTarget, CallFunc_GetSpecialCutSceneRenderTarget_UsedRenderTargetType) == 0x000010, "Member 'BPSpecialCaptureActor_C_SetSpecialRenderTarget::CallFunc_GetSpecialCutSceneRenderTarget_UsedRenderTargetType' has a wrong offset!");
static_assert(offsetof(BPSpecialCaptureActor_C_SetSpecialRenderTarget, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BPSpecialCaptureActor_C_SetSpecialRenderTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

