#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BrainFieldPsyObjDataTable

#include "Basic.hpp"

#include "BrainFieldPsyObjData_structs.hpp"


namespace SDK
{

// UserDefinedStruct BrainFieldPsyObjDataTable.BrainFieldPsyObjDataTable
// 0x0030 (0x0030 - 0x0000)
struct FBrainFieldPsyObjDataTable final
{
public:
	TArray<struct FBrainFieldPsyObjData>          ThrowList_8_9E8A31984D035807BB560FBF18D375CB;      // 0x0000(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FBrainFieldPsyObjData>          DropList_9_A02D86744F8F1BF8FE0E54957727D2AA;       // 0x0010(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FBrainFieldPsyObjData>          SwingList_10_DD641D4A45CE7161015067ACC9A3DA3D;     // 0x0020(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FBrainFieldPsyObjDataTable) == 0x000008, "Wrong alignment on FBrainFieldPsyObjDataTable");
static_assert(sizeof(FBrainFieldPsyObjDataTable) == 0x000030, "Wrong size on FBrainFieldPsyObjDataTable");
static_assert(offsetof(FBrainFieldPsyObjDataTable, ThrowList_8_9E8A31984D035807BB560FBF18D375CB) == 0x000000, "Member 'FBrainFieldPsyObjDataTable::ThrowList_8_9E8A31984D035807BB560FBF18D375CB' has a wrong offset!");
static_assert(offsetof(FBrainFieldPsyObjDataTable, DropList_9_A02D86744F8F1BF8FE0E54957727D2AA) == 0x000010, "Member 'FBrainFieldPsyObjDataTable::DropList_9_A02D86744F8F1BF8FE0E54957727D2AA' has a wrong offset!");
static_assert(offsetof(FBrainFieldPsyObjDataTable, SwingList_10_DD641D4A45CE7161015067ACC9A3DA3D) == 0x000020, "Member 'FBrainFieldPsyObjDataTable::SwingList_10_DD641D4A45CE7161015067ACC9A3DA3D' has a wrong offset!");

}

