#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_ch_CheckDistanceToPlayer

#include "Basic.hpp"

#include "DecoratorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTD_ch_CheckDistanceToPlayer.BTD_ch_CheckDistanceToPlayer_C
// 0x0010 (0x00B0 - 0x00A0)
class UBTD_ch_CheckDistanceToPlayer_C final : public UDecoratorBase_C
{
public:
	float                                         Distance;                                          // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCheckDistanceZ;                                   // 0x00A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6641[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DistanceZ;                                         // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool PerformConditionCheckAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTD_ch_CheckDistanceToPlayer_C">();
	}
	static class UBTD_ch_CheckDistanceToPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTD_ch_CheckDistanceToPlayer_C>();
	}
};
static_assert(alignof(UBTD_ch_CheckDistanceToPlayer_C) == 0x000008, "Wrong alignment on UBTD_ch_CheckDistanceToPlayer_C");
static_assert(sizeof(UBTD_ch_CheckDistanceToPlayer_C) == 0x0000B0, "Wrong size on UBTD_ch_CheckDistanceToPlayer_C");
static_assert(offsetof(UBTD_ch_CheckDistanceToPlayer_C, Distance) == 0x0000A0, "Member 'UBTD_ch_CheckDistanceToPlayer_C::Distance' has a wrong offset!");
static_assert(offsetof(UBTD_ch_CheckDistanceToPlayer_C, bCheckDistanceZ) == 0x0000A4, "Member 'UBTD_ch_CheckDistanceToPlayer_C::bCheckDistanceZ' has a wrong offset!");
static_assert(offsetof(UBTD_ch_CheckDistanceToPlayer_C, DistanceZ) == 0x0000A8, "Member 'UBTD_ch_CheckDistanceToPlayer_C::DistanceZ' has a wrong offset!");

}

