#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_ch_BrainField

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_ch_BrainField.BTT_ch_BrainField_C.ExecuteUbergraph_BTT_ch_BrainField
// 0x0038 (0x0038 - 0x0000)
struct BTT_ch_BrainField_C_ExecuteUbergraph_BTT_ch_BrainField final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_785C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IPlayerInterface>      K2Node_DynamicCast_AsPlayer_Interface;             // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InBranField_InBrainDield;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OpenBrainField_ReturnValue;               // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_ch_BrainField_C_ExecuteUbergraph_BTT_ch_BrainField) == 0x000008, "Wrong alignment on BTT_ch_BrainField_C_ExecuteUbergraph_BTT_ch_BrainField");
static_assert(sizeof(BTT_ch_BrainField_C_ExecuteUbergraph_BTT_ch_BrainField) == 0x000038, "Wrong size on BTT_ch_BrainField_C_ExecuteUbergraph_BTT_ch_BrainField");
static_assert(offsetof(BTT_ch_BrainField_C_ExecuteUbergraph_BTT_ch_BrainField, EntryPoint) == 0x000000, "Member 'BTT_ch_BrainField_C_ExecuteUbergraph_BTT_ch_BrainField::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_ch_BrainField_C_ExecuteUbergraph_BTT_ch_BrainField, K2Node_Event_OwnerController) == 0x000008, "Member 'BTT_ch_BrainField_C_ExecuteUbergraph_BTT_ch_BrainField::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ch_BrainField_C_ExecuteUbergraph_BTT_ch_BrainField, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTT_ch_BrainField_C_ExecuteUbergraph_BTT_ch_BrainField::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_ch_BrainField_C_ExecuteUbergraph_BTT_ch_BrainField, CallFunc_GetBrainFieldManager_Manager) == 0x000018, "Member 'BTT_ch_BrainField_C_ExecuteUbergraph_BTT_ch_BrainField::CallFunc_GetBrainFieldManager_Manager' has a wrong offset!");
static_assert(offsetof(BTT_ch_BrainField_C_ExecuteUbergraph_BTT_ch_BrainField, K2Node_DynamicCast_AsPlayer_Interface) == 0x000020, "Member 'BTT_ch_BrainField_C_ExecuteUbergraph_BTT_ch_BrainField::K2Node_DynamicCast_AsPlayer_Interface' has a wrong offset!");
static_assert(offsetof(BTT_ch_BrainField_C_ExecuteUbergraph_BTT_ch_BrainField, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BTT_ch_BrainField_C_ExecuteUbergraph_BTT_ch_BrainField::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_ch_BrainField_C_ExecuteUbergraph_BTT_ch_BrainField, CallFunc_InBranField_InBrainDield) == 0x000031, "Member 'BTT_ch_BrainField_C_ExecuteUbergraph_BTT_ch_BrainField::CallFunc_InBranField_InBrainDield' has a wrong offset!");
static_assert(offsetof(BTT_ch_BrainField_C_ExecuteUbergraph_BTT_ch_BrainField, CallFunc_OpenBrainField_ReturnValue) == 0x000032, "Member 'BTT_ch_BrainField_C_ExecuteUbergraph_BTT_ch_BrainField::CallFunc_OpenBrainField_ReturnValue' has a wrong offset!");

// Function BTT_ch_BrainField.BTT_ch_BrainField_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_ch_BrainField_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ch_BrainField_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_ch_BrainField_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_ch_BrainField_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_ch_BrainField_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_ch_BrainField_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_ch_BrainField_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ch_BrainField_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_ch_BrainField_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function BTT_ch_BrainField.BTT_ch_BrainField_C.Exit
// 0x0020 (0x0020 - 0x0000)
struct BTT_ch_BrainField_C_Exit final
{
public:
	class APawn*                                  ControlledPawn;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface;       // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetEnableInputStick_Dummy;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_ch_BrainField_C_Exit) == 0x000008, "Wrong alignment on BTT_ch_BrainField_C_Exit");
static_assert(sizeof(BTT_ch_BrainField_C_Exit) == 0x000020, "Wrong size on BTT_ch_BrainField_C_Exit");
static_assert(offsetof(BTT_ch_BrainField_C_Exit, ControlledPawn) == 0x000000, "Member 'BTT_ch_BrainField_C_Exit::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_ch_BrainField_C_Exit, K2Node_DynamicCast_AsBPI_Player_AIInterface) == 0x000008, "Member 'BTT_ch_BrainField_C_Exit::K2Node_DynamicCast_AsBPI_Player_AIInterface' has a wrong offset!");
static_assert(offsetof(BTT_ch_BrainField_C_Exit, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BTT_ch_BrainField_C_Exit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_ch_BrainField_C_Exit, CallFunc_SetEnableInputStick_Dummy) == 0x000019, "Member 'BTT_ch_BrainField_C_Exit::CallFunc_SetEnableInputStick_Dummy' has a wrong offset!");

}

