#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_ch_Dead

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_ch_Dead.BTT_ch_Dead_C.ExecuteUbergraph_BTT_ch_Dead
// 0x0080 (0x0080 - 0x0000)
struct BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA9[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharacterParamater_C> K2Node_DynamicCast_AsBPI_Character_Paramater;      // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EAA[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface;       // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDead_bDead;                             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionStatusAI_bResult;                 // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EAB[0x5];                                     // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface_1;     // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EAC[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface_2;     // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionStatusAI_bResult_1;               // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RestartBattleAI_bDummy;                   // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead) == 0x000008, "Wrong alignment on BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead");
static_assert(sizeof(BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead) == 0x000080, "Wrong size on BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead");
static_assert(offsetof(BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead, EntryPoint) == 0x000000, "Member 'BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead, K2Node_Event_OwnerController) == 0x000008, "Member 'BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead, K2Node_DynamicCast_AsBPI_Character_Paramater) == 0x000020, "Member 'BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead::K2Node_DynamicCast_AsBPI_Character_Paramater' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead, K2Node_DynamicCast_AsBPI_Player_AIInterface) == 0x000038, "Member 'BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead::K2Node_DynamicCast_AsBPI_Player_AIInterface' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead, CallFunc_IsDead_bDead) == 0x000049, "Member 'BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead::CallFunc_IsDead_bDead' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead, CallFunc_IsActionStatusAI_bResult) == 0x00004A, "Member 'BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead::CallFunc_IsActionStatusAI_bResult' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead, K2Node_DynamicCast_AsBPI_Player_AIInterface_1) == 0x000050, "Member 'BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead::K2Node_DynamicCast_AsBPI_Player_AIInterface_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead, K2Node_DynamicCast_AsBPI_Player_AIInterface_2) == 0x000068, "Member 'BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead::K2Node_DynamicCast_AsBPI_Player_AIInterface_2' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead, K2Node_DynamicCast_bSuccess_3) == 0x000078, "Member 'BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead, CallFunc_IsActionStatusAI_bResult_1) == 0x000079, "Member 'BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead::CallFunc_IsActionStatusAI_bResult_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead, CallFunc_RestartBattleAI_bDummy) == 0x00007A, "Member 'BTT_ch_Dead_C_ExecuteUbergraph_BTT_ch_Dead::CallFunc_RestartBattleAI_bDummy' has a wrong offset!");

// Function BTT_ch_Dead.BTT_ch_Dead_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTT_ch_Dead_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ch_Dead_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTT_ch_Dead_C_ReceiveTickAI");
static_assert(sizeof(BTT_ch_Dead_C_ReceiveTickAI) == 0x000018, "Wrong size on BTT_ch_Dead_C_ReceiveTickAI");
static_assert(offsetof(BTT_ch_Dead_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTT_ch_Dead_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dead_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTT_ch_Dead_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dead_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTT_ch_Dead_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

