#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_ch_MoveToTarget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTT_ch_MoveToTarget.BTT_ch_MoveToTarget_C.ExecuteUbergraph_BTT_ch_MoveToTarget
// 0x00F8 (0x00F8 - 0x0000)
struct BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83D5[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83D6[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface;       // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83D7[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface_1;     // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83D8[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMovePosActor_MovePosActor;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAIMoveMode_Result;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83D9[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface_2;     // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83DA[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBattleTargetActor_TargetActor;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83DB[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue_1;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget) == 0x000008, "Wrong alignment on BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget");
static_assert(sizeof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget) == 0x0000F8, "Wrong size on BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, EntryPoint) == 0x000000, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, K2Node_Event_OwnerController) == 0x000008, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, K2Node_DynamicCast_AsBPI_Player_AIInterface) == 0x000020, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::K2Node_DynamicCast_AsBPI_Player_AIInterface' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, K2Node_DynamicCast_AsBPI_Player_AIInterface_1) == 0x000038, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::K2Node_DynamicCast_AsBPI_Player_AIInterface_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, CallFunc_GetMovePosActor_MovePosActor) == 0x000050, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::CallFunc_GetMovePosActor_MovePosActor' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, CallFunc_IsAIMoveMode_Result) == 0x000058, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::CallFunc_IsAIMoveMode_Result' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00005C, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, K2Node_DynamicCast_AsBPI_Player_AIInterface_2) == 0x000068, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::K2Node_DynamicCast_AsBPI_Player_AIInterface_2' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, CallFunc_GetBattleTargetActor_TargetActor) == 0x000080, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::CallFunc_GetBattleTargetActor_TargetActor' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000088, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, CallFunc_IsValid_ReturnValue) == 0x000094, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000098, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000A4, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0000B0, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, CallFunc_BreakVector_X) == 0x0000BC, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, CallFunc_BreakVector_Y) == 0x0000C0, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, CallFunc_BreakVector_Z) == 0x0000C4, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, CallFunc_BreakVector_X_1) == 0x0000C8, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, CallFunc_BreakVector_Y_1) == 0x0000CC, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, CallFunc_BreakVector_Z_1) == 0x0000D0, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, CallFunc_MakeVector_ReturnValue) == 0x0000D4, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, CallFunc_MakeVector_ReturnValue_1) == 0x0000E0, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, CallFunc_VSizeSquared_ReturnValue) == 0x0000EC, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, CallFunc_VSizeSquared_ReturnValue_1) == 0x0000F0, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::CallFunc_VSizeSquared_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000F4, "Member 'BTT_ch_MoveToTarget_C_ExecuteUbergraph_BTT_ch_MoveToTarget::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BTT_ch_MoveToTarget.BTT_ch_MoveToTarget_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTT_ch_MoveToTarget_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ch_MoveToTarget_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTT_ch_MoveToTarget_C_ReceiveTickAI");
static_assert(sizeof(BTT_ch_MoveToTarget_C_ReceiveTickAI) == 0x000018, "Wrong size on BTT_ch_MoveToTarget_C_ReceiveTickAI");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTT_ch_MoveToTarget_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTT_ch_MoveToTarget_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveToTarget_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTT_ch_MoveToTarget_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

