#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_ch_Dodge

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_ch_Dodge.BTT_ch_Dodge_C.ExecuteUbergraph_BTT_ch_Dodge
// 0x0118 (0x0118 - 0x0000)
struct BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E95[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_2;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_2;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E96[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface;       // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E97[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface_1;     // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetEnableInputStick_Dummy;                // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E98[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface_2;     // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E99[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface_3;     // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E9A[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface_4;     // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInputAI_Dodge_bON;                      // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionStatusAI_bResult;                 // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E9B[0x5];                                     // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface_5;     // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E9C[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface_6;     // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionStatusAI_bResult_1;               // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E9D[0x6];                                     // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDisableActionDodge_ReturnValue;         // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E9E[0x2];                                     // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E9F[0x3];                                     // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetEnableInputStick_Dummy_1;              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7EA0[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge) == 0x000008, "Wrong alignment on BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge");
static_assert(sizeof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge) == 0x000118, "Wrong size on BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, EntryPoint) == 0x000000, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, K2Node_Event_OwnerController_2) == 0x000008, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::K2Node_Event_OwnerController_2' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, K2Node_Event_ControlledPawn_2) == 0x000010, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::K2Node_Event_ControlledPawn_2' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, K2Node_Event_OwnerController_1) == 0x000020, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, K2Node_Event_ControlledPawn_1) == 0x000028, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, K2Node_DynamicCast_AsBPI_Player_AIInterface) == 0x000030, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::K2Node_DynamicCast_AsBPI_Player_AIInterface' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, K2Node_DynamicCast_AsBPI_Player_AIInterface_1) == 0x000048, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::K2Node_DynamicCast_AsBPI_Player_AIInterface_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, CallFunc_SetEnableInputStick_Dummy) == 0x000059, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::CallFunc_SetEnableInputStick_Dummy' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, K2Node_DynamicCast_AsBPI_Player_AIInterface_2) == 0x000060, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::K2Node_DynamicCast_AsBPI_Player_AIInterface_2' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, K2Node_DynamicCast_AsBPI_Player_AIInterface_3) == 0x000078, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::K2Node_DynamicCast_AsBPI_Player_AIInterface_3' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, K2Node_DynamicCast_bSuccess_3) == 0x000088, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, K2Node_DynamicCast_AsBPI_Player_AIInterface_4) == 0x000090, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::K2Node_DynamicCast_AsBPI_Player_AIInterface_4' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, K2Node_DynamicCast_bSuccess_4) == 0x0000A0, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, CallFunc_IsInputAI_Dodge_bON) == 0x0000A1, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::CallFunc_IsInputAI_Dodge_bON' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, CallFunc_IsActionStatusAI_bResult) == 0x0000A2, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::CallFunc_IsActionStatusAI_bResult' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, K2Node_DynamicCast_AsBPI_Player_AIInterface_5) == 0x0000A8, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::K2Node_DynamicCast_AsBPI_Player_AIInterface_5' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, K2Node_DynamicCast_bSuccess_5) == 0x0000B8, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, K2Node_DynamicCast_AsBPI_Player_AIInterface_6) == 0x0000C0, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::K2Node_DynamicCast_AsBPI_Player_AIInterface_6' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, K2Node_DynamicCast_bSuccess_6) == 0x0000D0, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, CallFunc_IsActionStatusAI_bResult_1) == 0x0000D1, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::CallFunc_IsActionStatusAI_bResult_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, K2Node_DynamicCast_AsRSBattle_Player) == 0x0000D8, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, K2Node_DynamicCast_bSuccess_7) == 0x0000E0, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, CallFunc_IsDisableActionDodge_ReturnValue) == 0x0000E1, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::CallFunc_IsDisableActionDodge_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, Temp_int_Variable) == 0x0000E4, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, K2Node_Event_OwnerController) == 0x0000E8, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, K2Node_Event_ControlledPawn) == 0x0000F0, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, Temp_int_Variable_1) == 0x0000F8, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, K2Node_SwitchInteger_CmpSuccess) == 0x0000FC, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, CallFunc_Add_IntInt_ReturnValue) == 0x000100, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, CallFunc_Add_IntInt_ReturnValue_1) == 0x000104, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, CallFunc_SetEnableInputStick_Dummy_1) == 0x000108, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::CallFunc_SetEnableInputStick_Dummy_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, CallFunc_Add_IntInt_ReturnValue_2) == 0x00010C, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge, Temp_int_Variable_2) == 0x000110, "Member 'BTT_ch_Dodge_C_ExecuteUbergraph_BTT_ch_Dodge::Temp_int_Variable_2' has a wrong offset!");

// Function BTT_ch_Dodge.BTT_ch_Dodge_C.ReceiveAbortAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_ch_Dodge_C_ReceiveAbortAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ch_Dodge_C_ReceiveAbortAI) == 0x000008, "Wrong alignment on BTT_ch_Dodge_C_ReceiveAbortAI");
static_assert(sizeof(BTT_ch_Dodge_C_ReceiveAbortAI) == 0x000010, "Wrong size on BTT_ch_Dodge_C_ReceiveAbortAI");
static_assert(offsetof(BTT_ch_Dodge_C_ReceiveAbortAI, OwnerController) == 0x000000, "Member 'BTT_ch_Dodge_C_ReceiveAbortAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ReceiveAbortAI, ControlledPawn) == 0x000008, "Member 'BTT_ch_Dodge_C_ReceiveAbortAI::ControlledPawn' has a wrong offset!");

// Function BTT_ch_Dodge.BTT_ch_Dodge_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_ch_Dodge_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ch_Dodge_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_ch_Dodge_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_ch_Dodge_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_ch_Dodge_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_ch_Dodge_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_ch_Dodge_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_ch_Dodge_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function BTT_ch_Dodge.BTT_ch_Dodge_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTT_ch_Dodge_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ch_Dodge_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTT_ch_Dodge_C_ReceiveTickAI");
static_assert(sizeof(BTT_ch_Dodge_C_ReceiveTickAI) == 0x000018, "Wrong size on BTT_ch_Dodge_C_ReceiveTickAI");
static_assert(offsetof(BTT_ch_Dodge_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTT_ch_Dodge_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTT_ch_Dodge_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTT_ch_Dodge_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

// Function BTT_ch_Dodge.BTT_ch_Dodge_C.Exit
// 0x0038 (0x0038 - 0x0000)
struct BTT_ch_Dodge_C_Exit final
{
public:
	class APawn*                                  ControlledPawn;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface;       // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetEnableInputStick_Dummy;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7EA1[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface_1;     // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_ch_Dodge_C_Exit) == 0x000008, "Wrong alignment on BTT_ch_Dodge_C_Exit");
static_assert(sizeof(BTT_ch_Dodge_C_Exit) == 0x000038, "Wrong size on BTT_ch_Dodge_C_Exit");
static_assert(offsetof(BTT_ch_Dodge_C_Exit, ControlledPawn) == 0x000000, "Member 'BTT_ch_Dodge_C_Exit::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_Exit, K2Node_DynamicCast_AsBPI_Player_AIInterface) == 0x000008, "Member 'BTT_ch_Dodge_C_Exit::K2Node_DynamicCast_AsBPI_Player_AIInterface' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_Exit, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BTT_ch_Dodge_C_Exit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_Exit, CallFunc_SetEnableInputStick_Dummy) == 0x000019, "Member 'BTT_ch_Dodge_C_Exit::CallFunc_SetEnableInputStick_Dummy' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_Exit, K2Node_DynamicCast_AsBPI_Player_AIInterface_1) == 0x000020, "Member 'BTT_ch_Dodge_C_Exit::K2Node_DynamicCast_AsBPI_Player_AIInterface_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_Dodge_C_Exit, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BTT_ch_Dodge_C_Exit::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

