#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_ch_ResetBehaviorTree

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_ch_ResetBehaviorTree.BTT_ch_ResetBehaviorTree_C.ExecuteUbergraph_BTT_ch_ResetBehaviorTree
// 0x0038 (0x0038 - 0x0000)
struct BTT_ch_ResetBehaviorTree_C_ExecuteUbergraph_BTT_ch_ResetBehaviorTree final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_542D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_542E[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface;       // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotifyResetBehaviorTree_Dummy;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_ch_ResetBehaviorTree_C_ExecuteUbergraph_BTT_ch_ResetBehaviorTree) == 0x000008, "Wrong alignment on BTT_ch_ResetBehaviorTree_C_ExecuteUbergraph_BTT_ch_ResetBehaviorTree");
static_assert(sizeof(BTT_ch_ResetBehaviorTree_C_ExecuteUbergraph_BTT_ch_ResetBehaviorTree) == 0x000038, "Wrong size on BTT_ch_ResetBehaviorTree_C_ExecuteUbergraph_BTT_ch_ResetBehaviorTree");
static_assert(offsetof(BTT_ch_ResetBehaviorTree_C_ExecuteUbergraph_BTT_ch_ResetBehaviorTree, EntryPoint) == 0x000000, "Member 'BTT_ch_ResetBehaviorTree_C_ExecuteUbergraph_BTT_ch_ResetBehaviorTree::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_ch_ResetBehaviorTree_C_ExecuteUbergraph_BTT_ch_ResetBehaviorTree, K2Node_Event_OwnerController) == 0x000008, "Member 'BTT_ch_ResetBehaviorTree_C_ExecuteUbergraph_BTT_ch_ResetBehaviorTree::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ch_ResetBehaviorTree_C_ExecuteUbergraph_BTT_ch_ResetBehaviorTree, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTT_ch_ResetBehaviorTree_C_ExecuteUbergraph_BTT_ch_ResetBehaviorTree::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_ch_ResetBehaviorTree_C_ExecuteUbergraph_BTT_ch_ResetBehaviorTree, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BTT_ch_ResetBehaviorTree_C_ExecuteUbergraph_BTT_ch_ResetBehaviorTree::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTT_ch_ResetBehaviorTree_C_ExecuteUbergraph_BTT_ch_ResetBehaviorTree, K2Node_DynamicCast_AsBPI_Player_AIInterface) == 0x000020, "Member 'BTT_ch_ResetBehaviorTree_C_ExecuteUbergraph_BTT_ch_ResetBehaviorTree::K2Node_DynamicCast_AsBPI_Player_AIInterface' has a wrong offset!");
static_assert(offsetof(BTT_ch_ResetBehaviorTree_C_ExecuteUbergraph_BTT_ch_ResetBehaviorTree, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BTT_ch_ResetBehaviorTree_C_ExecuteUbergraph_BTT_ch_ResetBehaviorTree::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_ch_ResetBehaviorTree_C_ExecuteUbergraph_BTT_ch_ResetBehaviorTree, CallFunc_NotifyResetBehaviorTree_Dummy) == 0x000031, "Member 'BTT_ch_ResetBehaviorTree_C_ExecuteUbergraph_BTT_ch_ResetBehaviorTree::CallFunc_NotifyResetBehaviorTree_Dummy' has a wrong offset!");

// Function BTT_ch_ResetBehaviorTree.BTT_ch_ResetBehaviorTree_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTT_ch_ResetBehaviorTree_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ch_ResetBehaviorTree_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTT_ch_ResetBehaviorTree_C_ReceiveTickAI");
static_assert(sizeof(BTT_ch_ResetBehaviorTree_C_ReceiveTickAI) == 0x000018, "Wrong size on BTT_ch_ResetBehaviorTree_C_ReceiveTickAI");
static_assert(offsetof(BTT_ch_ResetBehaviorTree_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTT_ch_ResetBehaviorTree_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ch_ResetBehaviorTree_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTT_ch_ResetBehaviorTree_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_ch_ResetBehaviorTree_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTT_ch_ResetBehaviorTree_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

