#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_ch_MoveAttack

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_ch_MoveAttack.BTT_ch_MoveAttack_C.ExecuteUbergraph_BTT_ch_MoveAttack
// 0x0170 (0x0170 - 0x0000)
struct BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5716[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_2;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_2;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5717[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface;       // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5718[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAttackCountAI_Count;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface_1;     // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInputAI_Attack_bON;                     // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5719[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface_2;     // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571A[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface_3;     // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571B[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAttackCountAI_Count_1;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface_4;     // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionStatusAI_bResult;                 // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571C[0x6];                                     // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface_5;     // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAttackAble_bEnable;                     // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571D[0x5];                                     // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface_6;     // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571E[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface_7;     // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetEnableInputStick_Dummy;                // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571F[0x6];                                     // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface_8;     // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5720[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface_9;     // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5721[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface_10;    // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetEnableInputStick_Dummy_1;              // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5722[0x1];                                     // 0x0143(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5723[0x3];                                     // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRate_ReturnValue;                      // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5724[0x3];                                     // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack) == 0x000008, "Wrong alignment on BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack");
static_assert(sizeof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack) == 0x000170, "Wrong size on BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, EntryPoint) == 0x000000, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_Event_OwnerController_2) == 0x000008, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_Event_OwnerController_2' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_Event_ControlledPawn_2) == 0x000010, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_Event_ControlledPawn_2' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_Event_OwnerController_1) == 0x000018, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_Event_ControlledPawn_1) == 0x000020, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_DynamicCast_AsBPI_Player_AIInterface) == 0x000030, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_DynamicCast_AsBPI_Player_AIInterface' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, CallFunc_GetAttackCountAI_Count) == 0x000044, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::CallFunc_GetAttackCountAI_Count' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_DynamicCast_AsBPI_Player_AIInterface_1) == 0x000048, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_DynamicCast_AsBPI_Player_AIInterface_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, CallFunc_IsInputAI_Attack_bON) == 0x000059, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::CallFunc_IsInputAI_Attack_bON' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_DynamicCast_AsBPI_Player_AIInterface_2) == 0x000060, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_DynamicCast_AsBPI_Player_AIInterface_2' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_DynamicCast_AsBPI_Player_AIInterface_3) == 0x000078, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_DynamicCast_AsBPI_Player_AIInterface_3' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_DynamicCast_bSuccess_3) == 0x000088, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, CallFunc_GetAttackCountAI_Count_1) == 0x00008C, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::CallFunc_GetAttackCountAI_Count_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_DynamicCast_AsBPI_Player_AIInterface_4) == 0x000090, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_DynamicCast_AsBPI_Player_AIInterface_4' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_DynamicCast_bSuccess_4) == 0x0000A0, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, CallFunc_IsActionStatusAI_bResult) == 0x0000A1, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::CallFunc_IsActionStatusAI_bResult' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_DynamicCast_AsBPI_Player_AIInterface_5) == 0x0000A8, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_DynamicCast_AsBPI_Player_AIInterface_5' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_DynamicCast_bSuccess_5) == 0x0000B8, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, CallFunc_IsAttackAble_bEnable) == 0x0000B9, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::CallFunc_IsAttackAble_bEnable' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, CallFunc_Not_PreBool_ReturnValue) == 0x0000BA, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_DynamicCast_AsBPI_Player_AIInterface_6) == 0x0000C0, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_DynamicCast_AsBPI_Player_AIInterface_6' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_DynamicCast_bSuccess_6) == 0x0000D0, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_DynamicCast_AsBPI_Player_AIInterface_7) == 0x0000D8, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_DynamicCast_AsBPI_Player_AIInterface_7' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_DynamicCast_bSuccess_7) == 0x0000E8, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, CallFunc_SetEnableInputStick_Dummy) == 0x0000E9, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::CallFunc_SetEnableInputStick_Dummy' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_DynamicCast_AsBPI_Player_AIInterface_8) == 0x0000F0, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_DynamicCast_AsBPI_Player_AIInterface_8' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_DynamicCast_bSuccess_8) == 0x000100, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_Event_OwnerController) == 0x000108, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_Event_ControlledPawn) == 0x000110, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_DynamicCast_AsBPI_Player_AIInterface_9) == 0x000118, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_DynamicCast_AsBPI_Player_AIInterface_9' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_DynamicCast_bSuccess_9) == 0x000128, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_DynamicCast_AsBPI_Player_AIInterface_10) == 0x000130, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_DynamicCast_AsBPI_Player_AIInterface_10' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_DynamicCast_bSuccess_10) == 0x000140, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, CallFunc_SetEnableInputStick_Dummy_1) == 0x000141, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::CallFunc_SetEnableInputStick_Dummy_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, K2Node_SwitchInteger_CmpSuccess) == 0x000142, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, CallFunc_Add_IntInt_ReturnValue) == 0x000144, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, Temp_int_Variable) == 0x000148, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00014C, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, CallFunc_Add_IntInt_ReturnValue_1) == 0x000150, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, Temp_int_Variable_1) == 0x000154, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, Temp_int_Variable_2) == 0x000158, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, Temp_int_Variable_3) == 0x00015C, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, CallFunc_GetRate_ReturnValue) == 0x000160, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::CallFunc_GetRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, CallFunc_Add_IntInt_ReturnValue_2) == 0x000164, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, CallFunc_Less_FloatFloat_ReturnValue) == 0x000168, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack, CallFunc_Add_IntInt_ReturnValue_3) == 0x00016C, "Member 'BTT_ch_MoveAttack_C_ExecuteUbergraph_BTT_ch_MoveAttack::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");

// Function BTT_ch_MoveAttack.BTT_ch_MoveAttack_C.ReceiveAbortAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_ch_MoveAttack_C_ReceiveAbortAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ch_MoveAttack_C_ReceiveAbortAI) == 0x000008, "Wrong alignment on BTT_ch_MoveAttack_C_ReceiveAbortAI");
static_assert(sizeof(BTT_ch_MoveAttack_C_ReceiveAbortAI) == 0x000010, "Wrong size on BTT_ch_MoveAttack_C_ReceiveAbortAI");
static_assert(offsetof(BTT_ch_MoveAttack_C_ReceiveAbortAI, OwnerController) == 0x000000, "Member 'BTT_ch_MoveAttack_C_ReceiveAbortAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ReceiveAbortAI, ControlledPawn) == 0x000008, "Member 'BTT_ch_MoveAttack_C_ReceiveAbortAI::ControlledPawn' has a wrong offset!");

// Function BTT_ch_MoveAttack.BTT_ch_MoveAttack_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTT_ch_MoveAttack_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ch_MoveAttack_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTT_ch_MoveAttack_C_ReceiveTickAI");
static_assert(sizeof(BTT_ch_MoveAttack_C_ReceiveTickAI) == 0x000018, "Wrong size on BTT_ch_MoveAttack_C_ReceiveTickAI");
static_assert(offsetof(BTT_ch_MoveAttack_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTT_ch_MoveAttack_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTT_ch_MoveAttack_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTT_ch_MoveAttack_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

// Function BTT_ch_MoveAttack.BTT_ch_MoveAttack_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_ch_MoveAttack_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ch_MoveAttack_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_ch_MoveAttack_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_ch_MoveAttack_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_ch_MoveAttack_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_ch_MoveAttack_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_ch_MoveAttack_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ch_MoveAttack_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_ch_MoveAttack_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

