#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_ch_NextBattleThink

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_ch_NextBattleThink.BTT_ch_NextBattleThink_C.ExecuteUbergraph_BTT_ch_NextBattleThink
// 0x0030 (0x0030 - 0x0000)
struct BTT_ch_NextBattleThink_C_ExecuteUbergraph_BTT_ch_NextBattleThink final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5427[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface;       // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NextBattleThink_Dummy;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_ch_NextBattleThink_C_ExecuteUbergraph_BTT_ch_NextBattleThink) == 0x000008, "Wrong alignment on BTT_ch_NextBattleThink_C_ExecuteUbergraph_BTT_ch_NextBattleThink");
static_assert(sizeof(BTT_ch_NextBattleThink_C_ExecuteUbergraph_BTT_ch_NextBattleThink) == 0x000030, "Wrong size on BTT_ch_NextBattleThink_C_ExecuteUbergraph_BTT_ch_NextBattleThink");
static_assert(offsetof(BTT_ch_NextBattleThink_C_ExecuteUbergraph_BTT_ch_NextBattleThink, EntryPoint) == 0x000000, "Member 'BTT_ch_NextBattleThink_C_ExecuteUbergraph_BTT_ch_NextBattleThink::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_ch_NextBattleThink_C_ExecuteUbergraph_BTT_ch_NextBattleThink, K2Node_Event_OwnerController) == 0x000008, "Member 'BTT_ch_NextBattleThink_C_ExecuteUbergraph_BTT_ch_NextBattleThink::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ch_NextBattleThink_C_ExecuteUbergraph_BTT_ch_NextBattleThink, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTT_ch_NextBattleThink_C_ExecuteUbergraph_BTT_ch_NextBattleThink::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_ch_NextBattleThink_C_ExecuteUbergraph_BTT_ch_NextBattleThink, K2Node_DynamicCast_AsBPI_Player_AIInterface) == 0x000018, "Member 'BTT_ch_NextBattleThink_C_ExecuteUbergraph_BTT_ch_NextBattleThink::K2Node_DynamicCast_AsBPI_Player_AIInterface' has a wrong offset!");
static_assert(offsetof(BTT_ch_NextBattleThink_C_ExecuteUbergraph_BTT_ch_NextBattleThink, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BTT_ch_NextBattleThink_C_ExecuteUbergraph_BTT_ch_NextBattleThink::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_ch_NextBattleThink_C_ExecuteUbergraph_BTT_ch_NextBattleThink, CallFunc_NextBattleThink_Dummy) == 0x000029, "Member 'BTT_ch_NextBattleThink_C_ExecuteUbergraph_BTT_ch_NextBattleThink::CallFunc_NextBattleThink_Dummy' has a wrong offset!");

// Function BTT_ch_NextBattleThink.BTT_ch_NextBattleThink_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_ch_NextBattleThink_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ch_NextBattleThink_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_ch_NextBattleThink_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_ch_NextBattleThink_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_ch_NextBattleThink_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_ch_NextBattleThink_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_ch_NextBattleThink_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ch_NextBattleThink_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_ch_NextBattleThink_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

