#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_ch_Down

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_ch_Down.BTT_ch_Down_C.ExecuteUbergraph_BTT_ch_Down
// 0x0070 (0x0070 - 0x0000)
struct BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5460[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_2;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_2;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5461[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface;       // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionStatusAI_bResult;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5462[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface_1;     // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetEnableInputStick_Dummy;                // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5463[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down) == 0x000008, "Wrong alignment on BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down");
static_assert(sizeof(BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down) == 0x000070, "Wrong size on BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down");
static_assert(offsetof(BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down, EntryPoint) == 0x000000, "Member 'BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down, K2Node_Event_OwnerController_2) == 0x000008, "Member 'BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down::K2Node_Event_OwnerController_2' has a wrong offset!");
static_assert(offsetof(BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down, K2Node_Event_ControlledPawn_2) == 0x000010, "Member 'BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down::K2Node_Event_ControlledPawn_2' has a wrong offset!");
static_assert(offsetof(BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down, K2Node_DynamicCast_AsBPI_Player_AIInterface) == 0x000020, "Member 'BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down::K2Node_DynamicCast_AsBPI_Player_AIInterface' has a wrong offset!");
static_assert(offsetof(BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down, CallFunc_IsActionStatusAI_bResult) == 0x000031, "Member 'BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down::CallFunc_IsActionStatusAI_bResult' has a wrong offset!");
static_assert(offsetof(BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down, K2Node_Event_OwnerController_1) == 0x000038, "Member 'BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down, K2Node_Event_ControlledPawn_1) == 0x000040, "Member 'BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down, K2Node_DynamicCast_AsBPI_Player_AIInterface_1) == 0x000048, "Member 'BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down::K2Node_DynamicCast_AsBPI_Player_AIInterface_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down, CallFunc_SetEnableInputStick_Dummy) == 0x000059, "Member 'BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down::CallFunc_SetEnableInputStick_Dummy' has a wrong offset!");
static_assert(offsetof(BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down, K2Node_Event_OwnerController) == 0x000060, "Member 'BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down, K2Node_Event_ControlledPawn) == 0x000068, "Member 'BTT_ch_Down_C_ExecuteUbergraph_BTT_ch_Down::K2Node_Event_ControlledPawn' has a wrong offset!");

// Function BTT_ch_Down.BTT_ch_Down_C.ReceiveAbortAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_ch_Down_C_ReceiveAbortAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ch_Down_C_ReceiveAbortAI) == 0x000008, "Wrong alignment on BTT_ch_Down_C_ReceiveAbortAI");
static_assert(sizeof(BTT_ch_Down_C_ReceiveAbortAI) == 0x000010, "Wrong size on BTT_ch_Down_C_ReceiveAbortAI");
static_assert(offsetof(BTT_ch_Down_C_ReceiveAbortAI, OwnerController) == 0x000000, "Member 'BTT_ch_Down_C_ReceiveAbortAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ch_Down_C_ReceiveAbortAI, ControlledPawn) == 0x000008, "Member 'BTT_ch_Down_C_ReceiveAbortAI::ControlledPawn' has a wrong offset!");

// Function BTT_ch_Down.BTT_ch_Down_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_ch_Down_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ch_Down_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_ch_Down_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_ch_Down_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_ch_Down_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_ch_Down_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_ch_Down_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ch_Down_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_ch_Down_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function BTT_ch_Down.BTT_ch_Down_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTT_ch_Down_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ch_Down_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTT_ch_Down_C_ReceiveTickAI");
static_assert(sizeof(BTT_ch_Down_C_ReceiveTickAI) == 0x000018, "Wrong size on BTT_ch_Down_C_ReceiveTickAI");
static_assert(offsetof(BTT_ch_Down_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTT_ch_Down_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ch_Down_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTT_ch_Down_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_ch_Down_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTT_ch_Down_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

// Function BTT_ch_Down.BTT_ch_Down_C.Exit
// 0x0020 (0x0020 - 0x0000)
struct BTT_ch_Down_C_Exit final
{
public:
	class APawn*                                  ControlledPawn;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerAIInterface_C> K2Node_DynamicCast_AsBPI_Player_AIInterface;       // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetEnableInputStick_Dummy;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_ch_Down_C_Exit) == 0x000008, "Wrong alignment on BTT_ch_Down_C_Exit");
static_assert(sizeof(BTT_ch_Down_C_Exit) == 0x000020, "Wrong size on BTT_ch_Down_C_Exit");
static_assert(offsetof(BTT_ch_Down_C_Exit, ControlledPawn) == 0x000000, "Member 'BTT_ch_Down_C_Exit::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_ch_Down_C_Exit, K2Node_DynamicCast_AsBPI_Player_AIInterface) == 0x000008, "Member 'BTT_ch_Down_C_Exit::K2Node_DynamicCast_AsBPI_Player_AIInterface' has a wrong offset!");
static_assert(offsetof(BTT_ch_Down_C_Exit, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BTT_ch_Down_C_Exit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_ch_Down_C_Exit, CallFunc_SetEnableInputStick_Dummy) == 0x000019, "Member 'BTT_ch_Down_C_Exit::CallFunc_SetEnableInputStick_Dummy' has a wrong offset!");

}

