#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_ch_Rush

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TaskBase_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_ch_Rush.BTT_ch_Rush_C
// 0x0018 (0x00C8 - 0x00B0)
class UBTT_ch_Rush_C final : public UTaskBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BTT_ch_Rush_C;                      // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Count;                                             // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Step;                                              // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bExecMoveTo;                                       // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BTT_ch_Rush(int32 EntryPoint);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);
	void ReceiveAbortAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void OnSuccess_DFFE4004481D9FDEE7077F9D4A3499C7(EPathFollowingResult MovementResult);
	void OnFail_DFFE4004481D9FDEE7077F9D4A3499C7(EPathFollowingResult MovementResult);
	void OnSuccess_DE67968147E7AE929E26DA99FE78378D(EPathFollowingResult MovementResult);
	void OnFail_DE67968147E7AE929E26DA99FE78378D(EPathFollowingResult MovementResult);
	void Exit(class APawn* ControlledPawn, class AAIController* OwnerController);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_ch_Rush_C">();
	}
	static class UBTT_ch_Rush_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_ch_Rush_C>();
	}
};
static_assert(alignof(UBTT_ch_Rush_C) == 0x000008, "Wrong alignment on UBTT_ch_Rush_C");
static_assert(sizeof(UBTT_ch_Rush_C) == 0x0000C8, "Wrong size on UBTT_ch_Rush_C");
static_assert(offsetof(UBTT_ch_Rush_C, UberGraphFrame_BTT_ch_Rush_C) == 0x0000B0, "Member 'UBTT_ch_Rush_C::UberGraphFrame_BTT_ch_Rush_C' has a wrong offset!");
static_assert(offsetof(UBTT_ch_Rush_C, Count) == 0x0000B8, "Member 'UBTT_ch_Rush_C::Count' has a wrong offset!");
static_assert(offsetof(UBTT_ch_Rush_C, Step) == 0x0000BC, "Member 'UBTT_ch_Rush_C::Step' has a wrong offset!");
static_assert(offsetof(UBTT_ch_Rush_C, bExecMoveTo) == 0x0000C0, "Member 'UBTT_ch_Rush_C::bExecMoveTo' has a wrong offset!");

}

