#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterDatatableAccessorComponentBP

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function CharacterDatatableAccessorComponentBP.CharacterDatatableAccessorComponentBP_C.GetParamTable
// 0x0408 (0x0408 - 0x0000)
struct CharacterDatatableAccessorComponentBP_C_GetParamTable final
{
public:
	struct FCharactersParameterTable              ReturnValue;                                       // 0x0000(0x01F8)(Parm, OutParm, ReturnParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCharactersParameterTable              CallFunc_GetParamTable_ReturnValue;                // 0x0200(0x01F8)()
	class ARSBattleCharacter_C*                   K2Node_DynamicCast_AsRSBattle_Character;           // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterDatatableAccessorComponentBP_C_GetParamTable) == 0x000008, "Wrong alignment on CharacterDatatableAccessorComponentBP_C_GetParamTable");
static_assert(sizeof(CharacterDatatableAccessorComponentBP_C_GetParamTable) == 0x000408, "Wrong size on CharacterDatatableAccessorComponentBP_C_GetParamTable");
static_assert(offsetof(CharacterDatatableAccessorComponentBP_C_GetParamTable, ReturnValue) == 0x000000, "Member 'CharacterDatatableAccessorComponentBP_C_GetParamTable::ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterDatatableAccessorComponentBP_C_GetParamTable, CallFunc_GetOwner_ReturnValue) == 0x0001F8, "Member 'CharacterDatatableAccessorComponentBP_C_GetParamTable::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterDatatableAccessorComponentBP_C_GetParamTable, CallFunc_GetParamTable_ReturnValue) == 0x000200, "Member 'CharacterDatatableAccessorComponentBP_C_GetParamTable::CallFunc_GetParamTable_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterDatatableAccessorComponentBP_C_GetParamTable, K2Node_DynamicCast_AsRSBattle_Character) == 0x0003F8, "Member 'CharacterDatatableAccessorComponentBP_C_GetParamTable::K2Node_DynamicCast_AsRSBattle_Character' has a wrong offset!");
static_assert(offsetof(CharacterDatatableAccessorComponentBP_C_GetParamTable, K2Node_DynamicCast_bSuccess) == 0x000400, "Member 'CharacterDatatableAccessorComponentBP_C_GetParamTable::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CharacterDatatableAccessorComponentBP.CharacterDatatableAccessorComponentBP_C.GetParamBasic
// 0x0150 (0x0150 - 0x0000)
struct CharacterDatatableAccessorComponentBP_C_GetParamBasic final
{
public:
	struct FCharactersParameterBasic              ReturnValue;                                       // 0x0000(0x0068)(Parm, OutParm, ReturnParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCharactersParameterBasic              CallFunc_GetParamBasic_ReturnValue;                // 0x0070(0x0068)()
	class ARSBattleCharacter_C*                   K2Node_DynamicCast_AsRSBattle_Character;           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61DB[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharactersParameterBasic              CallFunc_GetParameterBasic_ReturnValue;            // 0x00E8(0x0068)()
};
static_assert(alignof(CharacterDatatableAccessorComponentBP_C_GetParamBasic) == 0x000008, "Wrong alignment on CharacterDatatableAccessorComponentBP_C_GetParamBasic");
static_assert(sizeof(CharacterDatatableAccessorComponentBP_C_GetParamBasic) == 0x000150, "Wrong size on CharacterDatatableAccessorComponentBP_C_GetParamBasic");
static_assert(offsetof(CharacterDatatableAccessorComponentBP_C_GetParamBasic, ReturnValue) == 0x000000, "Member 'CharacterDatatableAccessorComponentBP_C_GetParamBasic::ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterDatatableAccessorComponentBP_C_GetParamBasic, CallFunc_GetOwner_ReturnValue) == 0x000068, "Member 'CharacterDatatableAccessorComponentBP_C_GetParamBasic::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterDatatableAccessorComponentBP_C_GetParamBasic, CallFunc_GetParamBasic_ReturnValue) == 0x000070, "Member 'CharacterDatatableAccessorComponentBP_C_GetParamBasic::CallFunc_GetParamBasic_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterDatatableAccessorComponentBP_C_GetParamBasic, K2Node_DynamicCast_AsRSBattle_Character) == 0x0000D8, "Member 'CharacterDatatableAccessorComponentBP_C_GetParamBasic::K2Node_DynamicCast_AsRSBattle_Character' has a wrong offset!");
static_assert(offsetof(CharacterDatatableAccessorComponentBP_C_GetParamBasic, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'CharacterDatatableAccessorComponentBP_C_GetParamBasic::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterDatatableAccessorComponentBP_C_GetParamBasic, CallFunc_GetParameterBasic_ReturnValue) == 0x0000E8, "Member 'CharacterDatatableAccessorComponentBP_C_GetParamBasic::CallFunc_GetParameterBasic_ReturnValue' has a wrong offset!");

}

