#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharactersLevelData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct CharactersLevelData.CharactersLevelData
// 0x0018 (0x0018 - 0x0000)
struct FCharactersLevelData final
{
public:
	float                                         Vitality_3_492CE2724B44102AEA69CE89A713406E;       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PhysicalAttack_13_06E18D1B41C1A9756D9CF68B448FF1C4; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PsychicAttack_14_98343FB746CE17A99971CCB58BC7FE48; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Defence_7_E288AB754C67497EA024B28EF0DFD581;        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RequiredExp_17_F62FAFEC4E013A809664AFAA1B7FAAAB;   // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkillPoint_19_B9F4406240F49955842628A2BF693215;    // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FCharactersLevelData) == 0x000004, "Wrong alignment on FCharactersLevelData");
static_assert(sizeof(FCharactersLevelData) == 0x000018, "Wrong size on FCharactersLevelData");
static_assert(offsetof(FCharactersLevelData, Vitality_3_492CE2724B44102AEA69CE89A713406E) == 0x000000, "Member 'FCharactersLevelData::Vitality_3_492CE2724B44102AEA69CE89A713406E' has a wrong offset!");
static_assert(offsetof(FCharactersLevelData, PhysicalAttack_13_06E18D1B41C1A9756D9CF68B448FF1C4) == 0x000004, "Member 'FCharactersLevelData::PhysicalAttack_13_06E18D1B41C1A9756D9CF68B448FF1C4' has a wrong offset!");
static_assert(offsetof(FCharactersLevelData, PsychicAttack_14_98343FB746CE17A99971CCB58BC7FE48) == 0x000008, "Member 'FCharactersLevelData::PsychicAttack_14_98343FB746CE17A99971CCB58BC7FE48' has a wrong offset!");
static_assert(offsetof(FCharactersLevelData, Defence_7_E288AB754C67497EA024B28EF0DFD581) == 0x00000C, "Member 'FCharactersLevelData::Defence_7_E288AB754C67497EA024B28EF0DFD581' has a wrong offset!");
static_assert(offsetof(FCharactersLevelData, RequiredExp_17_F62FAFEC4E013A809664AFAA1B7FAAAB) == 0x000010, "Member 'FCharactersLevelData::RequiredExp_17_F62FAFEC4E013A809664AFAA1B7FAAAB' has a wrong offset!");
static_assert(offsetof(FCharactersLevelData, SkillPoint_19_B9F4406240F49955842628A2BF693215) == 0x000014, "Member 'FCharactersLevelData::SkillPoint_19_B9F4406240F49955842628A2BF693215' has a wrong offset!");

}

