#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChargeAttackData

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "FAttackEffectData_structs.hpp"


namespace SDK
{

// UserDefinedStruct ChargeAttackData.ChargeAttackData
// 0x0070 (0x0070 - 0x0000)
struct FChargeAttackData final
{
public:
	float                                         ChargeValue_5_48C850844A7EBA606758CB9B0C580EB3;    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43AE[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Montage_2_F1002E514D28136933DA9D8C9158B8C3;        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           WeaponMontage_38_7716501F49E738C0BE759B99630F5A68; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ChargeSEAttachPointName_22_D8671A5C407E63F745F820A15CE1792E; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          ChargeSE_16_BE05FF194E0D4B156EA183813EBEB532;      // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFAttackEffectData>             EffectData_20_8702C18242B2DFC8F3A24CAE8A1B335A;    // 0x0028(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          bUseRadialBlur_35_1FCA6EA74ECBF67518A13AA18AAC59D6; // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43AF[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveVector*                           RadialBlurCurveData_26_58A32F0C4EE2BB039745E19B4E05DB84; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENotifyRadialBlurModulateType                 RadialBlurModulateType_29_99E8E96147517A82AD9F51B94C55573E; // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43B0[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   RadialBlurBoneName_32_176CA4C642C4765EE3310DA01873DF94; // 0x004C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43B1[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           RushEndMontage_44_C966D3964E1C4E330F00B38C06E9463F; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           RushEndWeaponMontage_46_6813B6424D97E0CE7FD88DAAC722AA9F; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHCHitControllerVibrationType                 VibrationType_49_47A089A04B81FE0F0B01B6A5389ECCF0; // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FChargeAttackData) == 0x000008, "Wrong alignment on FChargeAttackData");
static_assert(sizeof(FChargeAttackData) == 0x000070, "Wrong size on FChargeAttackData");
static_assert(offsetof(FChargeAttackData, ChargeValue_5_48C850844A7EBA606758CB9B0C580EB3) == 0x000000, "Member 'FChargeAttackData::ChargeValue_5_48C850844A7EBA606758CB9B0C580EB3' has a wrong offset!");
static_assert(offsetof(FChargeAttackData, Montage_2_F1002E514D28136933DA9D8C9158B8C3) == 0x000008, "Member 'FChargeAttackData::Montage_2_F1002E514D28136933DA9D8C9158B8C3' has a wrong offset!");
static_assert(offsetof(FChargeAttackData, WeaponMontage_38_7716501F49E738C0BE759B99630F5A68) == 0x000010, "Member 'FChargeAttackData::WeaponMontage_38_7716501F49E738C0BE759B99630F5A68' has a wrong offset!");
static_assert(offsetof(FChargeAttackData, ChargeSEAttachPointName_22_D8671A5C407E63F745F820A15CE1792E) == 0x000018, "Member 'FChargeAttackData::ChargeSEAttachPointName_22_D8671A5C407E63F745F820A15CE1792E' has a wrong offset!");
static_assert(offsetof(FChargeAttackData, ChargeSE_16_BE05FF194E0D4B156EA183813EBEB532) == 0x000020, "Member 'FChargeAttackData::ChargeSE_16_BE05FF194E0D4B156EA183813EBEB532' has a wrong offset!");
static_assert(offsetof(FChargeAttackData, EffectData_20_8702C18242B2DFC8F3A24CAE8A1B335A) == 0x000028, "Member 'FChargeAttackData::EffectData_20_8702C18242B2DFC8F3A24CAE8A1B335A' has a wrong offset!");
static_assert(offsetof(FChargeAttackData, bUseRadialBlur_35_1FCA6EA74ECBF67518A13AA18AAC59D6) == 0x000038, "Member 'FChargeAttackData::bUseRadialBlur_35_1FCA6EA74ECBF67518A13AA18AAC59D6' has a wrong offset!");
static_assert(offsetof(FChargeAttackData, RadialBlurCurveData_26_58A32F0C4EE2BB039745E19B4E05DB84) == 0x000040, "Member 'FChargeAttackData::RadialBlurCurveData_26_58A32F0C4EE2BB039745E19B4E05DB84' has a wrong offset!");
static_assert(offsetof(FChargeAttackData, RadialBlurModulateType_29_99E8E96147517A82AD9F51B94C55573E) == 0x000048, "Member 'FChargeAttackData::RadialBlurModulateType_29_99E8E96147517A82AD9F51B94C55573E' has a wrong offset!");
static_assert(offsetof(FChargeAttackData, RadialBlurBoneName_32_176CA4C642C4765EE3310DA01873DF94) == 0x00004C, "Member 'FChargeAttackData::RadialBlurBoneName_32_176CA4C642C4765EE3310DA01873DF94' has a wrong offset!");
static_assert(offsetof(FChargeAttackData, RushEndMontage_44_C966D3964E1C4E330F00B38C06E9463F) == 0x000058, "Member 'FChargeAttackData::RushEndMontage_44_C966D3964E1C4E330F00B38C06E9463F' has a wrong offset!");
static_assert(offsetof(FChargeAttackData, RushEndWeaponMontage_46_6813B6424D97E0CE7FD88DAAC722AA9F) == 0x000060, "Member 'FChargeAttackData::RushEndWeaponMontage_46_6813B6424D97E0CE7FD88DAAC722AA9F' has a wrong offset!");
static_assert(offsetof(FChargeAttackData, VibrationType_49_47A089A04B81FE0F0B01B6A5389ECCF0) == 0x000068, "Member 'FChargeAttackData::VibrationType_49_47A089A04B81FE0F0B01B6A5389ECCF0' has a wrong offset!");

}

