#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterAnimNotify_ClearFlying

#include "Basic.hpp"


namespace SDK::Params
{

// Function CharacterAnimNotify_ClearFlying.CharacterAnimNotify_ClearFlying_C.Received_Notify
// 0x0058 (0x0058 - 0x0000)
struct CharacterAnimNotify_ClearFlying_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45E6[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovementPropertyMediator*              LMovementMediator;                                 // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45E7[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimMontageStoped_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45E8[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMovementPropertyInterface> K2Node_DynamicCast_AsMovement_Property_Interface;  // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClearFlyingForceInterface_ReturnValue;    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterAnimNotify_ClearFlying_C_Received_Notify) == 0x000008, "Wrong alignment on CharacterAnimNotify_ClearFlying_C_Received_Notify");
static_assert(sizeof(CharacterAnimNotify_ClearFlying_C_Received_Notify) == 0x000058, "Wrong size on CharacterAnimNotify_ClearFlying_C_Received_Notify");
static_assert(offsetof(CharacterAnimNotify_ClearFlying_C_Received_Notify, MeshComp) == 0x000000, "Member 'CharacterAnimNotify_ClearFlying_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(CharacterAnimNotify_ClearFlying_C_Received_Notify, Animation) == 0x000008, "Member 'CharacterAnimNotify_ClearFlying_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(CharacterAnimNotify_ClearFlying_C_Received_Notify, ReturnValue) == 0x000010, "Member 'CharacterAnimNotify_ClearFlying_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterAnimNotify_ClearFlying_C_Received_Notify, LMovementMediator) == 0x000018, "Member 'CharacterAnimNotify_ClearFlying_C_Received_Notify::LMovementMediator' has a wrong offset!");
static_assert(offsetof(CharacterAnimNotify_ClearFlying_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'CharacterAnimNotify_ClearFlying_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterAnimNotify_ClearFlying_C_Received_Notify, CallFunc_GetAnimInstance_ReturnValue) == 0x000028, "Member 'CharacterAnimNotify_ClearFlying_C_Received_Notify::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterAnimNotify_ClearFlying_C_Received_Notify, CallFunc_IsAnimMontageStoped_ReturnValue) == 0x000030, "Member 'CharacterAnimNotify_ClearFlying_C_Received_Notify::CallFunc_IsAnimMontageStoped_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterAnimNotify_ClearFlying_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'CharacterAnimNotify_ClearFlying_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterAnimNotify_ClearFlying_C_Received_Notify, K2Node_DynamicCast_AsMovement_Property_Interface) == 0x000040, "Member 'CharacterAnimNotify_ClearFlying_C_Received_Notify::K2Node_DynamicCast_AsMovement_Property_Interface' has a wrong offset!");
static_assert(offsetof(CharacterAnimNotify_ClearFlying_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'CharacterAnimNotify_ClearFlying_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterAnimNotify_ClearFlying_C_Received_Notify, CallFunc_ClearFlyingForceInterface_ReturnValue) == 0x000051, "Member 'CharacterAnimNotify_ClearFlying_C_Received_Notify::CallFunc_ClearFlyingForceInterface_ReturnValue' has a wrong offset!");

}

