#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharactersSkillData

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK
{

// UserDefinedStruct CharactersSkillData.CharactersSkillData
// 0x0024 (0x0024 - 0x0000)
struct FCharactersSkillData final
{
public:
	EPlayerSkillCategory                          Category_15_7C8D060142B0EF52FD0F5DA34FFDAAE0;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerSkillIconCategory                      IconType_25_486DD8F14C001FFB6BEBBEACF5F1CEFE;      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D23[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LearnPoint_36_0FA79E644C71D01DE288F0BCADF05A00;    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LearnPointCh0200_40_0ECD57BE4017D9223BD507BD1749A108; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Parameter_20_9A2B6E0A4E5DDBFE2D5C98BE43D285BE;     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Parameter2_28_54FAEE9D4C889ABECE15DC92801F246A;    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameMessageID_32_BEDF0CA84AEE8F63A99C5B94D915A104; // 0x0014(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DescriptionMessageID_33_C2BD7493489C603C01542C9FB160A7FC; // 0x001C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FCharactersSkillData) == 0x000004, "Wrong alignment on FCharactersSkillData");
static_assert(sizeof(FCharactersSkillData) == 0x000024, "Wrong size on FCharactersSkillData");
static_assert(offsetof(FCharactersSkillData, Category_15_7C8D060142B0EF52FD0F5DA34FFDAAE0) == 0x000000, "Member 'FCharactersSkillData::Category_15_7C8D060142B0EF52FD0F5DA34FFDAAE0' has a wrong offset!");
static_assert(offsetof(FCharactersSkillData, IconType_25_486DD8F14C001FFB6BEBBEACF5F1CEFE) == 0x000001, "Member 'FCharactersSkillData::IconType_25_486DD8F14C001FFB6BEBBEACF5F1CEFE' has a wrong offset!");
static_assert(offsetof(FCharactersSkillData, LearnPoint_36_0FA79E644C71D01DE288F0BCADF05A00) == 0x000004, "Member 'FCharactersSkillData::LearnPoint_36_0FA79E644C71D01DE288F0BCADF05A00' has a wrong offset!");
static_assert(offsetof(FCharactersSkillData, LearnPointCh0200_40_0ECD57BE4017D9223BD507BD1749A108) == 0x000008, "Member 'FCharactersSkillData::LearnPointCh0200_40_0ECD57BE4017D9223BD507BD1749A108' has a wrong offset!");
static_assert(offsetof(FCharactersSkillData, Parameter_20_9A2B6E0A4E5DDBFE2D5C98BE43D285BE) == 0x00000C, "Member 'FCharactersSkillData::Parameter_20_9A2B6E0A4E5DDBFE2D5C98BE43D285BE' has a wrong offset!");
static_assert(offsetof(FCharactersSkillData, Parameter2_28_54FAEE9D4C889ABECE15DC92801F246A) == 0x000010, "Member 'FCharactersSkillData::Parameter2_28_54FAEE9D4C889ABECE15DC92801F246A' has a wrong offset!");
static_assert(offsetof(FCharactersSkillData, NameMessageID_32_BEDF0CA84AEE8F63A99C5B94D915A104) == 0x000014, "Member 'FCharactersSkillData::NameMessageID_32_BEDF0CA84AEE8F63A99C5B94D915A104' has a wrong offset!");
static_assert(offsetof(FCharactersSkillData, DescriptionMessageID_33_C2BD7493489C603C01542C9FB160A7FC) == 0x00001C, "Member 'FCharactersSkillData::DescriptionMessageID_33_C2BD7493489C603C01542C9FB160A7FC' has a wrong offset!");

}

