#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CollisionCommonInfoBP

#include "Basic.hpp"

#include "CollisionValueDataBP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "CollisionElementDataBP_structs.hpp"
#include "DamageKindBP_structs.hpp"
#include "CollisionHitTeamBP_structs.hpp"
#include "CollitionConditionDataBP_structs.hpp"


namespace SDK
{

// UserDefinedStruct CollisionCommonInfoBP.CollisionCommonInfoBP
// 0x0078 (0x0078 - 0x0000)
struct FCollisionCommonInfoBP final
{
public:
	int32                                         Power_15_68A4FEC844E2B46C63F379A57E840ECA;         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               BlowAngle_34_8E62A796473BBB616C072B8F24F2BA42;     // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         BlowPower_35_FE0E05E849B61A74E875AAB6EA82A399;     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitStopSec_67_85B2F6424D75DA99F945E8BDFB1988D3;    // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitStopActionSpeedRate_68_4924F49445BABF9773C69DB837ECF48B; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDamageKindBP                                 DamageKind_73_81558ED041B6E93F3B9B1D8D268EFDAA;    // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52D2[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DamageStiffenSec_74_BE4706B849EBC68B2A64E99CBC6C3238; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stagger_41_D082343B4BDC35AE13F8EFAF94A71EC2;       // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReduceGuard_44_B1F91152441C35B5F6661E92B61F5516;   // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHCHitEffectType                              HitEffectType_89_BA16CC2D44F89D739EB6F9A2626E5521; // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52D3[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCollisionElementDataBP>        ElementDatas_53_E41972E44558710DB3052599D1227E13;  // 0x0030(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FCollitionConditionDataBP>      ConditionDatas_54_A99729054CE39CE8A753379970DC9F39; // 0x0040(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FCollisionValueDataBP>          Values_62_A4EE63344E0814FD6293C8BE1E139122;        // 0x0050(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	ECollisionHitTeamBP                           HitTeam_57_64E62BC64E74C86687B228B4AEDA552F;       // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52D4[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GroupNo_78_9F23551D4701F2C66D3E89B8DE3E0504;       // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GroupKeepSec_81_B418334B463FA844BCD81DA0880BA250;  // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RepeatHitSec_84_FBD5B0E04C04D4149770D7A43393A05C;  // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StiffenSec_38_CB48071A47991C843690359F919CFC23;    // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Element_23_6CFE38A74B452861BB9B6FBB3600DFC5;       // 0x0074(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FCollisionCommonInfoBP) == 0x000008, "Wrong alignment on FCollisionCommonInfoBP");
static_assert(sizeof(FCollisionCommonInfoBP) == 0x000078, "Wrong size on FCollisionCommonInfoBP");
static_assert(offsetof(FCollisionCommonInfoBP, Power_15_68A4FEC844E2B46C63F379A57E840ECA) == 0x000000, "Member 'FCollisionCommonInfoBP::Power_15_68A4FEC844E2B46C63F379A57E840ECA' has a wrong offset!");
static_assert(offsetof(FCollisionCommonInfoBP, BlowAngle_34_8E62A796473BBB616C072B8F24F2BA42) == 0x000004, "Member 'FCollisionCommonInfoBP::BlowAngle_34_8E62A796473BBB616C072B8F24F2BA42' has a wrong offset!");
static_assert(offsetof(FCollisionCommonInfoBP, BlowPower_35_FE0E05E849B61A74E875AAB6EA82A399) == 0x000010, "Member 'FCollisionCommonInfoBP::BlowPower_35_FE0E05E849B61A74E875AAB6EA82A399' has a wrong offset!");
static_assert(offsetof(FCollisionCommonInfoBP, HitStopSec_67_85B2F6424D75DA99F945E8BDFB1988D3) == 0x000014, "Member 'FCollisionCommonInfoBP::HitStopSec_67_85B2F6424D75DA99F945E8BDFB1988D3' has a wrong offset!");
static_assert(offsetof(FCollisionCommonInfoBP, HitStopActionSpeedRate_68_4924F49445BABF9773C69DB837ECF48B) == 0x000018, "Member 'FCollisionCommonInfoBP::HitStopActionSpeedRate_68_4924F49445BABF9773C69DB837ECF48B' has a wrong offset!");
static_assert(offsetof(FCollisionCommonInfoBP, DamageKind_73_81558ED041B6E93F3B9B1D8D268EFDAA) == 0x00001C, "Member 'FCollisionCommonInfoBP::DamageKind_73_81558ED041B6E93F3B9B1D8D268EFDAA' has a wrong offset!");
static_assert(offsetof(FCollisionCommonInfoBP, DamageStiffenSec_74_BE4706B849EBC68B2A64E99CBC6C3238) == 0x000020, "Member 'FCollisionCommonInfoBP::DamageStiffenSec_74_BE4706B849EBC68B2A64E99CBC6C3238' has a wrong offset!");
static_assert(offsetof(FCollisionCommonInfoBP, Stagger_41_D082343B4BDC35AE13F8EFAF94A71EC2) == 0x000024, "Member 'FCollisionCommonInfoBP::Stagger_41_D082343B4BDC35AE13F8EFAF94A71EC2' has a wrong offset!");
static_assert(offsetof(FCollisionCommonInfoBP, ReduceGuard_44_B1F91152441C35B5F6661E92B61F5516) == 0x000028, "Member 'FCollisionCommonInfoBP::ReduceGuard_44_B1F91152441C35B5F6661E92B61F5516' has a wrong offset!");
static_assert(offsetof(FCollisionCommonInfoBP, HitEffectType_89_BA16CC2D44F89D739EB6F9A2626E5521) == 0x00002C, "Member 'FCollisionCommonInfoBP::HitEffectType_89_BA16CC2D44F89D739EB6F9A2626E5521' has a wrong offset!");
static_assert(offsetof(FCollisionCommonInfoBP, ElementDatas_53_E41972E44558710DB3052599D1227E13) == 0x000030, "Member 'FCollisionCommonInfoBP::ElementDatas_53_E41972E44558710DB3052599D1227E13' has a wrong offset!");
static_assert(offsetof(FCollisionCommonInfoBP, ConditionDatas_54_A99729054CE39CE8A753379970DC9F39) == 0x000040, "Member 'FCollisionCommonInfoBP::ConditionDatas_54_A99729054CE39CE8A753379970DC9F39' has a wrong offset!");
static_assert(offsetof(FCollisionCommonInfoBP, Values_62_A4EE63344E0814FD6293C8BE1E139122) == 0x000050, "Member 'FCollisionCommonInfoBP::Values_62_A4EE63344E0814FD6293C8BE1E139122' has a wrong offset!");
static_assert(offsetof(FCollisionCommonInfoBP, HitTeam_57_64E62BC64E74C86687B228B4AEDA552F) == 0x000060, "Member 'FCollisionCommonInfoBP::HitTeam_57_64E62BC64E74C86687B228B4AEDA552F' has a wrong offset!");
static_assert(offsetof(FCollisionCommonInfoBP, GroupNo_78_9F23551D4701F2C66D3E89B8DE3E0504) == 0x000064, "Member 'FCollisionCommonInfoBP::GroupNo_78_9F23551D4701F2C66D3E89B8DE3E0504' has a wrong offset!");
static_assert(offsetof(FCollisionCommonInfoBP, GroupKeepSec_81_B418334B463FA844BCD81DA0880BA250) == 0x000068, "Member 'FCollisionCommonInfoBP::GroupKeepSec_81_B418334B463FA844BCD81DA0880BA250' has a wrong offset!");
static_assert(offsetof(FCollisionCommonInfoBP, RepeatHitSec_84_FBD5B0E04C04D4149770D7A43393A05C) == 0x00006C, "Member 'FCollisionCommonInfoBP::RepeatHitSec_84_FBD5B0E04C04D4149770D7A43393A05C' has a wrong offset!");
static_assert(offsetof(FCollisionCommonInfoBP, StiffenSec_38_CB48071A47991C843690359F919CFC23) == 0x000070, "Member 'FCollisionCommonInfoBP::StiffenSec_38_CB48071A47991C843690359F919CFC23' has a wrong offset!");
static_assert(offsetof(FCollisionCommonInfoBP, Element_23_6CFE38A74B452861BB9B6FBB3600DFC5) == 0x000074, "Member 'FCollisionCommonInfoBP::Element_23_6CFE38A74B452861BB9B6FBB3600DFC5' has a wrong offset!");

}

