#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmosWebApi

#include "Basic.hpp"

#include "CosmosWebApi_structs.hpp"


namespace SDK::Params
{

// Function CosmosWebApi.WebApiConnect.GetCampaignGetListResponse
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetCampaignGetListResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCampaignGetListResponseParam          RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetCampaignGetListResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetCampaignGetListResponse");
static_assert(sizeof(WebApiConnect_GetCampaignGetListResponse) == 0x000048, "Wrong size on WebApiConnect_GetCampaignGetListResponse");
static_assert(offsetof(WebApiConnect_GetCampaignGetListResponse, Data) == 0x000000, "Member 'WebApiConnect_GetCampaignGetListResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCampaignGetListResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetCampaignGetListResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCampaignGetListResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetCampaignGetListResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetCampaignInfoResponse
// 0x00C8 (0x00C8 - 0x0000)
struct WebApiConnect_GetCampaignInfoResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCampaignInfoResponseParam             RespParam;                                         // 0x0030(0x0098)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetCampaignInfoResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetCampaignInfoResponse");
static_assert(sizeof(WebApiConnect_GetCampaignInfoResponse) == 0x0000C8, "Wrong size on WebApiConnect_GetCampaignInfoResponse");
static_assert(offsetof(WebApiConnect_GetCampaignInfoResponse, Data) == 0x000000, "Member 'WebApiConnect_GetCampaignInfoResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCampaignInfoResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetCampaignInfoResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCampaignInfoResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetCampaignInfoResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetCampaignRewardListResponse
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetCampaignRewardListResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCampaignRewardListResponseParam       RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetCampaignRewardListResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetCampaignRewardListResponse");
static_assert(sizeof(WebApiConnect_GetCampaignRewardListResponse) == 0x000048, "Wrong size on WebApiConnect_GetCampaignRewardListResponse");
static_assert(offsetof(WebApiConnect_GetCampaignRewardListResponse, Data) == 0x000000, "Member 'WebApiConnect_GetCampaignRewardListResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCampaignRewardListResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetCampaignRewardListResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCampaignRewardListResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetCampaignRewardListResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetCampaignTitleListResponse
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetCampaignTitleListResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCampaignTitleListResponseParam        RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetCampaignTitleListResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetCampaignTitleListResponse");
static_assert(sizeof(WebApiConnect_GetCampaignTitleListResponse) == 0x000048, "Wrong size on WebApiConnect_GetCampaignTitleListResponse");
static_assert(offsetof(WebApiConnect_GetCampaignTitleListResponse, Data) == 0x000000, "Member 'WebApiConnect_GetCampaignTitleListResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCampaignTitleListResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetCampaignTitleListResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCampaignTitleListResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetCampaignTitleListResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetCatalogGetAreaResponse
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetCatalogGetAreaResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCatalogGetAreaResponseParam           RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetCatalogGetAreaResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetCatalogGetAreaResponse");
static_assert(sizeof(WebApiConnect_GetCatalogGetAreaResponse) == 0x000048, "Wrong size on WebApiConnect_GetCatalogGetAreaResponse");
static_assert(offsetof(WebApiConnect_GetCatalogGetAreaResponse, Data) == 0x000000, "Member 'WebApiConnect_GetCatalogGetAreaResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCatalogGetAreaResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetCatalogGetAreaResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCatalogGetAreaResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetCatalogGetAreaResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetCatalogGetLobbyResponse
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetCatalogGetLobbyResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCatalogGetLobbyResponseParam          RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetCatalogGetLobbyResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetCatalogGetLobbyResponse");
static_assert(sizeof(WebApiConnect_GetCatalogGetLobbyResponse) == 0x000048, "Wrong size on WebApiConnect_GetCatalogGetLobbyResponse");
static_assert(offsetof(WebApiConnect_GetCatalogGetLobbyResponse, Data) == 0x000000, "Member 'WebApiConnect_GetCatalogGetLobbyResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCatalogGetLobbyResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetCatalogGetLobbyResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCatalogGetLobbyResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetCatalogGetLobbyResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetCatalogGetRegionResponse
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetCatalogGetRegionResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCatalogGetRegionResponseParam         RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetCatalogGetRegionResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetCatalogGetRegionResponse");
static_assert(sizeof(WebApiConnect_GetCatalogGetRegionResponse) == 0x000048, "Wrong size on WebApiConnect_GetCatalogGetRegionResponse");
static_assert(offsetof(WebApiConnect_GetCatalogGetRegionResponse, Data) == 0x000000, "Member 'WebApiConnect_GetCatalogGetRegionResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCatalogGetRegionResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetCatalogGetRegionResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCatalogGetRegionResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetCatalogGetRegionResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetCommonpurchaseCancelPurchaseResponse
// 0x0038 (0x0038 - 0x0000)
struct WebApiConnect_GetCommonpurchaseCancelPurchaseResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCommonpurchaseCancelPurchaseResponseParam RespParam;                                         // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1488[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WebApiConnect_GetCommonpurchaseCancelPurchaseResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetCommonpurchaseCancelPurchaseResponse");
static_assert(sizeof(WebApiConnect_GetCommonpurchaseCancelPurchaseResponse) == 0x000038, "Wrong size on WebApiConnect_GetCommonpurchaseCancelPurchaseResponse");
static_assert(offsetof(WebApiConnect_GetCommonpurchaseCancelPurchaseResponse, Data) == 0x000000, "Member 'WebApiConnect_GetCommonpurchaseCancelPurchaseResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCommonpurchaseCancelPurchaseResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetCommonpurchaseCancelPurchaseResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCommonpurchaseCancelPurchaseResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetCommonpurchaseCancelPurchaseResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetCommonpurchaseCompletePurchaseResponse
// 0x0038 (0x0038 - 0x0000)
struct WebApiConnect_GetCommonpurchaseCompletePurchaseResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCommonpurchaseCompletePurchaseResponseParam RespParam;                                         // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1489[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WebApiConnect_GetCommonpurchaseCompletePurchaseResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetCommonpurchaseCompletePurchaseResponse");
static_assert(sizeof(WebApiConnect_GetCommonpurchaseCompletePurchaseResponse) == 0x000038, "Wrong size on WebApiConnect_GetCommonpurchaseCompletePurchaseResponse");
static_assert(offsetof(WebApiConnect_GetCommonpurchaseCompletePurchaseResponse, Data) == 0x000000, "Member 'WebApiConnect_GetCommonpurchaseCompletePurchaseResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCommonpurchaseCompletePurchaseResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetCommonpurchaseCompletePurchaseResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCommonpurchaseCompletePurchaseResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetCommonpurchaseCompletePurchaseResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetCommonpurchaseGetCatalogResponse
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetCommonpurchaseGetCatalogResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCommonpurchaseGetCatalogResponseParam RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetCommonpurchaseGetCatalogResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetCommonpurchaseGetCatalogResponse");
static_assert(sizeof(WebApiConnect_GetCommonpurchaseGetCatalogResponse) == 0x000048, "Wrong size on WebApiConnect_GetCommonpurchaseGetCatalogResponse");
static_assert(offsetof(WebApiConnect_GetCommonpurchaseGetCatalogResponse, Data) == 0x000000, "Member 'WebApiConnect_GetCommonpurchaseGetCatalogResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCommonpurchaseGetCatalogResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetCommonpurchaseGetCatalogResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCommonpurchaseGetCatalogResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetCommonpurchaseGetCatalogResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetCommonpurchaseGetPurchaseStatusResponse
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetCommonpurchaseGetPurchaseStatusResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCommonpurchaseGetPurchaseStatusResponseParam RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetCommonpurchaseGetPurchaseStatusResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetCommonpurchaseGetPurchaseStatusResponse");
static_assert(sizeof(WebApiConnect_GetCommonpurchaseGetPurchaseStatusResponse) == 0x000048, "Wrong size on WebApiConnect_GetCommonpurchaseGetPurchaseStatusResponse");
static_assert(offsetof(WebApiConnect_GetCommonpurchaseGetPurchaseStatusResponse, Data) == 0x000000, "Member 'WebApiConnect_GetCommonpurchaseGetPurchaseStatusResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCommonpurchaseGetPurchaseStatusResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetCommonpurchaseGetPurchaseStatusResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCommonpurchaseGetPurchaseStatusResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetCommonpurchaseGetPurchaseStatusResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetCommonpurchaseStartPurchaseResponse
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetCommonpurchaseStartPurchaseResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCommonpurchaseStartPurchaseResponseParam RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetCommonpurchaseStartPurchaseResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetCommonpurchaseStartPurchaseResponse");
static_assert(sizeof(WebApiConnect_GetCommonpurchaseStartPurchaseResponse) == 0x000048, "Wrong size on WebApiConnect_GetCommonpurchaseStartPurchaseResponse");
static_assert(offsetof(WebApiConnect_GetCommonpurchaseStartPurchaseResponse, Data) == 0x000000, "Member 'WebApiConnect_GetCommonpurchaseStartPurchaseResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCommonpurchaseStartPurchaseResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetCommonpurchaseStartPurchaseResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCommonpurchaseStartPurchaseResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetCommonpurchaseStartPurchaseResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetCommonpurchaseTokushoResponse
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetCommonpurchaseTokushoResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCommonpurchaseTokushoResponseParam    RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetCommonpurchaseTokushoResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetCommonpurchaseTokushoResponse");
static_assert(sizeof(WebApiConnect_GetCommonpurchaseTokushoResponse) == 0x000048, "Wrong size on WebApiConnect_GetCommonpurchaseTokushoResponse");
static_assert(offsetof(WebApiConnect_GetCommonpurchaseTokushoResponse, Data) == 0x000000, "Member 'WebApiConnect_GetCommonpurchaseTokushoResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCommonpurchaseTokushoResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetCommonpurchaseTokushoResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetCommonpurchaseTokushoResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetCommonpurchaseTokushoResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetDataupAppendResponse
// 0x0038 (0x0038 - 0x0000)
struct WebApiConnect_GetDataupAppendResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCommonResponseParam                   RespParam;                                         // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_148A[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WebApiConnect_GetDataupAppendResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetDataupAppendResponse");
static_assert(sizeof(WebApiConnect_GetDataupAppendResponse) == 0x000038, "Wrong size on WebApiConnect_GetDataupAppendResponse");
static_assert(offsetof(WebApiConnect_GetDataupAppendResponse, Data) == 0x000000, "Member 'WebApiConnect_GetDataupAppendResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetDataupAppendResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetDataupAppendResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetDataupAppendResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetDataupAppendResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetDataupReadResponse
// 0x00A8 (0x00A8 - 0x0000)
struct WebApiConnect_GetDataupReadResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FDataupReadResponseParam               RespParam;                                         // 0x0030(0x0078)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetDataupReadResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetDataupReadResponse");
static_assert(sizeof(WebApiConnect_GetDataupReadResponse) == 0x0000A8, "Wrong size on WebApiConnect_GetDataupReadResponse");
static_assert(offsetof(WebApiConnect_GetDataupReadResponse, Data) == 0x000000, "Member 'WebApiConnect_GetDataupReadResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetDataupReadResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetDataupReadResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetDataupReadResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetDataupReadResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetDataupSearchResponse
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetDataupSearchResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FDataupSearchResponseParam             RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetDataupSearchResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetDataupSearchResponse");
static_assert(sizeof(WebApiConnect_GetDataupSearchResponse) == 0x000048, "Wrong size on WebApiConnect_GetDataupSearchResponse");
static_assert(offsetof(WebApiConnect_GetDataupSearchResponse, Data) == 0x000000, "Member 'WebApiConnect_GetDataupSearchResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetDataupSearchResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetDataupSearchResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetDataupSearchResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetDataupSearchResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetDataupWriteResponse
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetDataupWriteResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FDataupWriteResponseParam              RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetDataupWriteResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetDataupWriteResponse");
static_assert(sizeof(WebApiConnect_GetDataupWriteResponse) == 0x000048, "Wrong size on WebApiConnect_GetDataupWriteResponse");
static_assert(offsetof(WebApiConnect_GetDataupWriteResponse, Data) == 0x000000, "Member 'WebApiConnect_GetDataupWriteResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetDataupWriteResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetDataupWriteResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetDataupWriteResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetDataupWriteResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetFesAddPointResponse
// 0x0038 (0x0038 - 0x0000)
struct WebApiConnect_GetFesAddPointResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FFesAddPointResponseParam              RespParam;                                         // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetFesAddPointResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetFesAddPointResponse");
static_assert(sizeof(WebApiConnect_GetFesAddPointResponse) == 0x000038, "Wrong size on WebApiConnect_GetFesAddPointResponse");
static_assert(offsetof(WebApiConnect_GetFesAddPointResponse, Data) == 0x000000, "Member 'WebApiConnect_GetFesAddPointResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetFesAddPointResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetFesAddPointResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetFesAddPointResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetFesAddPointResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetFesCompleteResponse
// 0x0038 (0x0038 - 0x0000)
struct WebApiConnect_GetFesCompleteResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCommonResponseParam                   RespParam;                                         // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_148B[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WebApiConnect_GetFesCompleteResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetFesCompleteResponse");
static_assert(sizeof(WebApiConnect_GetFesCompleteResponse) == 0x000038, "Wrong size on WebApiConnect_GetFesCompleteResponse");
static_assert(offsetof(WebApiConnect_GetFesCompleteResponse, Data) == 0x000000, "Member 'WebApiConnect_GetFesCompleteResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetFesCompleteResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetFesCompleteResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetFesCompleteResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetFesCompleteResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetFesGetInfoResponse
// 0x00C0 (0x00C0 - 0x0000)
struct WebApiConnect_GetFesGetInfoResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FFesGetInfoResponseParam               RespParam;                                         // 0x0030(0x0090)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetFesGetInfoResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetFesGetInfoResponse");
static_assert(sizeof(WebApiConnect_GetFesGetInfoResponse) == 0x0000C0, "Wrong size on WebApiConnect_GetFesGetInfoResponse");
static_assert(offsetof(WebApiConnect_GetFesGetInfoResponse, Data) == 0x000000, "Member 'WebApiConnect_GetFesGetInfoResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetFesGetInfoResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetFesGetInfoResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetFesGetInfoResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetFesGetInfoResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetFesGetListResponse
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetFesGetListResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FFesGetListResponseParam               RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetFesGetListResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetFesGetListResponse");
static_assert(sizeof(WebApiConnect_GetFesGetListResponse) == 0x000048, "Wrong size on WebApiConnect_GetFesGetListResponse");
static_assert(offsetof(WebApiConnect_GetFesGetListResponse, Data) == 0x000000, "Member 'WebApiConnect_GetFesGetListResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetFesGetListResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetFesGetListResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetFesGetListResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetFesGetListResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetFesGetRewardResponse
// 0x0058 (0x0058 - 0x0000)
struct WebApiConnect_GetFesGetRewardResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FFesGetRewardResponseParam             RespParam;                                         // 0x0030(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetFesGetRewardResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetFesGetRewardResponse");
static_assert(sizeof(WebApiConnect_GetFesGetRewardResponse) == 0x000058, "Wrong size on WebApiConnect_GetFesGetRewardResponse");
static_assert(offsetof(WebApiConnect_GetFesGetRewardResponse, Data) == 0x000000, "Member 'WebApiConnect_GetFesGetRewardResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetFesGetRewardResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetFesGetRewardResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetFesGetRewardResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetFesGetRewardResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetFesJoinResponse
// 0x0038 (0x0038 - 0x0000)
struct WebApiConnect_GetFesJoinResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCommonResponseParam                   RespParam;                                         // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_148C[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WebApiConnect_GetFesJoinResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetFesJoinResponse");
static_assert(sizeof(WebApiConnect_GetFesJoinResponse) == 0x000038, "Wrong size on WebApiConnect_GetFesJoinResponse");
static_assert(offsetof(WebApiConnect_GetFesJoinResponse, Data) == 0x000000, "Member 'WebApiConnect_GetFesJoinResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetFesJoinResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetFesJoinResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetFesJoinResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetFesJoinResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetGamecurrencyGetLimitedOwnedResponse
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetGamecurrencyGetLimitedOwnedResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FGamecurrencyGetLimitedOwnedResponseParam RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetGamecurrencyGetLimitedOwnedResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetGamecurrencyGetLimitedOwnedResponse");
static_assert(sizeof(WebApiConnect_GetGamecurrencyGetLimitedOwnedResponse) == 0x000048, "Wrong size on WebApiConnect_GetGamecurrencyGetLimitedOwnedResponse");
static_assert(offsetof(WebApiConnect_GetGamecurrencyGetLimitedOwnedResponse, Data) == 0x000000, "Member 'WebApiConnect_GetGamecurrencyGetLimitedOwnedResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGamecurrencyGetLimitedOwnedResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetGamecurrencyGetLimitedOwnedResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGamecurrencyGetLimitedOwnedResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetGamecurrencyGetLimitedOwnedResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetGamecurrencyGetOwnedResponse
// 0x0068 (0x0068 - 0x0000)
struct WebApiConnect_GetGamecurrencyGetOwnedResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FGamecurrencyGetOwnedResponseParam     RespParam;                                         // 0x0030(0x0038)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetGamecurrencyGetOwnedResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetGamecurrencyGetOwnedResponse");
static_assert(sizeof(WebApiConnect_GetGamecurrencyGetOwnedResponse) == 0x000068, "Wrong size on WebApiConnect_GetGamecurrencyGetOwnedResponse");
static_assert(offsetof(WebApiConnect_GetGamecurrencyGetOwnedResponse, Data) == 0x000000, "Member 'WebApiConnect_GetGamecurrencyGetOwnedResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGamecurrencyGetOwnedResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetGamecurrencyGetOwnedResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGamecurrencyGetOwnedResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetGamecurrencyGetOwnedResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetGiftBoxCloseResponse
// 0x0038 (0x0038 - 0x0000)
struct WebApiConnect_GetGiftBoxCloseResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCommonResponseParam                   RespParam;                                         // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_148D[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WebApiConnect_GetGiftBoxCloseResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetGiftBoxCloseResponse");
static_assert(sizeof(WebApiConnect_GetGiftBoxCloseResponse) == 0x000038, "Wrong size on WebApiConnect_GetGiftBoxCloseResponse");
static_assert(offsetof(WebApiConnect_GetGiftBoxCloseResponse, Data) == 0x000000, "Member 'WebApiConnect_GetGiftBoxCloseResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGiftBoxCloseResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetGiftBoxCloseResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGiftBoxCloseResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetGiftBoxCloseResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetGiftBoxOpenResponse
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetGiftBoxOpenResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FGiftBoxOpenResponseParam              RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetGiftBoxOpenResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetGiftBoxOpenResponse");
static_assert(sizeof(WebApiConnect_GetGiftBoxOpenResponse) == 0x000048, "Wrong size on WebApiConnect_GetGiftBoxOpenResponse");
static_assert(offsetof(WebApiConnect_GetGiftBoxOpenResponse, Data) == 0x000000, "Member 'WebApiConnect_GetGiftBoxOpenResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGiftBoxOpenResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetGiftBoxOpenResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGiftBoxOpenResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetGiftBoxOpenResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetGuildAddApplyCancelResponse
// 0x0038 (0x0038 - 0x0000)
struct WebApiConnect_GetGuildAddApplyCancelResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCommonResponseParam                   RespParam;                                         // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_148E[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WebApiConnect_GetGuildAddApplyCancelResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetGuildAddApplyCancelResponse");
static_assert(sizeof(WebApiConnect_GetGuildAddApplyCancelResponse) == 0x000038, "Wrong size on WebApiConnect_GetGuildAddApplyCancelResponse");
static_assert(offsetof(WebApiConnect_GetGuildAddApplyCancelResponse, Data) == 0x000000, "Member 'WebApiConnect_GetGuildAddApplyCancelResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGuildAddApplyCancelResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetGuildAddApplyCancelResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGuildAddApplyCancelResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetGuildAddApplyCancelResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetGuildAddApplyListResponse
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetGuildAddApplyListResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FGuildAddApplyListResponseParam        RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetGuildAddApplyListResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetGuildAddApplyListResponse");
static_assert(sizeof(WebApiConnect_GetGuildAddApplyListResponse) == 0x000048, "Wrong size on WebApiConnect_GetGuildAddApplyListResponse");
static_assert(offsetof(WebApiConnect_GetGuildAddApplyListResponse, Data) == 0x000000, "Member 'WebApiConnect_GetGuildAddApplyListResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGuildAddApplyListResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetGuildAddApplyListResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGuildAddApplyListResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetGuildAddApplyListResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetGuildAddApplyResponse
// 0x0038 (0x0038 - 0x0000)
struct WebApiConnect_GetGuildAddApplyResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCommonResponseParam                   RespParam;                                         // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_148F[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WebApiConnect_GetGuildAddApplyResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetGuildAddApplyResponse");
static_assert(sizeof(WebApiConnect_GetGuildAddApplyResponse) == 0x000038, "Wrong size on WebApiConnect_GetGuildAddApplyResponse");
static_assert(offsetof(WebApiConnect_GetGuildAddApplyResponse, Data) == 0x000000, "Member 'WebApiConnect_GetGuildAddApplyResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGuildAddApplyResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetGuildAddApplyResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGuildAddApplyResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetGuildAddApplyResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetGuildAddResponse
// 0x0038 (0x0038 - 0x0000)
struct WebApiConnect_GetGuildAddResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCommonResponseParam                   RespParam;                                         // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1490[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WebApiConnect_GetGuildAddResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetGuildAddResponse");
static_assert(sizeof(WebApiConnect_GetGuildAddResponse) == 0x000038, "Wrong size on WebApiConnect_GetGuildAddResponse");
static_assert(offsetof(WebApiConnect_GetGuildAddResponse, Data) == 0x000000, "Member 'WebApiConnect_GetGuildAddResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGuildAddResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetGuildAddResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGuildAddResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetGuildAddResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetGuildApprovalAddResponse
// 0x0038 (0x0038 - 0x0000)
struct WebApiConnect_GetGuildApprovalAddResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCommonResponseParam                   RespParam;                                         // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1491[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WebApiConnect_GetGuildApprovalAddResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetGuildApprovalAddResponse");
static_assert(sizeof(WebApiConnect_GetGuildApprovalAddResponse) == 0x000038, "Wrong size on WebApiConnect_GetGuildApprovalAddResponse");
static_assert(offsetof(WebApiConnect_GetGuildApprovalAddResponse, Data) == 0x000000, "Member 'WebApiConnect_GetGuildApprovalAddResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGuildApprovalAddResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetGuildApprovalAddResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGuildApprovalAddResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetGuildApprovalAddResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetGuildApprovalListResponse
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetGuildApprovalListResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FGuildApprovalListResponseParam        RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetGuildApprovalListResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetGuildApprovalListResponse");
static_assert(sizeof(WebApiConnect_GetGuildApprovalListResponse) == 0x000048, "Wrong size on WebApiConnect_GetGuildApprovalListResponse");
static_assert(offsetof(WebApiConnect_GetGuildApprovalListResponse, Data) == 0x000000, "Member 'WebApiConnect_GetGuildApprovalListResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGuildApprovalListResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetGuildApprovalListResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGuildApprovalListResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetGuildApprovalListResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetGuildChangeBasePositionResponse
// 0x0038 (0x0038 - 0x0000)
struct WebApiConnect_GetGuildChangeBasePositionResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCommonResponseParam                   RespParam;                                         // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1492[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WebApiConnect_GetGuildChangeBasePositionResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetGuildChangeBasePositionResponse");
static_assert(sizeof(WebApiConnect_GetGuildChangeBasePositionResponse) == 0x000038, "Wrong size on WebApiConnect_GetGuildChangeBasePositionResponse");
static_assert(offsetof(WebApiConnect_GetGuildChangeBasePositionResponse, Data) == 0x000000, "Member 'WebApiConnect_GetGuildChangeBasePositionResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGuildChangeBasePositionResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetGuildChangeBasePositionResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGuildChangeBasePositionResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetGuildChangeBasePositionResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetGuildChangeLeaderResponse
// 0x0038 (0x0038 - 0x0000)
struct WebApiConnect_GetGuildChangeLeaderResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCommonResponseParam                   RespParam;                                         // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1493[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WebApiConnect_GetGuildChangeLeaderResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetGuildChangeLeaderResponse");
static_assert(sizeof(WebApiConnect_GetGuildChangeLeaderResponse) == 0x000038, "Wrong size on WebApiConnect_GetGuildChangeLeaderResponse");
static_assert(offsetof(WebApiConnect_GetGuildChangeLeaderResponse, Data) == 0x000000, "Member 'WebApiConnect_GetGuildChangeLeaderResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGuildChangeLeaderResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetGuildChangeLeaderResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGuildChangeLeaderResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetGuildChangeLeaderResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetGuildCreateResponse
// 0x0048 (0x0048 - 0x0000)
struct WebApiConnect_GetGuildCreateResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FGuildCreateResponseParam              RespParam;                                         // 0x0030(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetGuildCreateResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetGuildCreateResponse");
static_assert(sizeof(WebApiConnect_GetGuildCreateResponse) == 0x000048, "Wrong size on WebApiConnect_GetGuildCreateResponse");
static_assert(offsetof(WebApiConnect_GetGuildCreateResponse, Data) == 0x000000, "Member 'WebApiConnect_GetGuildCreateResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGuildCreateResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetGuildCreateResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGuildCreateResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetGuildCreateResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetGuildEditMemberDataResponse
// 0x0038 (0x0038 - 0x0000)
struct WebApiConnect_GetGuildEditMemberDataResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FCommonResponseParam                   RespParam;                                         // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1494[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WebApiConnect_GetGuildEditMemberDataResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetGuildEditMemberDataResponse");
static_assert(sizeof(WebApiConnect_GetGuildEditMemberDataResponse) == 0x000038, "Wrong size on WebApiConnect_GetGuildEditMemberDataResponse");
static_assert(offsetof(WebApiConnect_GetGuildEditMemberDataResponse, Data) == 0x000000, "Member 'WebApiConnect_GetGuildEditMemberDataResponse::Data' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGuildEditMemberDataResponse, RespHeader) == 0x000008, "Member 'WebApiConnect_GetGuildEditMemberDataResponse::RespHeader' has a wrong offset!");
static_assert(offsetof(WebApiConnect_GetGuildEditMemberDataResponse, RespParam) == 0x000030, "Member 'WebApiConnect_GetGuildEditMemberDataResponse::RespParam' has a wrong offset!");

// Function CosmosWebApi.WebApiConnect.GetGuildEditResponse
// 0x0058 (0x0058 - 0x0000)
struct WebApiConnect_GetGuildEditResponse final
{
public:
	class UNetMessage*                            Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FResponseHeader                        RespHeader;                                        // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FGuildEditResponseParam                RespParam;                                         // 0x0030(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApiConnect_GetGuildEditResponse) == 0x000008, "Wrong alignment on WebApiConnect_GetGuildEditResponse");
static_assert(sizeof(WebApiConnect_GetGuildEditResponse) == 0x000058, "Wrong size on WebApiConnect_GetGuildEditResponse");
static_assert(offsetof(WebApiConnect_GetGuildEditResponse, Data) == 0x000000, "Member 'WebApiConnect_GetGuildEditResponse::Data' has a wrong offset!");
