#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmosWebApi

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct CosmosWebApi.RewardInfo
// 0x0060 (0x0060 - 0x0000)
struct FRewardInfo final
{
public:
	class FString                                 CampaignId;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TicketId;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemId;                                            // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemName;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemDetail;                                        // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CountAll;                                          // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CountPiece;                                        // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Rank;                                              // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Point;                                             // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRewardInfo) == 0x000008, "Wrong alignment on FRewardInfo");
static_assert(sizeof(FRewardInfo) == 0x000060, "Wrong size on FRewardInfo");
static_assert(offsetof(FRewardInfo, CampaignId) == 0x000000, "Member 'FRewardInfo::CampaignId' has a wrong offset!");
static_assert(offsetof(FRewardInfo, TicketId) == 0x000010, "Member 'FRewardInfo::TicketId' has a wrong offset!");
static_assert(offsetof(FRewardInfo, ItemId) == 0x000020, "Member 'FRewardInfo::ItemId' has a wrong offset!");
static_assert(offsetof(FRewardInfo, ItemName) == 0x000030, "Member 'FRewardInfo::ItemName' has a wrong offset!");
static_assert(offsetof(FRewardInfo, ItemDetail) == 0x000040, "Member 'FRewardInfo::ItemDetail' has a wrong offset!");
static_assert(offsetof(FRewardInfo, CountAll) == 0x000050, "Member 'FRewardInfo::CountAll' has a wrong offset!");
static_assert(offsetof(FRewardInfo, CountPiece) == 0x000054, "Member 'FRewardInfo::CountPiece' has a wrong offset!");
static_assert(offsetof(FRewardInfo, Rank) == 0x000058, "Member 'FRewardInfo::Rank' has a wrong offset!");
static_assert(offsetof(FRewardInfo, Point) == 0x00005C, "Member 'FRewardInfo::Point' has a wrong offset!");

// ScriptStruct CosmosWebApi.CampaignInfo
// 0x0090 (0x0090 - 0x0000)
struct FCampaignInfo final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TitleCd;                                           // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StartDate;                                         // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EndDate;                                           // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ItemCount;                                         // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_142A[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 URL;                                               // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Config;                                            // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_142B[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRewardInfo>                    RewardList;                                        // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCampaignInfo) == 0x000008, "Wrong alignment on FCampaignInfo");
static_assert(sizeof(FCampaignInfo) == 0x000090, "Wrong size on FCampaignInfo");
static_assert(offsetof(FCampaignInfo, ID) == 0x000000, "Member 'FCampaignInfo::ID' has a wrong offset!");
static_assert(offsetof(FCampaignInfo, TitleCd) == 0x000010, "Member 'FCampaignInfo::TitleCd' has a wrong offset!");
static_assert(offsetof(FCampaignInfo, Name) == 0x000020, "Member 'FCampaignInfo::Name' has a wrong offset!");
static_assert(offsetof(FCampaignInfo, StartDate) == 0x000030, "Member 'FCampaignInfo::StartDate' has a wrong offset!");
static_assert(offsetof(FCampaignInfo, EndDate) == 0x000040, "Member 'FCampaignInfo::EndDate' has a wrong offset!");
static_assert(offsetof(FCampaignInfo, ItemCount) == 0x000050, "Member 'FCampaignInfo::ItemCount' has a wrong offset!");
static_assert(offsetof(FCampaignInfo, URL) == 0x000058, "Member 'FCampaignInfo::URL' has a wrong offset!");
static_assert(offsetof(FCampaignInfo, Description) == 0x000068, "Member 'FCampaignInfo::Description' has a wrong offset!");
static_assert(offsetof(FCampaignInfo, Config) == 0x000078, "Member 'FCampaignInfo::Config' has a wrong offset!");
static_assert(offsetof(FCampaignInfo, RewardList) == 0x000080, "Member 'FCampaignInfo::RewardList' has a wrong offset!");

// ScriptStruct CosmosWebApi.CampaignGetListResponseParam
// 0x0018 (0x0018 - 0x0000)
struct FCampaignGetListResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_142C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCampaignInfo>                  CampaignList;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCampaignGetListResponseParam) == 0x000008, "Wrong alignment on FCampaignGetListResponseParam");
static_assert(sizeof(FCampaignGetListResponseParam) == 0x000018, "Wrong size on FCampaignGetListResponseParam");
static_assert(offsetof(FCampaignGetListResponseParam, Status) == 0x000000, "Member 'FCampaignGetListResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCampaignGetListResponseParam, CampaignList) == 0x000008, "Member 'FCampaignGetListResponseParam::CampaignList' has a wrong offset!");

// ScriptStruct CosmosWebApi.SavedataMultipartuploadResponseParam
// 0x0004 (0x0004 - 0x0000)
struct FSavedataMultipartuploadResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSavedataMultipartuploadResponseParam) == 0x000004, "Wrong alignment on FSavedataMultipartuploadResponseParam");
static_assert(sizeof(FSavedataMultipartuploadResponseParam) == 0x000004, "Wrong size on FSavedataMultipartuploadResponseParam");
static_assert(offsetof(FSavedataMultipartuploadResponseParam, Status) == 0x000000, "Member 'FSavedataMultipartuploadResponseParam::Status' has a wrong offset!");

// ScriptStruct CosmosWebApi.SavedataDeleteResponseParam
// 0x0004 (0x0004 - 0x0000)
struct FSavedataDeleteResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSavedataDeleteResponseParam) == 0x000004, "Wrong alignment on FSavedataDeleteResponseParam");
static_assert(sizeof(FSavedataDeleteResponseParam) == 0x000004, "Wrong size on FSavedataDeleteResponseParam");
static_assert(offsetof(FSavedataDeleteResponseParam, Status) == 0x000000, "Member 'FSavedataDeleteResponseParam::Status' has a wrong offset!");

// ScriptStruct CosmosWebApi.SavedataDownloadResponseParam
// 0x0018 (0x0018 - 0x0000)
struct FSavedataDownloadResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_142D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SaveData;                                          // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSavedataDownloadResponseParam) == 0x000008, "Wrong alignment on FSavedataDownloadResponseParam");
static_assert(sizeof(FSavedataDownloadResponseParam) == 0x000018, "Wrong size on FSavedataDownloadResponseParam");
static_assert(offsetof(FSavedataDownloadResponseParam, Status) == 0x000000, "Member 'FSavedataDownloadResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FSavedataDownloadResponseParam, SaveData) == 0x000008, "Member 'FSavedataDownloadResponseParam::SaveData' has a wrong offset!");

// ScriptStruct CosmosWebApi.SavedataUploadResponseParam
// 0x0004 (0x0004 - 0x0000)
struct FSavedataUploadResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSavedataUploadResponseParam) == 0x000004, "Wrong alignment on FSavedataUploadResponseParam");
static_assert(sizeof(FSavedataUploadResponseParam) == 0x000004, "Wrong size on FSavedataUploadResponseParam");
static_assert(offsetof(FSavedataUploadResponseParam, Status) == 0x000000, "Member 'FSavedataUploadResponseParam::Status' has a wrong offset!");

// ScriptStruct CosmosWebApi.MissionInfo
// 0x0070 (0x0070 - 0x0000)
struct FMissionInfo final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TitleCd;                                           // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Keyword;                                           // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Point;                                             // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CampaignCategoryId;                                // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CampaignCategoryName;                              // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Upto;                                              // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMissionInfo) == 0x000008, "Wrong alignment on FMissionInfo");
static_assert(sizeof(FMissionInfo) == 0x000070, "Wrong size on FMissionInfo");
static_assert(offsetof(FMissionInfo, ID) == 0x000000, "Member 'FMissionInfo::ID' has a wrong offset!");
static_assert(offsetof(FMissionInfo, Name) == 0x000010, "Member 'FMissionInfo::Name' has a wrong offset!");
static_assert(offsetof(FMissionInfo, TitleCd) == 0x000020, "Member 'FMissionInfo::TitleCd' has a wrong offset!");
static_assert(offsetof(FMissionInfo, Description) == 0x000030, "Member 'FMissionInfo::Description' has a wrong offset!");
static_assert(offsetof(FMissionInfo, Keyword) == 0x000040, "Member 'FMissionInfo::Keyword' has a wrong offset!");
static_assert(offsetof(FMissionInfo, Point) == 0x000050, "Member 'FMissionInfo::Point' has a wrong offset!");
static_assert(offsetof(FMissionInfo, CampaignCategoryId) == 0x000054, "Member 'FMissionInfo::CampaignCategoryId' has a wrong offset!");
static_assert(offsetof(FMissionInfo, CampaignCategoryName) == 0x000058, "Member 'FMissionInfo::CampaignCategoryName' has a wrong offset!");
static_assert(offsetof(FMissionInfo, Count) == 0x000068, "Member 'FMissionInfo::Count' has a wrong offset!");
static_assert(offsetof(FMissionInfo, Upto) == 0x00006C, "Member 'FMissionInfo::Upto' has a wrong offset!");

// ScriptStruct CosmosWebApi.MissionGetListResponseParam
// 0x0018 (0x0018 - 0x0000)
struct FMissionGetListResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_142E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMissionInfo>                   MissionList;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMissionGetListResponseParam) == 0x000008, "Wrong alignment on FMissionGetListResponseParam");
static_assert(sizeof(FMissionGetListResponseParam) == 0x000018, "Wrong size on FMissionGetListResponseParam");
static_assert(offsetof(FMissionGetListResponseParam, Status) == 0x000000, "Member 'FMissionGetListResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FMissionGetListResponseParam, MissionList) == 0x000008, "Member 'FMissionGetListResponseParam::MissionList' has a wrong offset!");

// ScriptStruct CosmosWebApi.RootBoxResultInfo
// 0x0048 (0x0048 - 0x0000)
struct FRootBoxResultInfo final
{
public:
	class FString                                 ItemConfigId;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemId;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ItemNum;                                           // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ItemType;                                          // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OnlineType;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReplaceFlag;                                       // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReplaceItemId;                                     // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReplaceItemNum;                                    // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         boxRemaining;                                      // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRootBoxResultInfo) == 0x000008, "Wrong alignment on FRootBoxResultInfo");
static_assert(sizeof(FRootBoxResultInfo) == 0x000048, "Wrong size on FRootBoxResultInfo");
static_assert(offsetof(FRootBoxResultInfo, ItemConfigId) == 0x000000, "Member 'FRootBoxResultInfo::ItemConfigId' has a wrong offset!");
static_assert(offsetof(FRootBoxResultInfo, ItemId) == 0x000010, "Member 'FRootBoxResultInfo::ItemId' has a wrong offset!");
static_assert(offsetof(FRootBoxResultInfo, ItemNum) == 0x000020, "Member 'FRootBoxResultInfo::ItemNum' has a wrong offset!");
static_assert(offsetof(FRootBoxResultInfo, ItemType) == 0x000024, "Member 'FRootBoxResultInfo::ItemType' has a wrong offset!");
static_assert(offsetof(FRootBoxResultInfo, OnlineType) == 0x000028, "Member 'FRootBoxResultInfo::OnlineType' has a wrong offset!");
static_assert(offsetof(FRootBoxResultInfo, ReplaceFlag) == 0x00002C, "Member 'FRootBoxResultInfo::ReplaceFlag' has a wrong offset!");
static_assert(offsetof(FRootBoxResultInfo, ReplaceItemId) == 0x000030, "Member 'FRootBoxResultInfo::ReplaceItemId' has a wrong offset!");
static_assert(offsetof(FRootBoxResultInfo, ReplaceItemNum) == 0x000040, "Member 'FRootBoxResultInfo::ReplaceItemNum' has a wrong offset!");
static_assert(offsetof(FRootBoxResultInfo, boxRemaining) == 0x000044, "Member 'FRootBoxResultInfo::boxRemaining' has a wrong offset!");

// ScriptStruct CosmosWebApi.RootBoxRunResponseParam
// 0x0018 (0x0018 - 0x0000)
struct FRootBoxRunResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalCount;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRootBoxResultInfo>             RootboxResultList;                                 // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRootBoxRunResponseParam) == 0x000008, "Wrong alignment on FRootBoxRunResponseParam");
static_assert(sizeof(FRootBoxRunResponseParam) == 0x000018, "Wrong size on FRootBoxRunResponseParam");
static_assert(offsetof(FRootBoxRunResponseParam, Status) == 0x000000, "Member 'FRootBoxRunResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FRootBoxRunResponseParam, TotalCount) == 0x000004, "Member 'FRootBoxRunResponseParam::TotalCount' has a wrong offset!");
static_assert(offsetof(FRootBoxRunResponseParam, RootboxResultList) == 0x000008, "Member 'FRootBoxRunResponseParam::RootboxResultList' has a wrong offset!");

// ScriptStruct CosmosWebApi.KpiData
// 0x0010 (0x0010 - 0x0000)
struct FKpiData final
{
public:
	TArray<class FString>                         KpiData;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FKpiData) == 0x000008, "Wrong alignment on FKpiData");
static_assert(sizeof(FKpiData) == 0x000010, "Wrong size on FKpiData");
static_assert(offsetof(FKpiData, KpiData) == 0x000000, "Member 'FKpiData::KpiData' has a wrong offset!");

// ScriptStruct CosmosWebApi.RootBoxCampaignInfo
// 0x0040 (0x0040 - 0x0000)
struct FRootBoxCampaignInfo final
{
public:
	class FString                                 CampaignId;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CampaignStartTime;                                 // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CampaignEndTime;                                   // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CampaignOption;                                    // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRootBoxCampaignInfo) == 0x000008, "Wrong alignment on FRootBoxCampaignInfo");
static_assert(sizeof(FRootBoxCampaignInfo) == 0x000040, "Wrong size on FRootBoxCampaignInfo");
static_assert(offsetof(FRootBoxCampaignInfo, CampaignId) == 0x000000, "Member 'FRootBoxCampaignInfo::CampaignId' has a wrong offset!");
static_assert(offsetof(FRootBoxCampaignInfo, CampaignStartTime) == 0x000010, "Member 'FRootBoxCampaignInfo::CampaignStartTime' has a wrong offset!");
static_assert(offsetof(FRootBoxCampaignInfo, CampaignEndTime) == 0x000020, "Member 'FRootBoxCampaignInfo::CampaignEndTime' has a wrong offset!");
static_assert(offsetof(FRootBoxCampaignInfo, CampaignOption) == 0x000030, "Member 'FRootBoxCampaignInfo::CampaignOption' has a wrong offset!");

// ScriptStruct CosmosWebApi.RarityItemInfo
// 0x0058 (0x0058 - 0x0000)
struct FRarityItemInfo final
{
public:
	class FString                                 ItemConfigId;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemId;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ItemNum;                                           // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ItemRarityRate;                                    // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CampaignItemRarityRate;                            // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_142F[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ItemInfo;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ItemType;                                          // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OnlineType;                                        // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SingleItemFlag;                                    // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         boxCount;                                          // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         boxRemaining;                                      // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1430[0x4];                                     // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRarityItemInfo) == 0x000008, "Wrong alignment on FRarityItemInfo");
static_assert(sizeof(FRarityItemInfo) == 0x000058, "Wrong size on FRarityItemInfo");
static_assert(offsetof(FRarityItemInfo, ItemConfigId) == 0x000000, "Member 'FRarityItemInfo::ItemConfigId' has a wrong offset!");
static_assert(offsetof(FRarityItemInfo, ItemId) == 0x000010, "Member 'FRarityItemInfo::ItemId' has a wrong offset!");
static_assert(offsetof(FRarityItemInfo, ItemNum) == 0x000020, "Member 'FRarityItemInfo::ItemNum' has a wrong offset!");
static_assert(offsetof(FRarityItemInfo, ItemRarityRate) == 0x000024, "Member 'FRarityItemInfo::ItemRarityRate' has a wrong offset!");
static_assert(offsetof(FRarityItemInfo, CampaignItemRarityRate) == 0x000028, "Member 'FRarityItemInfo::CampaignItemRarityRate' has a wrong offset!");
static_assert(offsetof(FRarityItemInfo, ItemInfo) == 0x000030, "Member 'FRarityItemInfo::ItemInfo' has a wrong offset!");
static_assert(offsetof(FRarityItemInfo, ItemType) == 0x000040, "Member 'FRarityItemInfo::ItemType' has a wrong offset!");
static_assert(offsetof(FRarityItemInfo, OnlineType) == 0x000044, "Member 'FRarityItemInfo::OnlineType' has a wrong offset!");
static_assert(offsetof(FRarityItemInfo, SingleItemFlag) == 0x000048, "Member 'FRarityItemInfo::SingleItemFlag' has a wrong offset!");
static_assert(offsetof(FRarityItemInfo, boxCount) == 0x00004C, "Member 'FRarityItemInfo::boxCount' has a wrong offset!");
static_assert(offsetof(FRarityItemInfo, boxRemaining) == 0x000050, "Member 'FRarityItemInfo::boxRemaining' has a wrong offset!");

// ScriptStruct CosmosWebApi.RootBoxStatusInfo
// 0x0028 (0x0028 - 0x0000)
struct FRootBoxStatusInfo final
{
public:
	class FString                                 RarityId;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RarityRate;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CampaignRarityRate;                                // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRarityItemInfo>                RarityItemList;                                    // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRootBoxStatusInfo) == 0x000008, "Wrong alignment on FRootBoxStatusInfo");
static_assert(sizeof(FRootBoxStatusInfo) == 0x000028, "Wrong size on FRootBoxStatusInfo");
static_assert(offsetof(FRootBoxStatusInfo, RarityId) == 0x000000, "Member 'FRootBoxStatusInfo::RarityId' has a wrong offset!");
static_assert(offsetof(FRootBoxStatusInfo, RarityRate) == 0x000010, "Member 'FRootBoxStatusInfo::RarityRate' has a wrong offset!");
static_assert(offsetof(FRootBoxStatusInfo, CampaignRarityRate) == 0x000014, "Member 'FRootBoxStatusInfo::CampaignRarityRate' has a wrong offset!");
static_assert(offsetof(FRootBoxStatusInfo, RarityItemList) == 0x000018, "Member 'FRootBoxStatusInfo::RarityItemList' has a wrong offset!");

// ScriptStruct CosmosWebApi.RootBoxGetProbabilityResponseParam
// 0x0028 (0x0028 - 0x0000)
struct FRootBoxGetProbabilityResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1431[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRootBoxCampaignInfo>           CampaignInfo;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRootBoxStatusInfo>             RootboxStatusList;                                 // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRootBoxGetProbabilityResponseParam) == 0x000008, "Wrong alignment on FRootBoxGetProbabilityResponseParam");
static_assert(sizeof(FRootBoxGetProbabilityResponseParam) == 0x000028, "Wrong size on FRootBoxGetProbabilityResponseParam");
static_assert(offsetof(FRootBoxGetProbabilityResponseParam, Status) == 0x000000, "Member 'FRootBoxGetProbabilityResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FRootBoxGetProbabilityResponseParam, CampaignInfo) == 0x000008, "Member 'FRootBoxGetProbabilityResponseParam::CampaignInfo' has a wrong offset!");
static_assert(offsetof(FRootBoxGetProbabilityResponseParam, RootboxStatusList) == 0x000018, "Member 'FRootBoxGetProbabilityResponseParam::RootboxStatusList' has a wrong offset!");

// ScriptStruct CosmosWebApi.PaymentInfo
// 0x0030 (0x0030 - 0x0000)
struct FPaymentInfo final
{
public:
	class FString                                 PaymentId;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PaymentType;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PerExecution;                                      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Limit;                                             // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Num;                                               // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PaymentItemid;                                     // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPaymentInfo) == 0x000008, "Wrong alignment on FPaymentInfo");
static_assert(sizeof(FPaymentInfo) == 0x000030, "Wrong size on FPaymentInfo");
static_assert(offsetof(FPaymentInfo, PaymentId) == 0x000000, "Member 'FPaymentInfo::PaymentId' has a wrong offset!");
static_assert(offsetof(FPaymentInfo, PaymentType) == 0x000010, "Member 'FPaymentInfo::PaymentType' has a wrong offset!");
static_assert(offsetof(FPaymentInfo, PerExecution) == 0x000014, "Member 'FPaymentInfo::PerExecution' has a wrong offset!");
static_assert(offsetof(FPaymentInfo, Limit) == 0x000018, "Member 'FPaymentInfo::Limit' has a wrong offset!");
static_assert(offsetof(FPaymentInfo, Num) == 0x00001C, "Member 'FPaymentInfo::Num' has a wrong offset!");
static_assert(offsetof(FPaymentInfo, PaymentItemid) == 0x000020, "Member 'FPaymentInfo::PaymentItemid' has a wrong offset!");

// ScriptStruct CosmosWebApi.RootBoxGetDetailResponseParam
// 0x0068 (0x0068 - 0x0000)
struct FRootBoxGetDetailResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1432[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RootboxId;                                         // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RootboxLavel;                                      // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StartTime;                                         // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EndTime;                                           // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPaymentInfo>                   PaymentList;                                       // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Option;                                            // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRootBoxGetDetailResponseParam) == 0x000008, "Wrong alignment on FRootBoxGetDetailResponseParam");
static_assert(sizeof(FRootBoxGetDetailResponseParam) == 0x000068, "Wrong size on FRootBoxGetDetailResponseParam");
static_assert(offsetof(FRootBoxGetDetailResponseParam, Status) == 0x000000, "Member 'FRootBoxGetDetailResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FRootBoxGetDetailResponseParam, RootboxId) == 0x000008, "Member 'FRootBoxGetDetailResponseParam::RootboxId' has a wrong offset!");
static_assert(offsetof(FRootBoxGetDetailResponseParam, RootboxLavel) == 0x000018, "Member 'FRootBoxGetDetailResponseParam::RootboxLavel' has a wrong offset!");
static_assert(offsetof(FRootBoxGetDetailResponseParam, StartTime) == 0x000028, "Member 'FRootBoxGetDetailResponseParam::StartTime' has a wrong offset!");
static_assert(offsetof(FRootBoxGetDetailResponseParam, EndTime) == 0x000038, "Member 'FRootBoxGetDetailResponseParam::EndTime' has a wrong offset!");
static_assert(offsetof(FRootBoxGetDetailResponseParam, PaymentList) == 0x000048, "Member 'FRootBoxGetDetailResponseParam::PaymentList' has a wrong offset!");
static_assert(offsetof(FRootBoxGetDetailResponseParam, Option) == 0x000058, "Member 'FRootBoxGetDetailResponseParam::Option' has a wrong offset!");

// ScriptStruct CosmosWebApi.RootBoxInfo
// 0x0068 (0x0068 - 0x0000)
struct FRootBoxInfo final
{
public:
	class FString                                 RootboxId;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RootboxLavel;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StartTime;                                         // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EndTime;                                           // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RootboxType;                                       // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1433[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Option;                                            // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRootBoxCampaignInfo>           CampaignInfo;                                      // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRootBoxInfo) == 0x000008, "Wrong alignment on FRootBoxInfo");
static_assert(sizeof(FRootBoxInfo) == 0x000068, "Wrong size on FRootBoxInfo");
static_assert(offsetof(FRootBoxInfo, RootboxId) == 0x000000, "Member 'FRootBoxInfo::RootboxId' has a wrong offset!");
static_assert(offsetof(FRootBoxInfo, RootboxLavel) == 0x000010, "Member 'FRootBoxInfo::RootboxLavel' has a wrong offset!");
static_assert(offsetof(FRootBoxInfo, StartTime) == 0x000020, "Member 'FRootBoxInfo::StartTime' has a wrong offset!");
static_assert(offsetof(FRootBoxInfo, EndTime) == 0x000030, "Member 'FRootBoxInfo::EndTime' has a wrong offset!");
static_assert(offsetof(FRootBoxInfo, RootboxType) == 0x000040, "Member 'FRootBoxInfo::RootboxType' has a wrong offset!");
static_assert(offsetof(FRootBoxInfo, Option) == 0x000048, "Member 'FRootBoxInfo::Option' has a wrong offset!");
static_assert(offsetof(FRootBoxInfo, CampaignInfo) == 0x000058, "Member 'FRootBoxInfo::CampaignInfo' has a wrong offset!");

// ScriptStruct CosmosWebApi.RootBoxGetListResponseParam
// 0x0018 (0x0018 - 0x0000)
struct FRootBoxGetListResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1434[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRootBoxInfo>                   RootboxList;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRootBoxGetListResponseParam) == 0x000008, "Wrong alignment on FRootBoxGetListResponseParam");
static_assert(sizeof(FRootBoxGetListResponseParam) == 0x000018, "Wrong size on FRootBoxGetListResponseParam");
static_assert(offsetof(FRootBoxGetListResponseParam, Status) == 0x000000, "Member 'FRootBoxGetListResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FRootBoxGetListResponseParam, RootboxList) == 0x000008, "Member 'FRootBoxGetListResponseParam::RootboxList' has a wrong offset!");

// ScriptStruct CosmosWebApi.PointInfo
// 0x0058 (0x0058 - 0x0000)
struct FPointInfo final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserId;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TitleCd;                                           // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CampaignId;                                        // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Point;                                             // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalPoint;                                        // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NowRank;                                           // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PrecedeRank;                                       // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1435[0x4];                                     // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPointInfo) == 0x000008, "Wrong alignment on FPointInfo");
static_assert(sizeof(FPointInfo) == 0x000058, "Wrong size on FPointInfo");
static_assert(offsetof(FPointInfo, ID) == 0x000000, "Member 'FPointInfo::ID' has a wrong offset!");
static_assert(offsetof(FPointInfo, UserId) == 0x000010, "Member 'FPointInfo::UserId' has a wrong offset!");
static_assert(offsetof(FPointInfo, TitleCd) == 0x000020, "Member 'FPointInfo::TitleCd' has a wrong offset!");
static_assert(offsetof(FPointInfo, CampaignId) == 0x000030, "Member 'FPointInfo::CampaignId' has a wrong offset!");
static_assert(offsetof(FPointInfo, Point) == 0x000040, "Member 'FPointInfo::Point' has a wrong offset!");
static_assert(offsetof(FPointInfo, TotalPoint) == 0x000044, "Member 'FPointInfo::TotalPoint' has a wrong offset!");
static_assert(offsetof(FPointInfo, NowRank) == 0x000048, "Member 'FPointInfo::NowRank' has a wrong offset!");
static_assert(offsetof(FPointInfo, Count) == 0x00004C, "Member 'FPointInfo::Count' has a wrong offset!");
static_assert(offsetof(FPointInfo, PrecedeRank) == 0x000050, "Member 'FPointInfo::PrecedeRank' has a wrong offset!");

// ScriptStruct CosmosWebApi.GamecurrencyGetLimitedOwnedInfo
// 0x0028 (0x0028 - 0x0000)
struct FGamecurrencyGetLimitedOwnedInfo final
{
public:
	class FString                                 Limit;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LimitCurrencyNum;                                  // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1436[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ChargedFlag;                                       // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGamecurrencyGetLimitedOwnedInfo) == 0x000008, "Wrong alignment on FGamecurrencyGetLimitedOwnedInfo");
static_assert(sizeof(FGamecurrencyGetLimitedOwnedInfo) == 0x000028, "Wrong size on FGamecurrencyGetLimitedOwnedInfo");
static_assert(offsetof(FGamecurrencyGetLimitedOwnedInfo, Limit) == 0x000000, "Member 'FGamecurrencyGetLimitedOwnedInfo::Limit' has a wrong offset!");
static_assert(offsetof(FGamecurrencyGetLimitedOwnedInfo, LimitCurrencyNum) == 0x000010, "Member 'FGamecurrencyGetLimitedOwnedInfo::LimitCurrencyNum' has a wrong offset!");
static_assert(offsetof(FGamecurrencyGetLimitedOwnedInfo, ChargedFlag) == 0x000018, "Member 'FGamecurrencyGetLimitedOwnedInfo::ChargedFlag' has a wrong offset!");

// ScriptStruct CosmosWebApi.GamecurrencyGetLimitedOwnedResponseParam
// 0x0018 (0x0018 - 0x0000)
struct FGamecurrencyGetLimitedOwnedResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1437[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGamecurrencyGetLimitedOwnedInfo> CurrencyList;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGamecurrencyGetLimitedOwnedResponseParam) == 0x000008, "Wrong alignment on FGamecurrencyGetLimitedOwnedResponseParam");
static_assert(sizeof(FGamecurrencyGetLimitedOwnedResponseParam) == 0x000018, "Wrong size on FGamecurrencyGetLimitedOwnedResponseParam");
static_assert(offsetof(FGamecurrencyGetLimitedOwnedResponseParam, Status) == 0x000000, "Member 'FGamecurrencyGetLimitedOwnedResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FGamecurrencyGetLimitedOwnedResponseParam, CurrencyList) == 0x000008, "Member 'FGamecurrencyGetLimitedOwnedResponseParam::CurrencyList' has a wrong offset!");

// ScriptStruct CosmosWebApi.GamecurrencyGetOwnedResponseParam
// 0x0038 (0x0038 - 0x0000)
struct FGamecurrencyGetOwnedResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalChargedCurrencyNum;                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalFreeCurrencyNum;                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1438[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RecentLimit;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RecentLimitCurrencyNum;                            // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1439[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RecentChargedFlag;                                 // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGamecurrencyGetOwnedResponseParam) == 0x000008, "Wrong alignment on FGamecurrencyGetOwnedResponseParam");
static_assert(sizeof(FGamecurrencyGetOwnedResponseParam) == 0x000038, "Wrong size on FGamecurrencyGetOwnedResponseParam");
static_assert(offsetof(FGamecurrencyGetOwnedResponseParam, Status) == 0x000000, "Member 'FGamecurrencyGetOwnedResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FGamecurrencyGetOwnedResponseParam, TotalChargedCurrencyNum) == 0x000004, "Member 'FGamecurrencyGetOwnedResponseParam::TotalChargedCurrencyNum' has a wrong offset!");
static_assert(offsetof(FGamecurrencyGetOwnedResponseParam, TotalFreeCurrencyNum) == 0x000008, "Member 'FGamecurrencyGetOwnedResponseParam::TotalFreeCurrencyNum' has a wrong offset!");
static_assert(offsetof(FGamecurrencyGetOwnedResponseParam, RecentLimit) == 0x000010, "Member 'FGamecurrencyGetOwnedResponseParam::RecentLimit' has a wrong offset!");
static_assert(offsetof(FGamecurrencyGetOwnedResponseParam, RecentLimitCurrencyNum) == 0x000020, "Member 'FGamecurrencyGetOwnedResponseParam::RecentLimitCurrencyNum' has a wrong offset!");
static_assert(offsetof(FGamecurrencyGetOwnedResponseParam, RecentChargedFlag) == 0x000028, "Member 'FGamecurrencyGetOwnedResponseParam::RecentChargedFlag' has a wrong offset!");

// ScriptStruct CosmosWebApi.CommonpurchaseTokushoResponseParam
// 0x0018 (0x0018 - 0x0000)
struct FCommonpurchaseTokushoResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_143A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Text;                                              // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCommonpurchaseTokushoResponseParam) == 0x000008, "Wrong alignment on FCommonpurchaseTokushoResponseParam");
static_assert(sizeof(FCommonpurchaseTokushoResponseParam) == 0x000018, "Wrong size on FCommonpurchaseTokushoResponseParam");
static_assert(offsetof(FCommonpurchaseTokushoResponseParam, Status) == 0x000000, "Member 'FCommonpurchaseTokushoResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCommonpurchaseTokushoResponseParam, Text) == 0x000008, "Member 'FCommonpurchaseTokushoResponseParam::Text' has a wrong offset!");

// ScriptStruct CosmosWebApi.CommonpurchaseGetPurchaseStatusResponseParam
// 0x0018 (0x0018 - 0x0000)
struct FCommonpurchaseGetPurchaseStatusResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_143B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PurchaseInfoId;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCommonpurchaseGetPurchaseStatusResponseParam) == 0x000008, "Wrong alignment on FCommonpurchaseGetPurchaseStatusResponseParam");
static_assert(sizeof(FCommonpurchaseGetPurchaseStatusResponseParam) == 0x000018, "Wrong size on FCommonpurchaseGetPurchaseStatusResponseParam");
static_assert(offsetof(FCommonpurchaseGetPurchaseStatusResponseParam, Status) == 0x000000, "Member 'FCommonpurchaseGetPurchaseStatusResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCommonpurchaseGetPurchaseStatusResponseParam, PurchaseInfoId) == 0x000008, "Member 'FCommonpurchaseGetPurchaseStatusResponseParam::PurchaseInfoId' has a wrong offset!");

// ScriptStruct CosmosWebApi.CommonpurchaseCancelPurchaseResponseParam
// 0x0004 (0x0004 - 0x0000)
struct FCommonpurchaseCancelPurchaseResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCommonpurchaseCancelPurchaseResponseParam) == 0x000004, "Wrong alignment on FCommonpurchaseCancelPurchaseResponseParam");
static_assert(sizeof(FCommonpurchaseCancelPurchaseResponseParam) == 0x000004, "Wrong size on FCommonpurchaseCancelPurchaseResponseParam");
static_assert(offsetof(FCommonpurchaseCancelPurchaseResponseParam, Status) == 0x000000, "Member 'FCommonpurchaseCancelPurchaseResponseParam::Status' has a wrong offset!");

// ScriptStruct CosmosWebApi.CommonpurchaseCompletePurchaseResponseParam
// 0x0004 (0x0004 - 0x0000)
struct FCommonpurchaseCompletePurchaseResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCommonpurchaseCompletePurchaseResponseParam) == 0x000004, "Wrong alignment on FCommonpurchaseCompletePurchaseResponseParam");
static_assert(sizeof(FCommonpurchaseCompletePurchaseResponseParam) == 0x000004, "Wrong size on FCommonpurchaseCompletePurchaseResponseParam");
static_assert(offsetof(FCommonpurchaseCompletePurchaseResponseParam, Status) == 0x000000, "Member 'FCommonpurchaseCompletePurchaseResponseParam::Status' has a wrong offset!");

// ScriptStruct CosmosWebApi.CommonpurchaseStartPurchaseResponseParam
// 0x0018 (0x0018 - 0x0000)
struct FCommonpurchaseStartPurchaseResponseParam final
{
public:
	int32                                         Status;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_143C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PurchaseInfoId;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCommonpurchaseStartPurchaseResponseParam) == 0x000008, "Wrong alignment on FCommonpurchaseStartPurchaseResponseParam");
static_assert(sizeof(FCommonpurchaseStartPurchaseResponseParam) == 0x000018, "Wrong size on FCommonpurchaseStartPurchaseResponseParam");
static_assert(offsetof(FCommonpurchaseStartPurchaseResponseParam, Status) == 0x000000, "Member 'FCommonpurchaseStartPurchaseResponseParam::Status' has a wrong offset!");
static_assert(offsetof(FCommonpurchaseStartPurchaseResponseParam, PurchaseInfoId) == 0x000008, "Member 'FCommonpurchaseStartPurchaseResponseParam::PurchaseInfoId' has a wrong offset!");

// ScriptStruct CosmosWebApi.CommonpurchaseGetCatalogInfo
// 0x0070 (0x0070 - 0x0000)
struct FCommonpurchaseGetCatalogInfo final
{
public:
	class FString                                 CatalogId;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Caption;                                           // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Image;                                             // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EstablishedPrice;                                  // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurrentPrice;                                      // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Option;                                            // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCommonpurchaseGetCatalogInfo) == 0x000008, "Wrong alignment on FCommonpurchaseGetCatalogInfo");
static_assert(sizeof(FCommonpurchaseGetCatalogInfo) == 0x000070, "Wrong size on FCommonpurchaseGetCatalogInfo");
static_assert(offsetof(FCommonpurchaseGetCatalogInfo, CatalogId) == 0x000000, "Member 'FCommonpurchaseGetCatalogInfo::CatalogId' has a wrong offset!");
static_assert(offsetof(FCommonpurchaseGetCatalogInfo, Name) == 0x000010, "Member 'FCommonpurchaseGetCatalogInfo::Name' has a wrong offset!");
static_assert(offsetof(FCommonpurchaseGetCatalogInfo, Caption) == 0x000020, "Member 'FCommonpurchaseGetCatalogInfo::Caption' has a wrong offset!");
static_assert(offsetof(FCommonpurchaseGetCatalogInfo, Image) == 0x000030, "Member 'FCommonpurchaseGetCatalogInfo::Image' has a wrong offset!");
