#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: E_GhostMaterialParam

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct E_GhostMaterialParam.E_GhostMaterialParam
// 0x0018 (0x0018 - 0x0000)
struct FE_GhostMaterialParam final
{
public:
	class FName                                   ParamName_12_7BBBFC27417E70F3B4247989B720B5D9;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            Curve_8_CC05CC424473955C67D941A47C7AE5A0;          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveLinearColor*                      ColorCurve_11_E6EAC465450C0BEC8A6B1A9C1452A825;    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FE_GhostMaterialParam) == 0x000008, "Wrong alignment on FE_GhostMaterialParam");
static_assert(sizeof(FE_GhostMaterialParam) == 0x000018, "Wrong size on FE_GhostMaterialParam");
static_assert(offsetof(FE_GhostMaterialParam, ParamName_12_7BBBFC27417E70F3B4247989B720B5D9) == 0x000000, "Member 'FE_GhostMaterialParam::ParamName_12_7BBBFC27417E70F3B4247989B720B5D9' has a wrong offset!");
static_assert(offsetof(FE_GhostMaterialParam, Curve_8_CC05CC424473955C67D941A47C7AE5A0) == 0x000008, "Member 'FE_GhostMaterialParam::Curve_8_CC05CC424473955C67D941A47C7AE5A0' has a wrong offset!");
static_assert(offsetof(FE_GhostMaterialParam, ColorCurve_11_E6EAC465450C0BEC8A6B1A9C1452A825) == 0x000010, "Member 'FE_GhostMaterialParam::ColorCurve_11_E6EAC465450C0BEC8A6B1A9C1452A825' has a wrong offset!");

}

