#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EnemyDatatableAccessorComponent

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function EnemyDatatableAccessorComponent.EnemyDatatableAccessorComponent_C.GetDamageCalcInfo
// 0x0040 (0x0040 - 0x0000)
struct EnemyDatatableAccessorComponent_C_GetDamageCalcInfo final
{
public:
	struct FDamageCalcInfo                        ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FDamageCalcInfo                        K2Node_MakeStruct_DamageCalcInfo;                  // 0x0020(0x0020)(NoDestructor)
};
static_assert(alignof(EnemyDatatableAccessorComponent_C_GetDamageCalcInfo) == 0x000004, "Wrong alignment on EnemyDatatableAccessorComponent_C_GetDamageCalcInfo");
static_assert(sizeof(EnemyDatatableAccessorComponent_C_GetDamageCalcInfo) == 0x000040, "Wrong size on EnemyDatatableAccessorComponent_C_GetDamageCalcInfo");
static_assert(offsetof(EnemyDatatableAccessorComponent_C_GetDamageCalcInfo, ReturnValue) == 0x000000, "Member 'EnemyDatatableAccessorComponent_C_GetDamageCalcInfo::ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyDatatableAccessorComponent_C_GetDamageCalcInfo, K2Node_MakeStruct_DamageCalcInfo) == 0x000020, "Member 'EnemyDatatableAccessorComponent_C_GetDamageCalcInfo::K2Node_MakeStruct_DamageCalcInfo' has a wrong offset!");

// Function EnemyDatatableAccessorComponent.EnemyDatatableAccessorComponent_C.GetAttackCalcInfo
// 0x0020 (0x0020 - 0x0000)
struct EnemyDatatableAccessorComponent_C_GetAttackCalcInfo final
{
public:
	struct FAttackCalcInfo                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FAttackCalcInfo                        K2Node_MakeStruct_AttackCalcInfo;                  // 0x0010(0x0010)(NoDestructor)
};
static_assert(alignof(EnemyDatatableAccessorComponent_C_GetAttackCalcInfo) == 0x000004, "Wrong alignment on EnemyDatatableAccessorComponent_C_GetAttackCalcInfo");
static_assert(sizeof(EnemyDatatableAccessorComponent_C_GetAttackCalcInfo) == 0x000020, "Wrong size on EnemyDatatableAccessorComponent_C_GetAttackCalcInfo");
static_assert(offsetof(EnemyDatatableAccessorComponent_C_GetAttackCalcInfo, ReturnValue) == 0x000000, "Member 'EnemyDatatableAccessorComponent_C_GetAttackCalcInfo::ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyDatatableAccessorComponent_C_GetAttackCalcInfo, K2Node_MakeStruct_AttackCalcInfo) == 0x000010, "Member 'EnemyDatatableAccessorComponent_C_GetAttackCalcInfo::K2Node_MakeStruct_AttackCalcInfo' has a wrong offset!");

}

