#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FAlertSoundSpecification

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK
{

// UserDefinedStruct FAlertSoundSpecification.FAlertSoundSpecification
// 0x0038 (0x0038 - 0x0000)
struct FFAlertSoundSpecification final
{
public:
	int32                                         ProgressIdMin_3_D9FC5F03458A1AB7D183F99A8E279AFF;  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ProgressIdMax_5_2262257843CF224D64E047B15D6AE76C;  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundAtomCue>           SoundCueSoftRef_8_48510E0E43A53708611088ADE7FC2BF8; // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	EPlayerID                                     PlayerCharactor_14_9B214CF947C3FAC9F805A48EC267D903; // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38D1[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Volume_17_63795973493F4D7B388C869436AD17DC;        // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFAlertSoundSpecification) == 0x000008, "Wrong alignment on FFAlertSoundSpecification");
static_assert(sizeof(FFAlertSoundSpecification) == 0x000038, "Wrong size on FFAlertSoundSpecification");
static_assert(offsetof(FFAlertSoundSpecification, ProgressIdMin_3_D9FC5F03458A1AB7D183F99A8E279AFF) == 0x000000, "Member 'FFAlertSoundSpecification::ProgressIdMin_3_D9FC5F03458A1AB7D183F99A8E279AFF' has a wrong offset!");
static_assert(offsetof(FFAlertSoundSpecification, ProgressIdMax_5_2262257843CF224D64E047B15D6AE76C) == 0x000004, "Member 'FFAlertSoundSpecification::ProgressIdMax_5_2262257843CF224D64E047B15D6AE76C' has a wrong offset!");
static_assert(offsetof(FFAlertSoundSpecification, SoundCueSoftRef_8_48510E0E43A53708611088ADE7FC2BF8) == 0x000008, "Member 'FFAlertSoundSpecification::SoundCueSoftRef_8_48510E0E43A53708611088ADE7FC2BF8' has a wrong offset!");
static_assert(offsetof(FFAlertSoundSpecification, PlayerCharactor_14_9B214CF947C3FAC9F805A48EC267D903) == 0x000030, "Member 'FFAlertSoundSpecification::PlayerCharactor_14_9B214CF947C3FAC9F805A48EC267D903' has a wrong offset!");
static_assert(offsetof(FFAlertSoundSpecification, Volume_17_63795973493F4D7B388C869436AD17DC) == 0x000034, "Member 'FFAlertSoundSpecification::Volume_17_63795973493F4D7B388C869436AD17DC' has a wrong offset!");

}

