#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FAttachmentData

#include "Basic.hpp"

#include "FAttachmentMaterialData_structs.hpp"
#include "EAttachmentCategory_structs.hpp"


namespace SDK
{

// UserDefinedStruct FAttachmentData.FAttachmentData
// 0x0020 (0x0020 - 0x0000)
struct FFAttachmentData final
{
public:
	EAttachmentCategory                           Category_36_C40BBD6745AD6D8FA52A6EB6838AC260;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4789[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Variation_9_116523494A7CECE38EB2C1A2C195E751;      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseAnimation_31_3C166736430B2AE7D0B90587EDC972AC; // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_478A[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EquipDataIndex_39_3799DF4345234ADF332299AC3C324385; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFAttachmentMaterialData>       MaterialData_43_56C799EC43832C9C78A679B25AD9ED1E;  // 0x0010(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FFAttachmentData) == 0x000008, "Wrong alignment on FFAttachmentData");
static_assert(sizeof(FFAttachmentData) == 0x000020, "Wrong size on FFAttachmentData");
static_assert(offsetof(FFAttachmentData, Category_36_C40BBD6745AD6D8FA52A6EB6838AC260) == 0x000000, "Member 'FFAttachmentData::Category_36_C40BBD6745AD6D8FA52A6EB6838AC260' has a wrong offset!");
static_assert(offsetof(FFAttachmentData, Variation_9_116523494A7CECE38EB2C1A2C195E751) == 0x000004, "Member 'FFAttachmentData::Variation_9_116523494A7CECE38EB2C1A2C195E751' has a wrong offset!");
static_assert(offsetof(FFAttachmentData, bUseAnimation_31_3C166736430B2AE7D0B90587EDC972AC) == 0x000008, "Member 'FFAttachmentData::bUseAnimation_31_3C166736430B2AE7D0B90587EDC972AC' has a wrong offset!");
static_assert(offsetof(FFAttachmentData, EquipDataIndex_39_3799DF4345234ADF332299AC3C324385) == 0x00000C, "Member 'FFAttachmentData::EquipDataIndex_39_3799DF4345234ADF332299AC3C324385' has a wrong offset!");
static_assert(offsetof(FFAttachmentData, MaterialData_43_56C799EC43832C9C78A679B25AD9ED1E) == 0x000010, "Member 'FFAttachmentData::MaterialData_43_56C799EC43832C9C78A679B25AD9ED1E' has a wrong offset!");

}

