#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FAttachmentPartsData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct FAttachmentPartsData.FAttachmentPartsData
// 0x0030 (0x0030 - 0x0000)
struct FFAttachmentPartsData final
{
public:
	int32                                         MeshIndex_5_56552C2043B8E41B4FC86791862B758B;      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName_15_E3C50981433F47A29025B8A802252813;    // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset_9_369657DF4B7AC8E84D3DC3A03BDD2994;         // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotate_10_2DD784894E499799D340DBA8757A1A8F;        // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Scale_11_BB3B1F2943D1D5BDB361BA868B08435D;         // 0x0024(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFAttachmentPartsData) == 0x000004, "Wrong alignment on FFAttachmentPartsData");
static_assert(sizeof(FFAttachmentPartsData) == 0x000030, "Wrong size on FFAttachmentPartsData");
static_assert(offsetof(FFAttachmentPartsData, MeshIndex_5_56552C2043B8E41B4FC86791862B758B) == 0x000000, "Member 'FFAttachmentPartsData::MeshIndex_5_56552C2043B8E41B4FC86791862B758B' has a wrong offset!");
static_assert(offsetof(FFAttachmentPartsData, SocketName_15_E3C50981433F47A29025B8A802252813) == 0x000004, "Member 'FFAttachmentPartsData::SocketName_15_E3C50981433F47A29025B8A802252813' has a wrong offset!");
static_assert(offsetof(FFAttachmentPartsData, Offset_9_369657DF4B7AC8E84D3DC3A03BDD2994) == 0x00000C, "Member 'FFAttachmentPartsData::Offset_9_369657DF4B7AC8E84D3DC3A03BDD2994' has a wrong offset!");
static_assert(offsetof(FFAttachmentPartsData, Rotate_10_2DD784894E499799D340DBA8757A1A8F) == 0x000018, "Member 'FFAttachmentPartsData::Rotate_10_2DD784894E499799D340DBA8757A1A8F' has a wrong offset!");
static_assert(offsetof(FFAttachmentPartsData, Scale_11_BB3B1F2943D1D5BDB361BA868B08435D) == 0x000024, "Member 'FFAttachmentPartsData::Scale_11_BB3B1F2943D1D5BDB361BA868B08435D' has a wrong offset!");

}

