#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FAttackEmitterInfo

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FAttackEmitterInfo.FAttackEmitterInfo
// 0x000C (0x000C - 0x0000)
struct FFAttackEmitterInfo final
{
public:
	int32                                         Num_4_C012863947FBF6DEE72B3BA1BAC65467;            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Range_9_29880ED046FA9E2270043FAD15493C98;          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Angle_8_A20DF88648A64F12D1E886AC2C275D3C;          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFAttackEmitterInfo) == 0x000004, "Wrong alignment on FFAttackEmitterInfo");
static_assert(sizeof(FFAttackEmitterInfo) == 0x00000C, "Wrong size on FFAttackEmitterInfo");
static_assert(offsetof(FFAttackEmitterInfo, Num_4_C012863947FBF6DEE72B3BA1BAC65467) == 0x000000, "Member 'FFAttackEmitterInfo::Num_4_C012863947FBF6DEE72B3BA1BAC65467' has a wrong offset!");
static_assert(offsetof(FFAttackEmitterInfo, Range_9_29880ED046FA9E2270043FAD15493C98) == 0x000004, "Member 'FFAttackEmitterInfo::Range_9_29880ED046FA9E2270043FAD15493C98' has a wrong offset!");
static_assert(offsetof(FFAttackEmitterInfo, Angle_8_A20DF88648A64F12D1E886AC2C275D3C) == 0x000008, "Member 'FFAttackEmitterInfo::Angle_8_A20DF88648A64F12D1E886AC2C275D3C' has a wrong offset!");

}

