#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FBrainCrashSequencerInfo

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FBrainCrashSequencerInfo.FBrainCrashSequencerInfo
// 0x0040 (0x0040 - 0x0000)
struct FFBrainCrashSequencerInfo final
{
public:
	class ARSLevelSequenceActor*                  Sequencer_2_E797D696490538308698538147ECB204;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventCameraRoot_C*                  SeqUniqueRoot_5_16B7E0774D6F4F46BBFC02A80A51A92F;  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventCameraRoot_C*                  SeqCameraRoot_8_897E238444204A73689986974EC879E5;  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventCameraRoot_C*                  SeqUniquePlayerRoot_9_0B4973F24175BBF8B46C85BD84B72701; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventCameraRoot_C*                  SeqUniqueEnemyRoot_11_65F1F680414EF6FBC35237BB378D59D5; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSLevelSequenceActor*                  CrashVisionEnemySequencer_14_969AD80B4CEB05CE24E29683E5F8AC5C; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSLevelSequenceActor*                  SubSequencer_17_F2DF47A34ED4080C61EB03BBA524B169;  // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventCameraRoot_C*                  SubSeqUniqueRoot_20_B7723B89487F71004A1B7AA418645E31; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFBrainCrashSequencerInfo) == 0x000008, "Wrong alignment on FFBrainCrashSequencerInfo");
static_assert(sizeof(FFBrainCrashSequencerInfo) == 0x000040, "Wrong size on FFBrainCrashSequencerInfo");
static_assert(offsetof(FFBrainCrashSequencerInfo, Sequencer_2_E797D696490538308698538147ECB204) == 0x000000, "Member 'FFBrainCrashSequencerInfo::Sequencer_2_E797D696490538308698538147ECB204' has a wrong offset!");
static_assert(offsetof(FFBrainCrashSequencerInfo, SeqUniqueRoot_5_16B7E0774D6F4F46BBFC02A80A51A92F) == 0x000008, "Member 'FFBrainCrashSequencerInfo::SeqUniqueRoot_5_16B7E0774D6F4F46BBFC02A80A51A92F' has a wrong offset!");
static_assert(offsetof(FFBrainCrashSequencerInfo, SeqCameraRoot_8_897E238444204A73689986974EC879E5) == 0x000010, "Member 'FFBrainCrashSequencerInfo::SeqCameraRoot_8_897E238444204A73689986974EC879E5' has a wrong offset!");
static_assert(offsetof(FFBrainCrashSequencerInfo, SeqUniquePlayerRoot_9_0B4973F24175BBF8B46C85BD84B72701) == 0x000018, "Member 'FFBrainCrashSequencerInfo::SeqUniquePlayerRoot_9_0B4973F24175BBF8B46C85BD84B72701' has a wrong offset!");
static_assert(offsetof(FFBrainCrashSequencerInfo, SeqUniqueEnemyRoot_11_65F1F680414EF6FBC35237BB378D59D5) == 0x000020, "Member 'FFBrainCrashSequencerInfo::SeqUniqueEnemyRoot_11_65F1F680414EF6FBC35237BB378D59D5' has a wrong offset!");
static_assert(offsetof(FFBrainCrashSequencerInfo, CrashVisionEnemySequencer_14_969AD80B4CEB05CE24E29683E5F8AC5C) == 0x000028, "Member 'FFBrainCrashSequencerInfo::CrashVisionEnemySequencer_14_969AD80B4CEB05CE24E29683E5F8AC5C' has a wrong offset!");
static_assert(offsetof(FFBrainCrashSequencerInfo, SubSequencer_17_F2DF47A34ED4080C61EB03BBA524B169) == 0x000030, "Member 'FFBrainCrashSequencerInfo::SubSequencer_17_F2DF47A34ED4080C61EB03BBA524B169' has a wrong offset!");
static_assert(offsetof(FFBrainCrashSequencerInfo, SubSeqUniqueRoot_20_B7723B89487F71004A1B7AA418645E31) == 0x000038, "Member 'FFBrainCrashSequencerInfo::SubSeqUniqueRoot_20_B7723B89487F71004A1B7AA418645E31' has a wrong offset!");

}

