#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FCapCharaBGData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FCapCharaBGData.FCapCharaBGData
// 0x000C (0x000C - 0x0000)
struct FFCapCharaBGData final
{
public:
	float                                         TexOffsetX_3_FDF7A5DC4795A5255C9CA6970D9BA8DB;     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TexOffsetY_4_1D67F9BA4BE42BAA1A6B4BBECF4E44DF;     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BokehRate_7_E7BB25EC45B564DD7BCA679770151412;      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFCapCharaBGData) == 0x000004, "Wrong alignment on FFCapCharaBGData");
static_assert(sizeof(FFCapCharaBGData) == 0x00000C, "Wrong size on FFCapCharaBGData");
static_assert(offsetof(FFCapCharaBGData, TexOffsetX_3_FDF7A5DC4795A5255C9CA6970D9BA8DB) == 0x000000, "Member 'FFCapCharaBGData::TexOffsetX_3_FDF7A5DC4795A5255C9CA6970D9BA8DB' has a wrong offset!");
static_assert(offsetof(FFCapCharaBGData, TexOffsetY_4_1D67F9BA4BE42BAA1A6B4BBECF4E44DF) == 0x000004, "Member 'FFCapCharaBGData::TexOffsetY_4_1D67F9BA4BE42BAA1A6B4BBECF4E44DF' has a wrong offset!");
static_assert(offsetof(FFCapCharaBGData, BokehRate_7_E7BB25EC45B564DD7BCA679770151412) == 0x000008, "Member 'FFCapCharaBGData::BokehRate_7_E7BB25EC45B564DD7BCA679770151412' has a wrong offset!");

}

