#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FChangeFaceData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FChangeFaceData.FChangeFaceData
// 0x0014 (0x0014 - 0x0000)
struct FFChangeFaceData final
{
public:
	float                                         ChangeTime_2_1BBDF4504D42EE76DB664CA2452F00E7;     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CharaAnimationName_11_F075AB84483A6A27E7043EA5298E4E64; // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CharaFaceAnimationName_10_6608B6AB44A559BC91F033914E01EB51; // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFChangeFaceData) == 0x000004, "Wrong alignment on FFChangeFaceData");
static_assert(sizeof(FFChangeFaceData) == 0x000014, "Wrong size on FFChangeFaceData");
static_assert(offsetof(FFChangeFaceData, ChangeTime_2_1BBDF4504D42EE76DB664CA2452F00E7) == 0x000000, "Member 'FFChangeFaceData::ChangeTime_2_1BBDF4504D42EE76DB664CA2452F00E7' has a wrong offset!");
static_assert(offsetof(FFChangeFaceData, CharaAnimationName_11_F075AB84483A6A27E7043EA5298E4E64) == 0x000004, "Member 'FFChangeFaceData::CharaAnimationName_11_F075AB84483A6A27E7043EA5298E4E64' has a wrong offset!");
static_assert(offsetof(FFChangeFaceData, CharaFaceAnimationName_10_6608B6AB44A559BC91F033914E01EB51) == 0x00000C, "Member 'FFChangeFaceData::CharaFaceAnimationName_10_6608B6AB44A559BC91F033914E01EB51' has a wrong offset!");

}

