#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FCombinationVisionData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FCombinationVisionData.FCombinationVisionData
// 0x002C (0x002C - 0x0000)
struct FFCombinationVisionData final
{
public:
	int32                                         LearnBondsLevel_13_6C1AFF3B48E3644B81188DA1CEBC0BD3; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CostCh0100_14_3B9F7B4A4C0520414CC924BE53EEFE4D;    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CostCh0200_15_2A0CD5A849EBB2118FB1DBB890C0E756;    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CostCh0300_16_31248BD544D2A94B930647B9304E947D;    // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CostCh0400_17_9888664E41E994E82C2BDDBD45B85954;    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CostCh0500_18_9373D8354811D506DD48E8936F3D287A;    // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CostCh0600_19_03F00DC44D48D35201675A97B8E0103D;    // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CostCh0700_20_007D011A4975F900FDB8E18BE8A4E7D0;    // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CostCh0800_21_189907154C5B98C9BD3C69B0F620A814;    // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CostCh0900_22_C95C81AD4ACB800BF78E3D8AB708936B;    // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CostCh1000_23_AA69CBF3494AD90B37D71CA8785EB2CA;    // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFCombinationVisionData) == 0x000004, "Wrong alignment on FFCombinationVisionData");
static_assert(sizeof(FFCombinationVisionData) == 0x00002C, "Wrong size on FFCombinationVisionData");
static_assert(offsetof(FFCombinationVisionData, LearnBondsLevel_13_6C1AFF3B48E3644B81188DA1CEBC0BD3) == 0x000000, "Member 'FFCombinationVisionData::LearnBondsLevel_13_6C1AFF3B48E3644B81188DA1CEBC0BD3' has a wrong offset!");
static_assert(offsetof(FFCombinationVisionData, CostCh0100_14_3B9F7B4A4C0520414CC924BE53EEFE4D) == 0x000004, "Member 'FFCombinationVisionData::CostCh0100_14_3B9F7B4A4C0520414CC924BE53EEFE4D' has a wrong offset!");
static_assert(offsetof(FFCombinationVisionData, CostCh0200_15_2A0CD5A849EBB2118FB1DBB890C0E756) == 0x000008, "Member 'FFCombinationVisionData::CostCh0200_15_2A0CD5A849EBB2118FB1DBB890C0E756' has a wrong offset!");
static_assert(offsetof(FFCombinationVisionData, CostCh0300_16_31248BD544D2A94B930647B9304E947D) == 0x00000C, "Member 'FFCombinationVisionData::CostCh0300_16_31248BD544D2A94B930647B9304E947D' has a wrong offset!");
static_assert(offsetof(FFCombinationVisionData, CostCh0400_17_9888664E41E994E82C2BDDBD45B85954) == 0x000010, "Member 'FFCombinationVisionData::CostCh0400_17_9888664E41E994E82C2BDDBD45B85954' has a wrong offset!");
static_assert(offsetof(FFCombinationVisionData, CostCh0500_18_9373D8354811D506DD48E8936F3D287A) == 0x000014, "Member 'FFCombinationVisionData::CostCh0500_18_9373D8354811D506DD48E8936F3D287A' has a wrong offset!");
static_assert(offsetof(FFCombinationVisionData, CostCh0600_19_03F00DC44D48D35201675A97B8E0103D) == 0x000018, "Member 'FFCombinationVisionData::CostCh0600_19_03F00DC44D48D35201675A97B8E0103D' has a wrong offset!");
static_assert(offsetof(FFCombinationVisionData, CostCh0700_20_007D011A4975F900FDB8E18BE8A4E7D0) == 0x00001C, "Member 'FFCombinationVisionData::CostCh0700_20_007D011A4975F900FDB8E18BE8A4E7D0' has a wrong offset!");
static_assert(offsetof(FFCombinationVisionData, CostCh0800_21_189907154C5B98C9BD3C69B0F620A814) == 0x000020, "Member 'FFCombinationVisionData::CostCh0800_21_189907154C5B98C9BD3C69B0F620A814' has a wrong offset!");
static_assert(offsetof(FFCombinationVisionData, CostCh0900_22_C95C81AD4ACB800BF78E3D8AB708936B) == 0x000024, "Member 'FFCombinationVisionData::CostCh0900_22_C95C81AD4ACB800BF78E3D8AB708936B' has a wrong offset!");
static_assert(offsetof(FFCombinationVisionData, CostCh1000_23_AA69CBF3494AD90B37D71CA8785EB2CA) == 0x000028, "Member 'FFCombinationVisionData::CostCh1000_23_AA69CBF3494AD90B37D71CA8785EB2CA' has a wrong offset!");

}

