#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FEventPresetData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct FEventPresetData.FEventPresetData
// 0x0190 (0x0190 - 0x0000)
struct FFEventPresetData final
{
public:
	TSoftObjectPtr<class USkeletalMesh>           CharaMesh_36_E789C1C048BA4EED2047CFB82DE6AA7B;     // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TMap<class FName, TSoftObjectPtr<class UMaterialInstance>> MaterialList_42_70492F7E436F7EDD2EF695ACF51368E6;  // 0x0028(0x0050)(Edit, BlueprintVisible)
	uint8                                         Pad_5466[0x8];                                     // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CameraTransform_1_1_18_FD263D974E425E5DA653838F1688E70C; // 0x0080(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FTransform                             CameraTransform_16_3_19_A1FBFBE84EF30649DC0281ADD3018D6A; // 0x00B0(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FTransform                             CameraTransform_16_9_20_1536D6AE4399A8D99B6E1DBC84E5BB60; // 0x00E0(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FTransform                             CameraTransform_4_3_21_71EE02B1438C033B57270698D502F0E3; // 0x0110(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FTransform                             CameraTransform_8_5_22_13066DCE44BA3A19BC42B4B49F4065CC; // 0x0140(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	float                                         CameraFOV_1_1_31_02277C6C43F6B4A72A5AAA9CABA6D0E7; // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraFOV_16_3_32_BAC687DD41C4B4B4A7AAA5A223179CAD; // 0x0174(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraFOV_16_9_33_B2CB7C394021574E06310783AEDC5E25; // 0x0178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraFOV_4_3_34_D139D5984C80921977A4C4ADAE5C3FA2; // 0x017C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraFOV_8_5_35_7A5FF6B4453E4FE8E136FFACD397AE15; // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFEventPresetData) == 0x000010, "Wrong alignment on FFEventPresetData");
static_assert(sizeof(FFEventPresetData) == 0x000190, "Wrong size on FFEventPresetData");
static_assert(offsetof(FFEventPresetData, CharaMesh_36_E789C1C048BA4EED2047CFB82DE6AA7B) == 0x000000, "Member 'FFEventPresetData::CharaMesh_36_E789C1C048BA4EED2047CFB82DE6AA7B' has a wrong offset!");
static_assert(offsetof(FFEventPresetData, MaterialList_42_70492F7E436F7EDD2EF695ACF51368E6) == 0x000028, "Member 'FFEventPresetData::MaterialList_42_70492F7E436F7EDD2EF695ACF51368E6' has a wrong offset!");
static_assert(offsetof(FFEventPresetData, CameraTransform_1_1_18_FD263D974E425E5DA653838F1688E70C) == 0x000080, "Member 'FFEventPresetData::CameraTransform_1_1_18_FD263D974E425E5DA653838F1688E70C' has a wrong offset!");
static_assert(offsetof(FFEventPresetData, CameraTransform_16_3_19_A1FBFBE84EF30649DC0281ADD3018D6A) == 0x0000B0, "Member 'FFEventPresetData::CameraTransform_16_3_19_A1FBFBE84EF30649DC0281ADD3018D6A' has a wrong offset!");
static_assert(offsetof(FFEventPresetData, CameraTransform_16_9_20_1536D6AE4399A8D99B6E1DBC84E5BB60) == 0x0000E0, "Member 'FFEventPresetData::CameraTransform_16_9_20_1536D6AE4399A8D99B6E1DBC84E5BB60' has a wrong offset!");
static_assert(offsetof(FFEventPresetData, CameraTransform_4_3_21_71EE02B1438C033B57270698D502F0E3) == 0x000110, "Member 'FFEventPresetData::CameraTransform_4_3_21_71EE02B1438C033B57270698D502F0E3' has a wrong offset!");
static_assert(offsetof(FFEventPresetData, CameraTransform_8_5_22_13066DCE44BA3A19BC42B4B49F4065CC) == 0x000140, "Member 'FFEventPresetData::CameraTransform_8_5_22_13066DCE44BA3A19BC42B4B49F4065CC' has a wrong offset!");
static_assert(offsetof(FFEventPresetData, CameraFOV_1_1_31_02277C6C43F6B4A72A5AAA9CABA6D0E7) == 0x000170, "Member 'FFEventPresetData::CameraFOV_1_1_31_02277C6C43F6B4A72A5AAA9CABA6D0E7' has a wrong offset!");
static_assert(offsetof(FFEventPresetData, CameraFOV_16_3_32_BAC687DD41C4B4B4A7AAA5A223179CAD) == 0x000174, "Member 'FFEventPresetData::CameraFOV_16_3_32_BAC687DD41C4B4B4A7AAA5A223179CAD' has a wrong offset!");
static_assert(offsetof(FFEventPresetData, CameraFOV_16_9_33_B2CB7C394021574E06310783AEDC5E25) == 0x000178, "Member 'FFEventPresetData::CameraFOV_16_9_33_B2CB7C394021574E06310783AEDC5E25' has a wrong offset!");
static_assert(offsetof(FFEventPresetData, CameraFOV_4_3_34_D139D5984C80921977A4C4ADAE5C3FA2) == 0x00017C, "Member 'FFEventPresetData::CameraFOV_4_3_34_D139D5984C80921977A4C4ADAE5C3FA2' has a wrong offset!");
static_assert(offsetof(FFEventPresetData, CameraFOV_8_5_35_7A5FF6B4453E4FE8E136FFACD397AE15) == 0x000180, "Member 'FFEventPresetData::CameraFOV_8_5_35_7A5FF6B4453E4FE8E136FFACD397AE15' has a wrong offset!");

}

