#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FEventPlAttachAssetData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FEventPlAttachAssetData.FEventPlAttachAssetData
// 0x0060 (0x0060 - 0x0000)
struct FFEventPlAttachAssetData final
{
public:
	TSoftObjectPtr<class USkeletalMesh>           SkeletalMesh_19_A8A3C0B34DDEDC8163D201B0E7C8CE28;  // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UMaterialInstance*                      Material_18_53859B3A48D1B641C455EAA6A1492420;      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 AnimationBP_14_5DA7E8164AC7E67D41C782936B31CDF3;   // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            AnimMontage_20_992BF522499E6E94EC4543A7B384081E;   // 0x0038(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FFEventPlAttachAssetData) == 0x000008, "Wrong alignment on FFEventPlAttachAssetData");
static_assert(sizeof(FFEventPlAttachAssetData) == 0x000060, "Wrong size on FFEventPlAttachAssetData");
static_assert(offsetof(FFEventPlAttachAssetData, SkeletalMesh_19_A8A3C0B34DDEDC8163D201B0E7C8CE28) == 0x000000, "Member 'FFEventPlAttachAssetData::SkeletalMesh_19_A8A3C0B34DDEDC8163D201B0E7C8CE28' has a wrong offset!");
static_assert(offsetof(FFEventPlAttachAssetData, Material_18_53859B3A48D1B641C455EAA6A1492420) == 0x000028, "Member 'FFEventPlAttachAssetData::Material_18_53859B3A48D1B641C455EAA6A1492420' has a wrong offset!");
static_assert(offsetof(FFEventPlAttachAssetData, AnimationBP_14_5DA7E8164AC7E67D41C782936B31CDF3) == 0x000030, "Member 'FFEventPlAttachAssetData::AnimationBP_14_5DA7E8164AC7E67D41C782936B31CDF3' has a wrong offset!");
static_assert(offsetof(FFEventPlAttachAssetData, AnimMontage_20_992BF522499E6E94EC4543A7B384081E) == 0x000038, "Member 'FFEventPlAttachAssetData::AnimMontage_20_992BF522499E6E94EC4543A7B384081E' has a wrong offset!");

}

