#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FEventHiddenActorForTagNameData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FEventHiddenActorForTagNameData.FEventHiddenActorForTagNameData
// 0x000C (0x000C - 0x0000)
struct FFEventHiddenActorForTagNameData final
{
public:
	class FName                                   StoreTagName_4_E83FE6D64C229F729C09E5935F27E71A;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StoreHiddenInGame_5_8F9B053644BEE221A7FEF6A2EA0AE1A3; // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          StoreIsKeepHidden_6_20EA0F4745955110F721609C032BC8E4; // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FFEventHiddenActorForTagNameData) == 0x000004, "Wrong alignment on FFEventHiddenActorForTagNameData");
static_assert(sizeof(FFEventHiddenActorForTagNameData) == 0x00000C, "Wrong size on FFEventHiddenActorForTagNameData");
static_assert(offsetof(FFEventHiddenActorForTagNameData, StoreTagName_4_E83FE6D64C229F729C09E5935F27E71A) == 0x000000, "Member 'FFEventHiddenActorForTagNameData::StoreTagName_4_E83FE6D64C229F729C09E5935F27E71A' has a wrong offset!");
static_assert(offsetof(FFEventHiddenActorForTagNameData, StoreHiddenInGame_5_8F9B053644BEE221A7FEF6A2EA0AE1A3) == 0x000008, "Member 'FFEventHiddenActorForTagNameData::StoreHiddenInGame_5_8F9B053644BEE221A7FEF6A2EA0AE1A3' has a wrong offset!");
static_assert(offsetof(FFEventHiddenActorForTagNameData, StoreIsKeepHidden_6_20EA0F4745955110F721609C032BC8E4) == 0x000009, "Member 'FFEventHiddenActorForTagNameData::StoreIsKeepHidden_6_20EA0F4745955110F721609C032BC8E4' has a wrong offset!");

}

