#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FEventInitSettingData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FEventInitSettingData.FEventInitSettingData
// 0x0006 (0x0006 - 0x0000)
struct FFEventInitSettingData final
{
public:
	bool                                          EventStartVisibleUI_6_4AD2162845CBD4BC61DF62BF7A9DC131; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          EventEndVisibleUI_7_A144B1004EC08A78248601B7C6727314; // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsEventBeforeInGameCapture_10_4365200C404AC103A6F625BCD7025EC3; // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          EventStart_NotPlControl_13_27FBB3784AF70E7B8CBFC1A1AD7B1342; // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          EventEnd_NotPlControl_14_C1FD90F746DC5FB85775EA8DC4ECCABE; // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OffSkipEventEndFade_17_4F8DB5514F16B1678859429CD9B126DC; // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FFEventInitSettingData) == 0x000001, "Wrong alignment on FFEventInitSettingData");
static_assert(sizeof(FFEventInitSettingData) == 0x000006, "Wrong size on FFEventInitSettingData");
static_assert(offsetof(FFEventInitSettingData, EventStartVisibleUI_6_4AD2162845CBD4BC61DF62BF7A9DC131) == 0x000000, "Member 'FFEventInitSettingData::EventStartVisibleUI_6_4AD2162845CBD4BC61DF62BF7A9DC131' has a wrong offset!");
static_assert(offsetof(FFEventInitSettingData, EventEndVisibleUI_7_A144B1004EC08A78248601B7C6727314) == 0x000001, "Member 'FFEventInitSettingData::EventEndVisibleUI_7_A144B1004EC08A78248601B7C6727314' has a wrong offset!");
static_assert(offsetof(FFEventInitSettingData, IsEventBeforeInGameCapture_10_4365200C404AC103A6F625BCD7025EC3) == 0x000002, "Member 'FFEventInitSettingData::IsEventBeforeInGameCapture_10_4365200C404AC103A6F625BCD7025EC3' has a wrong offset!");
static_assert(offsetof(FFEventInitSettingData, EventStart_NotPlControl_13_27FBB3784AF70E7B8CBFC1A1AD7B1342) == 0x000003, "Member 'FFEventInitSettingData::EventStart_NotPlControl_13_27FBB3784AF70E7B8CBFC1A1AD7B1342' has a wrong offset!");
static_assert(offsetof(FFEventInitSettingData, EventEnd_NotPlControl_14_C1FD90F746DC5FB85775EA8DC4ECCABE) == 0x000004, "Member 'FFEventInitSettingData::EventEnd_NotPlControl_14_C1FD90F746DC5FB85775EA8DC4ECCABE' has a wrong offset!");
static_assert(offsetof(FFEventInitSettingData, OffSkipEventEndFade_17_4F8DB5514F16B1678859429CD9B126DC) == 0x000005, "Member 'FFEventInitSettingData::OffSkipEventEndFade_17_4F8DB5514F16B1678859429CD9B126DC' has a wrong offset!");

}

