#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FEventTriggerCommand

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK
{

// UserDefinedStruct FEventTriggerCommand.FEventTriggerCommand
// 0x0068 (0x0068 - 0x0000)
struct FFEventTriggerCommand final
{
public:
	EEventTriggerCheckType                        EventTriggerType_3_8B756CE44FCBAE430CB264A465DE700B; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_327A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 MakeEventActorClass_5_991242B34E58E0FCCBD5D4AA92F9861A; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 SubMakeEventActorClass_31_5C77F1E54E332ED2BE0A4DB4E6EBC755; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggerWaitTime_8_E4BB2A474960FDC10DD51DBAAB82FCBB; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EnemyNum_14_CD835F684EA2A44ACA2B5B96FC10F561;      // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EnemyLevelName_11_383EAF5E4D472FAAF2731281B4D856A5; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ForCharaID_19_D534CA074167F07B63356FB72A07EAD8;    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ItemID_20_C861D19D45BA384D470E6BB11AC12712;        // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           TriggerPlayerAnimMontage_23_08D98F1E43CF7C1FD458109C512AC2FA; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ObstructActionNum_28_F3179BF14067D7AEE23E529DB6E9FF53; // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EventPriority_34_93406E194C3AB7A1FCCC00969CA3B215; // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EnemyHPCheckCharaTag_37_A346F6E3445F1948545B568D3E29556C; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EnemyHPCheckHPRate_41_46652FC34EBBC07689943ABD0C567D4C; // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DimensionTangleLevelName_45_726CF3C84A978508D436E7B28BCFDAD8; // 0x0054(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DimensionTangleNum_47_633335C34396DBB830BF89A167FA27A0; // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsExceptionBrainTalkEvent_52_EAE2F0834C972C48A3A274B4BA0BE40A; // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsBattleSimulatorSystemEvent_61_8C2E4DC64210B8190F757B8D6CCDE8ED; // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsAjitoStayEvent_63_4268FE984434C72B8998D0A7E2D3B7D1; // 0x0062(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FFEventTriggerCommand) == 0x000008, "Wrong alignment on FFEventTriggerCommand");
static_assert(sizeof(FFEventTriggerCommand) == 0x000068, "Wrong size on FFEventTriggerCommand");
static_assert(offsetof(FFEventTriggerCommand, EventTriggerType_3_8B756CE44FCBAE430CB264A465DE700B) == 0x000000, "Member 'FFEventTriggerCommand::EventTriggerType_3_8B756CE44FCBAE430CB264A465DE700B' has a wrong offset!");
static_assert(offsetof(FFEventTriggerCommand, MakeEventActorClass_5_991242B34E58E0FCCBD5D4AA92F9861A) == 0x000008, "Member 'FFEventTriggerCommand::MakeEventActorClass_5_991242B34E58E0FCCBD5D4AA92F9861A' has a wrong offset!");
static_assert(offsetof(FFEventTriggerCommand, SubMakeEventActorClass_31_5C77F1E54E332ED2BE0A4DB4E6EBC755) == 0x000010, "Member 'FFEventTriggerCommand::SubMakeEventActorClass_31_5C77F1E54E332ED2BE0A4DB4E6EBC755' has a wrong offset!");
static_assert(offsetof(FFEventTriggerCommand, TriggerWaitTime_8_E4BB2A474960FDC10DD51DBAAB82FCBB) == 0x000018, "Member 'FFEventTriggerCommand::TriggerWaitTime_8_E4BB2A474960FDC10DD51DBAAB82FCBB' has a wrong offset!");
static_assert(offsetof(FFEventTriggerCommand, EnemyNum_14_CD835F684EA2A44ACA2B5B96FC10F561) == 0x00001C, "Member 'FFEventTriggerCommand::EnemyNum_14_CD835F684EA2A44ACA2B5B96FC10F561' has a wrong offset!");
static_assert(offsetof(FFEventTriggerCommand, EnemyLevelName_11_383EAF5E4D472FAAF2731281B4D856A5) == 0x000020, "Member 'FFEventTriggerCommand::EnemyLevelName_11_383EAF5E4D472FAAF2731281B4D856A5' has a wrong offset!");
static_assert(offsetof(FFEventTriggerCommand, ForCharaID_19_D534CA074167F07B63356FB72A07EAD8) == 0x000028, "Member 'FFEventTriggerCommand::ForCharaID_19_D534CA074167F07B63356FB72A07EAD8' has a wrong offset!");
static_assert(offsetof(FFEventTriggerCommand, ItemID_20_C861D19D45BA384D470E6BB11AC12712) == 0x000030, "Member 'FFEventTriggerCommand::ItemID_20_C861D19D45BA384D470E6BB11AC12712' has a wrong offset!");
static_assert(offsetof(FFEventTriggerCommand, TriggerPlayerAnimMontage_23_08D98F1E43CF7C1FD458109C512AC2FA) == 0x000038, "Member 'FFEventTriggerCommand::TriggerPlayerAnimMontage_23_08D98F1E43CF7C1FD458109C512AC2FA' has a wrong offset!");
static_assert(offsetof(FFEventTriggerCommand, ObstructActionNum_28_F3179BF14067D7AEE23E529DB6E9FF53) == 0x000040, "Member 'FFEventTriggerCommand::ObstructActionNum_28_F3179BF14067D7AEE23E529DB6E9FF53' has a wrong offset!");
static_assert(offsetof(FFEventTriggerCommand, EventPriority_34_93406E194C3AB7A1FCCC00969CA3B215) == 0x000044, "Member 'FFEventTriggerCommand::EventPriority_34_93406E194C3AB7A1FCCC00969CA3B215' has a wrong offset!");
static_assert(offsetof(FFEventTriggerCommand, EnemyHPCheckCharaTag_37_A346F6E3445F1948545B568D3E29556C) == 0x000048, "Member 'FFEventTriggerCommand::EnemyHPCheckCharaTag_37_A346F6E3445F1948545B568D3E29556C' has a wrong offset!");
static_assert(offsetof(FFEventTriggerCommand, EnemyHPCheckHPRate_41_46652FC34EBBC07689943ABD0C567D4C) == 0x000050, "Member 'FFEventTriggerCommand::EnemyHPCheckHPRate_41_46652FC34EBBC07689943ABD0C567D4C' has a wrong offset!");
static_assert(offsetof(FFEventTriggerCommand, DimensionTangleLevelName_45_726CF3C84A978508D436E7B28BCFDAD8) == 0x000054, "Member 'FFEventTriggerCommand::DimensionTangleLevelName_45_726CF3C84A978508D436E7B28BCFDAD8' has a wrong offset!");
static_assert(offsetof(FFEventTriggerCommand, DimensionTangleNum_47_633335C34396DBB830BF89A167FA27A0) == 0x00005C, "Member 'FFEventTriggerCommand::DimensionTangleNum_47_633335C34396DBB830BF89A167FA27A0' has a wrong offset!");
static_assert(offsetof(FFEventTriggerCommand, IsExceptionBrainTalkEvent_52_EAE2F0834C972C48A3A274B4BA0BE40A) == 0x000060, "Member 'FFEventTriggerCommand::IsExceptionBrainTalkEvent_52_EAE2F0834C972C48A3A274B4BA0BE40A' has a wrong offset!");
static_assert(offsetof(FFEventTriggerCommand, IsBattleSimulatorSystemEvent_61_8C2E4DC64210B8190F757B8D6CCDE8ED) == 0x000061, "Member 'FFEventTriggerCommand::IsBattleSimulatorSystemEvent_61_8C2E4DC64210B8190F757B8D6CCDE8ED' has a wrong offset!");
static_assert(offsetof(FFEventTriggerCommand, IsAjitoStayEvent_63_4268FE984434C72B8998D0A7E2D3B7D1) == 0x000062, "Member 'FFEventTriggerCommand::IsAjitoStayEvent_63_4268FE984434C72B8998D0A7E2D3B7D1' has a wrong offset!");

}

