#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FHitSlowParam

#include "Basic.hpp"

#include "EHitSlowDelayType_structs.hpp"


namespace SDK
{

// UserDefinedStruct FHitSlowParam.FHitSlowParam
// 0x0020 (0x0020 - 0x0000)
struct FFHitSlowParam final
{
public:
	EHitSlowDelayType                             DelayType_10_653C22C24BDA679CDBB13A956DC20216;     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C8[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Priority_7_C58D8FAA43B8424D8684998BDF136DE1;       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SloowRate_2_DE8F65224B744ABB577E3098D4AA39D1;      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SlowSecond_4_6DDAB94B4027E9A66247E3A993F85EB3;     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Comment_13_317510094D7A8E4D1F8DD9A2D8B9B457;       // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FFHitSlowParam) == 0x000008, "Wrong alignment on FFHitSlowParam");
static_assert(sizeof(FFHitSlowParam) == 0x000020, "Wrong size on FFHitSlowParam");
static_assert(offsetof(FFHitSlowParam, DelayType_10_653C22C24BDA679CDBB13A956DC20216) == 0x000000, "Member 'FFHitSlowParam::DelayType_10_653C22C24BDA679CDBB13A956DC20216' has a wrong offset!");
static_assert(offsetof(FFHitSlowParam, Priority_7_C58D8FAA43B8424D8684998BDF136DE1) == 0x000004, "Member 'FFHitSlowParam::Priority_7_C58D8FAA43B8424D8684998BDF136DE1' has a wrong offset!");
static_assert(offsetof(FFHitSlowParam, SloowRate_2_DE8F65224B744ABB577E3098D4AA39D1) == 0x000008, "Member 'FFHitSlowParam::SloowRate_2_DE8F65224B744ABB577E3098D4AA39D1' has a wrong offset!");
static_assert(offsetof(FFHitSlowParam, SlowSecond_4_6DDAB94B4027E9A66247E3A993F85EB3) == 0x00000C, "Member 'FFHitSlowParam::SlowSecond_4_6DDAB94B4027E9A66247E3A993F85EB3' has a wrong offset!");
static_assert(offsetof(FFHitSlowParam, Comment_13_317510094D7A8E4D1F8DD9A2D8B9B457) == 0x000010, "Member 'FFHitSlowParam::Comment_13_317510094D7A8E4D1F8DD9A2D8B9B457' has a wrong offset!");

}

