#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FNotifyAttackData

#include "Basic.hpp"

#include "ENotifyAttackType_structs.hpp"


namespace SDK
{

// UserDefinedStruct FNotifyAttackData.FNotifyAttackData
// 0x0010 (0x0010 - 0x0000)
struct FFNotifyAttackData final
{
public:
	bool                                          bEnable_15_25556541426A9FFD297658AAEEF0D4C7;       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	ENotifyAttackType                             Type_8_A43D8D2A40975BAEBCCB3DBE5AE4B0B0;           // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Front_9_DDDA7C044C2637426F5F258FDE98764B;          // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Back_10_66465FD348366691B46415A38115518E;          // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Right_11_A6AA65E74DA0D7A9A530BBA2AC5C6D85;         // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Left_12_838367A041F70363A446A089D1DBD064;          // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47BC[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Range_13_E421928E4584EF555D3D96982F8E7333;         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Witdh_18_B974BEDF48C8ADE80B093AA83F8CCBA7;         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFNotifyAttackData) == 0x000004, "Wrong alignment on FFNotifyAttackData");
static_assert(sizeof(FFNotifyAttackData) == 0x000010, "Wrong size on FFNotifyAttackData");
static_assert(offsetof(FFNotifyAttackData, bEnable_15_25556541426A9FFD297658AAEEF0D4C7) == 0x000000, "Member 'FFNotifyAttackData::bEnable_15_25556541426A9FFD297658AAEEF0D4C7' has a wrong offset!");
static_assert(offsetof(FFNotifyAttackData, Type_8_A43D8D2A40975BAEBCCB3DBE5AE4B0B0) == 0x000001, "Member 'FFNotifyAttackData::Type_8_A43D8D2A40975BAEBCCB3DBE5AE4B0B0' has a wrong offset!");
static_assert(offsetof(FFNotifyAttackData, Front_9_DDDA7C044C2637426F5F258FDE98764B) == 0x000002, "Member 'FFNotifyAttackData::Front_9_DDDA7C044C2637426F5F258FDE98764B' has a wrong offset!");
static_assert(offsetof(FFNotifyAttackData, Back_10_66465FD348366691B46415A38115518E) == 0x000003, "Member 'FFNotifyAttackData::Back_10_66465FD348366691B46415A38115518E' has a wrong offset!");
static_assert(offsetof(FFNotifyAttackData, Right_11_A6AA65E74DA0D7A9A530BBA2AC5C6D85) == 0x000004, "Member 'FFNotifyAttackData::Right_11_A6AA65E74DA0D7A9A530BBA2AC5C6D85' has a wrong offset!");
static_assert(offsetof(FFNotifyAttackData, Left_12_838367A041F70363A446A089D1DBD064) == 0x000005, "Member 'FFNotifyAttackData::Left_12_838367A041F70363A446A089D1DBD064' has a wrong offset!");
static_assert(offsetof(FFNotifyAttackData, Range_13_E421928E4584EF555D3D96982F8E7333) == 0x000008, "Member 'FFNotifyAttackData::Range_13_E421928E4584EF555D3D96982F8E7333' has a wrong offset!");
static_assert(offsetof(FFNotifyAttackData, Witdh_18_B974BEDF48C8ADE80B093AA83F8CCBA7) == 0x00000C, "Member 'FFNotifyAttackData::Witdh_18_B974BEDF48C8ADE80B093AA83F8CCBA7' has a wrong offset!");

}

