#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FPlayerFacialData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FPlayerFacialData.FPlayerFacialData
// 0x0088 (0x0088 - 0x0000)
struct FFPlayerFacialData final
{
public:
	class UAnimMontage*                           Default_13_2403D4B941CF467D4C7FE7B15DB45607;       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Smile_S_14_0229554B4EFCD57C3B76078D2712423D;       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Smile_L_15_D4452F30473E52CF6576BABA5689FC6C;       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Smile_3_44_8A9A2D08492F796CDBCFFAA15F5D55DF;       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Angry_16_A49EFB6845DD0A34F0127D9F7FBEA54E;         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Sad_17_35D165D645F38ECBCED7A3A44570C88A;           // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Surprise_S_18_B23DC2E34EF6C4581BC92CAA9A3ABC16;    // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Surprise_L_19_E5FE80CA403C8FB6E61622B2DDEC33DC;    // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Fear_20_99EF9BA0486943594F44009AD3B79E35;          // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Aversion_21_9975F48340A22DAE4A538B94220EC3E3;      // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Damage_S_22_B1B0696E47EDD06AF3295F8B654F03B5;      // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Damage_L_23_82C697634E8817CFCD79558FF29A7B9E;      // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Serious_30_74A6226243BE9C8B4AB76D86BEF38C79;       // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Blushing_31_2C6F385348B52A7274D85AB61367D763;      // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Dead_32_39256F1D4F1A3435C1F58984D5E6069A;          // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           EX02_37_B0F9CDCE4E5F2C9156C9D295020889A1;          // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           EX01_40_AAE2CD4446D1679CE4CC8082CA0D6D69;          // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFPlayerFacialData) == 0x000008, "Wrong alignment on FFPlayerFacialData");
static_assert(sizeof(FFPlayerFacialData) == 0x000088, "Wrong size on FFPlayerFacialData");
static_assert(offsetof(FFPlayerFacialData, Default_13_2403D4B941CF467D4C7FE7B15DB45607) == 0x000000, "Member 'FFPlayerFacialData::Default_13_2403D4B941CF467D4C7FE7B15DB45607' has a wrong offset!");
static_assert(offsetof(FFPlayerFacialData, Smile_S_14_0229554B4EFCD57C3B76078D2712423D) == 0x000008, "Member 'FFPlayerFacialData::Smile_S_14_0229554B4EFCD57C3B76078D2712423D' has a wrong offset!");
static_assert(offsetof(FFPlayerFacialData, Smile_L_15_D4452F30473E52CF6576BABA5689FC6C) == 0x000010, "Member 'FFPlayerFacialData::Smile_L_15_D4452F30473E52CF6576BABA5689FC6C' has a wrong offset!");
static_assert(offsetof(FFPlayerFacialData, Smile_3_44_8A9A2D08492F796CDBCFFAA15F5D55DF) == 0x000018, "Member 'FFPlayerFacialData::Smile_3_44_8A9A2D08492F796CDBCFFAA15F5D55DF' has a wrong offset!");
static_assert(offsetof(FFPlayerFacialData, Angry_16_A49EFB6845DD0A34F0127D9F7FBEA54E) == 0x000020, "Member 'FFPlayerFacialData::Angry_16_A49EFB6845DD0A34F0127D9F7FBEA54E' has a wrong offset!");
static_assert(offsetof(FFPlayerFacialData, Sad_17_35D165D645F38ECBCED7A3A44570C88A) == 0x000028, "Member 'FFPlayerFacialData::Sad_17_35D165D645F38ECBCED7A3A44570C88A' has a wrong offset!");
static_assert(offsetof(FFPlayerFacialData, Surprise_S_18_B23DC2E34EF6C4581BC92CAA9A3ABC16) == 0x000030, "Member 'FFPlayerFacialData::Surprise_S_18_B23DC2E34EF6C4581BC92CAA9A3ABC16' has a wrong offset!");
static_assert(offsetof(FFPlayerFacialData, Surprise_L_19_E5FE80CA403C8FB6E61622B2DDEC33DC) == 0x000038, "Member 'FFPlayerFacialData::Surprise_L_19_E5FE80CA403C8FB6E61622B2DDEC33DC' has a wrong offset!");
static_assert(offsetof(FFPlayerFacialData, Fear_20_99EF9BA0486943594F44009AD3B79E35) == 0x000040, "Member 'FFPlayerFacialData::Fear_20_99EF9BA0486943594F44009AD3B79E35' has a wrong offset!");
static_assert(offsetof(FFPlayerFacialData, Aversion_21_9975F48340A22DAE4A538B94220EC3E3) == 0x000048, "Member 'FFPlayerFacialData::Aversion_21_9975F48340A22DAE4A538B94220EC3E3' has a wrong offset!");
static_assert(offsetof(FFPlayerFacialData, Damage_S_22_B1B0696E47EDD06AF3295F8B654F03B5) == 0x000050, "Member 'FFPlayerFacialData::Damage_S_22_B1B0696E47EDD06AF3295F8B654F03B5' has a wrong offset!");
static_assert(offsetof(FFPlayerFacialData, Damage_L_23_82C697634E8817CFCD79558FF29A7B9E) == 0x000058, "Member 'FFPlayerFacialData::Damage_L_23_82C697634E8817CFCD79558FF29A7B9E' has a wrong offset!");
static_assert(offsetof(FFPlayerFacialData, Serious_30_74A6226243BE9C8B4AB76D86BEF38C79) == 0x000060, "Member 'FFPlayerFacialData::Serious_30_74A6226243BE9C8B4AB76D86BEF38C79' has a wrong offset!");
static_assert(offsetof(FFPlayerFacialData, Blushing_31_2C6F385348B52A7274D85AB61367D763) == 0x000068, "Member 'FFPlayerFacialData::Blushing_31_2C6F385348B52A7274D85AB61367D763' has a wrong offset!");
static_assert(offsetof(FFPlayerFacialData, Dead_32_39256F1D4F1A3435C1F58984D5E6069A) == 0x000070, "Member 'FFPlayerFacialData::Dead_32_39256F1D4F1A3435C1F58984D5E6069A' has a wrong offset!");
static_assert(offsetof(FFPlayerFacialData, EX02_37_B0F9CDCE4E5F2C9156C9D295020889A1) == 0x000078, "Member 'FFPlayerFacialData::EX02_37_B0F9CDCE4E5F2C9156C9D295020889A1' has a wrong offset!");
static_assert(offsetof(FFPlayerFacialData, EX01_40_AAE2CD4446D1679CE4CC8082CA0D6D69) == 0x000080, "Member 'FFPlayerFacialData::EX01_40_AAE2CD4446D1679CE4CC8082CA0D6D69' has a wrong offset!");

}

