#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FPlayerBattleParticleData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct FPlayerBattleParticleData.FPlayerBattleParticleData
// 0x0048 (0x0048 - 0x0000)
struct FFPlayerBattleParticleData final
{
public:
	class UParticleSystem*                        LeftHandParticle_22_AA87B0AB422CA664E19CABADFA216DEB; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        RightHandParticle_24_3A36B54348B578421CB1909DF7955DD2; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        HeadParticle_19_A3B5F5FB485F9B5043232BA5B4BED7F8;  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorA_15_4C4F521D4F6F3643D247BA814A426ABE;        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorB_17_B1056F7F4E14CC282C794790AF2C6B7C;        // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius1_7_9B1B7B2049DE8C73087D91946EE45BBF;        // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rate1_8_975BBF2643BDAD802829C1B8105B798C;          // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius2_9_43EF078A41B6F49F44270A8E4AFFA6DB;        // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rate2_10_C020952E45011D51AE8F65B8E22DE03E;         // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFPlayerBattleParticleData) == 0x000008, "Wrong alignment on FFPlayerBattleParticleData");
static_assert(sizeof(FFPlayerBattleParticleData) == 0x000048, "Wrong size on FFPlayerBattleParticleData");
static_assert(offsetof(FFPlayerBattleParticleData, LeftHandParticle_22_AA87B0AB422CA664E19CABADFA216DEB) == 0x000000, "Member 'FFPlayerBattleParticleData::LeftHandParticle_22_AA87B0AB422CA664E19CABADFA216DEB' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleParticleData, RightHandParticle_24_3A36B54348B578421CB1909DF7955DD2) == 0x000008, "Member 'FFPlayerBattleParticleData::RightHandParticle_24_3A36B54348B578421CB1909DF7955DD2' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleParticleData, HeadParticle_19_A3B5F5FB485F9B5043232BA5B4BED7F8) == 0x000010, "Member 'FFPlayerBattleParticleData::HeadParticle_19_A3B5F5FB485F9B5043232BA5B4BED7F8' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleParticleData, ColorA_15_4C4F521D4F6F3643D247BA814A426ABE) == 0x000018, "Member 'FFPlayerBattleParticleData::ColorA_15_4C4F521D4F6F3643D247BA814A426ABE' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleParticleData, ColorB_17_B1056F7F4E14CC282C794790AF2C6B7C) == 0x000028, "Member 'FFPlayerBattleParticleData::ColorB_17_B1056F7F4E14CC282C794790AF2C6B7C' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleParticleData, Radius1_7_9B1B7B2049DE8C73087D91946EE45BBF) == 0x000038, "Member 'FFPlayerBattleParticleData::Radius1_7_9B1B7B2049DE8C73087D91946EE45BBF' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleParticleData, Rate1_8_975BBF2643BDAD802829C1B8105B798C) == 0x00003C, "Member 'FFPlayerBattleParticleData::Rate1_8_975BBF2643BDAD802829C1B8105B798C' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleParticleData, Radius2_9_43EF078A41B6F49F44270A8E4AFFA6DB) == 0x000040, "Member 'FFPlayerBattleParticleData::Radius2_9_43EF078A41B6F49F44270A8E4AFFA6DB' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleParticleData, Rate2_10_C020952E45011D51AE8F65B8E22DE03E) == 0x000044, "Member 'FFPlayerBattleParticleData::Rate2_10_C020952E45011D51AE8F65B8E22DE03E' has a wrong offset!");

}

