#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FPlayerCableMaterialParameter

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FPlayerCableMaterialParameter.FPlayerCableMaterialParameter
// 0x0020 (0x0020 - 0x0000)
struct FFPlayerCableMaterialParameter final
{
public:
	class UMeshComponent*                         Mesh_14_B5C77D14461A7B97F6E822BD0A5D3E88;          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       Materials_3_99FAB57E45D0D18729C8D3826D6F51B3;      // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	float                                         DefaultDither_8_9E4BC528431FB48BD22E8C815537BC0C;  // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFPlayerCableMaterialParameter) == 0x000008, "Wrong alignment on FFPlayerCableMaterialParameter");
static_assert(sizeof(FFPlayerCableMaterialParameter) == 0x000020, "Wrong size on FFPlayerCableMaterialParameter");
static_assert(offsetof(FFPlayerCableMaterialParameter, Mesh_14_B5C77D14461A7B97F6E822BD0A5D3E88) == 0x000000, "Member 'FFPlayerCableMaterialParameter::Mesh_14_B5C77D14461A7B97F6E822BD0A5D3E88' has a wrong offset!");
static_assert(offsetof(FFPlayerCableMaterialParameter, Materials_3_99FAB57E45D0D18729C8D3826D6F51B3) == 0x000008, "Member 'FFPlayerCableMaterialParameter::Materials_3_99FAB57E45D0D18729C8D3826D6F51B3' has a wrong offset!");
static_assert(offsetof(FFPlayerCableMaterialParameter, DefaultDither_8_9E4BC528431FB48BD22E8C815537BC0C) == 0x000018, "Member 'FFPlayerCableMaterialParameter::DefaultDither_8_9E4BC528431FB48BD22E8C815537BC0C' has a wrong offset!");

}

