#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FPlayerAIBattleThinkData

#include "Basic.hpp"

#include "FPlayerAIBattleThinkTransitionData_structs.hpp"


namespace SDK
{

// UserDefinedStruct FPlayerAIBattleThinkData.FPlayerAIBattleThinkData
// 0x0018 (0x0018 - 0x0000)
struct FFPlayerAIBattleThinkData final
{
public:
	float                                         Timer_4_8CD2BE874E9F24857C4679AB4BDA718D;          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance_18_E4C35E06408C79543AE6409637024E45;      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFPlayerAIBattleThinkTransitionData> Transition_15_469FC55A4F1579BCBF8C70B40EBC85EC;    // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FFPlayerAIBattleThinkData) == 0x000008, "Wrong alignment on FFPlayerAIBattleThinkData");
static_assert(sizeof(FFPlayerAIBattleThinkData) == 0x000018, "Wrong size on FFPlayerAIBattleThinkData");
static_assert(offsetof(FFPlayerAIBattleThinkData, Timer_4_8CD2BE874E9F24857C4679AB4BDA718D) == 0x000000, "Member 'FFPlayerAIBattleThinkData::Timer_4_8CD2BE874E9F24857C4679AB4BDA718D' has a wrong offset!");
static_assert(offsetof(FFPlayerAIBattleThinkData, Distance_18_E4C35E06408C79543AE6409637024E45) == 0x000004, "Member 'FFPlayerAIBattleThinkData::Distance_18_E4C35E06408C79543AE6409637024E45' has a wrong offset!");
static_assert(offsetof(FFPlayerAIBattleThinkData, Transition_15_469FC55A4F1579BCBF8C70B40EBC85EC) == 0x000008, "Member 'FFPlayerAIBattleThinkData::Transition_15_469FC55A4F1579BCBF8C70B40EBC85EC' has a wrong offset!");

}

