#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FPlayerWeaponLoadData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FPlayerWeaponLoadData.FPlayerWeaponLoadData
// 0x0060 (0x0060 - 0x0000)
struct FFPlayerWeaponLoadData final
{
public:
	int32                                         ID_13_FC9CC56245E6C498C7D52FB6CD146BF6;            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46CF[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USkeletalMesh>           Mesh_9_24DE0845420B4BED09923D8ED84BFE6F;           // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USkeletalMesh>           ExtraMesh_10_B0C52D064D9799CB8E79218CAC24D6BF;     // 0x0030(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          bDisableYuitoString_18_892E83ED4C5503792EA0319226CB1558; // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FFPlayerWeaponLoadData) == 0x000008, "Wrong alignment on FFPlayerWeaponLoadData");
static_assert(sizeof(FFPlayerWeaponLoadData) == 0x000060, "Wrong size on FFPlayerWeaponLoadData");
static_assert(offsetof(FFPlayerWeaponLoadData, ID_13_FC9CC56245E6C498C7D52FB6CD146BF6) == 0x000000, "Member 'FFPlayerWeaponLoadData::ID_13_FC9CC56245E6C498C7D52FB6CD146BF6' has a wrong offset!");
static_assert(offsetof(FFPlayerWeaponLoadData, Mesh_9_24DE0845420B4BED09923D8ED84BFE6F) == 0x000008, "Member 'FFPlayerWeaponLoadData::Mesh_9_24DE0845420B4BED09923D8ED84BFE6F' has a wrong offset!");
static_assert(offsetof(FFPlayerWeaponLoadData, ExtraMesh_10_B0C52D064D9799CB8E79218CAC24D6BF) == 0x000030, "Member 'FFPlayerWeaponLoadData::ExtraMesh_10_B0C52D064D9799CB8E79218CAC24D6BF' has a wrong offset!");
static_assert(offsetof(FFPlayerWeaponLoadData, bDisableYuitoString_18_892E83ED4C5503792EA0319226CB1558) == 0x000058, "Member 'FFPlayerWeaponLoadData::bDisableYuitoString_18_892E83ED4C5503792EA0319226CB1558' has a wrong offset!");

}

