#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FPlayerBattleVoiceFacialAnimType

#include "Basic.hpp"

#include "EPlayerFacialAnim_structs.hpp"


namespace SDK
{

// UserDefinedStruct FPlayerBattleVoiceFacialAnimType.FPlayerBattleVoiceFacialAnimType
// 0x0012 (0x0012 - 0x0000)
struct FFPlayerBattleVoiceFacialAnimType final
{
public:
	EPlayerFacialAnim                             BattleStart_2_64D9DD654DB4B8276952E9946DE4674F;    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerFacialAnim                             RecoverySelf_18_1C643EC54007FF3574FAE988ADE05CEC;  // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerFacialAnim                             RecoveryFriend_19_A1D0F4FA4EFFA84A3BB474B9B8FBBCD7; // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerFacialAnim                             RecoveryBadStatusSelf_20_3A1DED654468D97E2B122E89CB7D4CB4; // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerFacialAnim                             RecoveryBadStatusFriend_21_587CF8E44EFD3854779510A46A06C6C3; // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerFacialAnim                             WakeUp_22_6EA191AD432380C09C6479B8F407B867;        // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerFacialAnim                             Dying_23_74A5B45544315D2AD449EC81B5620B1F;         // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerFacialAnim                             Die_24_B89109BA4A037419AFD08FA671C663B8;           // 0x0007(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerFacialAnim                             Defeated_25_A6D086F7448CBD7E2D0B0895C63A534D;      // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerFacialAnim                             Lost_26_70E6D2D3428A85FBCEFAE8B20F2231D9;          // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerFacialAnim                             Find_27_F435380244BB0E5BA944FD862DFD5692;          // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerFacialAnim                             BadStatusOil_28_B802E1CC4FD5BE611769C789734C88B2;  // 0x000B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerFacialAnim                             BadStatusFlooded_29_E181C2674B35DC76911FF98A7F3600FA; // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerFacialAnim                             BadStatusFlame_30_136EB4084A09D70E8FA171A705BEBB1D; // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerFacialAnim                             BadStatusElectric_31_6E58441149F926163B9298B50F50AC09; // 0x000E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerFacialAnim                             BadStatusConfusion_32_DB0517B844D3C21E976A978F8EFC3BFA; // 0x000F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerFacialAnim                             BadStatusCable_35_92BFF0F644E751B0436730845A886ECF; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerFacialAnim                             CableHit_37_77DFC92B429CBE3B62CD0CB4CA509BB0;      // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFPlayerBattleVoiceFacialAnimType) == 0x000001, "Wrong alignment on FFPlayerBattleVoiceFacialAnimType");
static_assert(sizeof(FFPlayerBattleVoiceFacialAnimType) == 0x000012, "Wrong size on FFPlayerBattleVoiceFacialAnimType");
static_assert(offsetof(FFPlayerBattleVoiceFacialAnimType, BattleStart_2_64D9DD654DB4B8276952E9946DE4674F) == 0x000000, "Member 'FFPlayerBattleVoiceFacialAnimType::BattleStart_2_64D9DD654DB4B8276952E9946DE4674F' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleVoiceFacialAnimType, RecoverySelf_18_1C643EC54007FF3574FAE988ADE05CEC) == 0x000001, "Member 'FFPlayerBattleVoiceFacialAnimType::RecoverySelf_18_1C643EC54007FF3574FAE988ADE05CEC' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleVoiceFacialAnimType, RecoveryFriend_19_A1D0F4FA4EFFA84A3BB474B9B8FBBCD7) == 0x000002, "Member 'FFPlayerBattleVoiceFacialAnimType::RecoveryFriend_19_A1D0F4FA4EFFA84A3BB474B9B8FBBCD7' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleVoiceFacialAnimType, RecoveryBadStatusSelf_20_3A1DED654468D97E2B122E89CB7D4CB4) == 0x000003, "Member 'FFPlayerBattleVoiceFacialAnimType::RecoveryBadStatusSelf_20_3A1DED654468D97E2B122E89CB7D4CB4' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleVoiceFacialAnimType, RecoveryBadStatusFriend_21_587CF8E44EFD3854779510A46A06C6C3) == 0x000004, "Member 'FFPlayerBattleVoiceFacialAnimType::RecoveryBadStatusFriend_21_587CF8E44EFD3854779510A46A06C6C3' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleVoiceFacialAnimType, WakeUp_22_6EA191AD432380C09C6479B8F407B867) == 0x000005, "Member 'FFPlayerBattleVoiceFacialAnimType::WakeUp_22_6EA191AD432380C09C6479B8F407B867' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleVoiceFacialAnimType, Dying_23_74A5B45544315D2AD449EC81B5620B1F) == 0x000006, "Member 'FFPlayerBattleVoiceFacialAnimType::Dying_23_74A5B45544315D2AD449EC81B5620B1F' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleVoiceFacialAnimType, Die_24_B89109BA4A037419AFD08FA671C663B8) == 0x000007, "Member 'FFPlayerBattleVoiceFacialAnimType::Die_24_B89109BA4A037419AFD08FA671C663B8' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleVoiceFacialAnimType, Defeated_25_A6D086F7448CBD7E2D0B0895C63A534D) == 0x000008, "Member 'FFPlayerBattleVoiceFacialAnimType::Defeated_25_A6D086F7448CBD7E2D0B0895C63A534D' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleVoiceFacialAnimType, Lost_26_70E6D2D3428A85FBCEFAE8B20F2231D9) == 0x000009, "Member 'FFPlayerBattleVoiceFacialAnimType::Lost_26_70E6D2D3428A85FBCEFAE8B20F2231D9' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleVoiceFacialAnimType, Find_27_F435380244BB0E5BA944FD862DFD5692) == 0x00000A, "Member 'FFPlayerBattleVoiceFacialAnimType::Find_27_F435380244BB0E5BA944FD862DFD5692' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleVoiceFacialAnimType, BadStatusOil_28_B802E1CC4FD5BE611769C789734C88B2) == 0x00000B, "Member 'FFPlayerBattleVoiceFacialAnimType::BadStatusOil_28_B802E1CC4FD5BE611769C789734C88B2' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleVoiceFacialAnimType, BadStatusFlooded_29_E181C2674B35DC76911FF98A7F3600FA) == 0x00000C, "Member 'FFPlayerBattleVoiceFacialAnimType::BadStatusFlooded_29_E181C2674B35DC76911FF98A7F3600FA' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleVoiceFacialAnimType, BadStatusFlame_30_136EB4084A09D70E8FA171A705BEBB1D) == 0x00000D, "Member 'FFPlayerBattleVoiceFacialAnimType::BadStatusFlame_30_136EB4084A09D70E8FA171A705BEBB1D' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleVoiceFacialAnimType, BadStatusElectric_31_6E58441149F926163B9298B50F50AC09) == 0x00000E, "Member 'FFPlayerBattleVoiceFacialAnimType::BadStatusElectric_31_6E58441149F926163B9298B50F50AC09' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleVoiceFacialAnimType, BadStatusConfusion_32_DB0517B844D3C21E976A978F8EFC3BFA) == 0x00000F, "Member 'FFPlayerBattleVoiceFacialAnimType::BadStatusConfusion_32_DB0517B844D3C21E976A978F8EFC3BFA' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleVoiceFacialAnimType, BadStatusCable_35_92BFF0F644E751B0436730845A886ECF) == 0x000010, "Member 'FFPlayerBattleVoiceFacialAnimType::BadStatusCable_35_92BFF0F644E751B0436730845A886ECF' has a wrong offset!");
static_assert(offsetof(FFPlayerBattleVoiceFacialAnimType, CableHit_37_77DFC92B429CBE3B62CD0CB4CA509BB0) == 0x000011, "Member 'FFPlayerBattleVoiceFacialAnimType::CableHit_37_77DFC92B429CBE3B62CD0CB4CA509BB0' has a wrong offset!");

}

