#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FRegisterShotData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AttackCollisionInfoBP_structs.hpp"


namespace SDK
{

// UserDefinedStruct FRegisterShotData.FRegisterShotData
// 0x00E8 (0x00E8 - 0x0000)
struct FFRegisterShotData final
{
public:
	float                                         FireTiming_36_227D767E49325DCC02A40C8D388A3F12;    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FirePoint_27_2462510C43E442A0F456CBAD7178785F;     // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FireDir_33_67826331469EECC6FFF709BCECA309A7;       // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53A3[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttackCollisionInfoBP                 CollisionInfo_30_28D856A547CE107D2940709E4029420D; // 0x0020(0x00C0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Index_32_6FAB069244A6D2335611459D8417E1D7;         // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFRegisterShotData) == 0x000008, "Wrong alignment on FFRegisterShotData");
static_assert(sizeof(FFRegisterShotData) == 0x0000E8, "Wrong size on FFRegisterShotData");
static_assert(offsetof(FFRegisterShotData, FireTiming_36_227D767E49325DCC02A40C8D388A3F12) == 0x000000, "Member 'FFRegisterShotData::FireTiming_36_227D767E49325DCC02A40C8D388A3F12' has a wrong offset!");
static_assert(offsetof(FFRegisterShotData, FirePoint_27_2462510C43E442A0F456CBAD7178785F) == 0x000004, "Member 'FFRegisterShotData::FirePoint_27_2462510C43E442A0F456CBAD7178785F' has a wrong offset!");
static_assert(offsetof(FFRegisterShotData, FireDir_33_67826331469EECC6FFF709BCECA309A7) == 0x000010, "Member 'FFRegisterShotData::FireDir_33_67826331469EECC6FFF709BCECA309A7' has a wrong offset!");
static_assert(offsetof(FFRegisterShotData, CollisionInfo_30_28D856A547CE107D2940709E4029420D) == 0x000020, "Member 'FFRegisterShotData::CollisionInfo_30_28D856A547CE107D2940709E4029420D' has a wrong offset!");
static_assert(offsetof(FFRegisterShotData, Index_32_6FAB069244A6D2335611459D8417E1D7) == 0x0000E0, "Member 'FFRegisterShotData::Index_32_6FAB069244A6D2335611459D8417E1D7' has a wrong offset!");

}

