#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FRenderTargetData

#include "Basic.hpp"

#include "ERenderTargetType_structs.hpp"


namespace SDK
{

// UserDefinedStruct FRenderTargetData.FRenderTargetData
// 0x0018 (0x0018 - 0x0000)
struct FFRenderTargetData final
{
public:
	ERenderTargetType                             RenderTargetType_4_8C741E17448F08E7261D50A5CC3BB4F0; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4788[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 TextureRenderTarget_5_63E1F25242ECEDC97DF104A38098E1BD; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               TextureData_8_0D9DAA534AA38C5BF0EB89AA7D5EE998;    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFRenderTargetData) == 0x000008, "Wrong alignment on FFRenderTargetData");
static_assert(sizeof(FFRenderTargetData) == 0x000018, "Wrong size on FFRenderTargetData");
static_assert(offsetof(FFRenderTargetData, RenderTargetType_4_8C741E17448F08E7261D50A5CC3BB4F0) == 0x000000, "Member 'FFRenderTargetData::RenderTargetType_4_8C741E17448F08E7261D50A5CC3BB4F0' has a wrong offset!");
static_assert(offsetof(FFRenderTargetData, TextureRenderTarget_5_63E1F25242ECEDC97DF104A38098E1BD) == 0x000008, "Member 'FFRenderTargetData::TextureRenderTarget_5_63E1F25242ECEDC97DF104A38098E1BD' has a wrong offset!");
static_assert(offsetof(FFRenderTargetData, TextureData_8_0D9DAA534AA38C5BF0EB89AA7D5EE998) == 0x000010, "Member 'FFRenderTargetData::TextureData_8_0D9DAA534AA38C5BF0EB89AA7D5EE998' has a wrong offset!");

}

