#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FSASCommand

#include "Basic.hpp"

#include "FSASTelepoParam_structs.hpp"
#include "FSASCopyParam_structs.hpp"
#include "FSASStealthParam_structs.hpp"
#include "E_SASKind_structs.hpp"
#include "FSASElectricParam_structs.hpp"
#include "FSASMetalParam_structs.hpp"
#include "FSASSeeThroughParam_structs.hpp"
#include "FSASFireParam_structs.hpp"
#include "AcceleratorParam_structs.hpp"
#include "FSASPsychicParam_structs.hpp"


namespace SDK
{

// UserDefinedStruct FSASCommand.FSASCommand
// 0x0030 (0x0030 - 0x0000)
struct FFSASCommand final
{
public:
	E_SASKind                                     Kind_2_23A817BE4D2313508B87CFB882D2D118;           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_397C[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RemainTime_13_69E5C0AF416E23F54E741EAF69D93203;    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MemoryRemainTime_46_B2AD2AD248C2AD2E2404838C7C27F166; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxTime_45_8435A5824DED7FD281DB658180EB044C;       // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASFireParam                         Fire_23_769BF32843EEFBF0A3E905B89F8BCF47;          // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASMetalParam                        Metal_24_09BB48264A15259C751C17AA0FE944CF;         // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASSeeThroughParam                   SeeThrough_31_ABE1373C46861B2B0274A4A96FCCFFDD;    // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASTelepoParam                       Telepo_32_EF7E140D4BD15AA5A49B0ABAA87B155B;        // 0x0013(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASStealthParam                      Stealth_33_4D2AB2CB43BAAEDF2D32FDA11278C67C;       // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASElectricParam                     Electric_10_DCFFC7DC4C58A3DF3E711FA72780FB1F;      // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASCopyParam                         Copy_34_539F056E4F86B2ABCB0B8C8A3D23B4A1;          // 0x0016(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_397D[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAcceleratorParam                      Accelerator_7_49BD981A4CA9E2696131ECB6CC091520;    // 0x0018(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASPsychicParam                      Psychic_40_91A32BE84F69CE37511101A9DD92D386;       // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_397E[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner_37_509AEE1E405B7BD1ADABDA843B579086;         // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFSASCommand) == 0x000008, "Wrong alignment on FFSASCommand");
static_assert(sizeof(FFSASCommand) == 0x000030, "Wrong size on FFSASCommand");
static_assert(offsetof(FFSASCommand, Kind_2_23A817BE4D2313508B87CFB882D2D118) == 0x000000, "Member 'FFSASCommand::Kind_2_23A817BE4D2313508B87CFB882D2D118' has a wrong offset!");
static_assert(offsetof(FFSASCommand, RemainTime_13_69E5C0AF416E23F54E741EAF69D93203) == 0x000004, "Member 'FFSASCommand::RemainTime_13_69E5C0AF416E23F54E741EAF69D93203' has a wrong offset!");
static_assert(offsetof(FFSASCommand, MemoryRemainTime_46_B2AD2AD248C2AD2E2404838C7C27F166) == 0x000008, "Member 'FFSASCommand::MemoryRemainTime_46_B2AD2AD248C2AD2E2404838C7C27F166' has a wrong offset!");
static_assert(offsetof(FFSASCommand, MaxTime_45_8435A5824DED7FD281DB658180EB044C) == 0x00000C, "Member 'FFSASCommand::MaxTime_45_8435A5824DED7FD281DB658180EB044C' has a wrong offset!");
static_assert(offsetof(FFSASCommand, Fire_23_769BF32843EEFBF0A3E905B89F8BCF47) == 0x000010, "Member 'FFSASCommand::Fire_23_769BF32843EEFBF0A3E905B89F8BCF47' has a wrong offset!");
static_assert(offsetof(FFSASCommand, Metal_24_09BB48264A15259C751C17AA0FE944CF) == 0x000011, "Member 'FFSASCommand::Metal_24_09BB48264A15259C751C17AA0FE944CF' has a wrong offset!");
static_assert(offsetof(FFSASCommand, SeeThrough_31_ABE1373C46861B2B0274A4A96FCCFFDD) == 0x000012, "Member 'FFSASCommand::SeeThrough_31_ABE1373C46861B2B0274A4A96FCCFFDD' has a wrong offset!");
static_assert(offsetof(FFSASCommand, Telepo_32_EF7E140D4BD15AA5A49B0ABAA87B155B) == 0x000013, "Member 'FFSASCommand::Telepo_32_EF7E140D4BD15AA5A49B0ABAA87B155B' has a wrong offset!");
static_assert(offsetof(FFSASCommand, Stealth_33_4D2AB2CB43BAAEDF2D32FDA11278C67C) == 0x000014, "Member 'FFSASCommand::Stealth_33_4D2AB2CB43BAAEDF2D32FDA11278C67C' has a wrong offset!");
static_assert(offsetof(FFSASCommand, Electric_10_DCFFC7DC4C58A3DF3E711FA72780FB1F) == 0x000015, "Member 'FFSASCommand::Electric_10_DCFFC7DC4C58A3DF3E711FA72780FB1F' has a wrong offset!");
static_assert(offsetof(FFSASCommand, Copy_34_539F056E4F86B2ABCB0B8C8A3D23B4A1) == 0x000016, "Member 'FFSASCommand::Copy_34_539F056E4F86B2ABCB0B8C8A3D23B4A1' has a wrong offset!");
static_assert(offsetof(FFSASCommand, Accelerator_7_49BD981A4CA9E2696131ECB6CC091520) == 0x000018, "Member 'FFSASCommand::Accelerator_7_49BD981A4CA9E2696131ECB6CC091520' has a wrong offset!");
static_assert(offsetof(FFSASCommand, Psychic_40_91A32BE84F69CE37511101A9DD92D386) == 0x000024, "Member 'FFSASCommand::Psychic_40_91A32BE84F69CE37511101A9DD92D386' has a wrong offset!");
static_assert(offsetof(FFSASCommand, Owner_37_509AEE1E405B7BD1ADABDA843B579086) == 0x000028, "Member 'FFSASCommand::Owner_37_509AEE1E405B7BD1ADABDA843B579086' has a wrong offset!");

}

