#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FSasCutInVoiceVar

#include "Basic.hpp"

#include "FSasCutInVoiceData_structs.hpp"


namespace SDK
{

// UserDefinedStruct FSasCutInVoiceVar.FSasCutInVoiceVar
// 0x01B0 (0x01B0 - 0x0000)
struct FFSasCutInVoiceVar final
{
public:
	struct FFSasCutInVoiceData                    Fire_21_CE4D514A431849F269061E8D6D8376EE;          // 0x0000(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FFSasCutInVoiceData                    Metal_4_C4649CF24DAF746EBCF89099853BF942;          // 0x0030(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FFSasCutInVoiceData                    SeeThrough_6_D6E3501441C43133BF46C3910C442208;     // 0x0060(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FFSasCutInVoiceData                    Telepo_8_A2A575A54BE65608CC7F20ADB6D294A4;         // 0x0090(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FFSasCutInVoiceData                    Stealth_10_4AE4F2D94EA777D32A784DBC0D8BC4A6;       // 0x00C0(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FFSasCutInVoiceData                    Electoric_12_57E8FB4A4DEB96FEB3A453948A41B511;     // 0x00F0(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FFSasCutInVoiceData                    Copy_14_7964FFF142E9810955262E8B96F4D132;          // 0x0120(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FFSasCutInVoiceData                    Accelerator_16_C3BACE3549B70EE6D44E009B3B1F392E;   // 0x0150(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FFSasCutInVoiceData                    Psychic_24_9D2E5E294BBBD6835BC037B90E3B4BDB;       // 0x0180(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FFSasCutInVoiceVar) == 0x000008, "Wrong alignment on FFSasCutInVoiceVar");
static_assert(sizeof(FFSasCutInVoiceVar) == 0x0001B0, "Wrong size on FFSasCutInVoiceVar");
static_assert(offsetof(FFSasCutInVoiceVar, Fire_21_CE4D514A431849F269061E8D6D8376EE) == 0x000000, "Member 'FFSasCutInVoiceVar::Fire_21_CE4D514A431849F269061E8D6D8376EE' has a wrong offset!");
static_assert(offsetof(FFSasCutInVoiceVar, Metal_4_C4649CF24DAF746EBCF89099853BF942) == 0x000030, "Member 'FFSasCutInVoiceVar::Metal_4_C4649CF24DAF746EBCF89099853BF942' has a wrong offset!");
static_assert(offsetof(FFSasCutInVoiceVar, SeeThrough_6_D6E3501441C43133BF46C3910C442208) == 0x000060, "Member 'FFSasCutInVoiceVar::SeeThrough_6_D6E3501441C43133BF46C3910C442208' has a wrong offset!");
static_assert(offsetof(FFSasCutInVoiceVar, Telepo_8_A2A575A54BE65608CC7F20ADB6D294A4) == 0x000090, "Member 'FFSasCutInVoiceVar::Telepo_8_A2A575A54BE65608CC7F20ADB6D294A4' has a wrong offset!");
static_assert(offsetof(FFSasCutInVoiceVar, Stealth_10_4AE4F2D94EA777D32A784DBC0D8BC4A6) == 0x0000C0, "Member 'FFSasCutInVoiceVar::Stealth_10_4AE4F2D94EA777D32A784DBC0D8BC4A6' has a wrong offset!");
static_assert(offsetof(FFSasCutInVoiceVar, Electoric_12_57E8FB4A4DEB96FEB3A453948A41B511) == 0x0000F0, "Member 'FFSasCutInVoiceVar::Electoric_12_57E8FB4A4DEB96FEB3A453948A41B511' has a wrong offset!");
static_assert(offsetof(FFSasCutInVoiceVar, Copy_14_7964FFF142E9810955262E8B96F4D132) == 0x000120, "Member 'FFSasCutInVoiceVar::Copy_14_7964FFF142E9810955262E8B96F4D132' has a wrong offset!");
static_assert(offsetof(FFSasCutInVoiceVar, Accelerator_16_C3BACE3549B70EE6D44E009B3B1F392E) == 0x000150, "Member 'FFSasCutInVoiceVar::Accelerator_16_C3BACE3549B70EE6D44E009B3B1F392E' has a wrong offset!");
static_assert(offsetof(FFSasCutInVoiceVar, Psychic_24_9D2E5E294BBBD6835BC037B90E3B4BDB) == 0x000180, "Member 'FFSasCutInVoiceVar::Psychic_24_9D2E5E294BBBD6835BC037B90E3B4BDB' has a wrong offset!");

}

