#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FSasCutInVoiceData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FSasCutInVoiceData.FSasCutInVoiceData
// 0x0030 (0x0030 - 0x0000)
struct FFSasCutInVoiceData final
{
public:
	TArray<TSoftObjectPtr<class USoundAtomCue>>   BondsLevel1_15_49F0F1B94DA188B86DE855A8213743E8;   // 0x0000(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class USoundAtomCue>>   BondsLevel2_16_A0EB98434E8FB9F462A8989D05C9BA5B;   // 0x0010(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class USoundAtomCue>>   BondsLevel3_18_6FF8ECA34A6267B3E60532BCAE381A6D;   // 0x0020(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FFSasCutInVoiceData) == 0x000008, "Wrong alignment on FFSasCutInVoiceData");
static_assert(sizeof(FFSasCutInVoiceData) == 0x000030, "Wrong size on FFSasCutInVoiceData");
static_assert(offsetof(FFSasCutInVoiceData, BondsLevel1_15_49F0F1B94DA188B86DE855A8213743E8) == 0x000000, "Member 'FFSasCutInVoiceData::BondsLevel1_15_49F0F1B94DA188B86DE855A8213743E8' has a wrong offset!");
static_assert(offsetof(FFSasCutInVoiceData, BondsLevel2_16_A0EB98434E8FB9F462A8989D05C9BA5B) == 0x000010, "Member 'FFSasCutInVoiceData::BondsLevel2_16_A0EB98434E8FB9F462A8989D05C9BA5B' has a wrong offset!");
static_assert(offsetof(FFSasCutInVoiceData, BondsLevel3_18_6FF8ECA34A6267B3E60532BCAE381A6D) == 0x000020, "Member 'FFSasCutInVoiceData::BondsLevel3_18_6FF8ECA34A6267B3E60532BCAE381A6D' has a wrong offset!");

}

