#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FSASCommandInternal

#include "Basic.hpp"

#include "FSASCommand_structs.hpp"


namespace SDK
{

// UserDefinedStruct FSASCommandInternal.FSASCommandInternal
// 0x0038 (0x0038 - 0x0000)
struct FFSASCommandInternal final
{
public:
	struct FFSASCommand                           Command_2_095A0F0F4652C1EBF6CACBBDE36B5E25;        // 0x0000(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CutinStarted_10_3F88B7AE4F2DC70080056AB2477D15BC;  // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          SkillStarted_9_CBC034504AA7781AEB810A9A68882046;   // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FFSASCommandInternal) == 0x000008, "Wrong alignment on FFSASCommandInternal");
static_assert(sizeof(FFSASCommandInternal) == 0x000038, "Wrong size on FFSASCommandInternal");
static_assert(offsetof(FFSASCommandInternal, Command_2_095A0F0F4652C1EBF6CACBBDE36B5E25) == 0x000000, "Member 'FFSASCommandInternal::Command_2_095A0F0F4652C1EBF6CACBBDE36B5E25' has a wrong offset!");
static_assert(offsetof(FFSASCommandInternal, CutinStarted_10_3F88B7AE4F2DC70080056AB2477D15BC) == 0x000030, "Member 'FFSASCommandInternal::CutinStarted_10_3F88B7AE4F2DC70080056AB2477D15BC' has a wrong offset!");
static_assert(offsetof(FFSASCommandInternal, SkillStarted_9_CBC034504AA7781AEB810A9A68882046) == 0x000031, "Member 'FFSASCommandInternal::SkillStarted_9_CBC034504AA7781AEB810A9A68882046' has a wrong offset!");

}

