#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FSasCutInSeVar

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FSasCutInSeVar.FSasCutInSeVar
// 0x0168 (0x0168 - 0x0000)
struct FFSasCutInSeVar final
{
public:
	TSoftObjectPtr<class USoundAtomCue>           Fire_23_A4C6C73F4C3710C12EE667A820ECAAD3;          // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundAtomCue>           Metal_24_F1931E6847A772C6FA9310BECDED3CE1;         // 0x0028(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundAtomCue>           SeeThrough_25_9E0B9D9B407EEB78698B30AC0F39AFCF;    // 0x0050(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundAtomCue>           Telepo_26_A14B14664D9101772CBF3FAE67C1F3DE;        // 0x0078(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundAtomCue>           Stealth_27_564E79AA4CF5A738D38D6789B9F7096E;       // 0x00A0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundAtomCue>           Electric_28_AEF19F5646DDF8718D0020BCA6519F5C;      // 0x00C8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundAtomCue>           Copy_29_3D48806F46F78D2E0626258A418899D9;          // 0x00F0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundAtomCue>           Accelerator_30_4A89DE6A47CA52B8952E2687050C7A8F;   // 0x0118(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundAtomCue>           Psychic_31_A9A5995F477347F59DEFA58A24862558;       // 0x0140(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FFSasCutInSeVar) == 0x000008, "Wrong alignment on FFSasCutInSeVar");
static_assert(sizeof(FFSasCutInSeVar) == 0x000168, "Wrong size on FFSasCutInSeVar");
static_assert(offsetof(FFSasCutInSeVar, Fire_23_A4C6C73F4C3710C12EE667A820ECAAD3) == 0x000000, "Member 'FFSasCutInSeVar::Fire_23_A4C6C73F4C3710C12EE667A820ECAAD3' has a wrong offset!");
static_assert(offsetof(FFSasCutInSeVar, Metal_24_F1931E6847A772C6FA9310BECDED3CE1) == 0x000028, "Member 'FFSasCutInSeVar::Metal_24_F1931E6847A772C6FA9310BECDED3CE1' has a wrong offset!");
static_assert(offsetof(FFSasCutInSeVar, SeeThrough_25_9E0B9D9B407EEB78698B30AC0F39AFCF) == 0x000050, "Member 'FFSasCutInSeVar::SeeThrough_25_9E0B9D9B407EEB78698B30AC0F39AFCF' has a wrong offset!");
static_assert(offsetof(FFSasCutInSeVar, Telepo_26_A14B14664D9101772CBF3FAE67C1F3DE) == 0x000078, "Member 'FFSasCutInSeVar::Telepo_26_A14B14664D9101772CBF3FAE67C1F3DE' has a wrong offset!");
static_assert(offsetof(FFSasCutInSeVar, Stealth_27_564E79AA4CF5A738D38D6789B9F7096E) == 0x0000A0, "Member 'FFSasCutInSeVar::Stealth_27_564E79AA4CF5A738D38D6789B9F7096E' has a wrong offset!");
static_assert(offsetof(FFSasCutInSeVar, Electric_28_AEF19F5646DDF8718D0020BCA6519F5C) == 0x0000C8, "Member 'FFSasCutInSeVar::Electric_28_AEF19F5646DDF8718D0020BCA6519F5C' has a wrong offset!");
static_assert(offsetof(FFSasCutInSeVar, Copy_29_3D48806F46F78D2E0626258A418899D9) == 0x0000F0, "Member 'FFSasCutInSeVar::Copy_29_3D48806F46F78D2E0626258A418899D9' has a wrong offset!");
static_assert(offsetof(FFSasCutInSeVar, Accelerator_30_4A89DE6A47CA52B8952E2687050C7A8F) == 0x000118, "Member 'FFSasCutInSeVar::Accelerator_30_4A89DE6A47CA52B8952E2687050C7A8F' has a wrong offset!");
static_assert(offsetof(FFSasCutInSeVar, Psychic_31_A9A5995F477347F59DEFA58A24862558) == 0x000140, "Member 'FFSasCutInSeVar::Psychic_31_A9A5995F477347F59DEFA58A24862558' has a wrong offset!");

}

