#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FScenarioFlagCheckData

#include "Basic.hpp"

#include "EBoolCheckType_structs.hpp"


namespace SDK
{

// UserDefinedStruct FScenarioFlagCheckData.FScenarioFlagCheckData
// 0x0010 (0x0010 - 0x0000)
struct FFScenarioFlagCheckData final
{
public:
	EBoolCheckType                                BoolCheckType_2_8F41036B4474DE88A88B1595F00EE984;  // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4180[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ScenarioFlagName_7_829737EF4583D4F732AC0F8F2BFF24E0; // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckFlagBool_8_55F547954179D19A3A8518AAB366037E;  // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FFScenarioFlagCheckData) == 0x000004, "Wrong alignment on FFScenarioFlagCheckData");
static_assert(sizeof(FFScenarioFlagCheckData) == 0x000010, "Wrong size on FFScenarioFlagCheckData");
static_assert(offsetof(FFScenarioFlagCheckData, BoolCheckType_2_8F41036B4474DE88A88B1595F00EE984) == 0x000000, "Member 'FFScenarioFlagCheckData::BoolCheckType_2_8F41036B4474DE88A88B1595F00EE984' has a wrong offset!");
static_assert(offsetof(FFScenarioFlagCheckData, ScenarioFlagName_7_829737EF4583D4F732AC0F8F2BFF24E0) == 0x000004, "Member 'FFScenarioFlagCheckData::ScenarioFlagName_7_829737EF4583D4F732AC0F8F2BFF24E0' has a wrong offset!");
static_assert(offsetof(FFScenarioFlagCheckData, CheckFlagBool_8_55F547954179D19A3A8518AAB366037E) == 0x00000C, "Member 'FFScenarioFlagCheckData::CheckFlagBool_8_55F547954179D19A3A8518AAB366037E' has a wrong offset!");

}

