#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUDMainOutGame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HUDMainOutGame.HUDMainOutGame_C
// 0x0030 (0x0818 - 0x07E8)
class AHUDMainOutGame_C final : public ARSHUDBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_Caption_1_C*                     Caption;                                           // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RestoreRadialBlur;                                 // 0x0800(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESoundState                                   StoreSoundState;                                   // 0x0804(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E90[0x3];                                     // 0x0805(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_Caption_Guide_1_C*               CaptionGuide;                                      // 0x0808(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_Loading_1_C*                     LoadingWidget;                                     // 0x0810(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HUDMainOutGame(int32 EntryPoint);
	void StartPhotoModeUI();
	void ReceiveBeginPlay();
	void InitMessageWidget();
	int32 DrawMessage(const class FString& Talker, const class FString& Message, int32 WindowType, float DrawSecond, bool IsEnableSkip, class URSAtomComponentBase* Voice, bool IsSkipVoiceEnd, bool IsWaitMode);
	int32 DrawChoiceMessage(int32 ChoiceNum, const class FString& Choice0, const class FString& Choice1, const class FString& Choice2, const class FString& Choice3, const class FString& Choice4, int32 DefaultIndex, int32 CancelIndex, float DrawSecond, bool IsEnableCancel, bool IsWaitMode);
	bool SkipMessage();
	void GetChoiceResult(int32 MessageIndex, int32* Result);
	void GetLastChoiceResult(int32* Result);
	void CheckEndMessage(int32 MessageIndex, bool* IsEnd);
	void CheckEndAllMessage(bool* IsEnd, bool FlagCheckClose);
	bool Init();
	class URSAtomComponentBase* GetMessageVoice();
	void SetSkipAllMessage(bool IsSkip);
	bool IsValidMessageVoiceToMessageBuffer();
	bool StartPhotoMode();
	bool EndPhotoMode();
	bool IsEnableOpenPhotoMode();
	bool CanPlayCutScene_FromNative(const bool IsTipsCheck);
	bool CloseMessageGuide();
	bool StartMessageGuide(bool FlagSkip, bool FlagPhotoMode);
	bool StartLoading(bool IsFadeWhite);
	bool EndLoading();

	bool IsDrawMessageGuide() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HUDMainOutGame_C">();
	}
	static class AHUDMainOutGame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHUDMainOutGame_C>();
	}
};
static_assert(alignof(AHUDMainOutGame_C) == 0x000008, "Wrong alignment on AHUDMainOutGame_C");
static_assert(sizeof(AHUDMainOutGame_C) == 0x000818, "Wrong size on AHUDMainOutGame_C");
static_assert(offsetof(AHUDMainOutGame_C, UberGraphFrame) == 0x0007E8, "Member 'AHUDMainOutGame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AHUDMainOutGame_C, DefaultSceneRoot) == 0x0007F0, "Member 'AHUDMainOutGame_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AHUDMainOutGame_C, Caption) == 0x0007F8, "Member 'AHUDMainOutGame_C::Caption' has a wrong offset!");
static_assert(offsetof(AHUDMainOutGame_C, RestoreRadialBlur) == 0x000800, "Member 'AHUDMainOutGame_C::RestoreRadialBlur' has a wrong offset!");
static_assert(offsetof(AHUDMainOutGame_C, StoreSoundState) == 0x000804, "Member 'AHUDMainOutGame_C::StoreSoundState' has a wrong offset!");
static_assert(offsetof(AHUDMainOutGame_C, CaptionGuide) == 0x000808, "Member 'AHUDMainOutGame_C::CaptionGuide' has a wrong offset!");
static_assert(offsetof(AHUDMainOutGame_C, LoadingWidget) == 0x000810, "Member 'AHUDMainOutGame_C::LoadingWidget' has a wrong offset!");

}

