#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUDMainGame

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_ui_pk_weight_gauge_button_structs.hpp"
#include "UMG_structs.hpp"
#include "Enum_ui_object_guide_structs.hpp"
#include "Enum_ui_action_icon_device_type_structs.hpp"
#include "Enum_ui_pk_weight_gauge_size_structs.hpp"
#include "Engine_structs.hpp"
#include "PsychicGrabButtonType_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function HUDMainGame.HUDMainGame_C.BattleDamage2D__DelegateSignature
// 0x0014 (0x0014 - 0x0000)
struct HUDMainGame_C_BattleDamage2D__DelegateSignature final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Position2D;                                        // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlayer;                                          // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsCritical;                                        // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsSasCritical;                                     // 0x000E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsBrainCrashCritical;                              // 0x000F(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsHeal;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsWeak;                                            // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsNoDamage;                                        // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUDMainGame_C_BattleDamage2D__DelegateSignature) == 0x000004, "Wrong alignment on HUDMainGame_C_BattleDamage2D__DelegateSignature");
static_assert(sizeof(HUDMainGame_C_BattleDamage2D__DelegateSignature) == 0x000014, "Wrong size on HUDMainGame_C_BattleDamage2D__DelegateSignature");
static_assert(offsetof(HUDMainGame_C_BattleDamage2D__DelegateSignature, Damage) == 0x000000, "Member 'HUDMainGame_C_BattleDamage2D__DelegateSignature::Damage' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_BattleDamage2D__DelegateSignature, Position2D) == 0x000004, "Member 'HUDMainGame_C_BattleDamage2D__DelegateSignature::Position2D' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_BattleDamage2D__DelegateSignature, IsPlayer) == 0x00000C, "Member 'HUDMainGame_C_BattleDamage2D__DelegateSignature::IsPlayer' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_BattleDamage2D__DelegateSignature, IsCritical) == 0x00000D, "Member 'HUDMainGame_C_BattleDamage2D__DelegateSignature::IsCritical' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_BattleDamage2D__DelegateSignature, IsSasCritical) == 0x00000E, "Member 'HUDMainGame_C_BattleDamage2D__DelegateSignature::IsSasCritical' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_BattleDamage2D__DelegateSignature, IsBrainCrashCritical) == 0x00000F, "Member 'HUDMainGame_C_BattleDamage2D__DelegateSignature::IsBrainCrashCritical' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_BattleDamage2D__DelegateSignature, IsHeal) == 0x000010, "Member 'HUDMainGame_C_BattleDamage2D__DelegateSignature::IsHeal' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_BattleDamage2D__DelegateSignature, IsWeak) == 0x000011, "Member 'HUDMainGame_C_BattleDamage2D__DelegateSignature::IsWeak' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_BattleDamage2D__DelegateSignature, IsNoDamage) == 0x000012, "Member 'HUDMainGame_C_BattleDamage2D__DelegateSignature::IsNoDamage' has a wrong offset!");

// Function HUDMainGame.HUDMainGame_C.BattleDamage3D__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct HUDMainGame_C_BattleDamage3D__DelegateSignature final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Position3D;                                        // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlayer;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsCritical;                                        // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsSasCritical;                                     // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsBrainCrashCritical;                              // 0x0013(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsHeal;                                            // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsWeak;                                            // 0x0015(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsNoDamage;                                        // 0x0016(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_656A[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattleCharacter_C*                   CrushTarget;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CrushBonus;                                        // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Offset;                                            // 0x0024(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDMainGame_C_BattleDamage3D__DelegateSignature) == 0x000008, "Wrong alignment on HUDMainGame_C_BattleDamage3D__DelegateSignature");
static_assert(sizeof(HUDMainGame_C_BattleDamage3D__DelegateSignature) == 0x000030, "Wrong size on HUDMainGame_C_BattleDamage3D__DelegateSignature");
static_assert(offsetof(HUDMainGame_C_BattleDamage3D__DelegateSignature, Damage) == 0x000000, "Member 'HUDMainGame_C_BattleDamage3D__DelegateSignature::Damage' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_BattleDamage3D__DelegateSignature, Position3D) == 0x000004, "Member 'HUDMainGame_C_BattleDamage3D__DelegateSignature::Position3D' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_BattleDamage3D__DelegateSignature, IsPlayer) == 0x000010, "Member 'HUDMainGame_C_BattleDamage3D__DelegateSignature::IsPlayer' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_BattleDamage3D__DelegateSignature, IsCritical) == 0x000011, "Member 'HUDMainGame_C_BattleDamage3D__DelegateSignature::IsCritical' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_BattleDamage3D__DelegateSignature, IsSasCritical) == 0x000012, "Member 'HUDMainGame_C_BattleDamage3D__DelegateSignature::IsSasCritical' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_BattleDamage3D__DelegateSignature, IsBrainCrashCritical) == 0x000013, "Member 'HUDMainGame_C_BattleDamage3D__DelegateSignature::IsBrainCrashCritical' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_BattleDamage3D__DelegateSignature, IsHeal) == 0x000014, "Member 'HUDMainGame_C_BattleDamage3D__DelegateSignature::IsHeal' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_BattleDamage3D__DelegateSignature, IsWeak) == 0x000015, "Member 'HUDMainGame_C_BattleDamage3D__DelegateSignature::IsWeak' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_BattleDamage3D__DelegateSignature, IsNoDamage) == 0x000016, "Member 'HUDMainGame_C_BattleDamage3D__DelegateSignature::IsNoDamage' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_BattleDamage3D__DelegateSignature, CrushTarget) == 0x000018, "Member 'HUDMainGame_C_BattleDamage3D__DelegateSignature::CrushTarget' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_BattleDamage3D__DelegateSignature, CrushBonus) == 0x000020, "Member 'HUDMainGame_C_BattleDamage3D__DelegateSignature::CrushBonus' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_BattleDamage3D__DelegateSignature, Offset) == 0x000024, "Member 'HUDMainGame_C_BattleDamage3D__DelegateSignature::Offset' has a wrong offset!");

// Function HUDMainGame.HUDMainGame_C.ExecuteUbergraph_HUDMainGame
// 0x03A0 (0x03A0 - 0x0000)
struct HUDMainGame_C_ExecuteUbergraph_HUDMainGame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_656B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_EndCredits_C*                    CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StopAutoSaveIcon_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_656C[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameMainManager_C*                  CallFunc_GetGameMainManager_GameMainManager;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoSaveDataCapture_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_656D[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_CustomEvent_Key_5;                          // 0x0028(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_2;          // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_656E[0x5];                                     // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_CustomEvent_Key_4;                          // 0x0048(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_3;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_4;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_5;          // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_6;          // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_7;          // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_8;          // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_9;          // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_10;         // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_11;         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_12;         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_13;         // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_14;         // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_15;         // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_16;         // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_17;         // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_18;         // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_19;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_20;         // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_21;         // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_22;         // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_23;         // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_24;         // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_25;         // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_26;         // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_27;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_28;         // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_29;         // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_30;         // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_31;         // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_32;         // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_33;         // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_34;         // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_35;         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_36;         // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_37;         // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_656F[0x1];                                     // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6570[0x1];                                     // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_DrawMessage_ReturnValue;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6571[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6572[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartTownName_ReturnValue;                // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartCharaName_ReturnValue;               // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartCharaName_ReturnValue_1;             // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6573[0x1];                                     // 0x00A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_DrawChoiceMessage_ReturnValue;            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartAutoSaveIcon_ReturnValue;            // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SkipMessage_ReturnValue;                  // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6574[0x1];                                     // 0x00AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUi_menu_battle_control_C*              K2Node_DynamicCast_AsUi_Menu_Battle_Control;       // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6575[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_DrawMessage_ReturnValue_1;                // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6576[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Damage, const struct FVector2D& Position2D, bool IsPlayer, bool IsCritical, bool IsSasCritical, bool IsBrainCrashCritical, bool IsHeal, bool IsWeak, bool IsNoDamage)> K2Node_CreateDelegate_OutputDelegate;              // 0x00CC(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_getDebugKeyboard_ReturnValue;             // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_getDebugKeyboard_ReturnValue_1;           // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_isPlayBrainTuto_ReturnValue;              // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayDecideAnimeBrainTuto_ReturnValue;     // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OpenBrainTuto_ReturnValue;                // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEndStaffRoll_ReturnValue;               // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChangePlayUI_ReturnValue;                 // 0x00E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x00E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 Damage, const struct FVector& Position3D, bool IsPlayer, bool IsCritical, bool IsSasCritical, bool IsBrainCrashCritical, bool IsHeal, bool IsWeak, bool IsNoDamage, class ARSBattleCharacter_C* CrushTarget, int32 CrushBonus, const struct FVector2D& Offset)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue; // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue_1; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SkipMessage_ReturnValue_1;                // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetLogBrainFieldAddTime_ReturnValue;      // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartCode_ReturnValue;                    // 0x0126(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_startVisionSimulatorResult_ReturnValue;   // 0x0127(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EndLoading_ReturnValue;                   // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartLoading_ReturnValue;                 // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6577[0x2];                                     // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_target_1;                       // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CurrentHP;                      // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_BaseHP;                         // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsAlways;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6578[0x3];                                     // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Time;                           // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      K2Node_CustomEvent_Player_1;                       // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_index;                          // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6579[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattleCharacter_C*                   K2Node_DynamicCast_AsRSBattle_Character;           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_657A[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattleCharacter_C*                   K2Node_CustomEvent_Boss;                           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleCharacterInterface_C> CallFunc_IsEnemy_self_CastInput;                   // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemy_bEnemy;                           // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBossHpDisp_IsDisp;                      // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_657B[0x1];                                     // 0x0183(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_SizeX;                                // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SizeY;                                // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_visibleflag;                          // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_657C[0x2];                                     // 0x018E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUi_menu_battle_control_C*              K2Node_DynamicCast_AsUi_Menu_Battle_Control_1;     // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_657D[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUi_menu_battle_control_C*              K2Node_DynamicCast_AsUi_Menu_Battle_Control_2;     // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_657E[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_target;                         // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Bonus;                          // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_657F[0x4];                                     // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattleCharacter_C*                   K2Node_DynamicCast_AsRSBattle_Character_1;         // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetCrushBonus_ReturnValue;                // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsExecuteBrainTalkWidget_IsExecute;       // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6580[0x1];                                     // 0x01CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DelaySecond;                    // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6581[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_InputManager_C*                     CallFunc_GetInputManager_BP_InputManager;          // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6582[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGamepadLayout*                       CallFunc_GetGamepadLayout_ReturnValue;             // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSGamepadLayout*                       CallFunc_GetGamepadLayout_ReturnValue_1;           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERSGamepadLayoutType                          K2Node_CustomEvent_layout_3;                       // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERSGamepadInputName                           K2Node_CustomEvent_Key_3;                          // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERSGamepadLayoutType                          K2Node_CustomEvent_layout_2;                       // 0x021A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERSGamepadInputName                           K2Node_CustomEvent_Key_2;                          // 0x021B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERSGamepadLayoutType                          K2Node_CustomEvent_layout_1;                       // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERSGamepadInputName                           K2Node_CustomEvent_Key_1;                          // 0x021D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6583[0x2];                                     // 0x021E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FKey& KeyName)>   K2Node_CreateDelegate_OutputDelegate_4;            // 0x0220(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FKey& KeyName)>   K2Node_CreateDelegate_OutputDelegate_5;            // 0x0230(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6584[0x3];                                     // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0248(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Damage_1;                       // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_Position2D;                     // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsPlayer_1;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsCritical_1;                   // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsSasCritical_1;                // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsBrainCrashCritical_1;         // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsHeal_1;                       // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsWeak_1;                       // 0x029D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsNoDamage_1;                   // 0x029E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6585[0x1];                                     // 0x029F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Damage;                         // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Position3D;                     // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsPlayer;                       // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsCritical;                     // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsSasCritical;                  // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsBrainCrashCritical;           // 0x02B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsHeal;                         // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsWeak;                         // 0x02B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsNoDamage;                     // 0x02B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6586[0x1];                                     // 0x02B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattleCharacter_C*                   K2Node_CustomEvent_CrushTarget;                    // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CrushBonus;                     // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_Offset;                         // 0x02C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_PhotoMode_C*                     CallFunc_Create_ReturnValue_1;                     // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_MissionStartEnd_C*               CallFunc_Create_ReturnValue_2;                     // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_MissionStartEnd_C*               CallFunc_Create_ReturnValue_3;                     // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6587[0x6];                                     // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_InputManager_C*                     CallFunc_GetInputManager_BP_InputManager_1;        // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetOnPress_ReturnValue;                   // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6588[0x3];                                     // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERSGamepadLayoutType                          K2Node_CustomEvent_layout;                         // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERSGamepadInputName                           K2Node_CustomEvent_Key;                            // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6589[0x2];                                     // 0x0302(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_characterID;                          // 0x0304(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_ExpressionID;                         // 0x0308(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_658A[0x4];                                     // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_MessageID;                            // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DrawSecond;                           // 0x0320(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_658B[0x3];                                     // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARsBattleHero_C*                        K2Node_CustomEvent_Player;                         // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldNormalDeltaSeconds_ReturnValue;   // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ChangeTown_ReturnValue;                   // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_658C[0x3];                                     // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_Name_1;                               // 0x0338(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_CurrentCustomTimeDilation;            // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_658D[0x4];                                     // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_Name;                                 // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_GameSystemManager_C*                CallFunc_GetGameSystemManager_Manager;             // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_MissionSimulator_C*              CallFunc_Create_ReturnValue_4;                     // 0x0368(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_658E[0x7];                                     // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameSystemManager_C*                CallFunc_GetGameSystemManager_Manager_1;           // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveGlobalCustomTimeDilation_Success;   // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_658F[0x2];                                     // 0x0382(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetGlobalCustomTimeDilation_CurrentCustomTimeDilation; // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isPause;                              // 0x0388(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue;              // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x038A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6590[0x1];                                     // 0x038B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x038C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame) == 0x000008, "Wrong alignment on HUDMainGame_C_ExecuteUbergraph_HUDMainGame");
static_assert(sizeof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame) == 0x0003A0, "Wrong size on HUDMainGame_C_ExecuteUbergraph_HUDMainGame");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, EntryPoint) == 0x000000, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::EntryPoint' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_Create_ReturnValue) == 0x000008, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_StopAutoSaveIcon_ReturnValue) == 0x000010, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_StopAutoSaveIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_GetGameMainManager_GameMainManager) == 0x000018, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_GetGameMainManager_GameMainManager' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_DoSaveDataCapture_ReturnValue) == 0x000020, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_DoSaveDataCapture_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, K2Node_CustomEvent_Key_5) == 0x000028, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::K2Node_CustomEvent_Key_5' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000040, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000041, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_2) == 0x000042, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, K2Node_CustomEvent_Key_4) == 0x000048, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::K2Node_CustomEvent_Key_4' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_3) == 0x000060, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_4) == 0x000061, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_5) == 0x000062, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_6) == 0x000063, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_7) == 0x000064, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_8) == 0x000065, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_9) == 0x000066, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_10) == 0x000067, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_11) == 0x000068, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_12) == 0x000069, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_13) == 0x00006A, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_14) == 0x00006B, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_15) == 0x00006C, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_16) == 0x00006D, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_17) == 0x00006E, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_18) == 0x00006F, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_19) == 0x000070, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_20) == 0x000071, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_21) == 0x000072, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_22) == 0x000073, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_23) == 0x000074, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_24) == 0x000075, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_25) == 0x000076, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_26) == 0x000077, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_27) == 0x000078, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_27' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_28) == 0x000079, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_28' has a wrong offset!");
static_assert(offsetof(HUDMainGame_C_ExecuteUbergraph_HUDMainGame, CallFunc_EqualEqual_KeyKey_ReturnValue_29) == 0x00007A, "Member 'HUDMainGame_C_ExecuteUbergraph_HUDMainGame::CallFunc_EqualEqual_KeyKey_ReturnValue_29' has a wrong offset!");
