#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LV_OutGameStart

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LV_OutGameStart.LV_OutGameStart_C
// 0x0018 (0x0250 - 0x0238)
class ALV_OutGameStart_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWB_ui_TitleLogo_C*                     TitleLogo;                                         // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIGamerTag*                            GamerTag;                                          // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LV_OutGameStart(int32 EntryPoint);
	void OnClick(const struct FRedMouseArgument& Argument, class UUserWidget* PWidget);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LV_OutGameStart_C">();
	}
	static class ALV_OutGameStart_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALV_OutGameStart_C>();
	}
};
static_assert(alignof(ALV_OutGameStart_C) == 0x000008, "Wrong alignment on ALV_OutGameStart_C");
static_assert(sizeof(ALV_OutGameStart_C) == 0x000250, "Wrong size on ALV_OutGameStart_C");
static_assert(offsetof(ALV_OutGameStart_C, UberGraphFrame) == 0x000238, "Member 'ALV_OutGameStart_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALV_OutGameStart_C, TitleLogo) == 0x000240, "Member 'ALV_OutGameStart_C::TitleLogo' has a wrong offset!");
static_assert(offsetof(ALV_OutGameStart_C, GamerTag) == 0x000248, "Member 'ALV_OutGameStart_C::GamerTag' has a wrong offset!");

}

