#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LV_OutGameStart

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function LV_OutGameStart.LV_OutGameStart_C.ExecuteUbergraph_LV_OutGameStart
// 0x0070 (0x0070 - 0x0000)
struct LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EAD[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAccountManager*                      CallFunc_GetRSAccountManager_RSAcountManager;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestFirstSignIn_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EAE[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_IsPlaying;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EAF[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSHUDBase*                             K2Node_DynamicCast_AsRSHUDBase;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EB0[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_InputManager_C*                     CallFunc_GetInputManager_BP_InputManager;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRedMouseArgument                      K2Node_CustomEvent_argument;                       // 0x0048(0x000C)(NoDestructor)
	uint8                                         Pad_3EB1[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_pWidget;                        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FRedMouseArgument& Argument, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart) == 0x000008, "Wrong alignment on LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart");
static_assert(sizeof(LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart) == 0x000070, "Wrong size on LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart");
static_assert(offsetof(LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart, EntryPoint) == 0x000000, "Member 'LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart::EntryPoint' has a wrong offset!");
static_assert(offsetof(LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart, CallFunc_GetRSAccountManager_RSAcountManager) == 0x000008, "Member 'LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart::CallFunc_GetRSAccountManager_RSAcountManager' has a wrong offset!");
static_assert(offsetof(LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart, CallFunc_RequestFirstSignIn_ReturnValue) == 0x000010, "Member 'LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart::CallFunc_RequestFirstSignIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart, CallFunc_IsPlaying_IsPlaying) == 0x000018, "Member 'LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart::CallFunc_IsPlaying_IsPlaying' has a wrong offset!");
static_assert(offsetof(LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart, CallFunc_GetHUD_ReturnValue) == 0x000028, "Member 'LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart, K2Node_DynamicCast_AsRSHUDBase) == 0x000030, "Member 'LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart::K2Node_DynamicCast_AsRSHUDBase' has a wrong offset!");
static_assert(offsetof(LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart, CallFunc_GetInputManager_BP_InputManager) == 0x000040, "Member 'LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart::CallFunc_GetInputManager_BP_InputManager' has a wrong offset!");
static_assert(offsetof(LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart, K2Node_CustomEvent_argument) == 0x000048, "Member 'LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart::K2Node_CustomEvent_argument' has a wrong offset!");
static_assert(offsetof(LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart, K2Node_CustomEvent_pWidget) == 0x000058, "Member 'LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart::K2Node_CustomEvent_pWidget' has a wrong offset!");
static_assert(offsetof(LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'LV_OutGameStart_C_ExecuteUbergraph_LV_OutGameStart::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function LV_OutGameStart.LV_OutGameStart_C.OnClick
// 0x0018 (0x0018 - 0x0000)
struct LV_OutGameStart_C_OnClick final
{
public:
	struct FRedMouseArgument                      Argument;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	uint8                                         Pad_3EB2[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            PWidget;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LV_OutGameStart_C_OnClick) == 0x000008, "Wrong alignment on LV_OutGameStart_C_OnClick");
static_assert(sizeof(LV_OutGameStart_C_OnClick) == 0x000018, "Wrong size on LV_OutGameStart_C_OnClick");
static_assert(offsetof(LV_OutGameStart_C_OnClick, Argument) == 0x000000, "Member 'LV_OutGameStart_C_OnClick::Argument' has a wrong offset!");
static_assert(offsetof(LV_OutGameStart_C_OnClick, PWidget) == 0x000010, "Member 'LV_OutGameStart_C_OnClick::PWidget' has a wrong offset!");

// Function LV_OutGameStart.LV_OutGameStart_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct LV_OutGameStart_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LV_OutGameStart_C_ReceiveTick) == 0x000004, "Wrong alignment on LV_OutGameStart_C_ReceiveTick");
static_assert(sizeof(LV_OutGameStart_C_ReceiveTick) == 0x000004, "Wrong size on LV_OutGameStart_C_ReceiveTick");
static_assert(offsetof(LV_OutGameStart_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'LV_OutGameStart_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

