#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshModelingTools

#include "Basic.hpp"

#include "InteractiveToolsFramework_classes.hpp"
#include "MeshModelingTools_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ModelingOperators_structs.hpp"


namespace SDK
{

// Class MeshModelingTools.AddPrimitiveTool
// 0x0058 (0x00E0 - 0x0088)
class UAddPrimitiveTool final : public USingleClickTool
{
public:
	uint8                                         Pad_1374[0x8];                                     // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UProceduralShapeToolProperties*         ShapeSettings;                                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNewMeshMaterialProperties*             MaterialProperties;                                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPreviewMesh*                           PreviewMesh;                                       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULastActorInfo*                         LastGenerated;                                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1375[0x30];                                    // 0x00B0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddPrimitiveTool">();
	}
	static class UAddPrimitiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddPrimitiveTool>();
	}
};
static_assert(alignof(UAddPrimitiveTool) == 0x000008, "Wrong alignment on UAddPrimitiveTool");
static_assert(sizeof(UAddPrimitiveTool) == 0x0000E0, "Wrong size on UAddPrimitiveTool");
static_assert(offsetof(UAddPrimitiveTool, ShapeSettings) == 0x000090, "Member 'UAddPrimitiveTool::ShapeSettings' has a wrong offset!");
static_assert(offsetof(UAddPrimitiveTool, MaterialProperties) == 0x000098, "Member 'UAddPrimitiveTool::MaterialProperties' has a wrong offset!");
static_assert(offsetof(UAddPrimitiveTool, PreviewMesh) == 0x0000A0, "Member 'UAddPrimitiveTool::PreviewMesh' has a wrong offset!");
static_assert(offsetof(UAddPrimitiveTool, LastGenerated) == 0x0000A8, "Member 'UAddPrimitiveTool::LastGenerated' has a wrong offset!");

// Class MeshModelingTools.EditNormalsToolProperties
// 0x0010 (0x0060 - 0x0050)
class UEditNormalsToolProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bRecomputeNormals;                                 // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENormalCalculationMethod                      NormalCalculationMethod;                           // 0x0051(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFixInconsistentNormals;                           // 0x0052(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInvertNormals;                                    // 0x0053(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESplitNormalMethod                            SplitNormalMethod;                                 // 0x0054(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1376[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SharpEdgeAngleThreshold;                           // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowSharpVertices;                               // 0x005C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1377[0x3];                                     // 0x005D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditNormalsToolProperties">();
	}
	static class UEditNormalsToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditNormalsToolProperties>();
	}
};
static_assert(alignof(UEditNormalsToolProperties) == 0x000008, "Wrong alignment on UEditNormalsToolProperties");
static_assert(sizeof(UEditNormalsToolProperties) == 0x000060, "Wrong size on UEditNormalsToolProperties");
static_assert(offsetof(UEditNormalsToolProperties, bRecomputeNormals) == 0x000050, "Member 'UEditNormalsToolProperties::bRecomputeNormals' has a wrong offset!");
static_assert(offsetof(UEditNormalsToolProperties, NormalCalculationMethod) == 0x000051, "Member 'UEditNormalsToolProperties::NormalCalculationMethod' has a wrong offset!");
static_assert(offsetof(UEditNormalsToolProperties, bFixInconsistentNormals) == 0x000052, "Member 'UEditNormalsToolProperties::bFixInconsistentNormals' has a wrong offset!");
static_assert(offsetof(UEditNormalsToolProperties, bInvertNormals) == 0x000053, "Member 'UEditNormalsToolProperties::bInvertNormals' has a wrong offset!");
static_assert(offsetof(UEditNormalsToolProperties, SplitNormalMethod) == 0x000054, "Member 'UEditNormalsToolProperties::SplitNormalMethod' has a wrong offset!");
static_assert(offsetof(UEditNormalsToolProperties, SharpEdgeAngleThreshold) == 0x000058, "Member 'UEditNormalsToolProperties::SharpEdgeAngleThreshold' has a wrong offset!");
static_assert(offsetof(UEditNormalsToolProperties, bAllowSharpVertices) == 0x00005C, "Member 'UEditNormalsToolProperties::bAllowSharpVertices' has a wrong offset!");

// Class MeshModelingTools.AddPatchToolBuilder
// 0x0008 (0x0030 - 0x0028)
class UAddPatchToolBuilder final : public UInteractiveToolBuilder
{
public:
	uint8                                         Pad_1378[0x8];                                     // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddPatchToolBuilder">();
	}
	static class UAddPatchToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddPatchToolBuilder>();
	}
};
static_assert(alignof(UAddPatchToolBuilder) == 0x000008, "Wrong alignment on UAddPatchToolBuilder");
static_assert(sizeof(UAddPatchToolBuilder) == 0x000030, "Wrong size on UAddPatchToolBuilder");

// Class MeshModelingTools.AlignObjectsToolBuilder
// 0x0000 (0x0028 - 0x0028)
class UAlignObjectsToolBuilder final : public UInteractiveToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AlignObjectsToolBuilder">();
	}
	static class UAlignObjectsToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlignObjectsToolBuilder>();
	}
};
static_assert(alignof(UAlignObjectsToolBuilder) == 0x000008, "Wrong alignment on UAlignObjectsToolBuilder");
static_assert(sizeof(UAlignObjectsToolBuilder) == 0x000028, "Wrong size on UAlignObjectsToolBuilder");

// Class MeshModelingTools.EditNormalsAdvancedProperties
// 0x0000 (0x0050 - 0x0050)
class UEditNormalsAdvancedProperties final : public UInteractiveToolPropertySet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditNormalsAdvancedProperties">();
	}
	static class UEditNormalsAdvancedProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditNormalsAdvancedProperties>();
	}
};
static_assert(alignof(UEditNormalsAdvancedProperties) == 0x000008, "Wrong alignment on UEditNormalsAdvancedProperties");
static_assert(sizeof(UEditNormalsAdvancedProperties) == 0x000050, "Wrong size on UEditNormalsAdvancedProperties");

// Class MeshModelingTools.UVProjectionAdvancedProperties
// 0x0000 (0x0050 - 0x0050)
class UUVProjectionAdvancedProperties final : public UInteractiveToolPropertySet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVProjectionAdvancedProperties">();
	}
	static class UUVProjectionAdvancedProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVProjectionAdvancedProperties>();
	}
};
static_assert(alignof(UUVProjectionAdvancedProperties) == 0x000008, "Wrong alignment on UUVProjectionAdvancedProperties");
static_assert(sizeof(UUVProjectionAdvancedProperties) == 0x000050, "Wrong size on UUVProjectionAdvancedProperties");

// Class MeshModelingTools.AddPatchToolProperties
// 0x0010 (0x0060 - 0x0050)
class UAddPatchToolProperties final : public UInteractiveToolPropertySet
{
public:
	float                                         Width;                                             // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Rotation;                                          // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Subdivisions;                                      // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Shift;                                             // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddPatchToolProperties">();
	}
	static class UAddPatchToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddPatchToolProperties>();
	}
};
static_assert(alignof(UAddPatchToolProperties) == 0x000008, "Wrong alignment on UAddPatchToolProperties");
static_assert(sizeof(UAddPatchToolProperties) == 0x000060, "Wrong size on UAddPatchToolProperties");
static_assert(offsetof(UAddPatchToolProperties, Width) == 0x000050, "Member 'UAddPatchToolProperties::Width' has a wrong offset!");
static_assert(offsetof(UAddPatchToolProperties, Rotation) == 0x000054, "Member 'UAddPatchToolProperties::Rotation' has a wrong offset!");
static_assert(offsetof(UAddPatchToolProperties, Subdivisions) == 0x000058, "Member 'UAddPatchToolProperties::Subdivisions' has a wrong offset!");
static_assert(offsetof(UAddPatchToolProperties, Shift) == 0x00005C, "Member 'UAddPatchToolProperties::Shift' has a wrong offset!");

// Class MeshModelingTools.EditPivotToolBuilder
// 0x0000 (0x0028 - 0x0028)
class UEditPivotToolBuilder final : public UInteractiveToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditPivotToolBuilder">();
	}
	static class UEditPivotToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditPivotToolBuilder>();
	}
};
static_assert(alignof(UEditPivotToolBuilder) == 0x000008, "Wrong alignment on UEditPivotToolBuilder");
static_assert(sizeof(UEditPivotToolBuilder) == 0x000028, "Wrong size on UEditPivotToolBuilder");

// Class MeshModelingTools.AddPatchTool
// 0x0078 (0x0100 - 0x0088)
class UAddPatchTool final : public USingleClickTool
{
public:
	uint8                                         Pad_1379[0x8];                                     // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAddPatchToolProperties*                ShapeSettings;                                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNewMeshMaterialProperties*             MaterialProperties;                                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPreviewMesh*                           PreviewMesh;                                       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_137A[0x58];                                    // 0x00A8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddPatchTool">();
	}
	static class UAddPatchTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddPatchTool>();
	}
};
static_assert(alignof(UAddPatchTool) == 0x000008, "Wrong alignment on UAddPatchTool");
static_assert(sizeof(UAddPatchTool) == 0x000100, "Wrong size on UAddPatchTool");
static_assert(offsetof(UAddPatchTool, ShapeSettings) == 0x000090, "Member 'UAddPatchTool::ShapeSettings' has a wrong offset!");
static_assert(offsetof(UAddPatchTool, MaterialProperties) == 0x000098, "Member 'UAddPatchTool::MaterialProperties' has a wrong offset!");
static_assert(offsetof(UAddPatchTool, PreviewMesh) == 0x0000A0, "Member 'UAddPatchTool::PreviewMesh' has a wrong offset!");

// Class MeshModelingTools.EditPivotToolProperties
// 0x0008 (0x0058 - 0x0050)
class UEditPivotToolProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bEnableSnapDragging;                               // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEditPivotSnapDragRotationMode                RotationMode;                                      // 0x0051(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_137B[0x6];                                     // 0x0052(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditPivotToolProperties">();
	}
	static class UEditPivotToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditPivotToolProperties>();
	}
};
static_assert(alignof(UEditPivotToolProperties) == 0x000008, "Wrong alignment on UEditPivotToolProperties");
static_assert(sizeof(UEditPivotToolProperties) == 0x000058, "Wrong size on UEditPivotToolProperties");
static_assert(offsetof(UEditPivotToolProperties, bEnableSnapDragging) == 0x000050, "Member 'UEditPivotToolProperties::bEnableSnapDragging' has a wrong offset!");
static_assert(offsetof(UEditPivotToolProperties, RotationMode) == 0x000051, "Member 'UEditPivotToolProperties::RotationMode' has a wrong offset!");

// Class MeshModelingTools.AddPrimitiveToolBuilder
// 0x0008 (0x0030 - 0x0028)
class UAddPrimitiveToolBuilder final : public UInteractiveToolBuilder
{
public:
	uint8                                         Pad_137C[0x8];                                     // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddPrimitiveToolBuilder">();
	}
	static class UAddPrimitiveToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddPrimitiveToolBuilder>();
	}
};
static_assert(alignof(UAddPrimitiveToolBuilder) == 0x000008, "Wrong alignment on UAddPrimitiveToolBuilder");
static_assert(sizeof(UAddPrimitiveToolBuilder) == 0x000030, "Wrong size on UAddPrimitiveToolBuilder");

// Class MeshModelingTools.EditPivotToolActionPropertySet
// 0x0010 (0x0060 - 0x0050)
class UEditPivotToolActionPropertySet final : public UInteractiveToolPropertySet
{
public:
	uint8                                         Pad_137D[0x8];                                     // 0x0050(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUseWorldBox;                                      // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_137E[0x7];                                     // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Back();
	void Bottom();
	void Center();
	void Front();
	void Left();
	void Right();
	void Top();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditPivotToolActionPropertySet">();
	}
	static class UEditPivotToolActionPropertySet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditPivotToolActionPropertySet>();
	}
};
static_assert(alignof(UEditPivotToolActionPropertySet) == 0x000008, "Wrong alignment on UEditPivotToolActionPropertySet");
static_assert(sizeof(UEditPivotToolActionPropertySet) == 0x000060, "Wrong size on UEditPivotToolActionPropertySet");
static_assert(offsetof(UEditPivotToolActionPropertySet, bUseWorldBox) == 0x000058, "Member 'UEditPivotToolActionPropertySet::bUseWorldBox' has a wrong offset!");

// Class MeshModelingTools.ProceduralShapeToolProperties
// 0x0028 (0x0078 - 0x0050)
class UProceduralShapeToolProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bInstanceIfPossible;                               // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_137F[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EMakeMeshShapeType                            Shape;                                             // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Width;                                             // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FeatureRadius;                                     // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Slices;                                            // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Subdivisions;                                      // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMakeMeshPolygroupMode                        PolygroupMode;                                     // 0x006C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMakeMeshPlacementType                        PlaceMode;                                         // 0x006D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMakeMeshPivotLocation                        PivotLocation;                                     // 0x006E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1380[0x1];                                     // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Rotation;                                          // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlignShapeToPlacementSurface;                     // 0x0074(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1381[0x3];                                     // 0x0075(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProceduralShapeToolProperties">();
	}
	static class UProceduralShapeToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralShapeToolProperties>();
	}
};
static_assert(alignof(UProceduralShapeToolProperties) == 0x000008, "Wrong alignment on UProceduralShapeToolProperties");
static_assert(sizeof(UProceduralShapeToolProperties) == 0x000078, "Wrong size on UProceduralShapeToolProperties");
static_assert(offsetof(UProceduralShapeToolProperties, bInstanceIfPossible) == 0x000050, "Member 'UProceduralShapeToolProperties::bInstanceIfPossible' has a wrong offset!");
static_assert(offsetof(UProceduralShapeToolProperties, Shape) == 0x000054, "Member 'UProceduralShapeToolProperties::Shape' has a wrong offset!");
static_assert(offsetof(UProceduralShapeToolProperties, Width) == 0x000058, "Member 'UProceduralShapeToolProperties::Width' has a wrong offset!");
static_assert(offsetof(UProceduralShapeToolProperties, Height) == 0x00005C, "Member 'UProceduralShapeToolProperties::Height' has a wrong offset!");
static_assert(offsetof(UProceduralShapeToolProperties, FeatureRadius) == 0x000060, "Member 'UProceduralShapeToolProperties::FeatureRadius' has a wrong offset!");
static_assert(offsetof(UProceduralShapeToolProperties, Slices) == 0x000064, "Member 'UProceduralShapeToolProperties::Slices' has a wrong offset!");
static_assert(offsetof(UProceduralShapeToolProperties, Subdivisions) == 0x000068, "Member 'UProceduralShapeToolProperties::Subdivisions' has a wrong offset!");
static_assert(offsetof(UProceduralShapeToolProperties, PolygroupMode) == 0x00006C, "Member 'UProceduralShapeToolProperties::PolygroupMode' has a wrong offset!");
static_assert(offsetof(UProceduralShapeToolProperties, PlaceMode) == 0x00006D, "Member 'UProceduralShapeToolProperties::PlaceMode' has a wrong offset!");
static_assert(offsetof(UProceduralShapeToolProperties, PivotLocation) == 0x00006E, "Member 'UProceduralShapeToolProperties::PivotLocation' has a wrong offset!");
static_assert(offsetof(UProceduralShapeToolProperties, Rotation) == 0x000070, "Member 'UProceduralShapeToolProperties::Rotation' has a wrong offset!");
static_assert(offsetof(UProceduralShapeToolProperties, bAlignShapeToPlacementSurface) == 0x000074, "Member 'UProceduralShapeToolProperties::bAlignShapeToPlacementSurface' has a wrong offset!");

// Class MeshModelingTools.EditPivotTool
// 0x0170 (0x0200 - 0x0090)
class alignas(0x10) UEditPivotTool final : public UMultiSelectionTool
{
public:
	uint8                                         Pad_1382[0x8];                                     // 0x0090(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UEditPivotToolProperties*               TransformProps;                                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEditPivotToolActionPropertySet*        EditPivotActions;                                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1383[0xD0];                                    // 0x00A8(0x00D0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEditPivotTarget>               ActiveGizmos;                                      // 0x0178(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1384[0x78];                                    // 0x0188(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditPivotTool">();
	}
	static class UEditPivotTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditPivotTool>();
	}
};
static_assert(alignof(UEditPivotTool) == 0x000010, "Wrong alignment on UEditPivotTool");
static_assert(sizeof(UEditPivotTool) == 0x000200, "Wrong size on UEditPivotTool");
static_assert(offsetof(UEditPivotTool, TransformProps) == 0x000098, "Member 'UEditPivotTool::TransformProps' has a wrong offset!");
static_assert(offsetof(UEditPivotTool, EditPivotActions) == 0x0000A0, "Member 'UEditPivotTool::EditPivotActions' has a wrong offset!");
static_assert(offsetof(UEditPivotTool, ActiveGizmos) == 0x000178, "Member 'UEditPivotTool::ActiveGizmos' has a wrong offset!");

// Class MeshModelingTools.LastActorInfo
// 0x0030 (0x0058 - 0x0028)
class ULastActorInfo final : public UObject
{
public:
	uint8                                         Pad_1385[0x10];                                    // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            StaticMesh;                                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UProceduralShapeToolProperties*         ShapeSettings;                                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNewMeshMaterialProperties*             MaterialProperties;                                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LastActorInfo">();
	}
	static class ULastActorInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULastActorInfo>();
	}
};
static_assert(alignof(ULastActorInfo) == 0x000008, "Wrong alignment on ULastActorInfo");
static_assert(sizeof(ULastActorInfo) == 0x000058, "Wrong size on ULastActorInfo");
static_assert(offsetof(ULastActorInfo, Actor) == 0x000038, "Member 'ULastActorInfo::Actor' has a wrong offset!");
static_assert(offsetof(ULastActorInfo, StaticMesh) == 0x000040, "Member 'ULastActorInfo::StaticMesh' has a wrong offset!");
static_assert(offsetof(ULastActorInfo, ShapeSettings) == 0x000048, "Member 'ULastActorInfo::ShapeSettings' has a wrong offset!");
static_assert(offsetof(ULastActorInfo, MaterialProperties) == 0x000050, "Member 'ULastActorInfo::MaterialProperties' has a wrong offset!");

// Class MeshModelingTools.AlignObjectsToolProperties
// 0x0010 (0x0060 - 0x0050)
class UAlignObjectsToolProperties final : public UInteractiveToolPropertySet
{
public:
	EAlignObjectsAlignTypes                       AlignType;                                         // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAlignObjectsAlignToOptions                   AlignTo;                                           // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAlignObjectsBoxPoint                         BoxPosition;                                       // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlignX;                                           // 0x005C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlignY;                                           // 0x005D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlignZ;                                           // 0x005E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1386[0x1];                                     // 0x005F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AlignObjectsToolProperties">();
	}
	static class UAlignObjectsToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlignObjectsToolProperties>();
	}
};
static_assert(alignof(UAlignObjectsToolProperties) == 0x000008, "Wrong alignment on UAlignObjectsToolProperties");
static_assert(sizeof(UAlignObjectsToolProperties) == 0x000060, "Wrong size on UAlignObjectsToolProperties");
static_assert(offsetof(UAlignObjectsToolProperties, AlignType) == 0x000050, "Member 'UAlignObjectsToolProperties::AlignType' has a wrong offset!");
static_assert(offsetof(UAlignObjectsToolProperties, AlignTo) == 0x000054, "Member 'UAlignObjectsToolProperties::AlignTo' has a wrong offset!");
static_assert(offsetof(UAlignObjectsToolProperties, BoxPosition) == 0x000058, "Member 'UAlignObjectsToolProperties::BoxPosition' has a wrong offset!");
static_assert(offsetof(UAlignObjectsToolProperties, bAlignX) == 0x00005C, "Member 'UAlignObjectsToolProperties::bAlignX' has a wrong offset!");
static_assert(offsetof(UAlignObjectsToolProperties, bAlignY) == 0x00005D, "Member 'UAlignObjectsToolProperties::bAlignY' has a wrong offset!");
static_assert(offsetof(UAlignObjectsToolProperties, bAlignZ) == 0x00005E, "Member 'UAlignObjectsToolProperties::bAlignZ' has a wrong offset!");

// Class MeshModelingTools.AlignObjectsTool
// 0x00B0 (0x0140 - 0x0090)
class UAlignObjectsTool final : public UMultiSelectionTool
{
public:
	uint8                                         Pad_1387[0x8];                                     // 0x0090(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAlignObjectsToolProperties*            AlignProps;                                        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1388[0xA0];                                    // 0x00A0(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AlignObjectsTool">();
	}
	static class UAlignObjectsTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlignObjectsTool>();
	}
};
static_assert(alignof(UAlignObjectsTool) == 0x000008, "Wrong alignment on UAlignObjectsTool");
static_assert(sizeof(UAlignObjectsTool) == 0x000140, "Wrong size on UAlignObjectsTool");
static_assert(offsetof(UAlignObjectsTool, AlignProps) == 0x000098, "Member 'UAlignObjectsTool::AlignProps' has a wrong offset!");

// Class MeshModelingTools.BakeTransformToolBuilder
// 0x0008 (0x0030 - 0x0028)
class UBakeTransformToolBuilder final : public UInteractiveToolBuilder
{
public:
	uint8                                         Pad_1389[0x8];                                     // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BakeTransformToolBuilder">();
	}
	static class UBakeTransformToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeTransformToolBuilder>();
	}
};
static_assert(alignof(UBakeTransformToolBuilder) == 0x000008, "Wrong alignment on UBakeTransformToolBuilder");
static_assert(sizeof(UBakeTransformToolBuilder) == 0x000030, "Wrong size on UBakeTransformToolBuilder");

// Class MeshModelingTools.BakeTransformToolProperties
// 0x0008 (0x0058 - 0x0050)
class UBakeTransformToolProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bBakeRotation;                                     // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBakeScaleMethod                              BakeScale;                                         // 0x0051(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRecenterPivot;                                    // 0x0052(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_138A[0x5];                                     // 0x0053(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BakeTransformToolProperties">();
	}
	static class UBakeTransformToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeTransformToolProperties>();
	}
};
static_assert(alignof(UBakeTransformToolProperties) == 0x000008, "Wrong alignment on UBakeTransformToolProperties");
static_assert(sizeof(UBakeTransformToolProperties) == 0x000058, "Wrong size on UBakeTransformToolProperties");
static_assert(offsetof(UBakeTransformToolProperties, bBakeRotation) == 0x000050, "Member 'UBakeTransformToolProperties::bBakeRotation' has a wrong offset!");
static_assert(offsetof(UBakeTransformToolProperties, BakeScale) == 0x000051, "Member 'UBakeTransformToolProperties::BakeScale' has a wrong offset!");
static_assert(offsetof(UBakeTransformToolProperties, bRecenterPivot) == 0x000052, "Member 'UBakeTransformToolProperties::bRecenterPivot' has a wrong offset!");

// Class MeshModelingTools.BakeTransformTool
// 0x0028 (0x00B8 - 0x0090)
class UBakeTransformTool final : public UMultiSelectionTool
{
public:
	class UBakeTransformToolProperties*           BasicProperties;                                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_138B[0x20];                                    // 0x0098(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BakeTransformTool">();
	}
	static class UBakeTransformTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeTransformTool>();
	}
};
static_assert(alignof(UBakeTransformTool) == 0x000008, "Wrong alignment on UBakeTransformTool");
static_assert(sizeof(UBakeTransformTool) == 0x0000B8, "Wrong size on UBakeTransformTool");
static_assert(offsetof(UBakeTransformTool, BasicProperties) == 0x000090, "Member 'UBakeTransformTool::BasicProperties' has a wrong offset!");

// Class MeshModelingTools.CombineMeshesToolBuilder
// 0x0010 (0x0038 - 0x0028)
class UCombineMeshesToolBuilder final : public UInteractiveToolBuilder
{
public:
	uint8                                         Pad_138C[0x10];                                    // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CombineMeshesToolBuilder">();
	}
	static class UCombineMeshesToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCombineMeshesToolBuilder>();
	}
};
static_assert(alignof(UCombineMeshesToolBuilder) == 0x000008, "Wrong alignment on UCombineMeshesToolBuilder");
static_assert(sizeof(UCombineMeshesToolBuilder) == 0x000038, "Wrong size on UCombineMeshesToolBuilder");

// Class MeshModelingTools.CombineMeshesToolProperties
// 0x0008 (0x0058 - 0x0050)
class UCombineMeshesToolProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bDeleteSourceActors;                               // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_138D[0x7];                                     // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CombineMeshesToolProperties">();
	}
	static class UCombineMeshesToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCombineMeshesToolProperties>();
	}
};
static_assert(alignof(UCombineMeshesToolProperties) == 0x000008, "Wrong alignment on UCombineMeshesToolProperties");
static_assert(sizeof(UCombineMeshesToolProperties) == 0x000058, "Wrong size on UCombineMeshesToolProperties");
static_assert(offsetof(UCombineMeshesToolProperties, bDeleteSourceActors) == 0x000050, "Member 'UCombineMeshesToolProperties::bDeleteSourceActors' has a wrong offset!");

// Class MeshModelingTools.CombineMeshesTool
// 0x0020 (0x00B0 - 0x0090)
class UCombineMeshesTool final : public UMultiSelectionTool
{
public:
	class UCombineMeshesToolProperties*           BasicProperties;                                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_138E[0x18];                                    // 0x0098(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CombineMeshesTool">();
	}
	static class UCombineMeshesTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCombineMeshesTool>();
	}
};
static_assert(alignof(UCombineMeshesTool) == 0x000008, "Wrong alignment on UCombineMeshesTool");
static_assert(sizeof(UCombineMeshesTool) == 0x0000B0, "Wrong size on UCombineMeshesTool");
static_assert(offsetof(UCombineMeshesTool, BasicProperties) == 0x000090, "Member 'UCombineMeshesTool::BasicProperties' has a wrong offset!");

// Class MeshModelingTools.ConvertToPolygonsToolBuilder
// 0x0000 (0x0028 - 0x0028)
class UConvertToPolygonsToolBuilder final : public UInteractiveToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConvertToPolygonsToolBuilder">();
	}
	static class UConvertToPolygonsToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConvertToPolygonsToolBuilder>();
	}
};
static_assert(alignof(UConvertToPolygonsToolBuilder) == 0x000008, "Wrong alignment on UConvertToPolygonsToolBuilder");
static_assert(sizeof(UConvertToPolygonsToolBuilder) == 0x000028, "Wrong size on UConvertToPolygonsToolBuilder");

// Class MeshModelingTools.ConvertToPolygonsToolProperties
// 0x0010 (0x0060 - 0x0050)
class UConvertToPolygonsToolProperties final : public UInteractiveToolPropertySet
{
public:
	EConvertToPolygonsMode                        ConversionMode;                                    // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleTolerance;                                    // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCalculateNormals;                                 // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowGroupColors;                                  // 0x0059(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_138F[0x6];                                     // 0x005A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConvertToPolygonsToolProperties">();
	}
	static class UConvertToPolygonsToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConvertToPolygonsToolProperties>();
	}
};
static_assert(alignof(UConvertToPolygonsToolProperties) == 0x000008, "Wrong alignment on UConvertToPolygonsToolProperties");
static_assert(sizeof(UConvertToPolygonsToolProperties) == 0x000060, "Wrong size on UConvertToPolygonsToolProperties");
static_assert(offsetof(UConvertToPolygonsToolProperties, ConversionMode) == 0x000050, "Member 'UConvertToPolygonsToolProperties::ConversionMode' has a wrong offset!");
static_assert(offsetof(UConvertToPolygonsToolProperties, AngleTolerance) == 0x000054, "Member 'UConvertToPolygonsToolProperties::AngleTolerance' has a wrong offset!");
static_assert(offsetof(UConvertToPolygonsToolProperties, bCalculateNormals) == 0x000058, "Member 'UConvertToPolygonsToolProperties::bCalculateNormals' has a wrong offset!");
static_assert(offsetof(UConvertToPolygonsToolProperties, bShowGroupColors) == 0x000059, "Member 'UConvertToPolygonsToolProperties::bShowGroupColors' has a wrong offset!");

// Class MeshModelingTools.ConvertToPolygonsTool
// 0x0478 (0x0500 - 0x0088)
class alignas(0x10) UConvertToPolygonsTool final : public USingleSelectionTool
{
public:
	class UConvertToPolygonsToolProperties*       Settings;                                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPreviewMesh*                           PreviewMesh;                                       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1390[0x468];                                   // 0x0098(0x0468)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConvertToPolygonsTool">();
	}
	static class UConvertToPolygonsTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConvertToPolygonsTool>();
	}
};
static_assert(alignof(UConvertToPolygonsTool) == 0x000010, "Wrong alignment on UConvertToPolygonsTool");
static_assert(sizeof(UConvertToPolygonsTool) == 0x000500, "Wrong size on UConvertToPolygonsTool");
static_assert(offsetof(UConvertToPolygonsTool, Settings) == 0x000088, "Member 'UConvertToPolygonsTool::Settings' has a wrong offset!");
static_assert(offsetof(UConvertToPolygonsTool, PreviewMesh) == 0x000090, "Member 'UConvertToPolygonsTool::PreviewMesh' has a wrong offset!");

// Class MeshModelingTools.DeformMeshPolygonsToolBuilder
// 0x0000 (0x0030 - 0x0030)
class UDeformMeshPolygonsToolBuilder final : public UMeshSurfacePointToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DeformMeshPolygonsToolBuilder">();
	}
	static class UDeformMeshPolygonsToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeformMeshPolygonsToolBuilder>();
	}
};
static_assert(alignof(UDeformMeshPolygonsToolBuilder) == 0x000008, "Wrong alignment on UDeformMeshPolygonsToolBuilder");
static_assert(sizeof(UDeformMeshPolygonsToolBuilder) == 0x000030, "Wrong size on UDeformMeshPolygonsToolBuilder");

// Class MeshModelingTools.DeformMeshPolygonsTransformProperties
// 0x0020 (0x0070 - 0x0050)
class UDeformMeshPolygonsTransformProperties final : public UInteractiveToolPropertySet
{
public:
	EGroupTopologyDeformationStrategy             DeformationStrategy;                               // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQuickTransformerMode                         TransformMode;                                     // 0x0051(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectFaces;                                      // 0x0052(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectEdges;                                      // 0x0053(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectVertices;                                   // 0x0054(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowWireframe;                                    // 0x0055(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSnapToWorldGrid;                                  // 0x0056(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1391[0x1];                                     // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	EWeightScheme                                 SelectedWeightScheme;                              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1392[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        HandleWeight;                                      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPostFixHandles;                                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1393[0x7];                                     // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DeformMeshPolygonsTransformProperties">();
	}
	static class UDeformMeshPolygonsTransformProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeformMeshPolygonsTransformProperties>();
	}
};
static_assert(alignof(UDeformMeshPolygonsTransformProperties) == 0x000008, "Wrong alignment on UDeformMeshPolygonsTransformProperties");
static_assert(sizeof(UDeformMeshPolygonsTransformProperties) == 0x000070, "Wrong size on UDeformMeshPolygonsTransformProperties");
static_assert(offsetof(UDeformMeshPolygonsTransformProperties, DeformationStrategy) == 0x000050, "Member 'UDeformMeshPolygonsTransformProperties::DeformationStrategy' has a wrong offset!");
static_assert(offsetof(UDeformMeshPolygonsTransformProperties, TransformMode) == 0x000051, "Member 'UDeformMeshPolygonsTransformProperties::TransformMode' has a wrong offset!");
static_assert(offsetof(UDeformMeshPolygonsTransformProperties, bSelectFaces) == 0x000052, "Member 'UDeformMeshPolygonsTransformProperties::bSelectFaces' has a wrong offset!");
static_assert(offsetof(UDeformMeshPolygonsTransformProperties, bSelectEdges) == 0x000053, "Member 'UDeformMeshPolygonsTransformProperties::bSelectEdges' has a wrong offset!");
static_assert(offsetof(UDeformMeshPolygonsTransformProperties, bSelectVertices) == 0x000054, "Member 'UDeformMeshPolygonsTransformProperties::bSelectVertices' has a wrong offset!");
static_assert(offsetof(UDeformMeshPolygonsTransformProperties, bShowWireframe) == 0x000055, "Member 'UDeformMeshPolygonsTransformProperties::bShowWireframe' has a wrong offset!");
static_assert(offsetof(UDeformMeshPolygonsTransformProperties, bSnapToWorldGrid) == 0x000056, "Member 'UDeformMeshPolygonsTransformProperties::bSnapToWorldGrid' has a wrong offset!");
static_assert(offsetof(UDeformMeshPolygonsTransformProperties, SelectedWeightScheme) == 0x000058, "Member 'UDeformMeshPolygonsTransformProperties::SelectedWeightScheme' has a wrong offset!");
static_assert(offsetof(UDeformMeshPolygonsTransformProperties, HandleWeight) == 0x000060, "Member 'UDeformMeshPolygonsTransformProperties::HandleWeight' has a wrong offset!");
static_assert(offsetof(UDeformMeshPolygonsTransformProperties, bPostFixHandles) == 0x000068, "Member 'UDeformMeshPolygonsTransformProperties::bPostFixHandles' has a wrong offset!");

// Class MeshModelingTools.RemoveOccludedTrianglesAdvancedProperties
// 0x0008 (0x0058 - 0x0050)
class URemoveOccludedTrianglesAdvancedProperties final : public UInteractiveToolPropertySet
{
public:
	uint8                                         Pad_1394[0x8];                                     // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RemoveOccludedTrianglesAdvancedProperties">();
	}
	static class URemoveOccludedTrianglesAdvancedProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<URemoveOccludedTrianglesAdvancedProperties>();
	}
};
static_assert(alignof(URemoveOccludedTrianglesAdvancedProperties) == 0x000008, "Wrong alignment on URemoveOccludedTrianglesAdvancedProperties");
static_assert(sizeof(URemoveOccludedTrianglesAdvancedProperties) == 0x000058, "Wrong size on URemoveOccludedTrianglesAdvancedProperties");

// Class MeshModelingTools.DeformMeshPolygonsTool
// 0x15B0 (0x1670 - 0x00C0)
class alignas(0x10) UDeformMeshPolygonsTool final : public UMeshSurfacePointTool
{
public:
	uint8                                         Pad_1395[0x8];                                     // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USimpleDynamicMeshComponent*            DynamicMeshComponent;                              // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDeformMeshPolygonsTransformProperties* TransformProps;                                    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1396[0x1598];                                  // 0x00D8(0x1598)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DeformMeshPolygonsTool">();
	}
	static class UDeformMeshPolygonsTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeformMeshPolygonsTool>();
	}
};
static_assert(alignof(UDeformMeshPolygonsTool) == 0x000010, "Wrong alignment on UDeformMeshPolygonsTool");
static_assert(sizeof(UDeformMeshPolygonsTool) == 0x001670, "Wrong size on UDeformMeshPolygonsTool");
static_assert(offsetof(UDeformMeshPolygonsTool, DynamicMeshComponent) == 0x0000C8, "Member 'UDeformMeshPolygonsTool::DynamicMeshComponent' has a wrong offset!");
static_assert(offsetof(UDeformMeshPolygonsTool, TransformProps) == 0x0000D0, "Member 'UDeformMeshPolygonsTool::TransformProps' has a wrong offset!");

// Class MeshModelingTools.DisplaceMeshToolBuilder
// 0x0000 (0x0028 - 0x0028)
class UDisplaceMeshToolBuilder final : public UInteractiveToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DisplaceMeshToolBuilder">();
	}
	static class UDisplaceMeshToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDisplaceMeshToolBuilder>();
	}
};
static_assert(alignof(UDisplaceMeshToolBuilder) == 0x000008, "Wrong alignment on UDisplaceMeshToolBuilder");
static_assert(sizeof(UDisplaceMeshToolBuilder) == 0x000028, "Wrong size on UDisplaceMeshToolBuilder");

// Class MeshModelingTools.DisplaceMeshTool
// 0x02C8 (0x0350 - 0x0088)
class UDisplaceMeshTool final : public USingleSelectionTool
{
public:
	EDisplaceMeshToolDisplaceType                 DisplacementType;                                  // 0x0088(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1397[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DisplaceIntensity;                                 // 0x008C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RandomSeed;                                        // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Subdivisions;                                      // 0x0094(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             DisplacementMap;                                   // 0x0098(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DisplaceFrequency;                                 // 0x00A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DisplacePhaseShift;                                // 0x00A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1398[0x2A8];                                   // 0x00A8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DisplaceMeshTool">();
	}
	static class UDisplaceMeshTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDisplaceMeshTool>();
	}
};
static_assert(alignof(UDisplaceMeshTool) == 0x000008, "Wrong alignment on UDisplaceMeshTool");
static_assert(sizeof(UDisplaceMeshTool) == 0x000350, "Wrong size on UDisplaceMeshTool");
static_assert(offsetof(UDisplaceMeshTool, DisplacementType) == 0x000088, "Member 'UDisplaceMeshTool::DisplacementType' has a wrong offset!");
static_assert(offsetof(UDisplaceMeshTool, DisplaceIntensity) == 0x00008C, "Member 'UDisplaceMeshTool::DisplaceIntensity' has a wrong offset!");
static_assert(offsetof(UDisplaceMeshTool, RandomSeed) == 0x000090, "Member 'UDisplaceMeshTool::RandomSeed' has a wrong offset!");
static_assert(offsetof(UDisplaceMeshTool, Subdivisions) == 0x000094, "Member 'UDisplaceMeshTool::Subdivisions' has a wrong offset!");
static_assert(offsetof(UDisplaceMeshTool, DisplacementMap) == 0x000098, "Member 'UDisplaceMeshTool::DisplacementMap' has a wrong offset!");
static_assert(offsetof(UDisplaceMeshTool, DisplaceFrequency) == 0x0000A0, "Member 'UDisplaceMeshTool::DisplaceFrequency' has a wrong offset!");
static_assert(offsetof(UDisplaceMeshTool, DisplacePhaseShift) == 0x0000A4, "Member 'UDisplaceMeshTool::DisplacePhaseShift' has a wrong offset!");

// Class MeshModelingTools.DrawPolygonToolBuilder
// 0x0008 (0x0030 - 0x0028)
class UDrawPolygonToolBuilder final : public UInteractiveToolBuilder
{
public:
	uint8                                         Pad_1399[0x8];                                     // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DrawPolygonToolBuilder">();
	}
	static class UDrawPolygonToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDrawPolygonToolBuilder>();
	}
};
static_assert(alignof(UDrawPolygonToolBuilder) == 0x000008, "Wrong alignment on UDrawPolygonToolBuilder");
static_assert(sizeof(UDrawPolygonToolBuilder) == 0x000030, "Wrong size on UDrawPolygonToolBuilder");

// Class MeshModelingTools.SmoothMeshTool
// 0x0290 (0x0318 - 0x0088)
class USmoothMeshTool final : public USingleSelectionTool
{
public:
	uint8                                         Pad_139A[0x8];                                     // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	ESmoothMeshToolSmoothType                     SmoothType;                                        // 0x0090(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_139B[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SmoothSpeed;                                       // 0x0094(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SmoothIterations;                                  // 0x0098(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_139C[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshOpPreviewWithBackgroundCompute*    Preview;                                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_139D[0x270];                                   // 0x00A8(0x0270)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmoothMeshTool">();
	}
	static class USmoothMeshTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmoothMeshTool>();
	}
};
static_assert(alignof(USmoothMeshTool) == 0x000008, "Wrong alignment on USmoothMeshTool");
static_assert(sizeof(USmoothMeshTool) == 0x000318, "Wrong size on USmoothMeshTool");
static_assert(offsetof(USmoothMeshTool, SmoothType) == 0x000090, "Member 'USmoothMeshTool::SmoothType' has a wrong offset!");
static_assert(offsetof(USmoothMeshTool, SmoothSpeed) == 0x000094, "Member 'USmoothMeshTool::SmoothSpeed' has a wrong offset!");
static_assert(offsetof(USmoothMeshTool, SmoothIterations) == 0x000098, "Member 'USmoothMeshTool::SmoothIterations' has a wrong offset!");
static_assert(offsetof(USmoothMeshTool, Preview) == 0x0000A0, "Member 'USmoothMeshTool::Preview' has a wrong offset!");

// Class MeshModelingTools.DrawPolygonToolStandardProperties
// 0x0018 (0x0068 - 0x0050)
class UDrawPolygonToolStandardProperties final : public UInteractiveToolPropertySet
{
public:
	EDrawPolygonDrawMode                          PolygonType;                                       // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDrawPolygonOutputMode                        OutputMode;                                        // 0x0051(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_139E[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FeatureSizeRatio;                                  // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtrudeHeight;                                     // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Steps;                                             // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
