#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ParticleSocketData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct ParticleSocketData.ParticleSocketData
// 0x002C (0x002C - 0x0000)
struct FParticleSocketData final
{
public:
	class FName                                   SocketName_2_D2F88790431653595902069DA21BE8B4;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location_5_02692E8345D72046E82D83B194DA4037;       // 0x0008(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation_9_0C88D1794F61BAE69826AB908D3A058E;       // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Scale_12_B23713B343E2E2C290771ABEE85B9E00;         // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FParticleSocketData) == 0x000004, "Wrong alignment on FParticleSocketData");
static_assert(sizeof(FParticleSocketData) == 0x00002C, "Wrong size on FParticleSocketData");
static_assert(offsetof(FParticleSocketData, SocketName_2_D2F88790431653595902069DA21BE8B4) == 0x000000, "Member 'FParticleSocketData::SocketName_2_D2F88790431653595902069DA21BE8B4' has a wrong offset!");
static_assert(offsetof(FParticleSocketData, Location_5_02692E8345D72046E82D83B194DA4037) == 0x000008, "Member 'FParticleSocketData::Location_5_02692E8345D72046E82D83B194DA4037' has a wrong offset!");
static_assert(offsetof(FParticleSocketData, Rotation_9_0C88D1794F61BAE69826AB908D3A058E) == 0x000014, "Member 'FParticleSocketData::Rotation_9_0C88D1794F61BAE69826AB908D3A058E' has a wrong offset!");
static_assert(offsetof(FParticleSocketData, Scale_12_B23713B343E2E2C290771ABEE85B9E00) == 0x000020, "Member 'FParticleSocketData::Scale_12_B23713B343E2E2C290771ABEE85B9E00' has a wrong offset!");

}

