#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ParticleManageComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ParticleManageData_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ParticleManageComponent.ParticleManageComponent_C
// 0x0030 (0x00F0 - 0x00C0)
class UParticleManageComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FParticleManageData>            ManageData;                                        // 0x00C8(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       ParticleHandle;                                    // 0x00D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 OwnerMesh;                                         // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ParticleManageComponent(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SpawnParticle(int32 Param_Index);
	void StopParticle(int32 Param_Index);
	void ChangeParameter_Rate(int32 Param_Index, float Rate);
	void IsValid(int32 Param_Index, bool* bValid);
	void ChangeParameter_Radius(int32 Param_Index, float Radius);
	void ChangeParameter_Height(int32 Param_Index, float Height);
	void SpawnParticleAll();
	void StopParticleAll();
	void SetMesh(class USkeletalMeshComponent* Param_OwnerMesh);

	void GetManageData(int32 Param_Index, struct FParticleManageData* Output) const;
	void GetDataNum(int32* Num) const;
	void GetParameter_Rate(int32 Param_Index, float* MinRate, float* MaxRate) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ParticleManageComponent_C">();
	}
	static class UParticleManageComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UParticleManageComponent_C>();
	}
};
static_assert(alignof(UParticleManageComponent_C) == 0x000008, "Wrong alignment on UParticleManageComponent_C");
static_assert(sizeof(UParticleManageComponent_C) == 0x0000F0, "Wrong size on UParticleManageComponent_C");
static_assert(offsetof(UParticleManageComponent_C, UberGraphFrame) == 0x0000C0, "Member 'UParticleManageComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UParticleManageComponent_C, ManageData) == 0x0000C8, "Member 'UParticleManageComponent_C::ManageData' has a wrong offset!");
static_assert(offsetof(UParticleManageComponent_C, ParticleHandle) == 0x0000D8, "Member 'UParticleManageComponent_C::ParticleHandle' has a wrong offset!");
static_assert(offsetof(UParticleManageComponent_C, OwnerMesh) == 0x0000E8, "Member 'UParticleManageComponent_C::OwnerMesh' has a wrong offset!");

}

