#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ParticleManageData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ParticleManageData.ParticleManageData
// 0x0020 (0x0020 - 0x0000)
struct FParticleManageData final
{
public:
	class UParticleSystem*                        Particle_22_C63F2A1948FD84EDEE835D962FE685F5;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName_5_65A27CA847FCC4D9400EBD943DCE9BF4;     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_MinRate_11_56A699B2481321DE618498A3F43B22C7; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_MaxRate_12_D337916142EBE469EC9469BD6932F74A; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_Radius_16_67437669433D1D8181DE25BC163896BD;  // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_Height_20_E52E9934428074EB89F4F2968D5CD54E;  // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FParticleManageData) == 0x000008, "Wrong alignment on FParticleManageData");
static_assert(sizeof(FParticleManageData) == 0x000020, "Wrong size on FParticleManageData");
static_assert(offsetof(FParticleManageData, Particle_22_C63F2A1948FD84EDEE835D962FE685F5) == 0x000000, "Member 'FParticleManageData::Particle_22_C63F2A1948FD84EDEE835D962FE685F5' has a wrong offset!");
static_assert(offsetof(FParticleManageData, SocketName_5_65A27CA847FCC4D9400EBD943DCE9BF4) == 0x000008, "Member 'FParticleManageData::SocketName_5_65A27CA847FCC4D9400EBD943DCE9BF4' has a wrong offset!");
static_assert(offsetof(FParticleManageData, Param_MinRate_11_56A699B2481321DE618498A3F43B22C7) == 0x000010, "Member 'FParticleManageData::Param_MinRate_11_56A699B2481321DE618498A3F43B22C7' has a wrong offset!");
static_assert(offsetof(FParticleManageData, Param_MaxRate_12_D337916142EBE469EC9469BD6932F74A) == 0x000014, "Member 'FParticleManageData::Param_MaxRate_12_D337916142EBE469EC9469BD6932F74A' has a wrong offset!");
static_assert(offsetof(FParticleManageData, Param_Radius_16_67437669433D1D8181DE25BC163896BD) == 0x000018, "Member 'FParticleManageData::Param_Radius_16_67437669433D1D8181DE25BC163896BD' has a wrong offset!");
static_assert(offsetof(FParticleManageData, Param_Height_20_E52E9934428074EB89F4F2968D5CD54E) == 0x00001C, "Member 'FParticleManageData::Param_Height_20_E52E9934428074EB89F4F2968D5CD54E' has a wrong offset!");

}

