#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerAnimNotifyState_EnablePsychic

#include "Basic.hpp"

#include "ECharaExecuteNotifyKind_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PlayerAnimNotifyState_EnablePsychic.PlayerAnimNotifyState_EnablePsychic_C
// 0x0010 (0x0040 - 0x0030)
class UPlayerAnimNotifyState_EnablePsychic_C final : public UAnimNotifyState
{
public:
	bool                                          bNotOff;                                           // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8385[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ClaimantName;                                      // 0x0034(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPsychicEx;                                        // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	ECharaExecuteNotifyKind                       ExecuteKind;                                       // 0x003D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSkipWeightGaugeCheck;                             // 0x003E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	bool Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration) const;
	bool Received_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation) const;
	class FString GetNotifyName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerAnimNotifyState_EnablePsychic_C">();
	}
	static class UPlayerAnimNotifyState_EnablePsychic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerAnimNotifyState_EnablePsychic_C>();
	}
};
static_assert(alignof(UPlayerAnimNotifyState_EnablePsychic_C) == 0x000008, "Wrong alignment on UPlayerAnimNotifyState_EnablePsychic_C");
static_assert(sizeof(UPlayerAnimNotifyState_EnablePsychic_C) == 0x000040, "Wrong size on UPlayerAnimNotifyState_EnablePsychic_C");
static_assert(offsetof(UPlayerAnimNotifyState_EnablePsychic_C, bNotOff) == 0x000030, "Member 'UPlayerAnimNotifyState_EnablePsychic_C::bNotOff' has a wrong offset!");
static_assert(offsetof(UPlayerAnimNotifyState_EnablePsychic_C, ClaimantName) == 0x000034, "Member 'UPlayerAnimNotifyState_EnablePsychic_C::ClaimantName' has a wrong offset!");
static_assert(offsetof(UPlayerAnimNotifyState_EnablePsychic_C, bPsychicEx) == 0x00003C, "Member 'UPlayerAnimNotifyState_EnablePsychic_C::bPsychicEx' has a wrong offset!");
static_assert(offsetof(UPlayerAnimNotifyState_EnablePsychic_C, ExecuteKind) == 0x00003D, "Member 'UPlayerAnimNotifyState_EnablePsychic_C::ExecuteKind' has a wrong offset!");
static_assert(offsetof(UPlayerAnimNotifyState_EnablePsychic_C, bSkipWeightGaugeCheck) == 0x00003E, "Member 'UPlayerAnimNotifyState_EnablePsychic_C::bSkipWeightGaugeCheck' has a wrong offset!");

}

