#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerAnimMontageSet

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct PlayerAnimMontageSet.PlayerAnimMontageSet
// 0x00E8 (0x00E8 - 0x0000)
struct FPlayerAnimMontageSet final
{
public:
	class UAnimMontage*                           StartBattle_UP_9_44128E0F4415D06BD70987BD1C1267E1; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           StartBattle_LO_10_30C1C6394DFD2925FB1C9F9274FF62B0; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           EndBattle_UP_11_18A6D7AC4BC1C04FC40E1FBEC1858BC1;  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           EndBattle_LO_12_AFF6DA0D40631C5E2E813184610FFE8E;  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SAS_DAMAGE_UP_13_5D95AC5E4BBE074D8F22F8B39DDE5D18; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SAS_DAMAGE_LO_14_75795E1F4D1E3DC5B36CCAAF8A832829; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           BATTLE_SAS_DAMAGE_UP_17_5BC6CA764DEF250D3262E0A864816223; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           BATTLE_SAS_DAMAGE_LO_18_E396ACA8430AE3F3F2C0398A957BC965; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           END_BRAINFIELD_21_2465A265476B586AAB9931AED14F7263; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           EndAttackTelepo_27_61BD12C647FD5C8C154554878285AA06; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           WalkStart_Battle_Upper_34_0546663748BCB648CF6BF599A35FAE39; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           WalkEnd_Battle_Upper_36_6DDAFDA342A14CEE9564D48D96E2D773; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           ChargeWeaponStartUP_40_3D246A2E4CAED89850F46686AF30F374; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           ChargeWeaponStartLO_43_100BD7F149E4635EB96C6EABA3612E84; // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Capture_Start_UP_60_CF9758734507E6E589F6C69A55CE6A63; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Capture_Loop_UP_61_77CB79F24F2C0828BDDC6F97D61C8B3A; // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Capture_Cancel_UP_62_8EFE414C4C78AD62198D8C9701CC9468; // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           PsychicAttack0_UP_54_377444F14D1B5A41C987CE91E9C251E7; // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           PsychicAttackLeft_UP_78_35B1CE694C25393AEADC909098026542; // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           PsychicAttackLeft_Loop_UP_79_33D7760A499063DDBEB641BB990BA66D; // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           PsychicAttackLeft_Cancel_UP_80_956CF78C424044964034DFBA59E6171D; // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           PsychicAttackRight_UP_81_FD5979584DA135852ECB2CAEFD22F8CD; // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           PsychicAttackRight_Loop_UP_82_CAEB143A4FBBFA7E49A7928E1DA2C469; // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           PsychicAttackRight_Cancel_UP_83_1F594C484F7CB9EE813BCA9B1ACFF225; // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           AddDamage_Stand_86_D74A54A84E5D802F07A377A8E6F1A64B; // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           AddDamage_DownF_89_4677225F4BAAE0873F9604929106A85F; // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           AddDamage_DownB_90_A41D087F4C8CE14B8CC86CAAD04A9D97; // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           PsychicFallLeft_UP_94_E1B5099348D3ECDDA45DD19C139CFD6D; // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           PsychicFallRight_UP_96_E9F39F4A433F451EEB3E34B1D04AC527; // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPlayerAnimMontageSet) == 0x000008, "Wrong alignment on FPlayerAnimMontageSet");
static_assert(sizeof(FPlayerAnimMontageSet) == 0x0000E8, "Wrong size on FPlayerAnimMontageSet");
static_assert(offsetof(FPlayerAnimMontageSet, StartBattle_UP_9_44128E0F4415D06BD70987BD1C1267E1) == 0x000000, "Member 'FPlayerAnimMontageSet::StartBattle_UP_9_44128E0F4415D06BD70987BD1C1267E1' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, StartBattle_LO_10_30C1C6394DFD2925FB1C9F9274FF62B0) == 0x000008, "Member 'FPlayerAnimMontageSet::StartBattle_LO_10_30C1C6394DFD2925FB1C9F9274FF62B0' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, EndBattle_UP_11_18A6D7AC4BC1C04FC40E1FBEC1858BC1) == 0x000010, "Member 'FPlayerAnimMontageSet::EndBattle_UP_11_18A6D7AC4BC1C04FC40E1FBEC1858BC1' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, EndBattle_LO_12_AFF6DA0D40631C5E2E813184610FFE8E) == 0x000018, "Member 'FPlayerAnimMontageSet::EndBattle_LO_12_AFF6DA0D40631C5E2E813184610FFE8E' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, SAS_DAMAGE_UP_13_5D95AC5E4BBE074D8F22F8B39DDE5D18) == 0x000020, "Member 'FPlayerAnimMontageSet::SAS_DAMAGE_UP_13_5D95AC5E4BBE074D8F22F8B39DDE5D18' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, SAS_DAMAGE_LO_14_75795E1F4D1E3DC5B36CCAAF8A832829) == 0x000028, "Member 'FPlayerAnimMontageSet::SAS_DAMAGE_LO_14_75795E1F4D1E3DC5B36CCAAF8A832829' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, BATTLE_SAS_DAMAGE_UP_17_5BC6CA764DEF250D3262E0A864816223) == 0x000030, "Member 'FPlayerAnimMontageSet::BATTLE_SAS_DAMAGE_UP_17_5BC6CA764DEF250D3262E0A864816223' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, BATTLE_SAS_DAMAGE_LO_18_E396ACA8430AE3F3F2C0398A957BC965) == 0x000038, "Member 'FPlayerAnimMontageSet::BATTLE_SAS_DAMAGE_LO_18_E396ACA8430AE3F3F2C0398A957BC965' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, END_BRAINFIELD_21_2465A265476B586AAB9931AED14F7263) == 0x000040, "Member 'FPlayerAnimMontageSet::END_BRAINFIELD_21_2465A265476B586AAB9931AED14F7263' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, EndAttackTelepo_27_61BD12C647FD5C8C154554878285AA06) == 0x000048, "Member 'FPlayerAnimMontageSet::EndAttackTelepo_27_61BD12C647FD5C8C154554878285AA06' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, WalkStart_Battle_Upper_34_0546663748BCB648CF6BF599A35FAE39) == 0x000050, "Member 'FPlayerAnimMontageSet::WalkStart_Battle_Upper_34_0546663748BCB648CF6BF599A35FAE39' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, WalkEnd_Battle_Upper_36_6DDAFDA342A14CEE9564D48D96E2D773) == 0x000058, "Member 'FPlayerAnimMontageSet::WalkEnd_Battle_Upper_36_6DDAFDA342A14CEE9564D48D96E2D773' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, ChargeWeaponStartUP_40_3D246A2E4CAED89850F46686AF30F374) == 0x000060, "Member 'FPlayerAnimMontageSet::ChargeWeaponStartUP_40_3D246A2E4CAED89850F46686AF30F374' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, ChargeWeaponStartLO_43_100BD7F149E4635EB96C6EABA3612E84) == 0x000068, "Member 'FPlayerAnimMontageSet::ChargeWeaponStartLO_43_100BD7F149E4635EB96C6EABA3612E84' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, Capture_Start_UP_60_CF9758734507E6E589F6C69A55CE6A63) == 0x000070, "Member 'FPlayerAnimMontageSet::Capture_Start_UP_60_CF9758734507E6E589F6C69A55CE6A63' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, Capture_Loop_UP_61_77CB79F24F2C0828BDDC6F97D61C8B3A) == 0x000078, "Member 'FPlayerAnimMontageSet::Capture_Loop_UP_61_77CB79F24F2C0828BDDC6F97D61C8B3A' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, Capture_Cancel_UP_62_8EFE414C4C78AD62198D8C9701CC9468) == 0x000080, "Member 'FPlayerAnimMontageSet::Capture_Cancel_UP_62_8EFE414C4C78AD62198D8C9701CC9468' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, PsychicAttack0_UP_54_377444F14D1B5A41C987CE91E9C251E7) == 0x000088, "Member 'FPlayerAnimMontageSet::PsychicAttack0_UP_54_377444F14D1B5A41C987CE91E9C251E7' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, PsychicAttackLeft_UP_78_35B1CE694C25393AEADC909098026542) == 0x000090, "Member 'FPlayerAnimMontageSet::PsychicAttackLeft_UP_78_35B1CE694C25393AEADC909098026542' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, PsychicAttackLeft_Loop_UP_79_33D7760A499063DDBEB641BB990BA66D) == 0x000098, "Member 'FPlayerAnimMontageSet::PsychicAttackLeft_Loop_UP_79_33D7760A499063DDBEB641BB990BA66D' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, PsychicAttackLeft_Cancel_UP_80_956CF78C424044964034DFBA59E6171D) == 0x0000A0, "Member 'FPlayerAnimMontageSet::PsychicAttackLeft_Cancel_UP_80_956CF78C424044964034DFBA59E6171D' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, PsychicAttackRight_UP_81_FD5979584DA135852ECB2CAEFD22F8CD) == 0x0000A8, "Member 'FPlayerAnimMontageSet::PsychicAttackRight_UP_81_FD5979584DA135852ECB2CAEFD22F8CD' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, PsychicAttackRight_Loop_UP_82_CAEB143A4FBBFA7E49A7928E1DA2C469) == 0x0000B0, "Member 'FPlayerAnimMontageSet::PsychicAttackRight_Loop_UP_82_CAEB143A4FBBFA7E49A7928E1DA2C469' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, PsychicAttackRight_Cancel_UP_83_1F594C484F7CB9EE813BCA9B1ACFF225) == 0x0000B8, "Member 'FPlayerAnimMontageSet::PsychicAttackRight_Cancel_UP_83_1F594C484F7CB9EE813BCA9B1ACFF225' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, AddDamage_Stand_86_D74A54A84E5D802F07A377A8E6F1A64B) == 0x0000C0, "Member 'FPlayerAnimMontageSet::AddDamage_Stand_86_D74A54A84E5D802F07A377A8E6F1A64B' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, AddDamage_DownF_89_4677225F4BAAE0873F9604929106A85F) == 0x0000C8, "Member 'FPlayerAnimMontageSet::AddDamage_DownF_89_4677225F4BAAE0873F9604929106A85F' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, AddDamage_DownB_90_A41D087F4C8CE14B8CC86CAAD04A9D97) == 0x0000D0, "Member 'FPlayerAnimMontageSet::AddDamage_DownB_90_A41D087F4C8CE14B8CC86CAAD04A9D97' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, PsychicFallLeft_UP_94_E1B5099348D3ECDDA45DD19C139CFD6D) == 0x0000D8, "Member 'FPlayerAnimMontageSet::PsychicFallLeft_UP_94_E1B5099348D3ECDDA45DD19C139CFD6D' has a wrong offset!");
static_assert(offsetof(FPlayerAnimMontageSet, PsychicFallRight_UP_96_E9F39F4A433F451EEB3E34B1D04AC527) == 0x0000E0, "Member 'FPlayerAnimMontageSet::PsychicFallRight_UP_96_E9F39F4A433F451EEB3E34B1D04AC527' has a wrong offset!");

}

