#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerAnimNotifyState_EnableAttack

#include "Basic.hpp"


namespace SDK::Params
{

// Function PlayerAnimNotifyState_EnableAttack.PlayerAnimNotifyState_EnableAttack_C.Received_NotifyBegin
// 0x0080 (0x0080 - 0x0000)
struct PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          LbNotComboEnd;                                     // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8515[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetClaimantName_ClaimantName;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimMontageStoped_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8516[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerStatus_Result;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8517[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> CallFunc_IsEnemyPlayer_self_CastInput;             // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemyPlayer_bEnemyPlayer;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsComboInputEnd_NewParam;                 // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8518[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_AnimNotifyExecuteCheck_C> CallFunc_CheckExecuteAnimNotifyCharacterKind_self_CastInput; // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckExecuteAnimNotifyCharacterKind_bExecute; // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8519[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPsychicComboLevelMax_ReturnValue;      // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPsychicComboLevel_ReturnValue;         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin) == 0x000008, "Wrong alignment on PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin");
static_assert(sizeof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin) == 0x000080, "Wrong size on PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin, TotalDuration) == 0x000010, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin, ReturnValue) == 0x000014, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin, LbNotComboEnd) == 0x000015, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin::LbNotComboEnd' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin, CallFunc_IsValid_ReturnValue) == 0x000016, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin, CallFunc_GetClaimantName_ClaimantName) == 0x000018, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin::CallFunc_GetClaimantName_ClaimantName' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin, CallFunc_GetAnimInstance_ReturnValue) == 0x000020, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin, CallFunc_IsAnimMontageStoped_ReturnValue) == 0x000030, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin::CallFunc_IsAnimMontageStoped_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin, K2Node_DynamicCast_AsRSBattle_Player) == 0x000038, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin, CallFunc_IsPlayerStatus_Result) == 0x000041, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin::CallFunc_IsPlayerStatus_Result' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin, CallFunc_IsEnemyPlayer_self_CastInput) == 0x000048, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin::CallFunc_IsEnemyPlayer_self_CastInput' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin, CallFunc_IsEnemyPlayer_bEnemyPlayer) == 0x000058, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin::CallFunc_IsEnemyPlayer_bEnemyPlayer' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin, CallFunc_IsComboInputEnd_NewParam) == 0x000059, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin::CallFunc_IsComboInputEnd_NewParam' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin, CallFunc_CheckExecuteAnimNotifyCharacterKind_self_CastInput) == 0x000060, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin::CallFunc_CheckExecuteAnimNotifyCharacterKind_self_CastInput' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin, CallFunc_CheckExecuteAnimNotifyCharacterKind_bExecute) == 0x000070, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin::CallFunc_CheckExecuteAnimNotifyCharacterKind_bExecute' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin, CallFunc_GetPsychicComboLevelMax_ReturnValue) == 0x000074, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin::CallFunc_GetPsychicComboLevelMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin, CallFunc_GetPsychicComboLevel_ReturnValue) == 0x000078, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin::CallFunc_GetPsychicComboLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin, K2Node_SwitchEnum_CmpSuccess) == 0x00007D, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyBegin::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function PlayerAnimNotifyState_EnableAttack.PlayerAnimNotifyState_EnableAttack_C.Received_NotifyEnd
// 0x0050 (0x0050 - 0x0000)
struct PlayerAnimNotifyState_EnableAttack_C_Received_NotifyEnd final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_851A[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetClaimantName_ClaimantName;             // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_851B[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_851C[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_AnimNotifyExecuteCheck_C> CallFunc_CheckExecuteAnimNotifyCharacterKind_self_CastInput; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckExecuteAnimNotifyCharacterKind_bExecute; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyEnd) == 0x000008, "Wrong alignment on PlayerAnimNotifyState_EnableAttack_C_Received_NotifyEnd");
static_assert(sizeof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyEnd) == 0x000050, "Wrong size on PlayerAnimNotifyState_EnableAttack_C_Received_NotifyEnd");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyEnd, MeshComp) == 0x000000, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyEnd::MeshComp' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyEnd, Animation) == 0x000008, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyEnd::Animation' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyEnd, ReturnValue) == 0x000010, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyEnd::ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyEnd, CallFunc_GetClaimantName_ClaimantName) == 0x000014, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyEnd::CallFunc_GetClaimantName_ClaimantName' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyEnd, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyEnd::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyEnd, K2Node_DynamicCast_AsRSBattle_Player) == 0x000028, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyEnd::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyEnd, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyEnd::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyEnd, CallFunc_CheckExecuteAnimNotifyCharacterKind_self_CastInput) == 0x000038, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyEnd::CallFunc_CheckExecuteAnimNotifyCharacterKind_self_CastInput' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_Received_NotifyEnd, CallFunc_CheckExecuteAnimNotifyCharacterKind_bExecute) == 0x000048, "Member 'PlayerAnimNotifyState_EnableAttack_C_Received_NotifyEnd::CallFunc_CheckExecuteAnimNotifyCharacterKind_bExecute' has a wrong offset!");

// Function PlayerAnimNotifyState_EnableAttack.PlayerAnimNotifyState_EnableAttack_C.GetClaimantName
// 0x00B0 (0x00B0 - 0x0000)
struct PlayerAnimNotifyState_EnableAttack_C_GetClaimantName final
{
public:
	class UAnimSequenceBase*                      Anim;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Param_ClaimantName;                                // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Param_Name;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ObjectToString_ReturnValue;          // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ObjectToString_ReturnValue_1;        // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ObjectToString_ReturnValue_2;        // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ObjectToString_ReturnValue_3;        // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_3;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerAnimNotifyState_EnableAttack_C_GetClaimantName) == 0x000008, "Wrong alignment on PlayerAnimNotifyState_EnableAttack_C_GetClaimantName");
static_assert(sizeof(PlayerAnimNotifyState_EnableAttack_C_GetClaimantName) == 0x0000B0, "Wrong size on PlayerAnimNotifyState_EnableAttack_C_GetClaimantName");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_GetClaimantName, Anim) == 0x000000, "Member 'PlayerAnimNotifyState_EnableAttack_C_GetClaimantName::Anim' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_GetClaimantName, Param_ClaimantName) == 0x000008, "Member 'PlayerAnimNotifyState_EnableAttack_C_GetClaimantName::Param_ClaimantName' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_GetClaimantName, Param_Name) == 0x000010, "Member 'PlayerAnimNotifyState_EnableAttack_C_GetClaimantName::Param_Name' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_GetClaimantName, CallFunc_Conv_ObjectToString_ReturnValue) == 0x000018, "Member 'PlayerAnimNotifyState_EnableAttack_C_GetClaimantName::CallFunc_Conv_ObjectToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_GetClaimantName, CallFunc_Conv_ObjectToString_ReturnValue_1) == 0x000028, "Member 'PlayerAnimNotifyState_EnableAttack_C_GetClaimantName::CallFunc_Conv_ObjectToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_GetClaimantName, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'PlayerAnimNotifyState_EnableAttack_C_GetClaimantName::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_GetClaimantName, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000048, "Member 'PlayerAnimNotifyState_EnableAttack_C_GetClaimantName::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_GetClaimantName, CallFunc_Conv_StringToName_ReturnValue) == 0x000058, "Member 'PlayerAnimNotifyState_EnableAttack_C_GetClaimantName::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_GetClaimantName, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000060, "Member 'PlayerAnimNotifyState_EnableAttack_C_GetClaimantName::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_GetClaimantName, CallFunc_Conv_ObjectToString_ReturnValue_2) == 0x000068, "Member 'PlayerAnimNotifyState_EnableAttack_C_GetClaimantName::CallFunc_Conv_ObjectToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_GetClaimantName, CallFunc_Conv_ObjectToString_ReturnValue_3) == 0x000078, "Member 'PlayerAnimNotifyState_EnableAttack_C_GetClaimantName::CallFunc_Conv_ObjectToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_GetClaimantName, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000088, "Member 'PlayerAnimNotifyState_EnableAttack_C_GetClaimantName::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_GetClaimantName, CallFunc_Conv_StringToName_ReturnValue_2) == 0x000098, "Member 'PlayerAnimNotifyState_EnableAttack_C_GetClaimantName::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_GetClaimantName, CallFunc_Conv_StringToName_ReturnValue_3) == 0x0000A0, "Member 'PlayerAnimNotifyState_EnableAttack_C_GetClaimantName::CallFunc_Conv_StringToName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_GetClaimantName, K2Node_SwitchEnum_CmpSuccess) == 0x0000A8, "Member 'PlayerAnimNotifyState_EnableAttack_C_GetClaimantName::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function PlayerAnimNotifyState_EnableAttack.PlayerAnimNotifyState_EnableAttack_C.GetNotifyName
// 0x0050 (0x0050 - 0x0000)
struct PlayerAnimNotifyState_EnableAttack_C_GetNotifyName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_851D[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_851E[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetNotifyName_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerAnimNotifyState_EnableAttack_C_GetNotifyName) == 0x000008, "Wrong alignment on PlayerAnimNotifyState_EnableAttack_C_GetNotifyName");
static_assert(sizeof(PlayerAnimNotifyState_EnableAttack_C_GetNotifyName) == 0x000050, "Wrong size on PlayerAnimNotifyState_EnableAttack_C_GetNotifyName");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_GetNotifyName, ReturnValue) == 0x000000, "Member 'PlayerAnimNotifyState_EnableAttack_C_GetNotifyName::ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_GetNotifyName, Temp_bool_Variable) == 0x000010, "Member 'PlayerAnimNotifyState_EnableAttack_C_GetNotifyName::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_GetNotifyName, Temp_string_Variable) == 0x000018, "Member 'PlayerAnimNotifyState_EnableAttack_C_GetNotifyName::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_GetNotifyName, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000028, "Member 'PlayerAnimNotifyState_EnableAttack_C_GetNotifyName::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_GetNotifyName, CallFunc_GetNotifyName_ReturnValue) == 0x000030, "Member 'PlayerAnimNotifyState_EnableAttack_C_GetNotifyName::CallFunc_GetNotifyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAttack_C_GetNotifyName, K2Node_Select_Default) == 0x000040, "Member 'PlayerAnimNotifyState_EnableAttack_C_GetNotifyName::K2Node_Select_Default' has a wrong offset!");

}

