#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerAnimNotifyState_EnableBrainCrash

#include "Basic.hpp"


namespace SDK::Params
{

// Function PlayerAnimNotifyState_EnableBrainCrash.PlayerAnimNotifyState_EnableBrainCrash_C.Received_NotifyBegin
// 0x0058 (0x0058 - 0x0000)
struct PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7ED6[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_ObjectToString_ReturnValue;          // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimMontageStoped_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7ED7[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin) == 0x000008, "Wrong alignment on PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin");
static_assert(sizeof(PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin) == 0x000058, "Wrong size on PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin");
static_assert(offsetof(PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin, TotalDuration) == 0x000010, "Member 'PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin, ReturnValue) == 0x000014, "Member 'PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin, CallFunc_IsValid_ReturnValue) == 0x000015, "Member 'PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin, CallFunc_Conv_ObjectToString_ReturnValue) == 0x000018, "Member 'PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin::CallFunc_Conv_ObjectToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin, CallFunc_Conv_StringToName_ReturnValue) == 0x000028, "Member 'PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin, CallFunc_GetAnimInstance_ReturnValue) == 0x000030, "Member 'PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin, CallFunc_IsAnimMontageStoped_ReturnValue) == 0x000040, "Member 'PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin::CallFunc_IsAnimMontageStoped_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin, K2Node_DynamicCast_AsRSBattle_Player) == 0x000048, "Member 'PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyBegin::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function PlayerAnimNotifyState_EnableBrainCrash.PlayerAnimNotifyState_EnableBrainCrash_C.Received_NotifyEnd
// 0x0048 (0x0048 - 0x0000)
struct PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyEnd final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7ED8[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_ObjectToString_ReturnValue;          // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyEnd) == 0x000008, "Wrong alignment on PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyEnd");
static_assert(sizeof(PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyEnd) == 0x000048, "Wrong size on PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyEnd");
static_assert(offsetof(PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyEnd, MeshComp) == 0x000000, "Member 'PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyEnd::MeshComp' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyEnd, Animation) == 0x000008, "Member 'PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyEnd::Animation' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyEnd, ReturnValue) == 0x000010, "Member 'PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyEnd::ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyEnd, CallFunc_Conv_ObjectToString_ReturnValue) == 0x000018, "Member 'PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyEnd::CallFunc_Conv_ObjectToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyEnd, CallFunc_Conv_StringToName_ReturnValue) == 0x000028, "Member 'PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyEnd::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyEnd, CallFunc_GetOwner_ReturnValue) == 0x000030, "Member 'PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyEnd::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyEnd, K2Node_DynamicCast_AsRSBattle_Player) == 0x000038, "Member 'PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyEnd::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyEnd, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'PlayerAnimNotifyState_EnableBrainCrash_C_Received_NotifyEnd::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

