#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerAnimNotifyState_EnableAction

#include "Basic.hpp"


namespace SDK::Params
{

// Function PlayerAnimNotifyState_EnableAction.PlayerAnimNotifyState_EnableAction_C.Received_NotifyBegin
// 0x0090 (0x0090 - 0x0000)
struct PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5015[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_ObjectToString_ReturnValue;          // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5016[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5017[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimMontageStoped_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5018[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5019[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      CallFunc_OnAnimNotifyEnableAction_self_CastInput;  // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnAnimNotifyEnableAction_ReturnValue;     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_501A[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_AnimNotifyExecuteCheck_C> CallFunc_CheckExecuteAnimNotifyCharacterKind_self_CastInput; // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckExecuteAnimNotifyCharacterKind_bExecute; // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin) == 0x000008, "Wrong alignment on PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin");
static_assert(sizeof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin) == 0x000090, "Wrong size on PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin, TotalDuration) == 0x000010, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin, ReturnValue) == 0x000014, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin, CallFunc_Conv_ObjectToString_ReturnValue) == 0x000018, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin::CallFunc_Conv_ObjectToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin, CallFunc_Conv_StringToName_ReturnValue) == 0x00002C, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin, CallFunc_GetAnimInstance_ReturnValue) == 0x000038, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin, CallFunc_IsAnimMontageStoped_ReturnValue) == 0x000048, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin::CallFunc_IsAnimMontageStoped_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin, K2Node_DynamicCast_AsRSBattle_Player) == 0x000050, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin, CallFunc_OnAnimNotifyEnableAction_self_CastInput) == 0x000060, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin::CallFunc_OnAnimNotifyEnableAction_self_CastInput' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin, CallFunc_OnAnimNotifyEnableAction_ReturnValue) == 0x000070, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin::CallFunc_OnAnimNotifyEnableAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin, CallFunc_CheckExecuteAnimNotifyCharacterKind_self_CastInput) == 0x000078, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin::CallFunc_CheckExecuteAnimNotifyCharacterKind_self_CastInput' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin, CallFunc_CheckExecuteAnimNotifyCharacterKind_bExecute) == 0x000088, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyBegin::CallFunc_CheckExecuteAnimNotifyCharacterKind_bExecute' has a wrong offset!");

// Function PlayerAnimNotifyState_EnableAction.PlayerAnimNotifyState_EnableAction_C.Received_NotifyEnd
// 0x0060 (0x0060 - 0x0000)
struct PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_501B[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_ObjectToString_ReturnValue;          // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_501C[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_AnimNotifyExecuteCheck_C> CallFunc_CheckExecuteAnimNotifyCharacterKind_self_CastInput; // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckExecuteAnimNotifyCharacterKind_bExecute; // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd) == 0x000008, "Wrong alignment on PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd");
static_assert(sizeof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd) == 0x000060, "Wrong size on PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd, MeshComp) == 0x000000, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd::MeshComp' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd, Animation) == 0x000008, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd::Animation' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd, ReturnValue) == 0x000010, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd::ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd, CallFunc_Conv_ObjectToString_ReturnValue) == 0x000018, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd::CallFunc_Conv_ObjectToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd, CallFunc_Conv_StringToName_ReturnValue) == 0x000030, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd, K2Node_DynamicCast_AsRSBattle_Player) == 0x000038, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd, CallFunc_CheckExecuteAnimNotifyCharacterKind_self_CastInput) == 0x000048, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd::CallFunc_CheckExecuteAnimNotifyCharacterKind_self_CastInput' has a wrong offset!");
static_assert(offsetof(PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd, CallFunc_CheckExecuteAnimNotifyCharacterKind_bExecute) == 0x000058, "Member 'PlayerAnimNotifyState_EnableAction_C_Received_NotifyEnd::CallFunc_CheckExecuteAnimNotifyCharacterKind_bExecute' has a wrong offset!");

}

