#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PsychicGrabMovementSizeData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct PsychicGrabMovementSizeData.PsychicGrabMovementSizeData
// 0x00B0 (0x00B0 - 0x0000)
struct FPsychicGrabMovementSizeData final
{
public:
	class UCurveFloat*                            GrabStart_SpeedCurve_26_8CFF8B6742B34E8A73587CA28AE16B3E; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            GrabStart_RotateCurve_27_C5479FCC425552F0F4BC909DACABD64C; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GrabStart_TimeRateMin_19_87531055455DA591114A90A0F6F447A3; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GrabStart_TimeRateMax_20_9B305FDE42FE4B8E113AFD9C18ECF246; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GrabStart_SpeedRateMin_21_4BDCDFEB42E781B097C1C8A1C7B231E5; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GrabStart_SpeedRateMax_22_12CFB4B8445D7D53171CF5AD320D024F; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GrabStart_RotateRateMin_23_3F88DDF44A62BD3BF1C14287EAF19623; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GrabStart_RotateRateMax_24_B873F84E4AAB1E5B2A24938BE2A35CAA; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GrabLiftUp_DelayTime_25_663AC25F4331CD1F940EC7AF28960224; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ParticleRateCapture_64_A5E38D3F48168D88C832D6BAB9358AA1; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ParticleRateCaptureAura_70_EE20E5904E826BEB169C898EBBF9E27F; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ParticleRateFire_32_1B818E0143AF4082E92EF68537E3398D; // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ParticleRateThunder_33_B9111F8340606DA7AF95438205E67AD6; // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ParticleRateCopy_34_C6F4D1A948CA2369051EDC87038F1262; // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ParticleSizeCapture_65_94D0414A4D5528534C57A7A4EF52B696; // 0x0040(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ParticleSizeCaptureAura_73_1B82CF4047B9951156068D9481868BE0; // 0x004C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ParticleSizeFireMin_74_FE786F1F4B1ED1B4FBFC1ABA889BC546; // 0x0058(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ParticleSizeFireMax_77_A96E1CAE4E565949DECC33872B9C2E5B; // 0x0064(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ParticleSizeThunderMin_78_5911E3F14A47B7203DF69A92DA90E77F; // 0x0070(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ParticleSizeThunderMax_80_48A72BC849645E3B89B520AF9EE32AA7; // 0x007C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ParticleSizeCopy_46_678BFE374FE86F17CA214092B42E15B6; // 0x0088(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraShakeScale_58_CC171A1A444B65836186D8B32644BFAC; // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CameraShakeTypeThrow_53_BA913E8F4BD8351AF46F7EB6452D2383; // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CameraShakeTypeDrop_54_868DCEE54C124A080D72F1897BEA8E90; // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CameraShakeTypeSwing_55_F9E4225C44D8C3839BE84081A69ECB60; // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPsychicGrabMovementSizeData) == 0x000008, "Wrong alignment on FPsychicGrabMovementSizeData");
static_assert(sizeof(FPsychicGrabMovementSizeData) == 0x0000B0, "Wrong size on FPsychicGrabMovementSizeData");
static_assert(offsetof(FPsychicGrabMovementSizeData, GrabStart_SpeedCurve_26_8CFF8B6742B34E8A73587CA28AE16B3E) == 0x000000, "Member 'FPsychicGrabMovementSizeData::GrabStart_SpeedCurve_26_8CFF8B6742B34E8A73587CA28AE16B3E' has a wrong offset!");
static_assert(offsetof(FPsychicGrabMovementSizeData, GrabStart_RotateCurve_27_C5479FCC425552F0F4BC909DACABD64C) == 0x000008, "Member 'FPsychicGrabMovementSizeData::GrabStart_RotateCurve_27_C5479FCC425552F0F4BC909DACABD64C' has a wrong offset!");
static_assert(offsetof(FPsychicGrabMovementSizeData, GrabStart_TimeRateMin_19_87531055455DA591114A90A0F6F447A3) == 0x000010, "Member 'FPsychicGrabMovementSizeData::GrabStart_TimeRateMin_19_87531055455DA591114A90A0F6F447A3' has a wrong offset!");
static_assert(offsetof(FPsychicGrabMovementSizeData, GrabStart_TimeRateMax_20_9B305FDE42FE4B8E113AFD9C18ECF246) == 0x000014, "Member 'FPsychicGrabMovementSizeData::GrabStart_TimeRateMax_20_9B305FDE42FE4B8E113AFD9C18ECF246' has a wrong offset!");
static_assert(offsetof(FPsychicGrabMovementSizeData, GrabStart_SpeedRateMin_21_4BDCDFEB42E781B097C1C8A1C7B231E5) == 0x000018, "Member 'FPsychicGrabMovementSizeData::GrabStart_SpeedRateMin_21_4BDCDFEB42E781B097C1C8A1C7B231E5' has a wrong offset!");
static_assert(offsetof(FPsychicGrabMovementSizeData, GrabStart_SpeedRateMax_22_12CFB4B8445D7D53171CF5AD320D024F) == 0x00001C, "Member 'FPsychicGrabMovementSizeData::GrabStart_SpeedRateMax_22_12CFB4B8445D7D53171CF5AD320D024F' has a wrong offset!");
static_assert(offsetof(FPsychicGrabMovementSizeData, GrabStart_RotateRateMin_23_3F88DDF44A62BD3BF1C14287EAF19623) == 0x000020, "Member 'FPsychicGrabMovementSizeData::GrabStart_RotateRateMin_23_3F88DDF44A62BD3BF1C14287EAF19623' has a wrong offset!");
static_assert(offsetof(FPsychicGrabMovementSizeData, GrabStart_RotateRateMax_24_B873F84E4AAB1E5B2A24938BE2A35CAA) == 0x000024, "Member 'FPsychicGrabMovementSizeData::GrabStart_RotateRateMax_24_B873F84E4AAB1E5B2A24938BE2A35CAA' has a wrong offset!");
static_assert(offsetof(FPsychicGrabMovementSizeData, GrabLiftUp_DelayTime_25_663AC25F4331CD1F940EC7AF28960224) == 0x000028, "Member 'FPsychicGrabMovementSizeData::GrabLiftUp_DelayTime_25_663AC25F4331CD1F940EC7AF28960224' has a wrong offset!");
static_assert(offsetof(FPsychicGrabMovementSizeData, ParticleRateCapture_64_A5E38D3F48168D88C832D6BAB9358AA1) == 0x00002C, "Member 'FPsychicGrabMovementSizeData::ParticleRateCapture_64_A5E38D3F48168D88C832D6BAB9358AA1' has a wrong offset!");
static_assert(offsetof(FPsychicGrabMovementSizeData, ParticleRateCaptureAura_70_EE20E5904E826BEB169C898EBBF9E27F) == 0x000030, "Member 'FPsychicGrabMovementSizeData::ParticleRateCaptureAura_70_EE20E5904E826BEB169C898EBBF9E27F' has a wrong offset!");
static_assert(offsetof(FPsychicGrabMovementSizeData, ParticleRateFire_32_1B818E0143AF4082E92EF68537E3398D) == 0x000034, "Member 'FPsychicGrabMovementSizeData::ParticleRateFire_32_1B818E0143AF4082E92EF68537E3398D' has a wrong offset!");
static_assert(offsetof(FPsychicGrabMovementSizeData, ParticleRateThunder_33_B9111F8340606DA7AF95438205E67AD6) == 0x000038, "Member 'FPsychicGrabMovementSizeData::ParticleRateThunder_33_B9111F8340606DA7AF95438205E67AD6' has a wrong offset!");
static_assert(offsetof(FPsychicGrabMovementSizeData, ParticleRateCopy_34_C6F4D1A948CA2369051EDC87038F1262) == 0x00003C, "Member 'FPsychicGrabMovementSizeData::ParticleRateCopy_34_C6F4D1A948CA2369051EDC87038F1262' has a wrong offset!");
static_assert(offsetof(FPsychicGrabMovementSizeData, ParticleSizeCapture_65_94D0414A4D5528534C57A7A4EF52B696) == 0x000040, "Member 'FPsychicGrabMovementSizeData::ParticleSizeCapture_65_94D0414A4D5528534C57A7A4EF52B696' has a wrong offset!");
static_assert(offsetof(FPsychicGrabMovementSizeData, ParticleSizeCaptureAura_73_1B82CF4047B9951156068D9481868BE0) == 0x00004C, "Member 'FPsychicGrabMovementSizeData::ParticleSizeCaptureAura_73_1B82CF4047B9951156068D9481868BE0' has a wrong offset!");
static_assert(offsetof(FPsychicGrabMovementSizeData, ParticleSizeFireMin_74_FE786F1F4B1ED1B4FBFC1ABA889BC546) == 0x000058, "Member 'FPsychicGrabMovementSizeData::ParticleSizeFireMin_74_FE786F1F4B1ED1B4FBFC1ABA889BC546' has a wrong offset!");
static_assert(offsetof(FPsychicGrabMovementSizeData, ParticleSizeFireMax_77_A96E1CAE4E565949DECC33872B9C2E5B) == 0x000064, "Member 'FPsychicGrabMovementSizeData::ParticleSizeFireMax_77_A96E1CAE4E565949DECC33872B9C2E5B' has a wrong offset!");
static_assert(offsetof(FPsychicGrabMovementSizeData, ParticleSizeThunderMin_78_5911E3F14A47B7203DF69A92DA90E77F) == 0x000070, "Member 'FPsychicGrabMovementSizeData::ParticleSizeThunderMin_78_5911E3F14A47B7203DF69A92DA90E77F' has a wrong offset!");
static_assert(offsetof(FPsychicGrabMovementSizeData, ParticleSizeThunderMax_80_48A72BC849645E3B89B520AF9EE32AA7) == 0x00007C, "Member 'FPsychicGrabMovementSizeData::ParticleSizeThunderMax_80_48A72BC849645E3B89B520AF9EE32AA7' has a wrong offset!");
static_assert(offsetof(FPsychicGrabMovementSizeData, ParticleSizeCopy_46_678BFE374FE86F17CA214092B42E15B6) == 0x000088, "Member 'FPsychicGrabMovementSizeData::ParticleSizeCopy_46_678BFE374FE86F17CA214092B42E15B6' has a wrong offset!");
static_assert(offsetof(FPsychicGrabMovementSizeData, CameraShakeScale_58_CC171A1A444B65836186D8B32644BFAC) == 0x000094, "Member 'FPsychicGrabMovementSizeData::CameraShakeScale_58_CC171A1A444B65836186D8B32644BFAC' has a wrong offset!");
static_assert(offsetof(FPsychicGrabMovementSizeData, CameraShakeTypeThrow_53_BA913E8F4BD8351AF46F7EB6452D2383) == 0x000098, "Member 'FPsychicGrabMovementSizeData::CameraShakeTypeThrow_53_BA913E8F4BD8351AF46F7EB6452D2383' has a wrong offset!");
static_assert(offsetof(FPsychicGrabMovementSizeData, CameraShakeTypeDrop_54_868DCEE54C124A080D72F1897BEA8E90) == 0x0000A0, "Member 'FPsychicGrabMovementSizeData::CameraShakeTypeDrop_54_868DCEE54C124A080D72F1897BEA8E90' has a wrong offset!");
static_assert(offsetof(FPsychicGrabMovementSizeData, CameraShakeTypeSwing_55_F9E4225C44D8C3839BE84081A69ECB60) == 0x0000A8, "Member 'FPsychicGrabMovementSizeData::CameraShakeTypeSwing_55_F9E4225C44D8C3839BE84081A69ECB60' has a wrong offset!");

}

