#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PsychicGrabComponent

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_SASKind_structs.hpp"
#include "Engine_structs.hpp"
#include "PsychicGrabPosData_structs.hpp"
#include "PsychicGrabButtonType_structs.hpp"
#include "PsychicObjectAttackType_structs.hpp"


namespace SDK::Params
{

// Function PsychicGrabComponent.PsychicGrabComponent_C.UpdatePsyActionPress__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PsychicGrabComponent_C_UpdatePsyActionPress__DelegateSignature final
{
public:
	EPsychicGrabButtonType                        button_type;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Press;                                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Psychic_combo;                                     // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FA5[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Obj_count;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabComponent_C_UpdatePsyActionPress__DelegateSignature) == 0x000004, "Wrong alignment on PsychicGrabComponent_C_UpdatePsyActionPress__DelegateSignature");
static_assert(sizeof(PsychicGrabComponent_C_UpdatePsyActionPress__DelegateSignature) == 0x000008, "Wrong size on PsychicGrabComponent_C_UpdatePsyActionPress__DelegateSignature");
static_assert(offsetof(PsychicGrabComponent_C_UpdatePsyActionPress__DelegateSignature, button_type) == 0x000000, "Member 'PsychicGrabComponent_C_UpdatePsyActionPress__DelegateSignature::button_type' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_UpdatePsyActionPress__DelegateSignature, Press) == 0x000001, "Member 'PsychicGrabComponent_C_UpdatePsyActionPress__DelegateSignature::Press' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_UpdatePsyActionPress__DelegateSignature, Psychic_combo) == 0x000002, "Member 'PsychicGrabComponent_C_UpdatePsyActionPress__DelegateSignature::Psychic_combo' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_UpdatePsyActionPress__DelegateSignature, Obj_count) == 0x000004, "Member 'PsychicGrabComponent_C_UpdatePsyActionPress__DelegateSignature::Obj_count' has a wrong offset!");

// Function PsychicGrabComponent.PsychicGrabComponent_C.UpdatePsyActionShow__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PsychicGrabComponent_C_UpdatePsyActionShow__DelegateSignature final
{
public:
	EPsychicGrabButtonType                        button_type;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Show;                                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FA6[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Obj_count;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabComponent_C_UpdatePsyActionShow__DelegateSignature) == 0x000004, "Wrong alignment on PsychicGrabComponent_C_UpdatePsyActionShow__DelegateSignature");
static_assert(sizeof(PsychicGrabComponent_C_UpdatePsyActionShow__DelegateSignature) == 0x000008, "Wrong size on PsychicGrabComponent_C_UpdatePsyActionShow__DelegateSignature");
static_assert(offsetof(PsychicGrabComponent_C_UpdatePsyActionShow__DelegateSignature, button_type) == 0x000000, "Member 'PsychicGrabComponent_C_UpdatePsyActionShow__DelegateSignature::button_type' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_UpdatePsyActionShow__DelegateSignature, Show) == 0x000001, "Member 'PsychicGrabComponent_C_UpdatePsyActionShow__DelegateSignature::Show' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_UpdatePsyActionShow__DelegateSignature, Obj_count) == 0x000004, "Member 'PsychicGrabComponent_C_UpdatePsyActionShow__DelegateSignature::Obj_count' has a wrong offset!");

// Function PsychicGrabComponent.PsychicGrabComponent_C.UpdatePsyActionEnable__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PsychicGrabComponent_C_UpdatePsyActionEnable__DelegateSignature final
{
public:
	EPsychicGrabButtonType                        button_type;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FA7[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Obj_count;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabComponent_C_UpdatePsyActionEnable__DelegateSignature) == 0x000004, "Wrong alignment on PsychicGrabComponent_C_UpdatePsyActionEnable__DelegateSignature");
static_assert(sizeof(PsychicGrabComponent_C_UpdatePsyActionEnable__DelegateSignature) == 0x000008, "Wrong size on PsychicGrabComponent_C_UpdatePsyActionEnable__DelegateSignature");
static_assert(offsetof(PsychicGrabComponent_C_UpdatePsyActionEnable__DelegateSignature, button_type) == 0x000000, "Member 'PsychicGrabComponent_C_UpdatePsyActionEnable__DelegateSignature::button_type' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_UpdatePsyActionEnable__DelegateSignature, Enable) == 0x000001, "Member 'PsychicGrabComponent_C_UpdatePsyActionEnable__DelegateSignature::Enable' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_UpdatePsyActionEnable__DelegateSignature, Obj_count) == 0x000004, "Member 'PsychicGrabComponent_C_UpdatePsyActionEnable__DelegateSignature::Obj_count' has a wrong offset!");

// Function PsychicGrabComponent.PsychicGrabComponent_C.UpdatePsyActionCount__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PsychicGrabComponent_C_UpdatePsyActionCount__DelegateSignature final
{
public:
	EPsychicGrabButtonType                        button_type;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7FA8[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Obj_count;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabComponent_C_UpdatePsyActionCount__DelegateSignature) == 0x000004, "Wrong alignment on PsychicGrabComponent_C_UpdatePsyActionCount__DelegateSignature");
static_assert(sizeof(PsychicGrabComponent_C_UpdatePsyActionCount__DelegateSignature) == 0x000008, "Wrong size on PsychicGrabComponent_C_UpdatePsyActionCount__DelegateSignature");
static_assert(offsetof(PsychicGrabComponent_C_UpdatePsyActionCount__DelegateSignature, button_type) == 0x000000, "Member 'PsychicGrabComponent_C_UpdatePsyActionCount__DelegateSignature::button_type' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_UpdatePsyActionCount__DelegateSignature, Obj_count) == 0x000004, "Member 'PsychicGrabComponent_C_UpdatePsyActionCount__DelegateSignature::Obj_count' has a wrong offset!");

// Function PsychicGrabComponent.PsychicGrabComponent_C.UpdatePsyActionPress2__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PsychicGrabComponent_C_UpdatePsyActionPress2__DelegateSignature final
{
public:
	bool                                          Unique;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Press;                                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Psychic_combo;                                     // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FA9[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Obj_count;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabComponent_C_UpdatePsyActionPress2__DelegateSignature) == 0x000004, "Wrong alignment on PsychicGrabComponent_C_UpdatePsyActionPress2__DelegateSignature");
static_assert(sizeof(PsychicGrabComponent_C_UpdatePsyActionPress2__DelegateSignature) == 0x000008, "Wrong size on PsychicGrabComponent_C_UpdatePsyActionPress2__DelegateSignature");
static_assert(offsetof(PsychicGrabComponent_C_UpdatePsyActionPress2__DelegateSignature, Unique) == 0x000000, "Member 'PsychicGrabComponent_C_UpdatePsyActionPress2__DelegateSignature::Unique' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_UpdatePsyActionPress2__DelegateSignature, Press) == 0x000001, "Member 'PsychicGrabComponent_C_UpdatePsyActionPress2__DelegateSignature::Press' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_UpdatePsyActionPress2__DelegateSignature, Psychic_combo) == 0x000002, "Member 'PsychicGrabComponent_C_UpdatePsyActionPress2__DelegateSignature::Psychic_combo' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_UpdatePsyActionPress2__DelegateSignature, Obj_count) == 0x000004, "Member 'PsychicGrabComponent_C_UpdatePsyActionPress2__DelegateSignature::Obj_count' has a wrong offset!");

// Function PsychicGrabComponent.PsychicGrabComponent_C.UpdatePsyActionShow2__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PsychicGrabComponent_C_UpdatePsyActionShow2__DelegateSignature final
{
public:
	bool                                          Unique;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Show;                                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FAA[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Obj_count;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabComponent_C_UpdatePsyActionShow2__DelegateSignature) == 0x000004, "Wrong alignment on PsychicGrabComponent_C_UpdatePsyActionShow2__DelegateSignature");
static_assert(sizeof(PsychicGrabComponent_C_UpdatePsyActionShow2__DelegateSignature) == 0x000008, "Wrong size on PsychicGrabComponent_C_UpdatePsyActionShow2__DelegateSignature");
static_assert(offsetof(PsychicGrabComponent_C_UpdatePsyActionShow2__DelegateSignature, Unique) == 0x000000, "Member 'PsychicGrabComponent_C_UpdatePsyActionShow2__DelegateSignature::Unique' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_UpdatePsyActionShow2__DelegateSignature, Show) == 0x000001, "Member 'PsychicGrabComponent_C_UpdatePsyActionShow2__DelegateSignature::Show' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_UpdatePsyActionShow2__DelegateSignature, Obj_count) == 0x000004, "Member 'PsychicGrabComponent_C_UpdatePsyActionShow2__DelegateSignature::Obj_count' has a wrong offset!");

// Function PsychicGrabComponent.PsychicGrabComponent_C.UpdatePsyActionEnable2__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PsychicGrabComponent_C_UpdatePsyActionEnable2__DelegateSignature final
{
public:
	bool                                          Unique;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Enable;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FAB[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Obj_count;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabComponent_C_UpdatePsyActionEnable2__DelegateSignature) == 0x000004, "Wrong alignment on PsychicGrabComponent_C_UpdatePsyActionEnable2__DelegateSignature");
static_assert(sizeof(PsychicGrabComponent_C_UpdatePsyActionEnable2__DelegateSignature) == 0x000008, "Wrong size on PsychicGrabComponent_C_UpdatePsyActionEnable2__DelegateSignature");
static_assert(offsetof(PsychicGrabComponent_C_UpdatePsyActionEnable2__DelegateSignature, Unique) == 0x000000, "Member 'PsychicGrabComponent_C_UpdatePsyActionEnable2__DelegateSignature::Unique' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_UpdatePsyActionEnable2__DelegateSignature, Enable) == 0x000001, "Member 'PsychicGrabComponent_C_UpdatePsyActionEnable2__DelegateSignature::Enable' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_UpdatePsyActionEnable2__DelegateSignature, Obj_count) == 0x000004, "Member 'PsychicGrabComponent_C_UpdatePsyActionEnable2__DelegateSignature::Obj_count' has a wrong offset!");

// Function PsychicGrabComponent.PsychicGrabComponent_C.UpdatePsyActionCount2__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PsychicGrabComponent_C_UpdatePsyActionCount2__DelegateSignature final
{
public:
	bool                                          Unique;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FAC[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Obj_count;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabComponent_C_UpdatePsyActionCount2__DelegateSignature) == 0x000004, "Wrong alignment on PsychicGrabComponent_C_UpdatePsyActionCount2__DelegateSignature");
static_assert(sizeof(PsychicGrabComponent_C_UpdatePsyActionCount2__DelegateSignature) == 0x000008, "Wrong size on PsychicGrabComponent_C_UpdatePsyActionCount2__DelegateSignature");
static_assert(offsetof(PsychicGrabComponent_C_UpdatePsyActionCount2__DelegateSignature, Unique) == 0x000000, "Member 'PsychicGrabComponent_C_UpdatePsyActionCount2__DelegateSignature::Unique' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_UpdatePsyActionCount2__DelegateSignature, Obj_count) == 0x000004, "Member 'PsychicGrabComponent_C_UpdatePsyActionCount2__DelegateSignature::Obj_count' has a wrong offset!");

// Function PsychicGrabComponent.PsychicGrabComponent_C.ExecuteUbergraph_PsychicGrabComponent
// 0x0008 (0x0008 - 0x0000)
struct PsychicGrabComponent_C_ExecuteUbergraph_PsychicGrabComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabComponent_C_ExecuteUbergraph_PsychicGrabComponent) == 0x000004, "Wrong alignment on PsychicGrabComponent_C_ExecuteUbergraph_PsychicGrabComponent");
static_assert(sizeof(PsychicGrabComponent_C_ExecuteUbergraph_PsychicGrabComponent) == 0x000008, "Wrong size on PsychicGrabComponent_C_ExecuteUbergraph_PsychicGrabComponent");
static_assert(offsetof(PsychicGrabComponent_C_ExecuteUbergraph_PsychicGrabComponent, EntryPoint) == 0x000000, "Member 'PsychicGrabComponent_C_ExecuteUbergraph_PsychicGrabComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_ExecuteUbergraph_PsychicGrabComponent, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'PsychicGrabComponent_C_ExecuteUbergraph_PsychicGrabComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function PsychicGrabComponent.PsychicGrabComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct PsychicGrabComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on PsychicGrabComponent_C_ReceiveTick");
static_assert(sizeof(PsychicGrabComponent_C_ReceiveTick) == 0x000004, "Wrong size on PsychicGrabComponent_C_ReceiveTick");
static_assert(offsetof(PsychicGrabComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'PsychicGrabComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function PsychicGrabComponent.PsychicGrabComponent_C.Initialize
// 0x00D8 (0x00D8 - 0x0000)
struct PsychicGrabComponent_C_Initialize final
{
public:
	class USphereComponent*                       Collision;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           DT_Size_NameList;                                  // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	PsychicObjectAttackType::EPsychicObjectAttackType AttackTypeSwing;                                   // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPsychicGrabButtonType                        buttonMax;                                         // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7FAD[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APsychicObjectManager_C*                CallFunc_GetPsychicObjectManager_PsyObjManager;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FAE[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface>      CallFunc_GetPlayerID_self_CastInput;               // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7FAF[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FB0[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7FB1[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array_1;                          // 0x0078(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array_2;                          // 0x0090(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARsBattleHero_C*                        K2Node_DynamicCast_AsRs_Battle_Hero;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FB2[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabComponent_C_Initialize) == 0x000008, "Wrong alignment on PsychicGrabComponent_C_Initialize");
static_assert(sizeof(PsychicGrabComponent_C_Initialize) == 0x0000D8, "Wrong size on PsychicGrabComponent_C_Initialize");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, Collision) == 0x000000, "Member 'PsychicGrabComponent_C_Initialize::Collision' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, DT_Size_NameList) == 0x000008, "Member 'PsychicGrabComponent_C_Initialize::DT_Size_NameList' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, AttackTypeSwing) == 0x000018, "Member 'PsychicGrabComponent_C_Initialize::AttackTypeSwing' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, buttonMax) == 0x000019, "Member 'PsychicGrabComponent_C_Initialize::buttonMax' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'PsychicGrabComponent_C_Initialize::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, Temp_int_Loop_Num_Variable) == 0x000020, "Member 'PsychicGrabComponent_C_Initialize::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, Temp_int_Variable) == 0x000024, "Member 'PsychicGrabComponent_C_Initialize::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, CallFunc_GetPsychicObjectManager_PsyObjManager) == 0x000028, "Member 'PsychicGrabComponent_C_Initialize::CallFunc_GetPsychicObjectManager_PsyObjManager' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'PsychicGrabComponent_C_Initialize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, CallFunc_GetPlayerID_self_CastInput) == 0x000038, "Member 'PsychicGrabComponent_C_Initialize::CallFunc_GetPlayerID_self_CastInput' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, CallFunc_GetPlayerID_ReturnValue) == 0x000048, "Member 'PsychicGrabComponent_C_Initialize::CallFunc_GetPlayerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'PsychicGrabComponent_C_Initialize::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'PsychicGrabComponent_C_Initialize::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'PsychicGrabComponent_C_Initialize::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'PsychicGrabComponent_C_Initialize::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, K2Node_MakeArray_Array) == 0x000060, "Member 'PsychicGrabComponent_C_Initialize::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, CallFunc_Add_IntInt_ReturnValue_1) == 0x000070, "Member 'PsychicGrabComponent_C_Initialize::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, CallFunc_Add_IntInt_ReturnValue_2) == 0x000074, "Member 'PsychicGrabComponent_C_Initialize::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, K2Node_MakeArray_Array_1) == 0x000078, "Member 'PsychicGrabComponent_C_Initialize::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, CallFunc_Add_IntInt_ReturnValue_3) == 0x000088, "Member 'PsychicGrabComponent_C_Initialize::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, CallFunc_Add_IntInt_ReturnValue_4) == 0x00008C, "Member 'PsychicGrabComponent_C_Initialize::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, K2Node_MakeArray_Array_2) == 0x000090, "Member 'PsychicGrabComponent_C_Initialize::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000A0, "Member 'PsychicGrabComponent_C_Initialize::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x0000A4, "Member 'PsychicGrabComponent_C_Initialize::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x0000A8, "Member 'PsychicGrabComponent_C_Initialize::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, CallFunc_Add_IntInt_ReturnValue_5) == 0x0000AC, "Member 'PsychicGrabComponent_C_Initialize::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, CallFunc_GetOwner_ReturnValue) == 0x0000B0, "Member 'PsychicGrabComponent_C_Initialize::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, K2Node_DynamicCast_AsRs_Battle_Hero) == 0x0000B8, "Member 'PsychicGrabComponent_C_Initialize::K2Node_DynamicCast_AsRs_Battle_Hero' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'PsychicGrabComponent_C_Initialize::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, CallFunc_Add_IntInt_ReturnValue_6) == 0x0000C4, "Member 'PsychicGrabComponent_C_Initialize::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, CallFunc_Multiply_IntInt_ReturnValue) == 0x0000C8, "Member 'PsychicGrabComponent_C_Initialize::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000CC, "Member 'PsychicGrabComponent_C_Initialize::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_Initialize, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x0000D0, "Member 'PsychicGrabComponent_C_Initialize::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");

// Function PsychicGrabComponent.PsychicGrabComponent_C.Update
// 0x0010 (0x0010 - 0x0000)
struct PsychicGrabComponent_C_Update final
{
public:
	class FString                                 WorkStr;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabComponent_C_Update) == 0x000008, "Wrong alignment on PsychicGrabComponent_C_Update");
static_assert(sizeof(PsychicGrabComponent_C_Update) == 0x000010, "Wrong size on PsychicGrabComponent_C_Update");
static_assert(offsetof(PsychicGrabComponent_C_Update, WorkStr) == 0x000000, "Member 'PsychicGrabComponent_C_Update::WorkStr' has a wrong offset!");

// Function PsychicGrabComponent.PsychicGrabComponent_C.UpdateGrabList
// 0x0020 (0x0020 - 0x0000)
struct PsychicGrabComponent_C_UpdateGrabList final
{
public:
	class ABP_PsychicObjectBasic_C*               WorkCopyObj;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WorkReloadCheck;                                   // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FB3[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PsychicObjectBasic_C*               WorkPsyObj;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	PsychicObjectAttackType::EPsychicObjectAttackType WorkAttackType;                                    // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCallDispatcher;                                   // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PsychicGrabComponent_C_UpdateGrabList) == 0x000008, "Wrong alignment on PsychicGrabComponent_C_UpdateGrabList");
static_assert(sizeof(PsychicGrabComponent_C_UpdateGrabList) == 0x000020, "Wrong size on PsychicGrabComponent_C_UpdateGrabList");
static_assert(offsetof(PsychicGrabComponent_C_UpdateGrabList, WorkCopyObj) == 0x000000, "Member 'PsychicGrabComponent_C_UpdateGrabList::WorkCopyObj' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_UpdateGrabList, WorkReloadCheck) == 0x000008, "Member 'PsychicGrabComponent_C_UpdateGrabList::WorkReloadCheck' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_UpdateGrabList, WorkPsyObj) == 0x000010, "Member 'PsychicGrabComponent_C_UpdateGrabList::WorkPsyObj' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_UpdateGrabList, WorkAttackType) == 0x000018, "Member 'PsychicGrabComponent_C_UpdateGrabList::WorkAttackType' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_UpdateGrabList, bCallDispatcher) == 0x000019, "Member 'PsychicGrabComponent_C_UpdateGrabList::bCallDispatcher' has a wrong offset!");

// Function PsychicGrabComponent.PsychicGrabComponent_C.ThrowAll
// 0x0070 (0x0070 - 0x0000)
struct PsychicGrabComponent_C_ThrowAll final
{
public:
	class AActor*                                 L_TargetActor;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetThrowAllData_throw_all_index;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetThrowAllData_throw_all_angle;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetThrowAllData_throw_all_offset;         // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FB4[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_getTargetActor_targetActor;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FB5[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetThrowAllData_throw_all_index_1;        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetThrowAllData_throw_all_angle_1;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetThrowAllData_throw_all_offset_1;       // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabComponent_C_ThrowAll) == 0x000008, "Wrong alignment on PsychicGrabComponent_C_ThrowAll");
static_assert(sizeof(PsychicGrabComponent_C_ThrowAll) == 0x000070, "Wrong size on PsychicGrabComponent_C_ThrowAll");
static_assert(offsetof(PsychicGrabComponent_C_ThrowAll, L_TargetActor) == 0x000000, "Member 'PsychicGrabComponent_C_ThrowAll::L_TargetActor' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_ThrowAll, Temp_int_Array_Index_Variable) == 0x000008, "Member 'PsychicGrabComponent_C_ThrowAll::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_ThrowAll, Temp_int_Loop_Num_Variable) == 0x00000C, "Member 'PsychicGrabComponent_C_ThrowAll::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_ThrowAll, CallFunc_GetThrowAllData_throw_all_index) == 0x000010, "Member 'PsychicGrabComponent_C_ThrowAll::CallFunc_GetThrowAllData_throw_all_index' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_ThrowAll, CallFunc_GetThrowAllData_throw_all_angle) == 0x000014, "Member 'PsychicGrabComponent_C_ThrowAll::CallFunc_GetThrowAllData_throw_all_angle' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_ThrowAll, CallFunc_GetThrowAllData_throw_all_offset) == 0x000018, "Member 'PsychicGrabComponent_C_ThrowAll::CallFunc_GetThrowAllData_throw_all_offset' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_ThrowAll, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'PsychicGrabComponent_C_ThrowAll::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_ThrowAll, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'PsychicGrabComponent_C_ThrowAll::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_ThrowAll, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'PsychicGrabComponent_C_ThrowAll::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_ThrowAll, Temp_int_Loop_Counter_Variable_1) == 0x000030, "Member 'PsychicGrabComponent_C_ThrowAll::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_ThrowAll, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'PsychicGrabComponent_C_ThrowAll::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_ThrowAll, CallFunc_getTargetActor_targetActor) == 0x000038, "Member 'PsychicGrabComponent_C_ThrowAll::CallFunc_getTargetActor_targetActor' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_ThrowAll, Temp_int_Array_Index_Variable_1) == 0x000040, "Member 'PsychicGrabComponent_C_ThrowAll::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_ThrowAll, Temp_int_Loop_Num_Variable_1) == 0x000044, "Member 'PsychicGrabComponent_C_ThrowAll::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_ThrowAll, CallFunc_Less_IntInt_ReturnValue_1) == 0x000048, "Member 'PsychicGrabComponent_C_ThrowAll::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_ThrowAll, CallFunc_Add_IntInt_ReturnValue_2) == 0x00004C, "Member 'PsychicGrabComponent_C_ThrowAll::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_ThrowAll, CallFunc_GetThrowAllData_throw_all_index_1) == 0x000050, "Member 'PsychicGrabComponent_C_ThrowAll::CallFunc_GetThrowAllData_throw_all_index_1' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_ThrowAll, CallFunc_GetThrowAllData_throw_all_angle_1) == 0x000054, "Member 'PsychicGrabComponent_C_ThrowAll::CallFunc_GetThrowAllData_throw_all_angle_1' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_ThrowAll, CallFunc_GetThrowAllData_throw_all_offset_1) == 0x000058, "Member 'PsychicGrabComponent_C_ThrowAll::CallFunc_GetThrowAllData_throw_all_offset_1' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_ThrowAll, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'PsychicGrabComponent_C_ThrowAll::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_ThrowAll, CallFunc_Array_Length_ReturnValue_1) == 0x000068, "Member 'PsychicGrabComponent_C_ThrowAll::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");

// Function PsychicGrabComponent.PsychicGrabComponent_C.AddSearchListOld
// 0x0010 (0x0010 - 0x0000)
struct PsychicGrabComponent_C_AddSearchListOld final
{
public:
	class AActor*                                 Actor_in;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          L_bSource;                                         // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          L_bUnique;                                         // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PsychicGrabComponent_C_AddSearchListOld) == 0x000008, "Wrong alignment on PsychicGrabComponent_C_AddSearchListOld");
static_assert(sizeof(PsychicGrabComponent_C_AddSearchListOld) == 0x000010, "Wrong size on PsychicGrabComponent_C_AddSearchListOld");
static_assert(offsetof(PsychicGrabComponent_C_AddSearchListOld, Actor_in) == 0x000000, "Member 'PsychicGrabComponent_C_AddSearchListOld::Actor_in' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_AddSearchListOld, L_bSource) == 0x000008, "Member 'PsychicGrabComponent_C_AddSearchListOld::L_bSource' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_AddSearchListOld, L_bUnique) == 0x000009, "Member 'PsychicGrabComponent_C_AddSearchListOld::L_bUnique' has a wrong offset!");

// Function PsychicGrabComponent.PsychicGrabComponent_C.GetGrabObjByIndex
// 0x0048 (0x0048 - 0x0000)
struct PsychicGrabComponent_C_GetGrabObjByIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Valid;                                             // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FB6[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PsychicObjectBasic_C*               GrabObj;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PsychicObjectBasic_C*               L_psyObj;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_grabIndex;                                       // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFound;                                            // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FB7[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FB8[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FB9[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckGrabIndex_return;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FBA[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FBB[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabComponent_C_GetGrabObjByIndex) == 0x000008, "Wrong alignment on PsychicGrabComponent_C_GetGrabObjByIndex");
static_assert(sizeof(PsychicGrabComponent_C_GetGrabObjByIndex) == 0x000048, "Wrong size on PsychicGrabComponent_C_GetGrabObjByIndex");
static_assert(offsetof(PsychicGrabComponent_C_GetGrabObjByIndex, Param_Index) == 0x000000, "Member 'PsychicGrabComponent_C_GetGrabObjByIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_GetGrabObjByIndex, Valid) == 0x000004, "Member 'PsychicGrabComponent_C_GetGrabObjByIndex::Valid' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_GetGrabObjByIndex, GrabObj) == 0x000008, "Member 'PsychicGrabComponent_C_GetGrabObjByIndex::GrabObj' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_GetGrabObjByIndex, L_psyObj) == 0x000010, "Member 'PsychicGrabComponent_C_GetGrabObjByIndex::L_psyObj' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_GetGrabObjByIndex, L_grabIndex) == 0x000018, "Member 'PsychicGrabComponent_C_GetGrabObjByIndex::L_grabIndex' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_GetGrabObjByIndex, bFound) == 0x00001C, "Member 'PsychicGrabComponent_C_GetGrabObjByIndex::bFound' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_GetGrabObjByIndex, Temp_bool_True_if_break_was_hit_Variable) == 0x00001D, "Member 'PsychicGrabComponent_C_GetGrabObjByIndex::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_GetGrabObjByIndex, Temp_int_Array_Index_Variable) == 0x000020, "Member 'PsychicGrabComponent_C_GetGrabObjByIndex::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_GetGrabObjByIndex, CallFunc_Not_PreBool_ReturnValue) == 0x000024, "Member 'PsychicGrabComponent_C_GetGrabObjByIndex::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_GetGrabObjByIndex, Temp_int_Loop_Num_Variable) == 0x000028, "Member 'PsychicGrabComponent_C_GetGrabObjByIndex::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_GetGrabObjByIndex, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'PsychicGrabComponent_C_GetGrabObjByIndex::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_GetGrabObjByIndex, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'PsychicGrabComponent_C_GetGrabObjByIndex::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_GetGrabObjByIndex, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'PsychicGrabComponent_C_GetGrabObjByIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_GetGrabObjByIndex, CallFunc_BooleanAND_ReturnValue) == 0x000038, "Member 'PsychicGrabComponent_C_GetGrabObjByIndex::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_GetGrabObjByIndex, CallFunc_CheckGrabIndex_return) == 0x000039, "Member 'PsychicGrabComponent_C_GetGrabObjByIndex::CallFunc_CheckGrabIndex_return' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_GetGrabObjByIndex, CallFunc_Add_IntInt_ReturnValue_1) == 0x00003C, "Member 'PsychicGrabComponent_C_GetGrabObjByIndex::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_GetGrabObjByIndex, CallFunc_Less_IntInt_ReturnValue_1) == 0x000040, "Member 'PsychicGrabComponent_C_GetGrabObjByIndex::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_GetGrabObjByIndex, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'PsychicGrabComponent_C_GetGrabObjByIndex::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function PsychicGrabComponent.PsychicGrabComponent_C.GetAttachPosByIndex
// 0x0028 (0x0028 - 0x0000)
struct PsychicGrabComponent_C_GetAttachPosByIndex final
{
public:
	int32                                         Table_index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Socket_name;                                       // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_float_pos;                                      // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Valid;                                             // 0x000D(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FBC[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Pos;                                               // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_pageNum;                                         // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_index;                                           // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_pageNo;                                          // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabComponent_C_GetAttachPosByIndex) == 0x000004, "Wrong alignment on PsychicGrabComponent_C_GetAttachPosByIndex");
static_assert(sizeof(PsychicGrabComponent_C_GetAttachPosByIndex) == 0x000028, "Wrong size on PsychicGrabComponent_C_GetAttachPosByIndex");
static_assert(offsetof(PsychicGrabComponent_C_GetAttachPosByIndex, Table_index) == 0x000000, "Member 'PsychicGrabComponent_C_GetAttachPosByIndex::Table_index' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_GetAttachPosByIndex, Socket_name) == 0x000004, "Member 'PsychicGrabComponent_C_GetAttachPosByIndex::Socket_name' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_GetAttachPosByIndex, Is_float_pos) == 0x00000C, "Member 'PsychicGrabComponent_C_GetAttachPosByIndex::Is_float_pos' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_GetAttachPosByIndex, Valid) == 0x00000D, "Member 'PsychicGrabComponent_C_GetAttachPosByIndex::Valid' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_GetAttachPosByIndex, Pos) == 0x000010, "Member 'PsychicGrabComponent_C_GetAttachPosByIndex::Pos' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_GetAttachPosByIndex, L_pageNum) == 0x00001C, "Member 'PsychicGrabComponent_C_GetAttachPosByIndex::L_pageNum' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_GetAttachPosByIndex, L_index) == 0x000020, "Member 'PsychicGrabComponent_C_GetAttachPosByIndex::L_index' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_GetAttachPosByIndex, L_pageNo) == 0x000024, "Member 'PsychicGrabComponent_C_GetAttachPosByIndex::L_pageNo' has a wrong offset!");

// Function PsychicGrabComponent.PsychicGrabComponent_C.InputPsychicCaptrue
// 0x0002 (0x0002 - 0x0000)
struct PsychicGrabComponent_C_InputPsychicCaptrue final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Return;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PsychicGrabComponent_C_InputPsychicCaptrue) == 0x000001, "Wrong alignment on PsychicGrabComponent_C_InputPsychicCaptrue");
static_assert(sizeof(PsychicGrabComponent_C_InputPsychicCaptrue) == 0x000002, "Wrong size on PsychicGrabComponent_C_InputPsychicCaptrue");
static_assert(offsetof(PsychicGrabComponent_C_InputPsychicCaptrue, bActive) == 0x000000, "Member 'PsychicGrabComponent_C_InputPsychicCaptrue::bActive' has a wrong offset!");
static_assert(offsetof(PsychicGrabComponent_C_InputPsychicCaptrue, Return) == 0x000001, "Member 'PsychicGrabComponent_C_InputPsychicCaptrue::Return' has a wrong offset!");

