#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PsychicSasParticleComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_SASKind_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PsychicSasParticleComponent.PsychicSasParticleComponent_C.ExecuteUbergraph_PsychicSasParticleComponent
// 0x0004 (0x0004 - 0x0000)
struct PsychicSasParticleComponent_C_ExecuteUbergraph_PsychicSasParticleComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicSasParticleComponent_C_ExecuteUbergraph_PsychicSasParticleComponent) == 0x000004, "Wrong alignment on PsychicSasParticleComponent_C_ExecuteUbergraph_PsychicSasParticleComponent");
static_assert(sizeof(PsychicSasParticleComponent_C_ExecuteUbergraph_PsychicSasParticleComponent) == 0x000004, "Wrong size on PsychicSasParticleComponent_C_ExecuteUbergraph_PsychicSasParticleComponent");
static_assert(offsetof(PsychicSasParticleComponent_C_ExecuteUbergraph_PsychicSasParticleComponent, EntryPoint) == 0x000000, "Member 'PsychicSasParticleComponent_C_ExecuteUbergraph_PsychicSasParticleComponent::EntryPoint' has a wrong offset!");

// Function PsychicSasParticleComponent.PsychicSasParticleComponent_C.SpawnParticleEffect
// 0x03F0 (0x03F0 - 0x0000)
struct PsychicSasParticleComponent_C_SpawnParticleEffect final
{
public:
	E_SASKind                                     SasKind;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Force;                                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Capture;                                           // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Attack;                                            // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5431[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         MeshComp;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rate;                                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Size;                                              // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RateAura;                                          // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SizeAura;                                          // 0x0024(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSParticleSystemComponentBase*         ParticleSystem;                                    // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        L_template;                                        // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSParticleSystemComponentBase*         L_particleExist;                                   // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSParticleSystemComponentBase*         L_particle;                                        // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSkeletalMesh;                                    // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5432[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         TargetMesh;                                        // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5433[0x5];                                     // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         CallFunc_SetParticleComponent_ReturnComponent;     // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x00D0(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_1;              // 0x0150(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_2;              // 0x01D0(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_3;              // 0x0250(0x0080)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5434[0x7];                                     // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue;                    // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARsBattleHero_C*                        K2Node_DynamicCast_AsRs_Battle_Hero;               // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5435[0x6];                                     // 0x02F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PsychicObjectBasic_C*               CallFunc_GetOwnerObject_Owner;                     // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_4;              // 0x0300(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x0380(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0390(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5436[0x7];                                     // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x03A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        CallFunc_GetAttackEmitterTemplate_Template;        // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSParticleSystemComponentBase*         CallFunc_GetParticleComponent_ParticleComponent;   // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        CallFunc_GetCaptureEmitterTemplate_Template;       // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_Select_Default;                             // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5437[0x7];                                     // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PsychicObjectBasic_C*               CallFunc_GetOwnerObject_Owner_1;                   // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PsychicObjectBasic_C*               CallFunc_GetOwnerObject_Owner_2;                   // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PsychicObjectBasic_C*               CallFunc_GetOwnerObject_Owner_3;                   // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveSAS_ForKind_IsActive;             // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_isGrab_return;                            // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PsychicSasParticleComponent_C_SpawnParticleEffect) == 0x000010, "Wrong alignment on PsychicSasParticleComponent_C_SpawnParticleEffect");
static_assert(sizeof(PsychicSasParticleComponent_C_SpawnParticleEffect) == 0x0003F0, "Wrong size on PsychicSasParticleComponent_C_SpawnParticleEffect");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, SasKind) == 0x000000, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::SasKind' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, Force) == 0x000001, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::Force' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, Capture) == 0x000002, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::Capture' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, Attack) == 0x000003, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::Attack' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, MeshComp) == 0x000008, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::MeshComp' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, Rate) == 0x000010, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::Rate' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, Size) == 0x000014, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::Size' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, RateAura) == 0x000020, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::RateAura' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, SizeAura) == 0x000024, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::SizeAura' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, ParticleSystem) == 0x000030, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::ParticleSystem' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, L_template) == 0x000038, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::L_template' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, L_particleExist) == 0x000040, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::L_particleExist' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, L_particle) == 0x000048, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::L_particle' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, IsSkeletalMesh) == 0x000050, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::IsSkeletalMesh' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, TargetMesh) == 0x000058, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::TargetMesh' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_GetDisplayName_ReturnValue) == 0x000060, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_GetDisplayName_ReturnValue_1) == 0x000070, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_Concat_StrStr_ReturnValue) == 0x000080, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000090, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000A0, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000B0, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000C0, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_IsValid_ReturnValue) == 0x0000C1, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_IsValid_ReturnValue_1) == 0x0000C2, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_SetParticleComponent_ReturnComponent) == 0x0000C8, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_SetParticleComponent_ReturnComponent' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, K2Node_MakeStruct_ParticleSysParam) == 0x0000D0, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, K2Node_MakeStruct_ParticleSysParam_1) == 0x000150, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::K2Node_MakeStruct_ParticleSysParam_1' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, K2Node_MakeStruct_ParticleSysParam_2) == 0x0001D0, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::K2Node_MakeStruct_ParticleSysParam_2' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, K2Node_MakeStruct_ParticleSysParam_3) == 0x000250, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::K2Node_MakeStruct_ParticleSysParam_3' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_IsValid_ReturnValue_2) == 0x0002D0, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_GetPlayerManager_PlayerManager) == 0x0002D8, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_GetPlayer_ReturnValue) == 0x0002E0, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_GetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, K2Node_DynamicCast_AsRs_Battle_Hero) == 0x0002E8, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::K2Node_DynamicCast_AsRs_Battle_Hero' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, K2Node_DynamicCast_bSuccess) == 0x0002F0, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, Temp_bool_Variable) == 0x0002F1, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_GetOwnerObject_Owner) == 0x0002F8, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_GetOwnerObject_Owner' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, K2Node_MakeStruct_ParticleSysParam_4) == 0x000300, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::K2Node_MakeStruct_ParticleSysParam_4' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, K2Node_MakeArray_Array) == 0x000380, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x000390, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, K2Node_DynamicCast_bSuccess_1) == 0x000398, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0003A0, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_GetAttackEmitterTemplate_Template) == 0x0003A8, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_GetAttackEmitterTemplate_Template' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_GetParticleComponent_ParticleComponent) == 0x0003B0, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_GetParticleComponent_ParticleComponent' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_GetCaptureEmitterTemplate_Template) == 0x0003B8, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_GetCaptureEmitterTemplate_Template' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, K2Node_Select_Default) == 0x0003C0, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_IsValid_ReturnValue_3) == 0x0003C8, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_GetOwnerObject_Owner_1) == 0x0003D0, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_GetOwnerObject_Owner_1' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_GetOwnerObject_Owner_2) == 0x0003D8, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_GetOwnerObject_Owner_2' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_GetOwnerObject_Owner_3) == 0x0003E0, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_GetOwnerObject_Owner_3' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_IsActiveSAS_ForKind_IsActive) == 0x0003E8, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_IsActiveSAS_ForKind_IsActive' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_isGrab_return) == 0x0003E9, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_isGrab_return' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnParticleEffect, CallFunc_BooleanAND_ReturnValue) == 0x0003EA, "Member 'PsychicSasParticleComponent_C_SpawnParticleEffect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function PsychicSasParticleComponent.PsychicSasParticleComponent_C.SpawnEffectOld
// 0x0150 (0x0150 - 0x0000)
struct PsychicSasParticleComponent_C_SpawnEffectOld final
{
public:
	E_SASKind                                     SasKind;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Force;                                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Capture;                                           // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5438[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Rate;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Size;                                              // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RateAura;                                          // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SizeAura;                                          // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSkeletalMesh;                                    // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5439[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         TargetMesh;                                        // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARsBattleHero_C*                        K2Node_DynamicCast_AsRs_Battle_Hero;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_543A[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PsychicObjectBasic_C*               CallFunc_GetOwnerObject_Owner;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_543B[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0060(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_543C[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        CallFunc_GetCaptureEmitterTemplate_Template;       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSParticleSystemComponentBase*         CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSParticleSystemComponentBase*         CallFunc_GetParticleComponent_ParticleComponent;   // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSParticleSystemComponentBase*         CallFunc_SetParticleComponent_ReturnComponent;     // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_543D[0x6];                                     // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PsychicObjectBasic_C*               CallFunc_GetOwnerObject_Owner_1;                   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PsychicObjectBasic_C*               CallFunc_GetOwnerObject_Owner_2;                   // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PsychicObjectBasic_C*               CallFunc_GetOwnerObject_Owner_3;                   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveSAS_ForKind_IsActive;             // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_isGrab_return;                            // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PsychicSasParticleComponent_C_SpawnEffectOld) == 0x000010, "Wrong alignment on PsychicSasParticleComponent_C_SpawnEffectOld");
static_assert(sizeof(PsychicSasParticleComponent_C_SpawnEffectOld) == 0x000150, "Wrong size on PsychicSasParticleComponent_C_SpawnEffectOld");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, SasKind) == 0x000000, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::SasKind' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, Force) == 0x000001, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::Force' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, Capture) == 0x000002, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::Capture' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, Rate) == 0x000004, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::Rate' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, Size) == 0x000008, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::Size' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, RateAura) == 0x000014, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::RateAura' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, SizeAura) == 0x000018, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::SizeAura' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, IsSkeletalMesh) == 0x000024, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::IsSkeletalMesh' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, TargetMesh) == 0x000028, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::TargetMesh' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, CallFunc_GetPlayerManager_PlayerManager) == 0x000030, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, CallFunc_GetPlayer_ReturnValue) == 0x000038, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::CallFunc_GetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, K2Node_DynamicCast_AsRs_Battle_Hero) == 0x000040, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::K2Node_DynamicCast_AsRs_Battle_Hero' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, CallFunc_GetOwnerObject_Owner) == 0x000050, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::CallFunc_GetOwnerObject_Owner' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000058, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, K2Node_MakeStruct_ParticleSysParam) == 0x000060, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, K2Node_MakeArray_Array) == 0x0000E0, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x0000F0, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, K2Node_DynamicCast_bSuccess_1) == 0x0000F8, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, CallFunc_GetCaptureEmitterTemplate_Template) == 0x000100, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::CallFunc_GetCaptureEmitterTemplate_Template' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000108, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, CallFunc_GetParticleComponent_ParticleComponent) == 0x000110, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::CallFunc_GetParticleComponent_ParticleComponent' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, CallFunc_SetParticleComponent_ReturnComponent) == 0x000118, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::CallFunc_SetParticleComponent_ReturnComponent' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, CallFunc_IsValid_ReturnValue) == 0x000120, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, CallFunc_IsValid_ReturnValue_1) == 0x000121, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, CallFunc_GetOwnerObject_Owner_1) == 0x000128, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::CallFunc_GetOwnerObject_Owner_1' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, CallFunc_GetOwnerObject_Owner_2) == 0x000130, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::CallFunc_GetOwnerObject_Owner_2' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, CallFunc_GetOwnerObject_Owner_3) == 0x000138, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::CallFunc_GetOwnerObject_Owner_3' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, CallFunc_IsActiveSAS_ForKind_IsActive) == 0x000140, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::CallFunc_IsActiveSAS_ForKind_IsActive' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, CallFunc_isGrab_return) == 0x000141, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::CallFunc_isGrab_return' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnEffectOld, CallFunc_BooleanAND_ReturnValue) == 0x000142, "Member 'PsychicSasParticleComponent_C_SpawnEffectOld::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function PsychicSasParticleComponent.PsychicSasParticleComponent_C.SpawnMeshEffect
// 0x0120 (0x0120 - 0x0000)
struct PsychicSasParticleComponent_C_SpawnMeshEffect final
{
public:
	class UMeshComponent*                         Mesh_in;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SASKind                                     Sas_kind_in;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Capture_in;                                        // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_543E[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Rate_in;                                           // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Size_in;                                           // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RateAura_in;                                       // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SizeAura_in;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_543F[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         Particle_system;                                   // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSParticleSystemComponentBase*         L_effect;                                          // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSkeletalMesh;                                    // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5440[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         TargetMesh;                                        // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5441[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PsychicObjectBasic_C*               CallFunc_GetOwnerObject_Owner;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5442[0x8];                                     // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0070(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class UParticleSystem*                        CallFunc_GetCaptureEmitterTemplate_Template;       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSParticleSystemComponentBase*         CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5443[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PsychicObjectBasic_C*               CallFunc_GetOwnerObject_Owner_1;                   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicSasParticleComponent_C_SpawnMeshEffect) == 0x000010, "Wrong alignment on PsychicSasParticleComponent_C_SpawnMeshEffect");
static_assert(sizeof(PsychicSasParticleComponent_C_SpawnMeshEffect) == 0x000120, "Wrong size on PsychicSasParticleComponent_C_SpawnMeshEffect");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnMeshEffect, Mesh_in) == 0x000000, "Member 'PsychicSasParticleComponent_C_SpawnMeshEffect::Mesh_in' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnMeshEffect, Sas_kind_in) == 0x000008, "Member 'PsychicSasParticleComponent_C_SpawnMeshEffect::Sas_kind_in' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnMeshEffect, Capture_in) == 0x000009, "Member 'PsychicSasParticleComponent_C_SpawnMeshEffect::Capture_in' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnMeshEffect, Rate_in) == 0x00000C, "Member 'PsychicSasParticleComponent_C_SpawnMeshEffect::Rate_in' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnMeshEffect, Size_in) == 0x000010, "Member 'PsychicSasParticleComponent_C_SpawnMeshEffect::Size_in' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnMeshEffect, RateAura_in) == 0x00001C, "Member 'PsychicSasParticleComponent_C_SpawnMeshEffect::RateAura_in' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnMeshEffect, SizeAura_in) == 0x000020, "Member 'PsychicSasParticleComponent_C_SpawnMeshEffect::SizeAura_in' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnMeshEffect, Particle_system) == 0x000030, "Member 'PsychicSasParticleComponent_C_SpawnMeshEffect::Particle_system' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnMeshEffect, L_effect) == 0x000038, "Member 'PsychicSasParticleComponent_C_SpawnMeshEffect::L_effect' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnMeshEffect, IsSkeletalMesh) == 0x000040, "Member 'PsychicSasParticleComponent_C_SpawnMeshEffect::IsSkeletalMesh' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnMeshEffect, TargetMesh) == 0x000048, "Member 'PsychicSasParticleComponent_C_SpawnMeshEffect::TargetMesh' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnMeshEffect, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x000050, "Member 'PsychicSasParticleComponent_C_SpawnMeshEffect::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnMeshEffect, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'PsychicSasParticleComponent_C_SpawnMeshEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnMeshEffect, CallFunc_GetOwnerObject_Owner) == 0x000060, "Member 'PsychicSasParticleComponent_C_SpawnMeshEffect::CallFunc_GetOwnerObject_Owner' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnMeshEffect, K2Node_MakeStruct_ParticleSysParam) == 0x000070, "Member 'PsychicSasParticleComponent_C_SpawnMeshEffect::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnMeshEffect, K2Node_MakeArray_Array) == 0x0000F0, "Member 'PsychicSasParticleComponent_C_SpawnMeshEffect::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnMeshEffect, CallFunc_GetCaptureEmitterTemplate_Template) == 0x000100, "Member 'PsychicSasParticleComponent_C_SpawnMeshEffect::CallFunc_GetCaptureEmitterTemplate_Template' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnMeshEffect, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000108, "Member 'PsychicSasParticleComponent_C_SpawnMeshEffect::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnMeshEffect, CallFunc_IsValid_ReturnValue) == 0x000110, "Member 'PsychicSasParticleComponent_C_SpawnMeshEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_SpawnMeshEffect, CallFunc_GetOwnerObject_Owner_1) == 0x000118, "Member 'PsychicSasParticleComponent_C_SpawnMeshEffect::CallFunc_GetOwnerObject_Owner_1' has a wrong offset!");

// Function PsychicSasParticleComponent.PsychicSasParticleComponent_C.DeactivateEffect
// 0x0050 (0x0050 - 0x0000)
struct PsychicSasParticleComponent_C_DeactivateEffect final
{
public:
	E_SASKind                                     SasKind;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Capture;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Attack;                                            // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5444[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         MeshComp;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSParticleSystemComponentBase*         L_particle;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSParticleSystemComponentBase*         CallFunc_GetParticleComponent_ParticleComponent;   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class URSParticleSystemComponentBase*         CallFunc_SetParticleComponent_ReturnComponent;     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PsychicSasParticleComponent_C_DeactivateEffect) == 0x000008, "Wrong alignment on PsychicSasParticleComponent_C_DeactivateEffect");
static_assert(sizeof(PsychicSasParticleComponent_C_DeactivateEffect) == 0x000050, "Wrong size on PsychicSasParticleComponent_C_DeactivateEffect");
static_assert(offsetof(PsychicSasParticleComponent_C_DeactivateEffect, SasKind) == 0x000000, "Member 'PsychicSasParticleComponent_C_DeactivateEffect::SasKind' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_DeactivateEffect, Capture) == 0x000001, "Member 'PsychicSasParticleComponent_C_DeactivateEffect::Capture' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_DeactivateEffect, Attack) == 0x000002, "Member 'PsychicSasParticleComponent_C_DeactivateEffect::Attack' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_DeactivateEffect, MeshComp) == 0x000008, "Member 'PsychicSasParticleComponent_C_DeactivateEffect::MeshComp' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_DeactivateEffect, L_particle) == 0x000010, "Member 'PsychicSasParticleComponent_C_DeactivateEffect::L_particle' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_DeactivateEffect, CallFunc_GetParticleComponent_ParticleComponent) == 0x000018, "Member 'PsychicSasParticleComponent_C_DeactivateEffect::CallFunc_GetParticleComponent_ParticleComponent' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_DeactivateEffect, CallFunc_GetDisplayName_ReturnValue) == 0x000020, "Member 'PsychicSasParticleComponent_C_DeactivateEffect::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_DeactivateEffect, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'PsychicSasParticleComponent_C_DeactivateEffect::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_DeactivateEffect, CallFunc_SetParticleComponent_ReturnComponent) == 0x000040, "Member 'PsychicSasParticleComponent_C_DeactivateEffect::CallFunc_SetParticleComponent_ReturnComponent' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_DeactivateEffect, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'PsychicSasParticleComponent_C_DeactivateEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function PsychicSasParticleComponent.PsychicSasParticleComponent_C.DeactivateEffectAll
// 0x0040 (0x0040 - 0x0000)
struct PsychicSasParticleComponent_C_DeactivateEffectAll final
{
public:
	int32                                         L_index;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5445[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         L_particle;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSParticleSystemComponentBase*         CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5446[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5447[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PsychicSasParticleComponent_C_DeactivateEffectAll) == 0x000008, "Wrong alignment on PsychicSasParticleComponent_C_DeactivateEffectAll");
static_assert(sizeof(PsychicSasParticleComponent_C_DeactivateEffectAll) == 0x000040, "Wrong size on PsychicSasParticleComponent_C_DeactivateEffectAll");
static_assert(offsetof(PsychicSasParticleComponent_C_DeactivateEffectAll, L_index) == 0x000000, "Member 'PsychicSasParticleComponent_C_DeactivateEffectAll::L_index' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_DeactivateEffectAll, L_particle) == 0x000008, "Member 'PsychicSasParticleComponent_C_DeactivateEffectAll::L_particle' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_DeactivateEffectAll, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'PsychicSasParticleComponent_C_DeactivateEffectAll::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_DeactivateEffectAll, Temp_int_Array_Index_Variable) == 0x000014, "Member 'PsychicSasParticleComponent_C_DeactivateEffectAll::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_DeactivateEffectAll, CallFunc_Array_Get_Item) == 0x000018, "Member 'PsychicSasParticleComponent_C_DeactivateEffectAll::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_DeactivateEffectAll, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'PsychicSasParticleComponent_C_DeactivateEffectAll::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_DeactivateEffectAll, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'PsychicSasParticleComponent_C_DeactivateEffectAll::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_DeactivateEffectAll, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'PsychicSasParticleComponent_C_DeactivateEffectAll::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_DeactivateEffectAll, CallFunc_IsValid_ReturnValue_1) == 0x000034, "Member 'PsychicSasParticleComponent_C_DeactivateEffectAll::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_DeactivateEffectAll, CallFunc_Less_IntInt_ReturnValue) == 0x000035, "Member 'PsychicSasParticleComponent_C_DeactivateEffectAll::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_DeactivateEffectAll, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'PsychicSasParticleComponent_C_DeactivateEffectAll::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicSasParticleComponent_C_DeactivateEffectAll, CallFunc_IsValid_ReturnValue_2) == 0x00003C, "Member 'PsychicSasParticleComponent_C_DeactivateEffectAll::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function PsychicSasParticleComponent.PsychicSasParticleComponent_C.DestroyEffect
// 0x0050 (0x0050 - 0x0000)
struct PsychicSasParticleComponent_C_DestroyEffect final
{
public:
	E_SASKind                                     SasKind;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Capture;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Attack;                                            // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5448[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         MeshComp;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
