#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PsychicObjectSoundData2

#include "Basic.hpp"

#include "PsychicObjectSoundGroup_structs.hpp"


namespace SDK
{

// UserDefinedStruct PsychicObjectSoundData2.PsychicObjectSoundData2
// 0x0048 (0x0048 - 0x0000)
struct FPsychicObjectSoundData2 final
{
public:
	EPsychicObjectSoundGroup                      SoundGroup_19_02C4396341445055A45F3D9C03D32B9D;    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50D1[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCueSheet*                     SoundCueSheet_39_DFF3F4B74424DB56DBDE4A82B1459315; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          LiftUp_29_DD43080749DA4443FCD375B38852B3D4;        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USoundAtomCue*>                  AttackOriginal_35_204693B747796F8B8560F397938B2705; // 0x0018(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class USoundAtomCue*                          AttackThrow_31_48922966472F74D32E3DB6BE83A87868;   // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          AttackCombo_32_D878B19C4B842473BC1EDAA4F4C20EC5;   // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          HitGround_33_E92916C346C2FCFDB350178C028B5FEA;     // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          HitEnemy_34_0DC1A29949E7F3F00171499D209F9B44;      // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPsychicObjectSoundData2) == 0x000008, "Wrong alignment on FPsychicObjectSoundData2");
static_assert(sizeof(FPsychicObjectSoundData2) == 0x000048, "Wrong size on FPsychicObjectSoundData2");
static_assert(offsetof(FPsychicObjectSoundData2, SoundGroup_19_02C4396341445055A45F3D9C03D32B9D) == 0x000000, "Member 'FPsychicObjectSoundData2::SoundGroup_19_02C4396341445055A45F3D9C03D32B9D' has a wrong offset!");
static_assert(offsetof(FPsychicObjectSoundData2, SoundCueSheet_39_DFF3F4B74424DB56DBDE4A82B1459315) == 0x000008, "Member 'FPsychicObjectSoundData2::SoundCueSheet_39_DFF3F4B74424DB56DBDE4A82B1459315' has a wrong offset!");
static_assert(offsetof(FPsychicObjectSoundData2, LiftUp_29_DD43080749DA4443FCD375B38852B3D4) == 0x000010, "Member 'FPsychicObjectSoundData2::LiftUp_29_DD43080749DA4443FCD375B38852B3D4' has a wrong offset!");
static_assert(offsetof(FPsychicObjectSoundData2, AttackOriginal_35_204693B747796F8B8560F397938B2705) == 0x000018, "Member 'FPsychicObjectSoundData2::AttackOriginal_35_204693B747796F8B8560F397938B2705' has a wrong offset!");
static_assert(offsetof(FPsychicObjectSoundData2, AttackThrow_31_48922966472F74D32E3DB6BE83A87868) == 0x000028, "Member 'FPsychicObjectSoundData2::AttackThrow_31_48922966472F74D32E3DB6BE83A87868' has a wrong offset!");
static_assert(offsetof(FPsychicObjectSoundData2, AttackCombo_32_D878B19C4B842473BC1EDAA4F4C20EC5) == 0x000030, "Member 'FPsychicObjectSoundData2::AttackCombo_32_D878B19C4B842473BC1EDAA4F4C20EC5' has a wrong offset!");
static_assert(offsetof(FPsychicObjectSoundData2, HitGround_33_E92916C346C2FCFDB350178C028B5FEA) == 0x000038, "Member 'FPsychicObjectSoundData2::HitGround_33_E92916C346C2FCFDB350178C028B5FEA' has a wrong offset!");
static_assert(offsetof(FPsychicObjectSoundData2, HitEnemy_34_0DC1A29949E7F3F00171499D209F9B44) == 0x000040, "Member 'FPsychicObjectSoundData2::HitEnemy_34_0DC1A29949E7F3F00171499D209F9B44' has a wrong offset!");

}

