#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PsychicGrabAttachment

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "FSASCommand_structs.hpp"
#include "Engine_structs.hpp"
#include "E_SASKind_structs.hpp"
#include "PsychicGrabPosData_structs.hpp"
#include "FSASElectricParam_structs.hpp"
#include "FSASFireParam_structs.hpp"
#include "FSASSeeThroughParam_structs.hpp"
#include "FSASMetalParam_structs.hpp"
#include "FSASTelepoParam_structs.hpp"
#include "FSASStealthParam_structs.hpp"
#include "FSASCopyParam_structs.hpp"
#include "FSASPsychicParam_structs.hpp"
#include "AcceleratorParam_structs.hpp"


namespace SDK::Params
{

// Function PsychicGrabAttachment.PsychicGrabAttachment_C.ExecuteUbergraph_PsychicGrabAttachment
// 0x0168 (0x0168 - 0x0000)
struct PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7868[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSParallelObjectManager*               CallFunc_GetParallelObjectManager_NewParam;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFSASElectricParam                     K2Node_Event_param_15;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7869[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_17;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASElectricParam                     K2Node_Event_param_14;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_786A[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_16;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_8;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASFireParam                         K2Node_Event_param_13;                             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_786B[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_15;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASFireParam                         K2Node_Event_param_12;                             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_786C[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_14;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_7;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASMetalParam                        K2Node_Event_param_11;                             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_786D[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_13;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASMetalParam                        K2Node_Event_param_10;                             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_786E[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_12;                             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_6;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASSeeThroughParam                   K2Node_Event_param_9;                              // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_786F[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_11;                             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASSeeThroughParam                   K2Node_Event_param_8;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7870[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_10;                             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_5;                         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASTelepoParam                       K2Node_Event_param_7;                              // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7871[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_9;                              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASTelepoParam                       K2Node_Event_param_6;                              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7872[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_8;                              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_4;                         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASStealthParam                      K2Node_Event_param_5;                              // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7873[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_7;                              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASStealthParam                      K2Node_Event_param_4;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7874[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_6;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_3;                         // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASCopyParam                         K2Node_Event_param_3;                              // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7875[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_5;                              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASCopyParam                         K2Node_Event_param_2;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7876[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_4;                              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_2;                         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASPsychicParam                      K2Node_Event_param_1;                              // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7877[0x3];                                     // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_3;                              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASPsychicParam                      K2Node_Event_param;                                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7878[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_2;                              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_1;                         // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAcceleratorParam                      K2Node_Event_Parameter_1;                          // 0x0118(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7879[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_1;                              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHologram_1;                          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_787A[0x3];                                     // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAcceleratorParam                      K2Node_Event_Parameter;                            // 0x0134(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Owner;                                // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime;                           // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHologram;                            // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_787B[0x3];                                     // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0156(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0157(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ARSParallelObjectManager*               CallFunc_GetParallelObjectManager_NewParam_1;      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RegisterObject_ReturnValue;               // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment) == 0x000008, "Wrong alignment on PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment");
static_assert(sizeof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment) == 0x000168, "Wrong size on PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, EntryPoint) == 0x000000, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::EntryPoint' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, CallFunc_GetParallelObjectManager_NewParam) == 0x000008, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::CallFunc_GetParallelObjectManager_NewParam' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_param_15) == 0x000011, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_param_15' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_Owner_17) == 0x000018, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_Owner_17' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_param_14) == 0x000020, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_param_14' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_Owner_16) == 0x000028, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_Owner_16' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_RemainTime_8) == 0x000030, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_RemainTime_8' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_param_13) == 0x000034, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_param_13' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_Owner_15) == 0x000038, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_Owner_15' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_param_12) == 0x000040, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_param_12' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_Owner_14) == 0x000048, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_Owner_14' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_RemainTime_7) == 0x000050, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_RemainTime_7' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_param_11) == 0x000054, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_param_11' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_Owner_13) == 0x000058, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_Owner_13' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_param_10) == 0x000060, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_param_10' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_Owner_12) == 0x000068, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_Owner_12' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_RemainTime_6) == 0x000070, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_RemainTime_6' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_param_9) == 0x000074, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_param_9' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_Owner_11) == 0x000078, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_Owner_11' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_param_8) == 0x000080, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_param_8' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_Owner_10) == 0x000088, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_Owner_10' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_RemainTime_5) == 0x000090, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_RemainTime_5' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_param_7) == 0x000094, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_param_7' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_Owner_9) == 0x000098, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_Owner_9' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_param_6) == 0x0000A0, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_param_6' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_Owner_8) == 0x0000A8, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_Owner_8' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_RemainTime_4) == 0x0000B0, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_RemainTime_4' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_param_5) == 0x0000B4, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_param_5' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_Owner_7) == 0x0000B8, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_Owner_7' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_param_4) == 0x0000C0, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_param_4' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_Owner_6) == 0x0000C8, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_Owner_6' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_RemainTime_3) == 0x0000D0, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_RemainTime_3' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_param_3) == 0x0000D4, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_param_3' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_Owner_5) == 0x0000D8, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_Owner_5' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_param_2) == 0x0000E0, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_param_2' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_Owner_4) == 0x0000E8, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_Owner_4' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_RemainTime_2) == 0x0000F0, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_RemainTime_2' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_param_1) == 0x0000F4, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_param_1' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_Owner_3) == 0x0000F8, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_Owner_3' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_param) == 0x000100, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_param' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_Owner_2) == 0x000108, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_Owner_2' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_RemainTime_1) == 0x000110, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_RemainTime_1' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_DeltaTime) == 0x000114, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_Parameter_1) == 0x000118, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_Parameter_1' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_Owner_1) == 0x000128, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_Owner_1' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_bHologram_1) == 0x000130, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_bHologram_1' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_Parameter) == 0x000134, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_Parameter' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_Owner) == 0x000140, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_Owner' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_RemainTime) == 0x000148, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_RemainTime' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_bHologram) == 0x00014C, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_bHologram' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_DeltaSeconds) == 0x000150, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, Temp_bool_IsClosed_Variable) == 0x000154, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, Temp_bool_Has_Been_Initd_Variable) == 0x000155, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, K2Node_Event_EndPlayReason) == 0x000156, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000157, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, CallFunc_GetParallelObjectManager_NewParam_1) == 0x000158, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::CallFunc_GetParallelObjectManager_NewParam_1' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, CallFunc_IsValid_ReturnValue_1) == 0x000160, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment, CallFunc_RegisterObject_ReturnValue) == 0x000161, "Member 'PsychicGrabAttachment_C_ExecuteUbergraph_PsychicGrabAttachment::CallFunc_RegisterObject_ReturnValue' has a wrong offset!");

// Function PsychicGrabAttachment.PsychicGrabAttachment_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct PsychicGrabAttachment_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabAttachment_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on PsychicGrabAttachment_C_ReceiveEndPlay");
static_assert(sizeof(PsychicGrabAttachment_C_ReceiveEndPlay) == 0x000001, "Wrong size on PsychicGrabAttachment_C_ReceiveEndPlay");
static_assert(offsetof(PsychicGrabAttachment_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'PsychicGrabAttachment_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function PsychicGrabAttachment.PsychicGrabAttachment_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct PsychicGrabAttachment_C_ReceiveTick final
{
public:
	float                                         Param_DeltaSeconds;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabAttachment_C_ReceiveTick) == 0x000004, "Wrong alignment on PsychicGrabAttachment_C_ReceiveTick");
static_assert(sizeof(PsychicGrabAttachment_C_ReceiveTick) == 0x000004, "Wrong size on PsychicGrabAttachment_C_ReceiveTick");
static_assert(offsetof(PsychicGrabAttachment_C_ReceiveTick, Param_DeltaSeconds) == 0x000000, "Member 'PsychicGrabAttachment_C_ReceiveTick::Param_DeltaSeconds' has a wrong offset!");

// Function PsychicGrabAttachment.PsychicGrabAttachment_C.OnAcceleratorEnd
// 0x0020 (0x0020 - 0x0000)
struct PsychicGrabAttachment_C_OnAcceleratorEnd final
{
public:
	struct FAcceleratorParam                      Parameter;                                         // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_787C[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHologram;                                         // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PsychicGrabAttachment_C_OnAcceleratorEnd) == 0x000008, "Wrong alignment on PsychicGrabAttachment_C_OnAcceleratorEnd");
static_assert(sizeof(PsychicGrabAttachment_C_OnAcceleratorEnd) == 0x000020, "Wrong size on PsychicGrabAttachment_C_OnAcceleratorEnd");
static_assert(offsetof(PsychicGrabAttachment_C_OnAcceleratorEnd, Parameter) == 0x000000, "Member 'PsychicGrabAttachment_C_OnAcceleratorEnd::Parameter' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnAcceleratorEnd, Param_Owner) == 0x000010, "Member 'PsychicGrabAttachment_C_OnAcceleratorEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnAcceleratorEnd, RemainTime) == 0x000018, "Member 'PsychicGrabAttachment_C_OnAcceleratorEnd::RemainTime' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnAcceleratorEnd, bHologram) == 0x00001C, "Member 'PsychicGrabAttachment_C_OnAcceleratorEnd::bHologram' has a wrong offset!");

// Function PsychicGrabAttachment.PsychicGrabAttachment_C.OnAcceleratorStart
// 0x0020 (0x0020 - 0x0000)
struct PsychicGrabAttachment_C_OnAcceleratorStart final
{
public:
	struct FAcceleratorParam                      Parameter;                                         // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_787D[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHologram;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PsychicGrabAttachment_C_OnAcceleratorStart) == 0x000008, "Wrong alignment on PsychicGrabAttachment_C_OnAcceleratorStart");
static_assert(sizeof(PsychicGrabAttachment_C_OnAcceleratorStart) == 0x000020, "Wrong size on PsychicGrabAttachment_C_OnAcceleratorStart");
static_assert(offsetof(PsychicGrabAttachment_C_OnAcceleratorStart, Parameter) == 0x000000, "Member 'PsychicGrabAttachment_C_OnAcceleratorStart::Parameter' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnAcceleratorStart, Param_Owner) == 0x000010, "Member 'PsychicGrabAttachment_C_OnAcceleratorStart::Param_Owner' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnAcceleratorStart, bHologram) == 0x000018, "Member 'PsychicGrabAttachment_C_OnAcceleratorStart::bHologram' has a wrong offset!");

// Function PsychicGrabAttachment.PsychicGrabAttachment_C.ParallelTick
// 0x0004 (0x0004 - 0x0000)
struct PsychicGrabAttachment_C_ParallelTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabAttachment_C_ParallelTick) == 0x000004, "Wrong alignment on PsychicGrabAttachment_C_ParallelTick");
static_assert(sizeof(PsychicGrabAttachment_C_ParallelTick) == 0x000004, "Wrong size on PsychicGrabAttachment_C_ParallelTick");
static_assert(offsetof(PsychicGrabAttachment_C_ParallelTick, DeltaTime) == 0x000000, "Member 'PsychicGrabAttachment_C_ParallelTick::DeltaTime' has a wrong offset!");

// Function PsychicGrabAttachment.PsychicGrabAttachment_C.OnPsychicEnd
// 0x0018 (0x0018 - 0x0000)
struct PsychicGrabAttachment_C_OnPsychicEnd final
{
public:
	struct FFSASPsychicParam                      Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_787E[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabAttachment_C_OnPsychicEnd) == 0x000008, "Wrong alignment on PsychicGrabAttachment_C_OnPsychicEnd");
static_assert(sizeof(PsychicGrabAttachment_C_OnPsychicEnd) == 0x000018, "Wrong size on PsychicGrabAttachment_C_OnPsychicEnd");
static_assert(offsetof(PsychicGrabAttachment_C_OnPsychicEnd, Param) == 0x000000, "Member 'PsychicGrabAttachment_C_OnPsychicEnd::Param' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnPsychicEnd, Param_Owner) == 0x000008, "Member 'PsychicGrabAttachment_C_OnPsychicEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnPsychicEnd, RemainTime) == 0x000010, "Member 'PsychicGrabAttachment_C_OnPsychicEnd::RemainTime' has a wrong offset!");

// Function PsychicGrabAttachment.PsychicGrabAttachment_C.OnPsychicStart
// 0x0010 (0x0010 - 0x0000)
struct PsychicGrabAttachment_C_OnPsychicStart final
{
public:
	struct FFSASPsychicParam                      Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_787F[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabAttachment_C_OnPsychicStart) == 0x000008, "Wrong alignment on PsychicGrabAttachment_C_OnPsychicStart");
static_assert(sizeof(PsychicGrabAttachment_C_OnPsychicStart) == 0x000010, "Wrong size on PsychicGrabAttachment_C_OnPsychicStart");
static_assert(offsetof(PsychicGrabAttachment_C_OnPsychicStart, Param) == 0x000000, "Member 'PsychicGrabAttachment_C_OnPsychicStart::Param' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnPsychicStart, Param_Owner) == 0x000008, "Member 'PsychicGrabAttachment_C_OnPsychicStart::Param_Owner' has a wrong offset!");

// Function PsychicGrabAttachment.PsychicGrabAttachment_C.OnCopyEnd
// 0x0018 (0x0018 - 0x0000)
struct PsychicGrabAttachment_C_OnCopyEnd final
{
public:
	struct FFSASCopyParam                         Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7880[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabAttachment_C_OnCopyEnd) == 0x000008, "Wrong alignment on PsychicGrabAttachment_C_OnCopyEnd");
static_assert(sizeof(PsychicGrabAttachment_C_OnCopyEnd) == 0x000018, "Wrong size on PsychicGrabAttachment_C_OnCopyEnd");
static_assert(offsetof(PsychicGrabAttachment_C_OnCopyEnd, Param) == 0x000000, "Member 'PsychicGrabAttachment_C_OnCopyEnd::Param' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnCopyEnd, Param_Owner) == 0x000008, "Member 'PsychicGrabAttachment_C_OnCopyEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnCopyEnd, RemainTime) == 0x000010, "Member 'PsychicGrabAttachment_C_OnCopyEnd::RemainTime' has a wrong offset!");

// Function PsychicGrabAttachment.PsychicGrabAttachment_C.OnCopyStart
// 0x0010 (0x0010 - 0x0000)
struct PsychicGrabAttachment_C_OnCopyStart final
{
public:
	struct FFSASCopyParam                         Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7881[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabAttachment_C_OnCopyStart) == 0x000008, "Wrong alignment on PsychicGrabAttachment_C_OnCopyStart");
static_assert(sizeof(PsychicGrabAttachment_C_OnCopyStart) == 0x000010, "Wrong size on PsychicGrabAttachment_C_OnCopyStart");
static_assert(offsetof(PsychicGrabAttachment_C_OnCopyStart, Param) == 0x000000, "Member 'PsychicGrabAttachment_C_OnCopyStart::Param' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnCopyStart, Param_Owner) == 0x000008, "Member 'PsychicGrabAttachment_C_OnCopyStart::Param_Owner' has a wrong offset!");

// Function PsychicGrabAttachment.PsychicGrabAttachment_C.OnStealthEnd
// 0x0018 (0x0018 - 0x0000)
struct PsychicGrabAttachment_C_OnStealthEnd final
{
public:
	struct FFSASStealthParam                      Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7882[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabAttachment_C_OnStealthEnd) == 0x000008, "Wrong alignment on PsychicGrabAttachment_C_OnStealthEnd");
static_assert(sizeof(PsychicGrabAttachment_C_OnStealthEnd) == 0x000018, "Wrong size on PsychicGrabAttachment_C_OnStealthEnd");
static_assert(offsetof(PsychicGrabAttachment_C_OnStealthEnd, Param) == 0x000000, "Member 'PsychicGrabAttachment_C_OnStealthEnd::Param' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnStealthEnd, Param_Owner) == 0x000008, "Member 'PsychicGrabAttachment_C_OnStealthEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnStealthEnd, RemainTime) == 0x000010, "Member 'PsychicGrabAttachment_C_OnStealthEnd::RemainTime' has a wrong offset!");

// Function PsychicGrabAttachment.PsychicGrabAttachment_C.OnStealthStart
// 0x0010 (0x0010 - 0x0000)
struct PsychicGrabAttachment_C_OnStealthStart final
{
public:
	struct FFSASStealthParam                      Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7883[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabAttachment_C_OnStealthStart) == 0x000008, "Wrong alignment on PsychicGrabAttachment_C_OnStealthStart");
static_assert(sizeof(PsychicGrabAttachment_C_OnStealthStart) == 0x000010, "Wrong size on PsychicGrabAttachment_C_OnStealthStart");
static_assert(offsetof(PsychicGrabAttachment_C_OnStealthStart, Param) == 0x000000, "Member 'PsychicGrabAttachment_C_OnStealthStart::Param' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnStealthStart, Param_Owner) == 0x000008, "Member 'PsychicGrabAttachment_C_OnStealthStart::Param_Owner' has a wrong offset!");

// Function PsychicGrabAttachment.PsychicGrabAttachment_C.OnTelepoEnd
// 0x0018 (0x0018 - 0x0000)
struct PsychicGrabAttachment_C_OnTelepoEnd final
{
public:
	struct FFSASTelepoParam                       Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7884[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabAttachment_C_OnTelepoEnd) == 0x000008, "Wrong alignment on PsychicGrabAttachment_C_OnTelepoEnd");
static_assert(sizeof(PsychicGrabAttachment_C_OnTelepoEnd) == 0x000018, "Wrong size on PsychicGrabAttachment_C_OnTelepoEnd");
static_assert(offsetof(PsychicGrabAttachment_C_OnTelepoEnd, Param) == 0x000000, "Member 'PsychicGrabAttachment_C_OnTelepoEnd::Param' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnTelepoEnd, Param_Owner) == 0x000008, "Member 'PsychicGrabAttachment_C_OnTelepoEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnTelepoEnd, RemainTime) == 0x000010, "Member 'PsychicGrabAttachment_C_OnTelepoEnd::RemainTime' has a wrong offset!");

// Function PsychicGrabAttachment.PsychicGrabAttachment_C.OnTelepoStart
// 0x0010 (0x0010 - 0x0000)
struct PsychicGrabAttachment_C_OnTelepoStart final
{
public:
	struct FFSASTelepoParam                       Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7885[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabAttachment_C_OnTelepoStart) == 0x000008, "Wrong alignment on PsychicGrabAttachment_C_OnTelepoStart");
static_assert(sizeof(PsychicGrabAttachment_C_OnTelepoStart) == 0x000010, "Wrong size on PsychicGrabAttachment_C_OnTelepoStart");
static_assert(offsetof(PsychicGrabAttachment_C_OnTelepoStart, Param) == 0x000000, "Member 'PsychicGrabAttachment_C_OnTelepoStart::Param' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnTelepoStart, Param_Owner) == 0x000008, "Member 'PsychicGrabAttachment_C_OnTelepoStart::Param_Owner' has a wrong offset!");

// Function PsychicGrabAttachment.PsychicGrabAttachment_C.OnSeeThroughEnd
// 0x0018 (0x0018 - 0x0000)
struct PsychicGrabAttachment_C_OnSeeThroughEnd final
{
public:
	struct FFSASSeeThroughParam                   Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7886[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabAttachment_C_OnSeeThroughEnd) == 0x000008, "Wrong alignment on PsychicGrabAttachment_C_OnSeeThroughEnd");
static_assert(sizeof(PsychicGrabAttachment_C_OnSeeThroughEnd) == 0x000018, "Wrong size on PsychicGrabAttachment_C_OnSeeThroughEnd");
static_assert(offsetof(PsychicGrabAttachment_C_OnSeeThroughEnd, Param) == 0x000000, "Member 'PsychicGrabAttachment_C_OnSeeThroughEnd::Param' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnSeeThroughEnd, Param_Owner) == 0x000008, "Member 'PsychicGrabAttachment_C_OnSeeThroughEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnSeeThroughEnd, RemainTime) == 0x000010, "Member 'PsychicGrabAttachment_C_OnSeeThroughEnd::RemainTime' has a wrong offset!");

// Function PsychicGrabAttachment.PsychicGrabAttachment_C.OnSeeThroughStart
// 0x0010 (0x0010 - 0x0000)
struct PsychicGrabAttachment_C_OnSeeThroughStart final
{
public:
	struct FFSASSeeThroughParam                   Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7887[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabAttachment_C_OnSeeThroughStart) == 0x000008, "Wrong alignment on PsychicGrabAttachment_C_OnSeeThroughStart");
static_assert(sizeof(PsychicGrabAttachment_C_OnSeeThroughStart) == 0x000010, "Wrong size on PsychicGrabAttachment_C_OnSeeThroughStart");
static_assert(offsetof(PsychicGrabAttachment_C_OnSeeThroughStart, Param) == 0x000000, "Member 'PsychicGrabAttachment_C_OnSeeThroughStart::Param' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnSeeThroughStart, Param_Owner) == 0x000008, "Member 'PsychicGrabAttachment_C_OnSeeThroughStart::Param_Owner' has a wrong offset!");

// Function PsychicGrabAttachment.PsychicGrabAttachment_C.OnMetalEnd
// 0x0018 (0x0018 - 0x0000)
struct PsychicGrabAttachment_C_OnMetalEnd final
{
public:
	struct FFSASMetalParam                        Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7888[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabAttachment_C_OnMetalEnd) == 0x000008, "Wrong alignment on PsychicGrabAttachment_C_OnMetalEnd");
static_assert(sizeof(PsychicGrabAttachment_C_OnMetalEnd) == 0x000018, "Wrong size on PsychicGrabAttachment_C_OnMetalEnd");
static_assert(offsetof(PsychicGrabAttachment_C_OnMetalEnd, Param) == 0x000000, "Member 'PsychicGrabAttachment_C_OnMetalEnd::Param' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnMetalEnd, Param_Owner) == 0x000008, "Member 'PsychicGrabAttachment_C_OnMetalEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnMetalEnd, RemainTime) == 0x000010, "Member 'PsychicGrabAttachment_C_OnMetalEnd::RemainTime' has a wrong offset!");

// Function PsychicGrabAttachment.PsychicGrabAttachment_C.OnMetalStart
// 0x0010 (0x0010 - 0x0000)
struct PsychicGrabAttachment_C_OnMetalStart final
{
public:
	struct FFSASMetalParam                        Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7889[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabAttachment_C_OnMetalStart) == 0x000008, "Wrong alignment on PsychicGrabAttachment_C_OnMetalStart");
static_assert(sizeof(PsychicGrabAttachment_C_OnMetalStart) == 0x000010, "Wrong size on PsychicGrabAttachment_C_OnMetalStart");
static_assert(offsetof(PsychicGrabAttachment_C_OnMetalStart, Param) == 0x000000, "Member 'PsychicGrabAttachment_C_OnMetalStart::Param' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnMetalStart, Param_Owner) == 0x000008, "Member 'PsychicGrabAttachment_C_OnMetalStart::Param_Owner' has a wrong offset!");

// Function PsychicGrabAttachment.PsychicGrabAttachment_C.OnFireEnd
// 0x0018 (0x0018 - 0x0000)
struct PsychicGrabAttachment_C_OnFireEnd final
{
public:
	struct FFSASFireParam                         Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_788A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabAttachment_C_OnFireEnd) == 0x000008, "Wrong alignment on PsychicGrabAttachment_C_OnFireEnd");
static_assert(sizeof(PsychicGrabAttachment_C_OnFireEnd) == 0x000018, "Wrong size on PsychicGrabAttachment_C_OnFireEnd");
static_assert(offsetof(PsychicGrabAttachment_C_OnFireEnd, Param) == 0x000000, "Member 'PsychicGrabAttachment_C_OnFireEnd::Param' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnFireEnd, Param_Owner) == 0x000008, "Member 'PsychicGrabAttachment_C_OnFireEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnFireEnd, RemainTime) == 0x000010, "Member 'PsychicGrabAttachment_C_OnFireEnd::RemainTime' has a wrong offset!");

// Function PsychicGrabAttachment.PsychicGrabAttachment_C.OnFireStart
// 0x0010 (0x0010 - 0x0000)
struct PsychicGrabAttachment_C_OnFireStart final
{
public:
	struct FFSASFireParam                         Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_788B[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabAttachment_C_OnFireStart) == 0x000008, "Wrong alignment on PsychicGrabAttachment_C_OnFireStart");
static_assert(sizeof(PsychicGrabAttachment_C_OnFireStart) == 0x000010, "Wrong size on PsychicGrabAttachment_C_OnFireStart");
static_assert(offsetof(PsychicGrabAttachment_C_OnFireStart, Param) == 0x000000, "Member 'PsychicGrabAttachment_C_OnFireStart::Param' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnFireStart, Param_Owner) == 0x000008, "Member 'PsychicGrabAttachment_C_OnFireStart::Param_Owner' has a wrong offset!");

// Function PsychicGrabAttachment.PsychicGrabAttachment_C.OnElectricEnd
// 0x0018 (0x0018 - 0x0000)
struct PsychicGrabAttachment_C_OnElectricEnd final
{
public:
	struct FFSASElectricParam                     Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_788C[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Param_Owner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicGrabAttachment_C_OnElectricEnd) == 0x000008, "Wrong alignment on PsychicGrabAttachment_C_OnElectricEnd");
static_assert(sizeof(PsychicGrabAttachment_C_OnElectricEnd) == 0x000018, "Wrong size on PsychicGrabAttachment_C_OnElectricEnd");
static_assert(offsetof(PsychicGrabAttachment_C_OnElectricEnd, Param) == 0x000000, "Member 'PsychicGrabAttachment_C_OnElectricEnd::Param' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnElectricEnd, Param_Owner) == 0x000008, "Member 'PsychicGrabAttachment_C_OnElectricEnd::Param_Owner' has a wrong offset!");
static_assert(offsetof(PsychicGrabAttachment_C_OnElectricEnd, RemainTime) == 0x000010, "Member 'PsychicGrabAttachment_C_OnElectricEnd::RemainTime' has a wrong offset!");

