#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PsychicObjectManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "PsychicObjectSizeParameter_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "Engine_structs.hpp"
#include "UniqueObjectContainerEnemyInfo_structs.hpp"
#include "PsychicObjectID_structs.hpp"
#include "Enum_ui_pk_weight_gauge_button_structs.hpp"
#include "PsychicObjectBulletData_structs.hpp"
#include "UniqueObjectCommonParameter_structs.hpp"
#include "PsychicObjectSoundData2_structs.hpp"
#include "UniqueObjectElectricPoleEffectParameter_structs.hpp"
#include "PsychicGrabPosData_structs.hpp"
#include "PsychicGrabParameterSizeData_structs.hpp"
#include "PsychicGrabParameterData_structs.hpp"
#include "PsychicGrabButtonType_structs.hpp"
#include "PsychicGrabMovementSizeData_structs.hpp"
#include "PsychicObjectAttackParameterData_structs.hpp"
#include "PsychicGrabMovementData_structs.hpp"
#include "PsychicObjectData_structs.hpp"
#include "E_SASKind_structs.hpp"
#include "PsychicObjectCommonParameter_structs.hpp"
#include "UniqueObjectCameraParameter_structs.hpp"
#include "PsychicObjectPhysicParameter_structs.hpp"
#include "SPsychicCaptureMaterial_structs.hpp"
#include "BrainFieldPsyObjData_structs.hpp"


namespace SDK::Params
{

// Function PsychicObjectManager.PsychicObjectManager_C.EnemyInterceptableThrow__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct PsychicObjectManager_C_EnemyInterceptableThrow__DelegateSignature final
{
public:
	class AActor*                                 Psy_obj_actor_in;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target_actor_in;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicObjectManager_C_EnemyInterceptableThrow__DelegateSignature) == 0x000008, "Wrong alignment on PsychicObjectManager_C_EnemyInterceptableThrow__DelegateSignature");
static_assert(sizeof(PsychicObjectManager_C_EnemyInterceptableThrow__DelegateSignature) == 0x000010, "Wrong size on PsychicObjectManager_C_EnemyInterceptableThrow__DelegateSignature");
static_assert(offsetof(PsychicObjectManager_C_EnemyInterceptableThrow__DelegateSignature, Psy_obj_actor_in) == 0x000000, "Member 'PsychicObjectManager_C_EnemyInterceptableThrow__DelegateSignature::Psy_obj_actor_in' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_EnemyInterceptableThrow__DelegateSignature, Target_actor_in) == 0x000008, "Member 'PsychicObjectManager_C_EnemyInterceptableThrow__DelegateSignature::Target_actor_in' has a wrong offset!");

// Function PsychicObjectManager.PsychicObjectManager_C.ExecuteUbergraph_PsychicObjectManager
// 0x0198 (0x0198 - 0x0000)
struct PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_743E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHudMain_HudMainGame;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_743F[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPsychicBattleType PsychicBattleType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7440[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7441[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7442[0x2];                                     // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7443[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadSoftClassActor_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0060(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7444[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDestructibleComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ECollisionChannel                             CallFunc_GetCollisionObjectType_ReturnValue;       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7445[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(EPsychicBattleType PsychicBattleType)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                CallFunc_GetDebuggingManager_Manager;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7446[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadSoftClassActor_ReturnValue_1;         // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0100(0x0010)(ReferenceParm, HasGetValueTypeHash)
	EPsychicBattleType                            K2Node_CustomEvent_PsychicBattleType_1;            // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7447[0x6];                                     // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDestructibleComponent*                 CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7448[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ECollisionChannel                             CallFunc_GetCollisionObjectType_ReturnValue_1;     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7449[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EPsychicBattleType                            K2Node_CustomEvent_PsychicBattleType;              // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_744A[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHudMain_HudMainGame_1;                 // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager) == 0x000008, "Wrong alignment on PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager");
static_assert(sizeof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager) == 0x000198, "Wrong size on PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, EntryPoint) == 0x000000, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_GetHudMain_HudMainGame) == 0x000008, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_GetHudMain_HudMainGame' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, Temp_int_Array_Index_Variable) == 0x000024, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, Temp_int_Loop_Num_Variable) == 0x000030, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, Temp_int_Loop_Counter_Variable_1) == 0x000034, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_Add_IntInt_ReturnValue_1) == 0x00003C, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, Temp_int_Loop_Num_Variable_1) == 0x000040, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_Less_IntInt_ReturnValue_1) == 0x000044, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, K2Node_Event_DeltaSeconds) == 0x000048, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, K2Node_Event_EndPlayReason) == 0x00004C, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, K2Node_SwitchEnum_CmpSuccess) == 0x00004D, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, Temp_int_Array_Index_Variable_1) == 0x000050, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_LoadSoftClassActor_ReturnValue) == 0x000058, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_LoadSoftClassActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_GetAllActorsOfClass_OutActors) == 0x000060, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_GetComponentByClass_ReturnValue) == 0x000078, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_GetDisplayName_ReturnValue) == 0x000080, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_GetCollisionObjectType_ReturnValue) == 0x000090, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_GetCollisionObjectType_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_Concat_StrStr_ReturnValue) == 0x000098, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0000A8, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000B8, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000C8, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000D8, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_GetDebuggingManager_Manager) == 0x0000E8, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_GetDebuggingManager_Manager' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_IsValid_ReturnValue_1) == 0x0000F0, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_LoadSoftClassActor_ReturnValue_1) == 0x0000F8, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_LoadSoftClassActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000100, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, K2Node_CustomEvent_PsychicBattleType_1) == 0x000110, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::K2Node_CustomEvent_PsychicBattleType_1' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, K2Node_SwitchEnum_CmpSuccess_1) == 0x000111, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000118, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_Array_Length_ReturnValue_1) == 0x000120, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_GetDisplayName_ReturnValue_1) == 0x000128, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000138, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_GetCollisionObjectType_ReturnValue_1) == 0x000148, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_GetCollisionObjectType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000150, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000160, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000170, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, K2Node_CustomEvent_PsychicBattleType) == 0x000180, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::K2Node_CustomEvent_PsychicBattleType' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_GetHudMain_HudMainGame_1) == 0x000188, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_GetHudMain_HudMainGame_1' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, K2Node_SwitchEnum_CmpSuccess_2) == 0x000190, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager, CallFunc_IsValid_ReturnValue_2) == 0x000191, "Member 'PsychicObjectManager_C_ExecuteUbergraph_PsychicObjectManager::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function PsychicObjectManager.PsychicObjectManager_C.OnFinishedPsychicBattle
// 0x0001 (0x0001 - 0x0000)
struct PsychicObjectManager_C_OnFinishedPsychicBattle final
{
public:
	EPsychicBattleType                            PsychicBattleType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicObjectManager_C_OnFinishedPsychicBattle) == 0x000001, "Wrong alignment on PsychicObjectManager_C_OnFinishedPsychicBattle");
static_assert(sizeof(PsychicObjectManager_C_OnFinishedPsychicBattle) == 0x000001, "Wrong size on PsychicObjectManager_C_OnFinishedPsychicBattle");
static_assert(offsetof(PsychicObjectManager_C_OnFinishedPsychicBattle, PsychicBattleType) == 0x000000, "Member 'PsychicObjectManager_C_OnFinishedPsychicBattle::PsychicBattleType' has a wrong offset!");

// Function PsychicObjectManager.PsychicObjectManager_C.OnStartPsychicBattle
// 0x0001 (0x0001 - 0x0000)
struct PsychicObjectManager_C_OnStartPsychicBattle final
{
public:
	EPsychicBattleType                            PsychicBattleType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicObjectManager_C_OnStartPsychicBattle) == 0x000001, "Wrong alignment on PsychicObjectManager_C_OnStartPsychicBattle");
static_assert(sizeof(PsychicObjectManager_C_OnStartPsychicBattle) == 0x000001, "Wrong size on PsychicObjectManager_C_OnStartPsychicBattle");
static_assert(offsetof(PsychicObjectManager_C_OnStartPsychicBattle, PsychicBattleType) == 0x000000, "Member 'PsychicObjectManager_C_OnStartPsychicBattle::PsychicBattleType' has a wrong offset!");

// Function PsychicObjectManager.PsychicObjectManager_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct PsychicObjectManager_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicObjectManager_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on PsychicObjectManager_C_ReceiveEndPlay");
static_assert(sizeof(PsychicObjectManager_C_ReceiveEndPlay) == 0x000001, "Wrong size on PsychicObjectManager_C_ReceiveEndPlay");
static_assert(offsetof(PsychicObjectManager_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'PsychicObjectManager_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function PsychicObjectManager.PsychicObjectManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct PsychicObjectManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychicObjectManager_C_ReceiveTick) == 0x000004, "Wrong alignment on PsychicObjectManager_C_ReceiveTick");
static_assert(sizeof(PsychicObjectManager_C_ReceiveTick) == 0x000004, "Wrong size on PsychicObjectManager_C_ReceiveTick");
static_assert(offsetof(PsychicObjectManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'PsychicObjectManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function PsychicObjectManager.PsychicObjectManager_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct PsychicObjectManager_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_SetEnablePsychicObjectRegister_ReturnValue; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PsychicObjectManager_C_UserConstructionScript) == 0x000001, "Wrong alignment on PsychicObjectManager_C_UserConstructionScript");
static_assert(sizeof(PsychicObjectManager_C_UserConstructionScript) == 0x000001, "Wrong size on PsychicObjectManager_C_UserConstructionScript");
static_assert(offsetof(PsychicObjectManager_C_UserConstructionScript, CallFunc_SetEnablePsychicObjectRegister_ReturnValue) == 0x000000, "Member 'PsychicObjectManager_C_UserConstructionScript::CallFunc_SetEnablePsychicObjectRegister_ReturnValue' has a wrong offset!");

// Function PsychicObjectManager.PsychicObjectManager_C.AddPsychicObjectInfo
// 0x0028 (0x0028 - 0x0000)
struct PsychicObjectManager_C_AddPsychicObjectInfo final
{
public:
	class AActor*                                 Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_744B[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PsychicObjectBasic_C*               K2Node_DynamicCast_AsBP_Psychic_Object_Basic;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_744C[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetRegNo_return;                          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PsychicObjectManager_C_AddPsychicObjectInfo) == 0x000008, "Wrong alignment on PsychicObjectManager_C_AddPsychicObjectInfo");
static_assert(sizeof(PsychicObjectManager_C_AddPsychicObjectInfo) == 0x000028, "Wrong size on PsychicObjectManager_C_AddPsychicObjectInfo");
static_assert(offsetof(PsychicObjectManager_C_AddPsychicObjectInfo, Object) == 0x000000, "Member 'PsychicObjectManager_C_AddPsychicObjectInfo::Object' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_AddPsychicObjectInfo, Temp_int_Variable) == 0x000008, "Member 'PsychicObjectManager_C_AddPsychicObjectInfo::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_AddPsychicObjectInfo, K2Node_DynamicCast_AsBP_Psychic_Object_Basic) == 0x000010, "Member 'PsychicObjectManager_C_AddPsychicObjectInfo::K2Node_DynamicCast_AsBP_Psychic_Object_Basic' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_AddPsychicObjectInfo, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PsychicObjectManager_C_AddPsychicObjectInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_AddPsychicObjectInfo, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'PsychicObjectManager_C_AddPsychicObjectInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_AddPsychicObjectInfo, CallFunc_SetRegNo_return) == 0x000020, "Member 'PsychicObjectManager_C_AddPsychicObjectInfo::CallFunc_SetRegNo_return' has a wrong offset!");

// Function PsychicObjectManager.PsychicObjectManager_C.InitializeBrainField
// 0x0050 (0x0050 - 0x0000)
struct PsychicObjectManager_C_InitializeBrainField final
{
public:
	int32                                         ListLen;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotAngle;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLoop;                                             // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_744D[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SpawnGroupNum;                                     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnTime;                                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TileNum;                                           // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         CallFunc_GetHudMain_HudMainGame;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_744E[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_744F[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBrainFieldUser_User;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARsBattleHero_C*                        K2Node_DynamicCast_AsRs_Battle_Hero;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUserIsPlayer_IsPlayer;                  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PsychicObjectManager_C_InitializeBrainField) == 0x000008, "Wrong alignment on PsychicObjectManager_C_InitializeBrainField");
static_assert(sizeof(PsychicObjectManager_C_InitializeBrainField) == 0x000050, "Wrong size on PsychicObjectManager_C_InitializeBrainField");
static_assert(offsetof(PsychicObjectManager_C_InitializeBrainField, ListLen) == 0x000000, "Member 'PsychicObjectManager_C_InitializeBrainField::ListLen' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_InitializeBrainField, RotAngle) == 0x000004, "Member 'PsychicObjectManager_C_InitializeBrainField::RotAngle' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_InitializeBrainField, bLoop) == 0x000008, "Member 'PsychicObjectManager_C_InitializeBrainField::bLoop' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_InitializeBrainField, SpawnGroupNum) == 0x00000C, "Member 'PsychicObjectManager_C_InitializeBrainField::SpawnGroupNum' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_InitializeBrainField, SpawnTime) == 0x000010, "Member 'PsychicObjectManager_C_InitializeBrainField::SpawnTime' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_InitializeBrainField, TileNum) == 0x000014, "Member 'PsychicObjectManager_C_InitializeBrainField::TileNum' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_InitializeBrainField, CallFunc_GetHudMain_HudMainGame) == 0x000018, "Member 'PsychicObjectManager_C_InitializeBrainField::CallFunc_GetHudMain_HudMainGame' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_InitializeBrainField, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'PsychicObjectManager_C_InitializeBrainField::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_InitializeBrainField, CallFunc_GetBrainFieldManager_Manager) == 0x000028, "Member 'PsychicObjectManager_C_InitializeBrainField::CallFunc_GetBrainFieldManager_Manager' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_InitializeBrainField, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'PsychicObjectManager_C_InitializeBrainField::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_InitializeBrainField, CallFunc_GetBrainFieldUser_User) == 0x000038, "Member 'PsychicObjectManager_C_InitializeBrainField::CallFunc_GetBrainFieldUser_User' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_InitializeBrainField, K2Node_DynamicCast_AsRs_Battle_Hero) == 0x000040, "Member 'PsychicObjectManager_C_InitializeBrainField::K2Node_DynamicCast_AsRs_Battle_Hero' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_InitializeBrainField, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'PsychicObjectManager_C_InitializeBrainField::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_InitializeBrainField, CallFunc_IsValid_ReturnValue_2) == 0x000049, "Member 'PsychicObjectManager_C_InitializeBrainField::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_InitializeBrainField, CallFunc_IsUserIsPlayer_IsPlayer) == 0x00004A, "Member 'PsychicObjectManager_C_InitializeBrainField::CallFunc_IsUserIsPlayer_IsPlayer' has a wrong offset!");

// Function PsychicObjectManager.PsychicObjectManager_C.UpdateBrainField
// 0x0030 (0x0030 - 0x0000)
struct PsychicObjectManager_C_UpdateBrainField final
{
public:
	class ABP_PsychicObjectBasic_C*               L_psyObj;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 L_str;                                             // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bSpawn;                                            // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7450[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpawnPsychicObject_IsSpawn;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PsychicObjectManager_C_UpdateBrainField) == 0x000008, "Wrong alignment on PsychicObjectManager_C_UpdateBrainField");
static_assert(sizeof(PsychicObjectManager_C_UpdateBrainField) == 0x000030, "Wrong size on PsychicObjectManager_C_UpdateBrainField");
static_assert(offsetof(PsychicObjectManager_C_UpdateBrainField, L_psyObj) == 0x000000, "Member 'PsychicObjectManager_C_UpdateBrainField::L_psyObj' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_UpdateBrainField, L_str) == 0x000008, "Member 'PsychicObjectManager_C_UpdateBrainField::L_str' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_UpdateBrainField, bSpawn) == 0x000018, "Member 'PsychicObjectManager_C_UpdateBrainField::bSpawn' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_UpdateBrainField, CallFunc_GetBrainFieldManager_Manager) == 0x000020, "Member 'PsychicObjectManager_C_UpdateBrainField::CallFunc_GetBrainFieldManager_Manager' has a wrong offset!");
static_assert(offsetof(PsychicObjectManager_C_UpdateBrainField, CallFunc_IsSpawnPsychicObject_IsSpawn) == 0x000028, "Member 'PsychicObjectManager_C_UpdateBrainField::CallFunc_IsSpawnPsychicObject_IsSpawn' has a wrong offset!");

// Function PsychicObjectManager.PsychicObjectManager_C.DebugPrintPsyObjSpawnList
// 0x0440 (0x0440 - 0x0000)
struct PsychicObjectManager_C_DebugPrintPsyObjSpawnList final
{
public:
	class FString                                 DbStr;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GroupNo;                                           // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 SortGroupList;                                     // 0x0018(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class ABP_PsychicObjectBasic_C*>       SortObjList;                                       // 0x0028(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	TArray<int32>                                 WorkGroupList;                                     // 0x0038(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class ABP_PsychicObjectBasic_C*>       WorkObjList;                                       // 0x0048(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7451[0x2];                                     // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7452[0x2];                                     // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7453[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PsychicObjectBasic_C*               CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7454[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_convGroupToRowNameOld_row_name_out;       // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_convGroupToRowNameOld_group_out;          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_convGroupToRowNameOld_index_out;          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_PsychicObjectBasic_C*               CallFunc_Array_Get_Item_1;                         // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7455[0xC];                                     // 0x0104(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0110(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7456[0x3];                                     // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_1;         // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_2;         // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_3;         // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_4;         // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_5;         // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7457[0x4];                                     // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_6;         // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7458[0x4];                                     // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7459[0x4];                                     // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_745A[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_745B[0x3];                                     // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PsychicObjectBasic_C*               CallFunc_Array_Get_Item_2;                         // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue_1;         // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_745C[0x4];                                     // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_7;         // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_8;         // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_745D[0x7];                                     // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0300(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_745E[0x4];                                     // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_10;             // 0x0318(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_11;             // 0x0328(0x0010)(ZeroConstructor, HasGetValueTypeHash)
