#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PsychicObjectBulletData

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK
{

// UserDefinedStruct PsychicObjectBulletData.PsychicObjectBulletData
// 0x0048 (0x0048 - 0x0000)
struct FPsychicObjectBulletData final
{
public:
	BattlePrototype::EPsychicObjectID             PsychicObjectID_14_45A3312B42773DDC4FAD42A7F4EBB7A1; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EFF[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_PsychicObjectBasic_C*>       PsychicBulletFreeList_17_065988034381B44EBCAA5D8B9B88BBD1; // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	TArray<class ABP_PsychicObjectBasic_C*>       PsychicBulletWorkList_16_47F750EE40355742440A63A09F0A95BA; // 0x0018(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	int32                                         PsychicBulletMagazine_18_115067134F02AF670FA739884EDC93DD; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PsychicBulletMax_19_F525922F4029B54E70AB34959842C3E2; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PsychicBulletCount_20_E9C9BF144F778175658004AA2DCB536D; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F00[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_PsychicObjectBasic_C*>       PsychicBulletOwnerList_24_899B6A034FDF26CD449B12932E8D4C43; // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
};
static_assert(alignof(FPsychicObjectBulletData) == 0x000008, "Wrong alignment on FPsychicObjectBulletData");
static_assert(sizeof(FPsychicObjectBulletData) == 0x000048, "Wrong size on FPsychicObjectBulletData");
static_assert(offsetof(FPsychicObjectBulletData, PsychicObjectID_14_45A3312B42773DDC4FAD42A7F4EBB7A1) == 0x000000, "Member 'FPsychicObjectBulletData::PsychicObjectID_14_45A3312B42773DDC4FAD42A7F4EBB7A1' has a wrong offset!");
static_assert(offsetof(FPsychicObjectBulletData, PsychicBulletFreeList_17_065988034381B44EBCAA5D8B9B88BBD1) == 0x000008, "Member 'FPsychicObjectBulletData::PsychicBulletFreeList_17_065988034381B44EBCAA5D8B9B88BBD1' has a wrong offset!");
static_assert(offsetof(FPsychicObjectBulletData, PsychicBulletWorkList_16_47F750EE40355742440A63A09F0A95BA) == 0x000018, "Member 'FPsychicObjectBulletData::PsychicBulletWorkList_16_47F750EE40355742440A63A09F0A95BA' has a wrong offset!");
static_assert(offsetof(FPsychicObjectBulletData, PsychicBulletMagazine_18_115067134F02AF670FA739884EDC93DD) == 0x000028, "Member 'FPsychicObjectBulletData::PsychicBulletMagazine_18_115067134F02AF670FA739884EDC93DD' has a wrong offset!");
static_assert(offsetof(FPsychicObjectBulletData, PsychicBulletMax_19_F525922F4029B54E70AB34959842C3E2) == 0x00002C, "Member 'FPsychicObjectBulletData::PsychicBulletMax_19_F525922F4029B54E70AB34959842C3E2' has a wrong offset!");
static_assert(offsetof(FPsychicObjectBulletData, PsychicBulletCount_20_E9C9BF144F778175658004AA2DCB536D) == 0x000030, "Member 'FPsychicObjectBulletData::PsychicBulletCount_20_E9C9BF144F778175658004AA2DCB536D' has a wrong offset!");
static_assert(offsetof(FPsychicObjectBulletData, PsychicBulletOwnerList_24_899B6A034FDF26CD449B12932E8D4C43) == 0x000038, "Member 'FPsychicObjectBulletData::PsychicBulletOwnerList_24_899B6A034FDF26CD449B12932E8D4C43' has a wrong offset!");

}

