#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PsychicObjectPhysicParameter

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct PsychicObjectPhysicParameter.PsychicObjectPhysicParameter
// 0x0040 (0x0040 - 0x0000)
struct FPsychicObjectPhysicParameter final
{
public:
	float                                         HandleLinearDamping_26_E022F26B44A814DDD4E421A5D3366261; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HandleLinearStiffness_27_908FFD5640AF88FEA7E3E89B66DCE5A6; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HandleAngularDamping_28_1B34261F41D4D0DB7CDCB18DBEE6C2ED; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HandleAngularStifness_29_1FC65AD740A2445B319EA89853A6A728; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HandleInterplationSpeed_30_04DD97754FB9EBAB728D5C8EE94E5B05; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CaptureMass_44_502C6C3C40151845893469BC297E7E70;   // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LiftUpRotForce_45_24A6D10D4780156F239446B6849AF985; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LiftUpRotForceRangeMin_46_A8CAE2AB42641587C79575AD7C1595A4; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LiftUpRotForceRangeMax_47_A8AFF6034C5305009194CB91652C80DC; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LiftUpRotForceTime_48_BEB1EF154EA36AC1B0A8269AB17B7781; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEasingFunc                                   LiftUpRotForceEase_57_AA0D7C04422743BDF74F29A5A40CBAA6; // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47B4[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ThrowRotForce_49_AE6A1F7041D9EB84743936882F37E0F2; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ThrowRotForceRangeMin_50_65DDE982460B4E9361B87596111C042A; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ThrowRotForceRangeMax_51_DEDA620D4608DD67E6339C84A1B0DC57; // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ThrowRotForceTime_52_788BD70147DEA8FEB46FED9DAFE26242; // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEasingFunc                                   ThrowRotForceEase_58_740E994243B69B58965CFA9C25D3298E; // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPsychicObjectPhysicParameter) == 0x000004, "Wrong alignment on FPsychicObjectPhysicParameter");
static_assert(sizeof(FPsychicObjectPhysicParameter) == 0x000040, "Wrong size on FPsychicObjectPhysicParameter");
static_assert(offsetof(FPsychicObjectPhysicParameter, HandleLinearDamping_26_E022F26B44A814DDD4E421A5D3366261) == 0x000000, "Member 'FPsychicObjectPhysicParameter::HandleLinearDamping_26_E022F26B44A814DDD4E421A5D3366261' has a wrong offset!");
static_assert(offsetof(FPsychicObjectPhysicParameter, HandleLinearStiffness_27_908FFD5640AF88FEA7E3E89B66DCE5A6) == 0x000004, "Member 'FPsychicObjectPhysicParameter::HandleLinearStiffness_27_908FFD5640AF88FEA7E3E89B66DCE5A6' has a wrong offset!");
static_assert(offsetof(FPsychicObjectPhysicParameter, HandleAngularDamping_28_1B34261F41D4D0DB7CDCB18DBEE6C2ED) == 0x000008, "Member 'FPsychicObjectPhysicParameter::HandleAngularDamping_28_1B34261F41D4D0DB7CDCB18DBEE6C2ED' has a wrong offset!");
static_assert(offsetof(FPsychicObjectPhysicParameter, HandleAngularStifness_29_1FC65AD740A2445B319EA89853A6A728) == 0x00000C, "Member 'FPsychicObjectPhysicParameter::HandleAngularStifness_29_1FC65AD740A2445B319EA89853A6A728' has a wrong offset!");
static_assert(offsetof(FPsychicObjectPhysicParameter, HandleInterplationSpeed_30_04DD97754FB9EBAB728D5C8EE94E5B05) == 0x000010, "Member 'FPsychicObjectPhysicParameter::HandleInterplationSpeed_30_04DD97754FB9EBAB728D5C8EE94E5B05' has a wrong offset!");
static_assert(offsetof(FPsychicObjectPhysicParameter, CaptureMass_44_502C6C3C40151845893469BC297E7E70) == 0x000014, "Member 'FPsychicObjectPhysicParameter::CaptureMass_44_502C6C3C40151845893469BC297E7E70' has a wrong offset!");
static_assert(offsetof(FPsychicObjectPhysicParameter, LiftUpRotForce_45_24A6D10D4780156F239446B6849AF985) == 0x000018, "Member 'FPsychicObjectPhysicParameter::LiftUpRotForce_45_24A6D10D4780156F239446B6849AF985' has a wrong offset!");
static_assert(offsetof(FPsychicObjectPhysicParameter, LiftUpRotForceRangeMin_46_A8CAE2AB42641587C79575AD7C1595A4) == 0x00001C, "Member 'FPsychicObjectPhysicParameter::LiftUpRotForceRangeMin_46_A8CAE2AB42641587C79575AD7C1595A4' has a wrong offset!");
static_assert(offsetof(FPsychicObjectPhysicParameter, LiftUpRotForceRangeMax_47_A8AFF6034C5305009194CB91652C80DC) == 0x000020, "Member 'FPsychicObjectPhysicParameter::LiftUpRotForceRangeMax_47_A8AFF6034C5305009194CB91652C80DC' has a wrong offset!");
static_assert(offsetof(FPsychicObjectPhysicParameter, LiftUpRotForceTime_48_BEB1EF154EA36AC1B0A8269AB17B7781) == 0x000024, "Member 'FPsychicObjectPhysicParameter::LiftUpRotForceTime_48_BEB1EF154EA36AC1B0A8269AB17B7781' has a wrong offset!");
static_assert(offsetof(FPsychicObjectPhysicParameter, LiftUpRotForceEase_57_AA0D7C04422743BDF74F29A5A40CBAA6) == 0x000028, "Member 'FPsychicObjectPhysicParameter::LiftUpRotForceEase_57_AA0D7C04422743BDF74F29A5A40CBAA6' has a wrong offset!");
static_assert(offsetof(FPsychicObjectPhysicParameter, ThrowRotForce_49_AE6A1F7041D9EB84743936882F37E0F2) == 0x00002C, "Member 'FPsychicObjectPhysicParameter::ThrowRotForce_49_AE6A1F7041D9EB84743936882F37E0F2' has a wrong offset!");
static_assert(offsetof(FPsychicObjectPhysicParameter, ThrowRotForceRangeMin_50_65DDE982460B4E9361B87596111C042A) == 0x000030, "Member 'FPsychicObjectPhysicParameter::ThrowRotForceRangeMin_50_65DDE982460B4E9361B87596111C042A' has a wrong offset!");
static_assert(offsetof(FPsychicObjectPhysicParameter, ThrowRotForceRangeMax_51_DEDA620D4608DD67E6339C84A1B0DC57) == 0x000034, "Member 'FPsychicObjectPhysicParameter::ThrowRotForceRangeMax_51_DEDA620D4608DD67E6339C84A1B0DC57' has a wrong offset!");
static_assert(offsetof(FPsychicObjectPhysicParameter, ThrowRotForceTime_52_788BD70147DEA8FEB46FED9DAFE26242) == 0x000038, "Member 'FPsychicObjectPhysicParameter::ThrowRotForceTime_52_788BD70147DEA8FEB46FED9DAFE26242' has a wrong offset!");
static_assert(offsetof(FPsychicObjectPhysicParameter, ThrowRotForceEase_58_740E994243B69B58965CFA9C25D3298E) == 0x00003C, "Member 'FPsychicObjectPhysicParameter::ThrowRotForceEase_58_740E994243B69B58965CFA9C25D3298E' has a wrong offset!");

}

