#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PsychicGrabParameterData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct PsychicGrabParameterData.PsychicGrabParameterData
// 0x0034 (0x0034 - 0x0000)
struct FPsychicGrabParameterData final
{
public:
	float                                         ReloadTimeGrab_104_8A92F7C24E6C6F0E1B000AB09B9594D0; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReloadTimeCombo_105_E54240D54308489DE4AA15862EDCBE89; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReloadTimeBrain_106_66DD45CF4B7B533ECB9AB58C44B9BF67; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReloadTimeRandomRate_111_88A189B84ABF9E4C08F418A724F30E74; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RespawnRestrictRange_122_772AB01548AB734483B89FA1FDCF8CD6; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RespawnRequeueTime_130_2D7F82A54AC351C6C37DCBA5C4F18356; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RespawnTimeNormal_126_A20867EA424FFEEA69D254A26545554F; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RespawnTimeUnique_127_E7E036C5411712E33E2B819E9EA476D6; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AttackCountSpBoomerang_116_46AA22F042E89E3CC39C14817A38474B; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AttackCountSpChipsaw_117_A71B9D334E53D32F02D00E9C6BE47B99; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AttackCountVM_138_55671329455BF448392A779969663145; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackIntervalVM_139_D0E491B04C3D346B88351E8FBF82077F; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackSpreadVM_143_2C9D07E347C42DC2AAF1CEA210192B51; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPsychicGrabParameterData) == 0x000004, "Wrong alignment on FPsychicGrabParameterData");
static_assert(sizeof(FPsychicGrabParameterData) == 0x000034, "Wrong size on FPsychicGrabParameterData");
static_assert(offsetof(FPsychicGrabParameterData, ReloadTimeGrab_104_8A92F7C24E6C6F0E1B000AB09B9594D0) == 0x000000, "Member 'FPsychicGrabParameterData::ReloadTimeGrab_104_8A92F7C24E6C6F0E1B000AB09B9594D0' has a wrong offset!");
static_assert(offsetof(FPsychicGrabParameterData, ReloadTimeCombo_105_E54240D54308489DE4AA15862EDCBE89) == 0x000004, "Member 'FPsychicGrabParameterData::ReloadTimeCombo_105_E54240D54308489DE4AA15862EDCBE89' has a wrong offset!");
static_assert(offsetof(FPsychicGrabParameterData, ReloadTimeBrain_106_66DD45CF4B7B533ECB9AB58C44B9BF67) == 0x000008, "Member 'FPsychicGrabParameterData::ReloadTimeBrain_106_66DD45CF4B7B533ECB9AB58C44B9BF67' has a wrong offset!");
static_assert(offsetof(FPsychicGrabParameterData, ReloadTimeRandomRate_111_88A189B84ABF9E4C08F418A724F30E74) == 0x00000C, "Member 'FPsychicGrabParameterData::ReloadTimeRandomRate_111_88A189B84ABF9E4C08F418A724F30E74' has a wrong offset!");
static_assert(offsetof(FPsychicGrabParameterData, RespawnRestrictRange_122_772AB01548AB734483B89FA1FDCF8CD6) == 0x000010, "Member 'FPsychicGrabParameterData::RespawnRestrictRange_122_772AB01548AB734483B89FA1FDCF8CD6' has a wrong offset!");
static_assert(offsetof(FPsychicGrabParameterData, RespawnRequeueTime_130_2D7F82A54AC351C6C37DCBA5C4F18356) == 0x000014, "Member 'FPsychicGrabParameterData::RespawnRequeueTime_130_2D7F82A54AC351C6C37DCBA5C4F18356' has a wrong offset!");
static_assert(offsetof(FPsychicGrabParameterData, RespawnTimeNormal_126_A20867EA424FFEEA69D254A26545554F) == 0x000018, "Member 'FPsychicGrabParameterData::RespawnTimeNormal_126_A20867EA424FFEEA69D254A26545554F' has a wrong offset!");
static_assert(offsetof(FPsychicGrabParameterData, RespawnTimeUnique_127_E7E036C5411712E33E2B819E9EA476D6) == 0x00001C, "Member 'FPsychicGrabParameterData::RespawnTimeUnique_127_E7E036C5411712E33E2B819E9EA476D6' has a wrong offset!");
static_assert(offsetof(FPsychicGrabParameterData, AttackCountSpBoomerang_116_46AA22F042E89E3CC39C14817A38474B) == 0x000020, "Member 'FPsychicGrabParameterData::AttackCountSpBoomerang_116_46AA22F042E89E3CC39C14817A38474B' has a wrong offset!");
static_assert(offsetof(FPsychicGrabParameterData, AttackCountSpChipsaw_117_A71B9D334E53D32F02D00E9C6BE47B99) == 0x000024, "Member 'FPsychicGrabParameterData::AttackCountSpChipsaw_117_A71B9D334E53D32F02D00E9C6BE47B99' has a wrong offset!");
static_assert(offsetof(FPsychicGrabParameterData, AttackCountVM_138_55671329455BF448392A779969663145) == 0x000028, "Member 'FPsychicGrabParameterData::AttackCountVM_138_55671329455BF448392A779969663145' has a wrong offset!");
static_assert(offsetof(FPsychicGrabParameterData, AttackIntervalVM_139_D0E491B04C3D346B88351E8FBF82077F) == 0x00002C, "Member 'FPsychicGrabParameterData::AttackIntervalVM_139_D0E491B04C3D346B88351E8FBF82077F' has a wrong offset!");
static_assert(offsetof(FPsychicGrabParameterData, AttackSpreadVM_143_2C9D07E347C42DC2AAF1CEA210192B51) == 0x000030, "Member 'FPsychicGrabParameterData::AttackSpreadVM_143_2C9D07E347C42DC2AAF1CEA210192B51' has a wrong offset!");

}

