#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: REDRuntime

#include "Basic.hpp"

#include "REDRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class REDRuntime.ParticleModuleLocationTrail
// 0x0050 (0x0080 - 0x0030)
class UParticleModuleLocationTrail final : public UParticleModuleLocationBase
{
public:
	ELocationTrailSource                          SourceType;                                        // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14CF[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WidthSplitNum;                                     // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRawDistributionVector                 Velocity;                                          // 0x0038(0x0048)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ParticleModuleLocationTrail">();
	}
	static class UParticleModuleLocationTrail* GetDefaultObj()
	{
		return GetDefaultObjImpl<UParticleModuleLocationTrail>();
	}
};
static_assert(alignof(UParticleModuleLocationTrail) == 0x000008, "Wrong alignment on UParticleModuleLocationTrail");
static_assert(sizeof(UParticleModuleLocationTrail) == 0x000080, "Wrong size on UParticleModuleLocationTrail");
static_assert(offsetof(UParticleModuleLocationTrail, SourceType) == 0x000030, "Member 'UParticleModuleLocationTrail::SourceType' has a wrong offset!");
static_assert(offsetof(UParticleModuleLocationTrail, WidthSplitNum) == 0x000034, "Member 'UParticleModuleLocationTrail::WidthSplitNum' has a wrong offset!");
static_assert(offsetof(UParticleModuleLocationTrail, Velocity) == 0x000038, "Member 'UParticleModuleLocationTrail::Velocity' has a wrong offset!");

}

