#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RSAtomCuePlay_AnimNotify

#include "Basic.hpp"


namespace SDK::Params
{

// Function RSAtomCuePlay_AnimNotify.RSAtomCuePlay_AnimNotify_C.Received_Notify
// 0x00A0 (0x00A0 - 0x0000)
struct RSAtomCuePlay_AnimNotify_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92C0[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBattleCharacterInterface> K2Node_DynamicCast_AsBattle_Character_Interface;   // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92C1[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_AjitoMember_C>    K2Node_DynamicCast_AsBPI_Ajito_Member;             // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDisableAtomCuePlayInterface_ReturnValue; // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92C2[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattleCharacter_C*                   K2Node_DynamicCast_AsRSBattle_Character;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92C3[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SASCopyPlayerActor_C*               K2Node_DynamicCast_AsBP_SASCopy_Player_Actor;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92C4[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SoundManager_C*                     CallFunc_GetSoundManager_Sound_Manager;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92C5[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SoundManager_C*                     CallFunc_GetSoundManager_Sound_Manager_1;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92C6[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAtomComponentBase*                   CallFunc_RSAtomCuePlay_AnimNotify_Native_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetVoiceAtomComp_Return;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RSAtomCuePlay_AnimNotify_C_Received_Notify) == 0x000008, "Wrong alignment on RSAtomCuePlay_AnimNotify_C_Received_Notify");
static_assert(sizeof(RSAtomCuePlay_AnimNotify_C_Received_Notify) == 0x0000A0, "Wrong size on RSAtomCuePlay_AnimNotify_C_Received_Notify");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_Received_Notify, MeshComp) == 0x000000, "Member 'RSAtomCuePlay_AnimNotify_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_Received_Notify, Animation) == 0x000008, "Member 'RSAtomCuePlay_AnimNotify_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_Received_Notify, ReturnValue) == 0x000010, "Member 'RSAtomCuePlay_AnimNotify_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'RSAtomCuePlay_AnimNotify_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_Received_Notify, K2Node_DynamicCast_AsBattle_Character_Interface) == 0x000020, "Member 'RSAtomCuePlay_AnimNotify_C_Received_Notify::K2Node_DynamicCast_AsBattle_Character_Interface' has a wrong offset!");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'RSAtomCuePlay_AnimNotify_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_Received_Notify, K2Node_DynamicCast_AsBPI_Ajito_Member) == 0x000038, "Member 'RSAtomCuePlay_AnimNotify_C_Received_Notify::K2Node_DynamicCast_AsBPI_Ajito_Member' has a wrong offset!");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_Received_Notify, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'RSAtomCuePlay_AnimNotify_C_Received_Notify::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_Received_Notify, CallFunc_IsDisableAtomCuePlayInterface_ReturnValue) == 0x000049, "Member 'RSAtomCuePlay_AnimNotify_C_Received_Notify::CallFunc_IsDisableAtomCuePlayInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_Received_Notify, K2Node_DynamicCast_AsRSBattle_Character) == 0x000050, "Member 'RSAtomCuePlay_AnimNotify_C_Received_Notify::K2Node_DynamicCast_AsRSBattle_Character' has a wrong offset!");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_Received_Notify, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'RSAtomCuePlay_AnimNotify_C_Received_Notify::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_Received_Notify, K2Node_DynamicCast_AsBP_SASCopy_Player_Actor) == 0x000060, "Member 'RSAtomCuePlay_AnimNotify_C_Received_Notify::K2Node_DynamicCast_AsBP_SASCopy_Player_Actor' has a wrong offset!");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_Received_Notify, K2Node_DynamicCast_bSuccess_3) == 0x000068, "Member 'RSAtomCuePlay_AnimNotify_C_Received_Notify::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_Received_Notify, CallFunc_GetSoundManager_Sound_Manager) == 0x000070, "Member 'RSAtomCuePlay_AnimNotify_C_Received_Notify::CallFunc_GetSoundManager_Sound_Manager' has a wrong offset!");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'RSAtomCuePlay_AnimNotify_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_Received_Notify, CallFunc_GetSoundManager_Sound_Manager_1) == 0x000080, "Member 'RSAtomCuePlay_AnimNotify_C_Received_Notify::CallFunc_GetSoundManager_Sound_Manager_1' has a wrong offset!");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_Received_Notify, CallFunc_IsValid_ReturnValue_1) == 0x000088, "Member 'RSAtomCuePlay_AnimNotify_C_Received_Notify::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_Received_Notify, CallFunc_RSAtomCuePlay_AnimNotify_Native_ReturnValue) == 0x000090, "Member 'RSAtomCuePlay_AnimNotify_C_Received_Notify::CallFunc_RSAtomCuePlay_AnimNotify_Native_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_Received_Notify, CallFunc_SetVoiceAtomComp_Return) == 0x000098, "Member 'RSAtomCuePlay_AnimNotify_C_Received_Notify::CallFunc_SetVoiceAtomComp_Return' has a wrong offset!");

// Function RSAtomCuePlay_AnimNotify.RSAtomCuePlay_AnimNotify_C.GetNotifyName
// 0x0048 (0x0048 - 0x0000)
struct RSAtomCuePlay_AnimNotify_C_GetNotifyName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 NotifyName;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92C7[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetNotifyName_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(RSAtomCuePlay_AnimNotify_C_GetNotifyName) == 0x000008, "Wrong alignment on RSAtomCuePlay_AnimNotify_C_GetNotifyName");
static_assert(sizeof(RSAtomCuePlay_AnimNotify_C_GetNotifyName) == 0x000048, "Wrong size on RSAtomCuePlay_AnimNotify_C_GetNotifyName");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_GetNotifyName, ReturnValue) == 0x000000, "Member 'RSAtomCuePlay_AnimNotify_C_GetNotifyName::ReturnValue' has a wrong offset!");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_GetNotifyName, NotifyName) == 0x000010, "Member 'RSAtomCuePlay_AnimNotify_C_GetNotifyName::NotifyName' has a wrong offset!");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_GetNotifyName, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'RSAtomCuePlay_AnimNotify_C_GetNotifyName::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_GetNotifyName, CallFunc_GetDisplayName_ReturnValue) == 0x000028, "Member 'RSAtomCuePlay_AnimNotify_C_GetNotifyName::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_GetNotifyName, CallFunc_GetNotifyName_ReturnValue) == 0x000038, "Member 'RSAtomCuePlay_AnimNotify_C_GetNotifyName::CallFunc_GetNotifyName_ReturnValue' has a wrong offset!");

// Function RSAtomCuePlay_AnimNotify.RSAtomCuePlay_AnimNotify_C.OnSetEditorSound
// 0x0008 (0x0008 - 0x0000)
struct RSAtomCuePlay_AnimNotify_C_OnSetEditorSound final
{
public:
	class USoundAtomCue*                          Param_Sound;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RSAtomCuePlay_AnimNotify_C_OnSetEditorSound) == 0x000008, "Wrong alignment on RSAtomCuePlay_AnimNotify_C_OnSetEditorSound");
static_assert(sizeof(RSAtomCuePlay_AnimNotify_C_OnSetEditorSound) == 0x000008, "Wrong size on RSAtomCuePlay_AnimNotify_C_OnSetEditorSound");
static_assert(offsetof(RSAtomCuePlay_AnimNotify_C_OnSetEditorSound, Param_Sound) == 0x000000, "Member 'RSAtomCuePlay_AnimNotify_C_OnSetEditorSound::Param_Sound' has a wrong offset!");

}

