#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RSAtomCuePlay_AnimNotify

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RSAtomCuePlay_AnimNotify.RSAtomCuePlay_AnimNotify_C
// 0x0028 (0x0068 - 0x0040)
class URSAtomCuePlay_AnimNotify_C final : public URSAtomCuePlayNotifyBase
{
public:
	class USoundAtomCue*                          Sound;                                             // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Bone;                                              // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Component;                                         // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAttenuation*                      Attenuation;                                       // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseWeaponLocation;                                // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EGetPlayerWeaponType                          WeaponType;                                        // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoUse3DPan;                                        // 0x0062(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDisableCheck;                                     // 0x0063(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bPlaySASCopyPlayer;                                // 0x0064(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation) const;
	class FString GetNotifyName() const;
	void OnSetEditorSound(class USoundAtomCue* Param_Sound) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RSAtomCuePlay_AnimNotify_C">();
	}
	static class URSAtomCuePlay_AnimNotify_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URSAtomCuePlay_AnimNotify_C>();
	}
};
static_assert(alignof(URSAtomCuePlay_AnimNotify_C) == 0x000008, "Wrong alignment on URSAtomCuePlay_AnimNotify_C");
static_assert(sizeof(URSAtomCuePlay_AnimNotify_C) == 0x000068, "Wrong size on URSAtomCuePlay_AnimNotify_C");
static_assert(offsetof(URSAtomCuePlay_AnimNotify_C, Sound) == 0x000040, "Member 'URSAtomCuePlay_AnimNotify_C::Sound' has a wrong offset!");
static_assert(offsetof(URSAtomCuePlay_AnimNotify_C, Bone) == 0x000048, "Member 'URSAtomCuePlay_AnimNotify_C::Bone' has a wrong offset!");
static_assert(offsetof(URSAtomCuePlay_AnimNotify_C, Component) == 0x000050, "Member 'URSAtomCuePlay_AnimNotify_C::Component' has a wrong offset!");
static_assert(offsetof(URSAtomCuePlay_AnimNotify_C, Attenuation) == 0x000058, "Member 'URSAtomCuePlay_AnimNotify_C::Attenuation' has a wrong offset!");
static_assert(offsetof(URSAtomCuePlay_AnimNotify_C, bUseWeaponLocation) == 0x000060, "Member 'URSAtomCuePlay_AnimNotify_C::bUseWeaponLocation' has a wrong offset!");
static_assert(offsetof(URSAtomCuePlay_AnimNotify_C, WeaponType) == 0x000061, "Member 'URSAtomCuePlay_AnimNotify_C::WeaponType' has a wrong offset!");
static_assert(offsetof(URSAtomCuePlay_AnimNotify_C, NoUse3DPan) == 0x000062, "Member 'URSAtomCuePlay_AnimNotify_C::NoUse3DPan' has a wrong offset!");
static_assert(offsetof(URSAtomCuePlay_AnimNotify_C, bDisableCheck) == 0x000063, "Member 'URSAtomCuePlay_AnimNotify_C::bDisableCheck' has a wrong offset!");
static_assert(offsetof(URSAtomCuePlay_AnimNotify_C, bPlaySASCopyPlayer) == 0x000064, "Member 'URSAtomCuePlay_AnimNotify_C::bPlaySASCopyPlayer' has a wrong offset!");

}

