#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RsBattleHero

#include "Basic.hpp"

#include "EPlayerAIBattleThinkType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "Engine_structs.hpp"
#include "F_SASInputData_structs.hpp"
#include "E_SASKind_structs.hpp"
#include "EPsychicDitherType_structs.hpp"
#include "EPlayerPsychicActionParam_structs.hpp"
#include "RSBattlePlayer_classes.hpp"
#include "EPlayerUseItemSpeed_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass RsBattleHero.RsBattleHero_C
// 0x02E0 (0x1FD0 - 0x1CF0)
class ARsBattleHero_C final : public ARSBattlePlayer_C
{
public:
	uint8                                         Pad_5484[0x4];                                     // 0x1CE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_RsBattleHero_C;                     // 0x1CE8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_NexusDriveComponent_C*              BP_NexusDriveComponent;                            // 0x1CF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayerPsychicObjectComponent_C*     BP_PlayerPsychicObjectComponent;                   // 0x1CF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayerSequencerComponent_C*         BP_PlayerSequencerComponent;                       // 0x1D00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDamagePostEffectComponent_C*           DamagePostEffectComponent;                         // 0x1D08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SAS_PlayerState_C*                  BP_SAS_PlayerState;                                // 0x1D10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayerEmissionComponent_C*          BP_PlayerEmissionComponent;                        // 0x1D18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPsychicGrabComponent_C*                PsychicGrabComponent;                              // 0x1D20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            EnpcSASTimeLine__Direction_40BE0B2848433BB641F9E4A9E97A4077; // 0x1D28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5485[0x7];                                     // 0x1D29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     EnpcSASTimeLine;                                   // 0x1D30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PsychicThrowActionTime;                            // 0x1D38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PsychicCaptureActionTime;                          // 0x1D3C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsIK_Init;                                         // 0x1D40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5486[0x3];                                     // 0x1D41(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               HandRotator;                                       // 0x1D44(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                HandOffset;                                        // 0x1D50(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameTimer                             AfterTelepoInvincibleTimer;                        // 0x1D5C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FName                                   AfterTelepoInvincibleClaimantName;                 // 0x1D68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanAnimOverrideSASColor;                           // 0x1D70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5487[0x3];                                     // 0x1D71(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameTimer                             SASSeeThroughTimer;                                // 0x1D74(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class FName>                           HideSASOutlineClaimantList;                        // 0x1D80(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             DispatchPsychicUniqueSuccess;                      // 0x1D90(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             DispatchPsychicCaptureCompleted;                   // 0x1DA0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             DispatchPsychicCaptureCancel;                      // 0x1DB0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             DispatchPsychicComboAttack;                        // 0x1DC0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TSet<class FName>                             PsychicEffectClaimantList;                         // 0x1DD0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         UniquePsychicBonusLevel;                           // 0x1E20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPrecedeInputPsychic;                              // 0x1E24(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPrecedeInputPsychicUnique;                        // 0x1E25(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5488[0x2];                                     // 0x1E26(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FF_SASInputData>                SASInputData;                                      // 0x1E28(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class AMapGimmickObject*                      CurrentMapGimmickObject;                           // 0x1E38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableCaptureMapGimmick;                          // 0x1E40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPayPsychicCost;                                   // 0x1E41(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPsychicComboPostProcess;                          // 0x1E42(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCancelMapGimmick;                                 // 0x1E43(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FName                                   ClaimantNameDrive;                                 // 0x1E44(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameTimer                             AutoStealthIntervalTimer;                          // 0x1E4C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameTimer                             AutoStealthTimer;                                  // 0x1E58(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameTimer                             CoverDamageIntervalTimer;                          // 0x1E64(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SkillAction_AirJump;                               // 0x1E70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SkillAction_BlowRecovery;                          // 0x1E71(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SkillAttack_AirCombo1;                             // 0x1E72(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SkillAttack_AirLongPressAttack;                    // 0x1E73(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SkillAttack_WeaponCombo1;                          // 0x1E74(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SkillAttack_WeaponCombo2;                          // 0x1E75(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SkillAttack_PsychicSlam;                           // 0x1E76(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5489[0x1];                                     // 0x1E77(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SkillAttack_ChargeAttackLV;                        // 0x1E78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Skill_WeaponCrashScale;                            // 0x1E7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Skill_PsychicCrashScale;                           // 0x1E80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Skill_DownDamageUp;                                // 0x1E84(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SkillAttack_BrainFieldThrowLevel;                  // 0x1E88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SkillAttack_BrainFieldSwingLevel;                  // 0x1E8C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SkillAttack_BrainFieldChargeLevel;                 // 0x1E90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBeginPsychicDither;                               // 0x1E94(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_548A[0x3];                                     // 0x1E95(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         PsychicDitherIgnoreList;                           // 0x1E98(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             DispatchPsychicUniqueInputStart;                   // 0x1EA8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         PsychicDitherTimer;                                // 0x1EB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PsychicDitherTimerMax;                             // 0x1EBC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             DispatchPsychicUniqueEnd;                          // 0x1EC0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         PsychicDitherEndTime;                              // 0x1ED0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_548B[0x4];                                     // 0x1ED4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           SeeThroughPostProcessClaimantNameList;             // 0x1ED8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         Param_CancelSASCostRate;                           // 0x1EE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SASStackNum;                                       // 0x1EEC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             DispatchPsychicUniqueAimBegin;                     // 0x1EF0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bCaptureTypeCombo;                                 // 0x1F00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	E_SASKind                                     EnpcSASDirectionKind;                              // 0x1F01(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_548C[0x6];                                     // 0x1F02(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAssassinAttackData                    Param_AssassinAttack;                              // 0x1F08(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Skill_AerialAttackPsychicGaugeUp;                  // 0x1F48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Skill_PinchStatusUp;                               // 0x1F4C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_548D[0x3];                                     // 0x1F4D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Skill_DriveCrashScale;                             // 0x1F50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkillAction_NoStockBrainField;                     // 0x1F54(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIgnoreBrainFieldStock;                            // 0x1F55(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_548E[0x2];                                     // 0x1F56(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAtomComponentBase*                   BrainFieldBackGroundVoiceHandle;                   // 0x1F58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Skill_PinchAttackUpRate;                           // 0x1F60(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Skill_PinchDamageDownRate;                         // 0x1F64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Skill_BrainFieldOverKill;                          // 0x1F68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Skill_AutoPickUp;                                  // 0x1F69(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_548F[0x2];                                     // 0x1F6A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SkillAttack_PsychicComboAddLevel;                  // 0x1F6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SkillAttack_AerialPsychicComboAddLevel;            // 0x1F70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnpcUseDuelPole;                                 // 0x1F74(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bPsychicInputButtonPressed;                        // 0x1F75(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	E_SASKindNative                               LastUseSASKind;                                    // 0x1F76(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5490[0x1];                                     // 0x1F77(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LastUseSASCount;                                   // 0x1F78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5491[0x4];                                     // 0x1F7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAtomComponentBase*                   PsychicComboCaptureSEHandle;                       // 0x1F80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Skill_JustDodgeUpRecoveryValue;                    // 0x1F88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5492[0x4];                                     // 0x1F8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSkillSASRecoverData                   Skill_SasRecover;                                  // 0x1F90(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsEnpcSasCamera;                                   // 0x1FA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEnpcSasTimeDilation;                             // 0x1FA9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Skill_OverkillBonus;                               // 0x1FAA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5493[0x1];                                     // 0x1FAB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SkillAction_AirDodgeCount;                         // 0x1FAC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Skill_BrainFieldDamageCut;                         // 0x1FB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SasRecastRecoveryDelayTime;                        // 0x1FB4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerPsychicActionParam                     LastFlyingPsychicPattern;                          // 0x1FB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERSAttackInputKind                            LastBrainFieldChargeAttackInputKind;               // 0x1FB9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5494[0x2];                                     // 0x1FBA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EnpcSasTimeDilationTimer;                          // 0x1FBC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SkillAttack_BackStepAttackCount;                   // 0x1FC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSasTelepoAttackAirResetOnce;                      // 0x1FC4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bTelepoComboSetting;                               // 0x1FC5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bTelepoComboSettingAir;                            // 0x1FC6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5495[0x1];                                     // 0x1FC7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BackupManualAssaultVisionSasRate;                  // 0x1FC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIgnoreManualHologramAttack;                       // 0x1FCC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void DispatchPsychicUniqueSuccess__DelegateSignature(class UAnimMontage* Montage);
	void DispatchPsychicCaptureCompleted__DelegateSignature(class UAnimMontage* FirstAttackMontage);
	void DispatchPsychicCaptureCancel__DelegateSignature();
	void DispatchPsychicComboAttack__DelegateSignature();
	void DispatchPsychicUniqueInputStart__DelegateSignature();
	void DispatchPsychicUniqueEnd__DelegateSignature();
	void DispatchPsychicUniqueAimBegin__DelegateSignature(class ABP_PsychicObjectBasic_C* PsychicObject);
	void ExecuteUbergraph_RsBattleHero(int32 EntryPoint);
	void UnregisterDelayDriveEnd(EPlayerID PlayerId);
	void RegisterDelayDriveEnd(EPlayerID PlayerId);
	void UnregisterNpcDriveForNexusDrive(EPlayerID PlayerId);
	void RegisterNpcDriveForNexusDrive(EPlayerID PlayerId);
	void UnbindHologramOff();
	void BindHologramOff();
