#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RSBattlePlayer

#include "Basic.hpp"

#include "EBattlePhase_em8210_structs.hpp"
#include "EPlayerAIBattleThinkType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "Engine_structs.hpp"
#include "EBattleVoice_em8200_structs.hpp"
#include "PsychicGrabButtonType_structs.hpp"
#include "FPlayerBattleParticleData_structs.hpp"
#include "Enum_BattleType_em8000_structs.hpp"
#include "FRegisterShotData_structs.hpp"
#include "EPlayerAIBattleThinkParam_structs.hpp"
#include "EBulletType_structs.hpp"
#include "EDeadFactor_structs.hpp"
#include "ST_em8220_CableInfo_structs.hpp"
#include "ECharaDeadType_structs.hpp"
#include "Enum_BattleType_em8010_structs.hpp"
#include "EPlayerAnimMontage_structs.hpp"
#include "ST_em_ChangeTimeDilation_structs.hpp"
#include "E_SASKind_structs.hpp"
#include "ETelepoMoveType_em8200_structs.hpp"
#include "EBattleBonusAddType_structs.hpp"
#include "FSASCommand_structs.hpp"
#include "ECharaExecuteNotifyKind_structs.hpp"
#include "DE_em_ChangeTimeDilation_structs.hpp"
#include "Enum_EnemyAiType_structs.hpp"
#include "FSASTelepoParam_structs.hpp"
#include "EPlayerComboPattern_structs.hpp"
#include "Enum_EnemySound_structs.hpp"
#include "EPlayerUseItemSpeed_structs.hpp"
#include "EPlayerAIMoveMode_structs.hpp"
#include "F_AssultVisionRequestPool_structs.hpp"
#include "EPlayerMaterialManageType_structs.hpp"
#include "FPlayerBattleVoiceFacialAnimType_structs.hpp"
#include "FPlayerAIBattleThinkTransitionData_structs.hpp"
#include "EParamAfterEventAction_structs.hpp"
#include "Enum_EnemySpawnState_structs.hpp"
#include "BadStateAddParticleData_structs.hpp"
#include "EEnpcMetamorphosisiFinishType_structs.hpp"
#include "EPlayerBattleVoiceType_structs.hpp"
#include "EPlayerFacialAnim_structs.hpp"
#include "F_SASParam_structs.hpp"
#include "FCombinationVisionData_structs.hpp"
#include "E_SceneType_structs.hpp"
#include "EPlayerCapsuleSize_structs.hpp"
#include "CharactersParameter_structs.hpp"
#include "EBonusGhostType_structs.hpp"
#include "EPlayerReviveKind_structs.hpp"
#include "AttackCollisionInfoBP_structs.hpp"
#include "AcceleratorParam_structs.hpp"
#include "FSASElectricParam_structs.hpp"
#include "FSASFireParam_structs.hpp"
#include "FSASSeeThroughParam_structs.hpp"
#include "FSASMetalParam_structs.hpp"
#include "FSASStealthParam_structs.hpp"
#include "FSASCopyParam_structs.hpp"
#include "FSASPsychicParam_structs.hpp"


namespace SDK::Params
{

// Function RSBattlePlayer.RSBattlePlayer_C.OnChangePsychicObjShow__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct RSBattlePlayer_C_OnChangePsychicObjShow__DelegateSignature final
{
public:
	EPsychicGrabButtonType                        Button;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShow;                                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78FE[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RSBattlePlayer_C_OnChangePsychicObjShow__DelegateSignature) == 0x000004, "Wrong alignment on RSBattlePlayer_C_OnChangePsychicObjShow__DelegateSignature");
static_assert(sizeof(RSBattlePlayer_C_OnChangePsychicObjShow__DelegateSignature) == 0x000008, "Wrong size on RSBattlePlayer_C_OnChangePsychicObjShow__DelegateSignature");
static_assert(offsetof(RSBattlePlayer_C_OnChangePsychicObjShow__DelegateSignature, Button) == 0x000000, "Member 'RSBattlePlayer_C_OnChangePsychicObjShow__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(RSBattlePlayer_C_OnChangePsychicObjShow__DelegateSignature, bShow) == 0x000001, "Member 'RSBattlePlayer_C_OnChangePsychicObjShow__DelegateSignature::bShow' has a wrong offset!");
static_assert(offsetof(RSBattlePlayer_C_OnChangePsychicObjShow__DelegateSignature, Count) == 0x000004, "Member 'RSBattlePlayer_C_OnChangePsychicObjShow__DelegateSignature::Count' has a wrong offset!");

// Function RSBattlePlayer.RSBattlePlayer_C.OnChangePsychicObjEnable__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct RSBattlePlayer_C_OnChangePsychicObjEnable__DelegateSignature final
{
public:
	EPsychicGrabButtonType                        Button;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RSBattlePlayer_C_OnChangePsychicObjEnable__DelegateSignature) == 0x000001, "Wrong alignment on RSBattlePlayer_C_OnChangePsychicObjEnable__DelegateSignature");
static_assert(sizeof(RSBattlePlayer_C_OnChangePsychicObjEnable__DelegateSignature) == 0x000002, "Wrong size on RSBattlePlayer_C_OnChangePsychicObjEnable__DelegateSignature");
static_assert(offsetof(RSBattlePlayer_C_OnChangePsychicObjEnable__DelegateSignature, Button) == 0x000000, "Member 'RSBattlePlayer_C_OnChangePsychicObjEnable__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(RSBattlePlayer_C_OnChangePsychicObjEnable__DelegateSignature, bEnable) == 0x000001, "Member 'RSBattlePlayer_C_OnChangePsychicObjEnable__DelegateSignature::bEnable' has a wrong offset!");

// Function RSBattlePlayer.RSBattlePlayer_C.OnChangePsychicObjUse__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct RSBattlePlayer_C_OnChangePsychicObjUse__DelegateSignature final
{
public:
	EPsychicGrabButtonType                        Button;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RSBattlePlayer_C_OnChangePsychicObjUse__DelegateSignature) == 0x000001, "Wrong alignment on RSBattlePlayer_C_OnChangePsychicObjUse__DelegateSignature");
static_assert(sizeof(RSBattlePlayer_C_OnChangePsychicObjUse__DelegateSignature) == 0x000001, "Wrong size on RSBattlePlayer_C_OnChangePsychicObjUse__DelegateSignature");
static_assert(offsetof(RSBattlePlayer_C_OnChangePsychicObjUse__DelegateSignature, Button) == 0x000000, "Member 'RSBattlePlayer_C_OnChangePsychicObjUse__DelegateSignature::Button' has a wrong offset!");

// Function RSBattlePlayer.RSBattlePlayer_C.OnChangePsychicObjCount__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct RSBattlePlayer_C_OnChangePsychicObjCount__DelegateSignature final
{
public:
	EPsychicGrabButtonType                        Button;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78FF[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RSBattlePlayer_C_OnChangePsychicObjCount__DelegateSignature) == 0x000004, "Wrong alignment on RSBattlePlayer_C_OnChangePsychicObjCount__DelegateSignature");
static_assert(sizeof(RSBattlePlayer_C_OnChangePsychicObjCount__DelegateSignature) == 0x000008, "Wrong size on RSBattlePlayer_C_OnChangePsychicObjCount__DelegateSignature");
static_assert(offsetof(RSBattlePlayer_C_OnChangePsychicObjCount__DelegateSignature, Button) == 0x000000, "Member 'RSBattlePlayer_C_OnChangePsychicObjCount__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(RSBattlePlayer_C_OnChangePsychicObjCount__DelegateSignature, Count) == 0x000004, "Member 'RSBattlePlayer_C_OnChangePsychicObjCount__DelegateSignature::Count' has a wrong offset!");

// Function RSBattlePlayer.RSBattlePlayer_C.OnChangePsychicObjShow2__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct RSBattlePlayer_C_OnChangePsychicObjShow2__DelegateSignature final
{
public:
	bool                                          Unique;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Show;                                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7900[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Obj_count;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RSBattlePlayer_C_OnChangePsychicObjShow2__DelegateSignature) == 0x000004, "Wrong alignment on RSBattlePlayer_C_OnChangePsychicObjShow2__DelegateSignature");
static_assert(sizeof(RSBattlePlayer_C_OnChangePsychicObjShow2__DelegateSignature) == 0x000008, "Wrong size on RSBattlePlayer_C_OnChangePsychicObjShow2__DelegateSignature");
static_assert(offsetof(RSBattlePlayer_C_OnChangePsychicObjShow2__DelegateSignature, Unique) == 0x000000, "Member 'RSBattlePlayer_C_OnChangePsychicObjShow2__DelegateSignature::Unique' has a wrong offset!");
static_assert(offsetof(RSBattlePlayer_C_OnChangePsychicObjShow2__DelegateSignature, Show) == 0x000001, "Member 'RSBattlePlayer_C_OnChangePsychicObjShow2__DelegateSignature::Show' has a wrong offset!");
static_assert(offsetof(RSBattlePlayer_C_OnChangePsychicObjShow2__DelegateSignature, Obj_count) == 0x000004, "Member 'RSBattlePlayer_C_OnChangePsychicObjShow2__DelegateSignature::Obj_count' has a wrong offset!");

// Function RSBattlePlayer.RSBattlePlayer_C.OnChangePsychicObjEnable2__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct RSBattlePlayer_C_OnChangePsychicObjEnable2__DelegateSignature final
{
public:
	bool                                          Unique;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Enable;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RSBattlePlayer_C_OnChangePsychicObjEnable2__DelegateSignature) == 0x000001, "Wrong alignment on RSBattlePlayer_C_OnChangePsychicObjEnable2__DelegateSignature");
static_assert(sizeof(RSBattlePlayer_C_OnChangePsychicObjEnable2__DelegateSignature) == 0x000002, "Wrong size on RSBattlePlayer_C_OnChangePsychicObjEnable2__DelegateSignature");
static_assert(offsetof(RSBattlePlayer_C_OnChangePsychicObjEnable2__DelegateSignature, Unique) == 0x000000, "Member 'RSBattlePlayer_C_OnChangePsychicObjEnable2__DelegateSignature::Unique' has a wrong offset!");
static_assert(offsetof(RSBattlePlayer_C_OnChangePsychicObjEnable2__DelegateSignature, Enable) == 0x000001, "Member 'RSBattlePlayer_C_OnChangePsychicObjEnable2__DelegateSignature::Enable' has a wrong offset!");

// Function RSBattlePlayer.RSBattlePlayer_C.OnChangePsychicObjUse2__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct RSBattlePlayer_C_OnChangePsychicObjUse2__DelegateSignature final
{
public:
	bool                                          Unique;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RSBattlePlayer_C_OnChangePsychicObjUse2__DelegateSignature) == 0x000001, "Wrong alignment on RSBattlePlayer_C_OnChangePsychicObjUse2__DelegateSignature");
static_assert(sizeof(RSBattlePlayer_C_OnChangePsychicObjUse2__DelegateSignature) == 0x000001, "Wrong size on RSBattlePlayer_C_OnChangePsychicObjUse2__DelegateSignature");
static_assert(offsetof(RSBattlePlayer_C_OnChangePsychicObjUse2__DelegateSignature, Unique) == 0x000000, "Member 'RSBattlePlayer_C_OnChangePsychicObjUse2__DelegateSignature::Unique' has a wrong offset!");

// Function RSBattlePlayer.RSBattlePlayer_C.OnChangePsychicObjCount2__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct RSBattlePlayer_C_OnChangePsychicObjCount2__DelegateSignature final
{
public:
	bool                                          Unique;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7901[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RSBattlePlayer_C_OnChangePsychicObjCount2__DelegateSignature) == 0x000004, "Wrong alignment on RSBattlePlayer_C_OnChangePsychicObjCount2__DelegateSignature");
static_assert(sizeof(RSBattlePlayer_C_OnChangePsychicObjCount2__DelegateSignature) == 0x000008, "Wrong size on RSBattlePlayer_C_OnChangePsychicObjCount2__DelegateSignature");
static_assert(offsetof(RSBattlePlayer_C_OnChangePsychicObjCount2__DelegateSignature, Unique) == 0x000000, "Member 'RSBattlePlayer_C_OnChangePsychicObjCount2__DelegateSignature::Unique' has a wrong offset!");
static_assert(offsetof(RSBattlePlayer_C_OnChangePsychicObjCount2__DelegateSignature, Count) == 0x000004, "Member 'RSBattlePlayer_C_OnChangePsychicObjCount2__DelegateSignature::Count' has a wrong offset!");

// Function RSBattlePlayer.RSBattlePlayer_C.DispatchMontageBlendingOut__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct RSBattlePlayer_C_DispatchMontageBlendingOut__DelegateSignature final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RSBattlePlayer_C_DispatchMontageBlendingOut__DelegateSignature) == 0x000008, "Wrong alignment on RSBattlePlayer_C_DispatchMontageBlendingOut__DelegateSignature");
static_assert(sizeof(RSBattlePlayer_C_DispatchMontageBlendingOut__DelegateSignature) == 0x000010, "Wrong size on RSBattlePlayer_C_DispatchMontageBlendingOut__DelegateSignature");
static_assert(offsetof(RSBattlePlayer_C_DispatchMontageBlendingOut__DelegateSignature, Montage) == 0x000000, "Member 'RSBattlePlayer_C_DispatchMontageBlendingOut__DelegateSignature::Montage' has a wrong offset!");
static_assert(offsetof(RSBattlePlayer_C_DispatchMontageBlendingOut__DelegateSignature, bInterrupted) == 0x000008, "Member 'RSBattlePlayer_C_DispatchMontageBlendingOut__DelegateSignature::bInterrupted' has a wrong offset!");

// Function RSBattlePlayer.RSBattlePlayer_C.OnTelepoDodgeBegin__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct RSBattlePlayer_C_OnTelepoDodgeBegin__DelegateSignature final
{
public:
	class ARSBattlePlayer_C*                      Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RSBattlePlayer_C_OnTelepoDodgeBegin__DelegateSignature) == 0x000008, "Wrong alignment on RSBattlePlayer_C_OnTelepoDodgeBegin__DelegateSignature");
static_assert(sizeof(RSBattlePlayer_C_OnTelepoDodgeBegin__DelegateSignature) == 0x000008, "Wrong size on RSBattlePlayer_C_OnTelepoDodgeBegin__DelegateSignature");
static_assert(offsetof(RSBattlePlayer_C_OnTelepoDodgeBegin__DelegateSignature, Player) == 0x000000, "Member 'RSBattlePlayer_C_OnTelepoDodgeBegin__DelegateSignature::Player' has a wrong offset!");

// Function RSBattlePlayer.RSBattlePlayer_C.OnTelepoDodgeEnd__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct RSBattlePlayer_C_OnTelepoDodgeEnd__DelegateSignature final
{
public:
	class ARSBattlePlayer_C*                      Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RSBattlePlayer_C_OnTelepoDodgeEnd__DelegateSignature) == 0x000008, "Wrong alignment on RSBattlePlayer_C_OnTelepoDodgeEnd__DelegateSignature");
static_assert(sizeof(RSBattlePlayer_C_OnTelepoDodgeEnd__DelegateSignature) == 0x000008, "Wrong size on RSBattlePlayer_C_OnTelepoDodgeEnd__DelegateSignature");
static_assert(offsetof(RSBattlePlayer_C_OnTelepoDodgeEnd__DelegateSignature, Player) == 0x000000, "Member 'RSBattlePlayer_C_OnTelepoDodgeEnd__DelegateSignature::Player' has a wrong offset!");

// Function RSBattlePlayer.RSBattlePlayer_C.DispatchChangeWalkRunStateKind__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct RSBattlePlayer_C_DispatchChangeWalkRunStateKind__DelegateSignature final
{
public:
	EPlayerWalkRunStateKind                       Kind;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RSBattlePlayer_C_DispatchChangeWalkRunStateKind__DelegateSignature) == 0x000001, "Wrong alignment on RSBattlePlayer_C_DispatchChangeWalkRunStateKind__DelegateSignature");
static_assert(sizeof(RSBattlePlayer_C_DispatchChangeWalkRunStateKind__DelegateSignature) == 0x000001, "Wrong size on RSBattlePlayer_C_DispatchChangeWalkRunStateKind__DelegateSignature");
static_assert(offsetof(RSBattlePlayer_C_DispatchChangeWalkRunStateKind__DelegateSignature, Kind) == 0x000000, "Member 'RSBattlePlayer_C_DispatchChangeWalkRunStateKind__DelegateSignature::Kind' has a wrong offset!");

// Function RSBattlePlayer.RSBattlePlayer_C.DispatchMontageEnded__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct RSBattlePlayer_C_DispatchMontageEnded__DelegateSignature final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RSBattlePlayer_C_DispatchMontageEnded__DelegateSignature) == 0x000008, "Wrong alignment on RSBattlePlayer_C_DispatchMontageEnded__DelegateSignature");
static_assert(sizeof(RSBattlePlayer_C_DispatchMontageEnded__DelegateSignature) == 0x000010, "Wrong size on RSBattlePlayer_C_DispatchMontageEnded__DelegateSignature");
static_assert(offsetof(RSBattlePlayer_C_DispatchMontageEnded__DelegateSignature, Montage) == 0x000000, "Member 'RSBattlePlayer_C_DispatchMontageEnded__DelegateSignature::Montage' has a wrong offset!");
static_assert(offsetof(RSBattlePlayer_C_DispatchMontageEnded__DelegateSignature, bInterrupted) == 0x000008, "Member 'RSBattlePlayer_C_DispatchMontageEnded__DelegateSignature::bInterrupted' has a wrong offset!");

// Function RSBattlePlayer.RSBattlePlayer_C.DispatchAttackActorHit__DelegateSignature
// 0x01C0 (0x01C0 - 0x0000)
struct RSBattlePlayer_C_DispatchAttackActorHit__DelegateSignature final
{
public:
	struct FHCHitResult                           HitResult;                                         // 0x0000(0x01C0)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(RSBattlePlayer_C_DispatchAttackActorHit__DelegateSignature) == 0x000008, "Wrong alignment on RSBattlePlayer_C_DispatchAttackActorHit__DelegateSignature");
static_assert(sizeof(RSBattlePlayer_C_DispatchAttackActorHit__DelegateSignature) == 0x0001C0, "Wrong size on RSBattlePlayer_C_DispatchAttackActorHit__DelegateSignature");
static_assert(offsetof(RSBattlePlayer_C_DispatchAttackActorHit__DelegateSignature, HitResult) == 0x000000, "Member 'RSBattlePlayer_C_DispatchAttackActorHit__DelegateSignature::HitResult' has a wrong offset!");

// Function RSBattlePlayer.RSBattlePlayer_C.DispatchTimerPause__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct RSBattlePlayer_C_DispatchTimerPause__DelegateSignature final
{
public:
	bool                                          bPause;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RSBattlePlayer_C_DispatchTimerPause__DelegateSignature) == 0x000001, "Wrong alignment on RSBattlePlayer_C_DispatchTimerPause__DelegateSignature");
static_assert(sizeof(RSBattlePlayer_C_DispatchTimerPause__DelegateSignature) == 0x000001, "Wrong size on RSBattlePlayer_C_DispatchTimerPause__DelegateSignature");
static_assert(offsetof(RSBattlePlayer_C_DispatchTimerPause__DelegateSignature, bPause) == 0x000000, "Member 'RSBattlePlayer_C_DispatchTimerPause__DelegateSignature::bPause' has a wrong offset!");

// Function RSBattlePlayer.RSBattlePlayer_C.DispatchTalkTurn__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct RSBattlePlayer_C_DispatchTalkTurn__DelegateSignature final
{
public:
	float                                         LookAtAngle;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RSBattlePlayer_C_DispatchTalkTurn__DelegateSignature) == 0x000004, "Wrong alignment on RSBattlePlayer_C_DispatchTalkTurn__DelegateSignature");
static_assert(sizeof(RSBattlePlayer_C_DispatchTalkTurn__DelegateSignature) == 0x000004, "Wrong size on RSBattlePlayer_C_DispatchTalkTurn__DelegateSignature");
static_assert(offsetof(RSBattlePlayer_C_DispatchTalkTurn__DelegateSignature, LookAtAngle) == 0x000000, "Member 'RSBattlePlayer_C_DispatchTalkTurn__DelegateSignature::LookAtAngle' has a wrong offset!");

// Function RSBattlePlayer.RSBattlePlayer_C.ExecuteUbergraph_RSBattlePlayer
// 0x1070 (0x1070 - 0x0000)
struct RSBattlePlayer_C_ExecuteUbergraph_RSBattlePlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x00A4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x00B4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x00C4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_13;           // 0x00D4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_14;           // 0x00E4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_15;           // 0x00F4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_16;           // 0x0104(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_17;           // 0x0114(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_18;           // 0x0124(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_19;           // 0x0134(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_20;           // 0x0144(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_21;           // 0x0154(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_22;           // 0x0164(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_23;           // 0x0174(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_24;           // 0x0184(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7902[0x3];                                     // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float DeltaSeconds)>           K2Node_CreateDelegate_OutputDelegate_25;           // 0x0198(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(float DeltaSeconds)>           K2Node_CreateDelegate_OutputDelegate_26;           // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_27;           // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EBrainFieldEndType EndType)>   K2Node_CreateDelegate_OutputDelegate_28;           // 0x01C8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(float DeltaSeconds)>           K2Node_CreateDelegate_OutputDelegate_29;           // 0x01D8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7903[0x2];                                     // 0x01EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_30;           // 0x01EC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7904[0x3];                                     // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_31;           // 0x0200(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0213(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_32;           // 0x0214(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_4;                     // 0x0226(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_4;               // 0x0227(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerBattleVoiceType                        Temp_byte_Variable;                                // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_5;                     // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7905[0x2];                                     // 0x022A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerBattleVoiceType                        Temp_byte_Variable_1;                              // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7906[0x3];                                     // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_33;           // 0x023C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_5;               // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7907[0x3];                                     // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_6;               // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_6;                     // 0x025D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerBattleVoiceType                        Temp_byte_Variable_2;                              // 0x025E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_7;               // 0x025F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ERSGamepadLayoutType Layout, ERSGamepadInputName Key)> K2Node_CreateDelegate_OutputDelegate_34;           // 0x026C(0x0010)(ZeroConstructor, NoDestructor)
	EPlayerBattleVoiceType                        Temp_byte_Variable_3;                              // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7908[0x3];                                     // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerBattleVoiceType                        Temp_byte_Variable_4;                              // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_7;                     // 0x028D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_8;               // 0x028E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_8;                     // 0x028F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerBattleVoiceType                        Temp_byte_Variable_5;                              // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_9;                     // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_9;               // 0x0292(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHCBadState                                   Temp_byte_Variable_6;                              // 0x0293(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_10;                    // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_10;              // 0x0295(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerBattleVoiceType                        Temp_byte_Variable_7;                              // 0x0296(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerBattleVoiceType                        Temp_byte_Variable_8;                              // 0x0297(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_11;                    // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_11;              // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_12;                    // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_12;              // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerBattleVoiceType                        Temp_byte_Variable_9;                              // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7909[0x3];                                     // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_ToTargetLenge;                        // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ForceDisp;                            // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_790A[0x3];                                     // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_discoverPos;                          // 0x02A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NewParam;                             // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NewParam1;                            // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NewParam2;                            // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_IndexIn;                              // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAcceleratorParam                      K2Node_Event_Parameter_1;                          // 0x02C4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Owner_17;                             // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHologram_1;                          // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_790B[0x3];                                     // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAcceleratorParam                      K2Node_Event_Parameter;                            // 0x02DC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Owner_16;                             // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_8;                         // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHologram;                            // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFSASElectricParam                     K2Node_Event_param_15;                             // 0x02F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_790C[0x2];                                     // 0x02F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_15;                             // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASElectricParam                     K2Node_Event_param_14;                             // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_790D[0x7];                                     // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_14;                             // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_7;                         // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASFireParam                         K2Node_Event_param_13;                             // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_790E[0x3];                                     // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_13;                             // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASFireParam                         K2Node_Event_param_12;                             // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_790F[0x7];                                     // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_12;                             // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_6;                         // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASMetalParam                        K2Node_Event_param_11;                             // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7910[0x3];                                     // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_11;                             // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASMetalParam                        K2Node_Event_param_10;                             // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7911[0x7];                                     // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_10;                             // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_5;                         // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASSeeThroughParam                   K2Node_Event_param_9;                              // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7912[0x3];                                     // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_9;                              // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASSeeThroughParam                   K2Node_Event_param_8;                              // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7913[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_8;                              // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_4;                         // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASTelepoParam                       K2Node_Event_param_7;                              // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7914[0x3];                                     // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_7;                              // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASTelepoParam                       K2Node_Event_param_6;                              // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7915[0x7];                                     // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_6;                              // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_3;                         // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASStealthParam                      K2Node_Event_param_5;                              // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7916[0x3];                                     // 0x0395(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_5;                              // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASStealthParam                      K2Node_Event_param_4;                              // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7917[0x7];                                     // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_4;                              // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_2;                         // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASCopyParam                         K2Node_Event_param_3;                              // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7918[0x3];                                     // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_3;                              // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASCopyParam                         K2Node_Event_param_2;                              // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7919[0x7];                                     // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_2;                              // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime_1;                         // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASPsychicParam                      K2Node_Event_param_1;                              // 0x03D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_791A[0x3];                                     // 0x03D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner_1;                              // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFSASPsychicParam                      K2Node_Event_param;                                // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_791B[0x7];                                     // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner;                                // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime;                           // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_flag_in;                              // 0x03F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bON;                                  // 0x03F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_791C[0x2];                                     // 0x03F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_ClaimantName_1;                       // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_13;              // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_791D[0x3];                                     // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float DeltaSeconds)>           K2Node_CreateDelegate_OutputDelegate_35;           // 0x0404(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(float DeltaSeconds)>           K2Node_CreateDelegate_OutputDelegate_36;           // 0x0414(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsActionStatus_Result;                    // 0x0424(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_791E[0x3];                                     // 0x0425(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABrainTalkManager*                      CallFunc_GetBrainTalkManager_BrainTalkManager;     // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_14;              // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BrainTalkBt_KillEnemyBC_ReturnValue;      // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_791F[0x6];                                     // 0x0432(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABrainTalkManager*                      CallFunc_GetBrainTalkManager_BrainTalkManager_1;   // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BrainTalkBt_DispCrashTrg_ReturnValue;     // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7920[0x7];                                     // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABrainTalkManager*                      CallFunc_GetBrainTalkManager_BrainTalkManager_2;   // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsControlAI_bAI;                          // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BrainTalkBt_Hp30p_ReturnValue;            // 0x0451(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7921[0x6];                                     // 0x0452(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABrainTalkManager*                      CallFunc_GetBrainTalkManager_BrainTalkManager_3;   // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsControlAI_bAI_1;                        // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BrainTalkBt_KillByEn_ReturnValue;         // 0x0461(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHCBadState                                   K2Node_CustomEvent_BadStatus;                      // 0x0462(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_13;                    // 0x0463(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerBattleVoiceType                        K2Node_Select_Default;                             // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0465(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7922[0x2];                                     // 0x0466(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABrainTalkManager*                      CallFunc_GetBrainTalkManager_BrainTalkManager_4;   // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemyPlayer_bEnemyPlayer;               // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue;                  // 0x0471(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     K2Node_CustomEvent_TargetPlayer;                   // 0x0472(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7923[0x5];                                     // 0x0473(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABrainTalkManager*                      CallFunc_GetBrainTalkManager_BrainTalkManager_5;   // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     K2Node_CustomEvent_RevivePlayer;                   // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BrainTalkBt_Recovery_ReturnValue;         // 0x0481(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7924[0x6];                                     // 0x0482(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABrainTalkManager*                      CallFunc_GetBrainTalkManager_BrainTalkManager_6;   // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue_1;                // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BrainTalkBt_Revival_ReturnValue;          // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsControlAI_bAI_2;                        // 0x0492(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemyPlayer_bEnemyPlayer_1;             // 0x0493(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7925[0x4];                                     // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABrainTalkManager*                      CallFunc_GetBrainTalkManager_BrainTalkManager_7;   // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsBattleMode_IsBattleMode;             // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BrainTalkBt_DriveActive_ReturnValue;      // 0x04A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemyPlayer_bEnemyPlayer_2;             // 0x04A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
