#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RSBattleCharacter

#include "Basic.hpp"

#include "EAttackAttribute_structs.hpp"
#include "FNotifyAttackData_structs.hpp"
#include "ECharaExecuteNotifyKind_structs.hpp"
#include "ST_BrainCrashMissAccumulationScale_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EAnimNotifyTimeDilationMode_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "Engine_structs.hpp"
#include "ST_DisplayDamageBrainCrashInfo_structs.hpp"
#include "SkillParameter_structs.hpp"
#include "CharactersParameter_structs.hpp"
#include "BadStateAddParticleData_structs.hpp"
#include "HateParamData_structs.hpp"
#include "EBonusGhostType_structs.hpp"


namespace SDK::Params
{

// Function RSBattleCharacter.RSBattleCharacter_C.ExecuteUbergraph_RSBattleCharacter
// 0x1240 (0x1240 - 0x0000)
struct RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_IdlingSec;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_IdleRestoreDelay;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBonusGhostType                               K2Node_Event_Type;                                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EDC[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_AliveTime_1;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_BrainFieldUser_6;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsAttacker_6;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EDD[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_BrainFieldUser_5;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsAttacker_5;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EDE[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_BrainFieldUser_4;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsAttacker_4;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EDF[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_BrainFieldUser_3;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsAttacker_3;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrainFieldEndType                            K2Node_Event_EndType_2;                            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EE0[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_BrainFieldUser_2;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsAttacker_2;                         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_wait_on_in;                           // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EE1[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float DeltaSeconds)>           K2Node_CreateDelegate_OutputDelegate;              // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3EE2[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHCHitResult                           K2Node_ComponentBoundEvent_Result_2;               // 0x0080(0x01C0)(ContainsInstancedReference)
	bool                                          CallFunc_OnHitDamage_Return;                       // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EE3[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHCHitResult                           K2Node_ComponentBoundEvent_hitResult_3;            // 0x0248(0x01C0)(ConstParm, ContainsInstancedReference)
	int32                                         K2Node_ComponentBoundEvent_damage_4;               // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_isDamage;               // 0x040C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EE4[0x3];                                     // 0x040D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_ComponentBoundEvent_location;               // 0x0410(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_damage_3;               // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_crashDamage;            // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDamagePointKind                              K2Node_ComponentBoundEvent_kind;                   // 0x0424(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_isCritical;             // 0x0425(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_isWeakhit;              // 0x0426(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_isStealthCritical;      // 0x0427(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_isBrainCrash;           // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EE5[0x7];                                     // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_attackActor;            // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartDamageAnimFunc_Dummy;                // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EE6[0x7];                                     // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHCHitResult>                   K2Node_Event_Result;                               // 0x0440(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	struct FHCHitResult                           K2Node_Event_HitResult;                            // 0x0450(0x01C0)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_OnDamageActorHit_Dummy;                   // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_ignoreAutoSasMetal;                   // 0x0611(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInvalidDamage;                       // 0x0612(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EE7[0x1];                                     // 0x0613(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_ClaimantName;                         // 0x0614(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_param;                                // 0x061C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DamageBefore_bDummy;                      // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInvalidDamage_Dummy;                   // 0x0621(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EE8[0x2];                                     // 0x0622(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float DeltaSeconds)>           K2Node_CreateDelegate_OutputDelegate_1;            // 0x0624(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bBeginActor_1;                        // 0x0634(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EE9[0x3];                                     // 0x0635(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Event_PlayerEndMontage;                     // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EEA[0x3];                                     // 0x0649(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x064C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSocketExist_ReturnValue;              // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0659(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EEB[0x2];                                     // 0x065A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x065C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_4;               // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_5;               // 0x0669(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EEC[0x6];                                     // 0x066A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EnemyManager_C*                     CallFunc_GetEnemyManager_Manager;                  // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_6;               // 0x0679(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EED[0x6];                                     // 0x067A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleSimulatorManager*                CallFunc_GetBattleSimulatorManager_BattleSimulatorManager; // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemy_bEnemy;                           // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0689(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMissionActive_ReturnValue;              // 0x068A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EEE[0x5];                                     // 0x068B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_EnemyInterface_C> K2Node_DynamicCast_AsBPI_Enemy_Interface;          // 0x0690(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBossEnemy_bBoss;                        // 0x06A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EEF[0x2];                                     // 0x06A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float DeltaSeconds)>           K2Node_CreateDelegate_OutputDelegate_2;            // 0x06A4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_4;                     // 0x06B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_5;                     // 0x06B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EF0[0x2];                                     // 0x06B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_AliveTime;                            // 0x06B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Active;                               // 0x06BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EF1[0x3];                                     // 0x06BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x06C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EF2[0x4];                                     // 0x06C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHCHitResult                           K2Node_ComponentBoundEvent_Result_1;               // 0x06C8(0x01C0)(ContainsInstancedReference)
	bool                                          CallFunc_PrevCheckOnAttackActorHit_bOK;            // 0x0888(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnAttackActorHit_Dummy;                   // 0x0889(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PostTick_Dummy;                           // 0x088A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MainTick_Dummy;                           // 0x088B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PreTick_Dummy;                            // 0x088C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EF3[0x3];                                     // 0x088D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHCHitResult                           K2Node_ComponentBoundEvent_hitResult_2;            // 0x0890(0x01C0)(ConstParm, ContainsInstancedReference)
	int32                                         K2Node_ComponentBoundEvent_damage_2;               // 0x0A50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0A54(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnDamaging_Dummy;                         // 0x0A58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnDead_Dummy;                             // 0x0A59(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EF4[0x6];                                     // 0x0A5A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHCHitResult                           K2Node_ComponentBoundEvent_hitResult_1;            // 0x0A60(0x01C0)(ConstParm, ContainsInstancedReference)
	int32                                         K2Node_ComponentBoundEvent_damage_1;               // 0x0C20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_current_hp;             // 0x0C24(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_base_hp;                // 0x0C28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoHPEvent_bDummy;                         // 0x0C2C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetHoodVisible_ReturnValue;               // 0x0C2D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EF5[0x2];                                     // 0x0C2E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0C30(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0C38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0C40(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0C48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0C4C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EF6[0x3];                                     // 0x0C4D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0C50(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0CD8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0CE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0CE8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0CF0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EF7[0x4];                                     // 0x0CF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCapsuleComponent*                      K2Node_DynamicCast_AsCapsule_Collision;            // 0x0CF8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0D00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EF8[0x7];                                     // 0x0D01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCapsuleComponent*                      K2Node_DynamicCast_AsCapsule_Collision_1;          // 0x0D08(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0D10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_6;                     // 0x0D11(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnCharacterAssetLoad_Return;              // 0x0D12(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EF9[0x5];                                     // 0x0D13(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AHitManager_C*                          CallFunc_GetHitManager_Manager;                    // 0x0D18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHitManager_C*                          CallFunc_GetHitManager_Manager_1;                  // 0x0D20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDelayDeath_dummy;                      // 0x0D28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EFA[0x7];                                     // 0x0D29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_finisher;               // 0x0D30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHCHitResult                           K2Node_ComponentBoundEvent_hitResult;              // 0x0D38(0x01C0)(ConstParm, ContainsInstancedReference)
	int32                                         K2Node_ComponentBoundEvent_damage;                 // 0x0EF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EFB[0x4];                                     // 0x0EFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0F00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface;         // 0x0F08(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0F18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0F19(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EFC[0x6];                                     // 0x0F1A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PlayerInterface_C> K2Node_DynamicCast_AsBPI_Player_Interface_1;       // 0x0F20(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0F30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0F31(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_7;               // 0x0F32(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EFD[0x5];                                     // 0x0F33(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BattleManager_C*                    CallFunc_GetBattleManager_BattleManager;           // 0x0F38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BattleManager_C*                    CallFunc_GetBattleManager_BattleManager_1;         // 0x0F40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0F48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_7;                     // 0x0F49(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHCBadState                                   K2Node_ComponentBoundEvent_bad_state_1;            // 0x0F4A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EFE[0x5];                                     // 0x0F4B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_attacker;               // 0x0F50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemy_bEnemy_1;                         // 0x0F58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0F59(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0F5A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EFF[0x5];                                     // 0x0F5B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager_1;         // 0x0F60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHCBadState                                   K2Node_ComponentBoundEvent_bad_state;              // 0x0F68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0F69(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableCharacterTick_bEnable;            // 0x0F6A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F00[0x5];                                     // 0x0F6B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame_1;             // 0x0F70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemy_bEnemy_2;                         // 0x0F78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F01[0x7];                                     // 0x0F79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager_2;         // 0x0F80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InitializeDifficulty_bDummy;              // 0x0F88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_8;                     // 0x0F89(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F02[0x2];                                     // 0x0F8A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0F8C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_SetAttackHitStop_bDummy;                  // 0x0F9C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetAttackHitStop_bDummy_1;                // 0x0F9D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F03[0x2];                                     // 0x0F9E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EnemyManager_C*                     CallFunc_GetEnemyManager_Manager_1;                // 0x0FA0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0FA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LeaveBrainCrashAccess_Dummy;              // 0x0FA9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemy_bEnemy_3;                         // 0x0FAA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F04[0x5];                                     // 0x0FAB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHCHitResult                           K2Node_ComponentBoundEvent_Result;                 // 0x0FB0(0x01C0)(ContainsInstancedReference)
	bool                                          Temp_bool_Has_Been_Initd_Variable_8;               // 0x1170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnAttackActorHit_Dummy_1;                 // 0x1171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F05[0x6];                                     // 0x1172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_BrainFieldUser_1;                     // 0x1178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsAttacker_1;                         // 0x1180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrainFieldEndType                            K2Node_Event_EndType_1;                            // 0x1181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F06[0x6];                                     // 0x1182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_BrainFieldUser;                       // 0x1188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsAttacker;                           // 0x1190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBrainFieldEndType                            K2Node_Event_EndType;                              // 0x1191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x1192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x1193(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(float DeltaSeconds)>           K2Node_CreateDelegate_OutputDelegate_4;            // 0x1194(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_9;               // 0x11A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F07[0x3];                                     // 0x11A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float DeltaSeconds)>           K2Node_CreateDelegate_OutputDelegate_5;            // 0x11A8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_noDeadEvent;                          // 0x11B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_noCrashChanceEvent;                   // 0x11B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x11BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F08[0x5];                                     // 0x11BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         K2Node_Event_Particle_1;                           // 0x11C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x11C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F09[0x4];                                     // 0x11D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         K2Node_Event_Particle;                             // 0x11D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemy_bEnemy_4;                         // 0x11E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F0A[0x7];                                     // 0x11E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleSimulatorManager*                CallFunc_GetBattleSimulatorManager_BattleSimulatorManager_1; // 0x11E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x11F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F0B[0x7];                                     // 0x11F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleSimulatorManager*                CallFunc_GetBattleSimulatorManager_BattleSimulatorManager_2; // 0x11F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x1200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBadStateEndless_ReturnValue;            // 0x1201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bBeginActor;                          // 0x1202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F0C[0x5];                                     // 0x1203(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EnemyManager_C*                     CallFunc_GetEnemyManager_Manager_2;                // 0x1208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleSimulatorManager*                CallFunc_GetBattleSimulatorManager_BattleSimulatorManager_3; // 0x1210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x1218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x1219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMissionActive_ReturnValue_1;            // 0x121A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_9;                     // 0x121B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemy_bEnemy_5;                         // 0x121C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F0D[0x3];                                     // 0x121D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetDebuggingManager_Manager;              // 0x1220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_EnemyInterface_C> K2Node_DynamicCast_AsBPI_Enemy_Interface_1;        // 0x1228(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x1238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x1239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBossEnemy_bBoss_1;                      // 0x123A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter) == 0x000008, "Wrong alignment on RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter");
static_assert(sizeof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter) == 0x001240, "Wrong size on RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, EntryPoint) == 0x000000, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::EntryPoint' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, Temp_bool_Has_Been_Initd_Variable_1) == 0x000006, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, Temp_bool_IsClosed_Variable_1) == 0x000007, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, Temp_bool_Has_Been_Initd_Variable_2) == 0x000008, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, Temp_bool_IsClosed_Variable_2) == 0x000009, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, Temp_bool_Has_Been_Initd_Variable_3) == 0x00000A, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::Temp_bool_Has_Been_Initd_Variable_3' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, Temp_bool_IsClosed_Variable_3) == 0x00000B, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::Temp_bool_IsClosed_Variable_3' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_IdlingSec) == 0x00000C, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_IdlingSec' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_IdleRestoreDelay) == 0x000010, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_IdleRestoreDelay' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_Time) == 0x000014, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_Type) == 0x000018, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_Type' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_AliveTime_1) == 0x00001C, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_AliveTime_1' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_BrainFieldUser_6) == 0x000020, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_BrainFieldUser_6' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_IsAttacker_6) == 0x000028, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_IsAttacker_6' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_BrainFieldUser_5) == 0x000030, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_BrainFieldUser_5' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_IsAttacker_5) == 0x000038, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_IsAttacker_5' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_BrainFieldUser_4) == 0x000040, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_BrainFieldUser_4' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_IsAttacker_4) == 0x000048, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_IsAttacker_4' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_BrainFieldUser_3) == 0x000050, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_BrainFieldUser_3' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_IsAttacker_3) == 0x000058, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_IsAttacker_3' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_EndType_2) == 0x000059, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_EndType_2' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_BrainFieldUser_2) == 0x000060, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_BrainFieldUser_2' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_IsAttacker_2) == 0x000068, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_IsAttacker_2' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_wait_on_in) == 0x000069, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_wait_on_in' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_CreateDelegate_OutputDelegate) == 0x00006C, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_ComponentBoundEvent_Result_2) == 0x000080, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_ComponentBoundEvent_Result_2' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, CallFunc_OnHitDamage_Return) == 0x000240, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::CallFunc_OnHitDamage_Return' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_ComponentBoundEvent_hitResult_3) == 0x000248, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_ComponentBoundEvent_hitResult_3' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_ComponentBoundEvent_damage_4) == 0x000408, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_ComponentBoundEvent_damage_4' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_ComponentBoundEvent_isDamage) == 0x00040C, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_ComponentBoundEvent_isDamage' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_ComponentBoundEvent_location) == 0x000410, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_ComponentBoundEvent_location' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_ComponentBoundEvent_damage_3) == 0x00041C, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_ComponentBoundEvent_damage_3' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_ComponentBoundEvent_crashDamage) == 0x000420, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_ComponentBoundEvent_crashDamage' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_ComponentBoundEvent_kind) == 0x000424, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_ComponentBoundEvent_kind' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_ComponentBoundEvent_isCritical) == 0x000425, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_ComponentBoundEvent_isCritical' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_ComponentBoundEvent_isWeakhit) == 0x000426, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_ComponentBoundEvent_isWeakhit' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_ComponentBoundEvent_isStealthCritical) == 0x000427, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_ComponentBoundEvent_isStealthCritical' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_ComponentBoundEvent_isBrainCrash) == 0x000428, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_ComponentBoundEvent_isBrainCrash' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_ComponentBoundEvent_attackActor) == 0x000430, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_ComponentBoundEvent_attackActor' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, CallFunc_StartDamageAnimFunc_Dummy) == 0x000438, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::CallFunc_StartDamageAnimFunc_Dummy' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_Result) == 0x000440, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_Result' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_HitResult) == 0x000450, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_HitResult' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, CallFunc_OnDamageActorHit_Dummy) == 0x000610, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::CallFunc_OnDamageActorHit_Dummy' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_ignoreAutoSasMetal) == 0x000611, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_ignoreAutoSasMetal' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_bInvalidDamage) == 0x000612, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_bInvalidDamage' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_ClaimantName) == 0x000614, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_ClaimantName' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_param) == 0x00061C, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_param' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, CallFunc_DamageBefore_bDummy) == 0x000620, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::CallFunc_DamageBefore_bDummy' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, CallFunc_SetInvalidDamage_Dummy) == 0x000621, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::CallFunc_SetInvalidDamage_Dummy' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_CreateDelegate_OutputDelegate_1) == 0x000624, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_bBeginActor_1) == 0x000634, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_bBeginActor_1' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_Event_PlayerEndMontage) == 0x000638, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_Event_PlayerEndMontage' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000640, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, CallFunc_IsValid_ReturnValue) == 0x000648, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00064C, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, CallFunc_DoesSocketExist_ReturnValue) == 0x000658, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::CallFunc_DoesSocketExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, CallFunc_IsValid_ReturnValue_1) == 0x000659, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, CallFunc_GetSocketLocation_ReturnValue) == 0x00065C, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, Temp_bool_Has_Been_Initd_Variable_4) == 0x000668, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::Temp_bool_Has_Been_Initd_Variable_4' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, Temp_bool_Has_Been_Initd_Variable_5) == 0x000669, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::Temp_bool_Has_Been_Initd_Variable_5' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, CallFunc_GetEnemyManager_Manager) == 0x000670, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::CallFunc_GetEnemyManager_Manager' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, CallFunc_IsValid_ReturnValue_2) == 0x000678, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, Temp_bool_Has_Been_Initd_Variable_6) == 0x000679, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::Temp_bool_Has_Been_Initd_Variable_6' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, CallFunc_GetBattleSimulatorManager_BattleSimulatorManager) == 0x000680, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::CallFunc_GetBattleSimulatorManager_BattleSimulatorManager' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, CallFunc_IsEnemy_bEnemy) == 0x000688, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::CallFunc_IsEnemy_bEnemy' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, CallFunc_IsValid_ReturnValue_3) == 0x000689, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, CallFunc_IsMissionActive_ReturnValue) == 0x00068A, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::CallFunc_IsMissionActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_DynamicCast_AsBPI_Enemy_Interface) == 0x000690, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_DynamicCast_AsBPI_Enemy_Interface' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_DynamicCast_bSuccess) == 0x0006A0, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, CallFunc_IsBossEnemy_bBoss) == 0x0006A1, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::CallFunc_IsBossEnemy_bBoss' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, K2Node_CreateDelegate_OutputDelegate_2) == 0x0006A4, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter, Temp_bool_IsClosed_Variable_4) == 0x0006B4, "Member 'RSBattleCharacter_C_ExecuteUbergraph_RSBattleCharacter::Temp_bool_IsClosed_Variable_4' has a wrong offset!");
