#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RSBattleEnemy

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "StealthWeakData_structs.hpp"
#include "ST_em_ChangeTimeDilation_structs.hpp"
#include "AiParamEnemy_structs.hpp"
#include "MovieScene_structs.hpp"
#include "Enum_EnemyAiType_structs.hpp"
#include "AnimScaleHitStopEnemy_structs.hpp"
#include "ST_emChangeAiTypeInfo_structs.hpp"
#include "Enum_EnemySound_structs.hpp"
#include "FEnemyCrashVisionEffectInfo_structs.hpp"
#include "FEnemyCrashVisionEffectData_structs.hpp"
#include "UniqueObjectContainerEnemyInfo_structs.hpp"
#include "DE_em_ChangeTimeDilation_structs.hpp"
#include "ECharaExecuteNotifyKind_structs.hpp"
#include "Enum_EnemySpawnState_structs.hpp"
#include "Enum_EnemyBrainFieldProgress_structs.hpp"
#include "BadStateAddParticleData_structs.hpp"
#include "CharactersParameter_structs.hpp"
#include "WeakObjectRecommendEnemy_structs.hpp"
#include "UMG_structs.hpp"
#include "Enum_EnemyAvoidType_structs.hpp"
#include "Enum_EnemyRange_structs.hpp"
#include "BadStateParticleData_structs.hpp"
#include "Enum_em0300_structs.hpp"
#include "WeakObjectEntryEnemy_structs.hpp"
#include "ST_emEnableWeakData_structs.hpp"
#include "Enum_EnemyMotionParam_structs.hpp"
#include "BattleAIStateType_structs.hpp"


namespace SDK::Params
{

// Function RSBattleEnemy.RSBattleEnemy_C.ExecuteUbergraph_RSBattleEnemy
// 0x0760 (0x0760 - 0x0000)
struct RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bBeginActor_1;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bBeginActor;                          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAnimMontage*                           K2Node_Event_PlayerEndMontage;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BattleManager_C*                    CallFunc_GetBattleManager_BattleManager;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSEnemyAnimInstance*                   K2Node_DynamicCast_AsRSEnemy_Anim_Instance;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E0C[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSEnemyAnimInstance*                   K2Node_DynamicCast_AsRSEnemy_Anim_Instance_1;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnBrainCrashAccessOn_Dummy;               // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnBrainCrashAccessOff_Dummy;              // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E0D[0x5];                                     // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_co2000Base_C*                       CallFunc_GetBrainCore_CoreObject;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E0E[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_co2000Base_C*                       CallFunc_GetBrainCore_CoreObject_1;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SwitchDispCore_Dummy;                     // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E0F[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_EnemyBattleLog_C*                   K2Node_DynamicCast_AsBP_Enemy_Battle_Log;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OutputLog_BrainCrash_dummy;               // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E10[0x1];                                     // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E11[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHCHitResult>                   K2Node_Event_Result;                               // 0x0090(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnHitDamageCall_ret;                      // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSuperArmor;                          // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E12[0x2];                                     // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_ClaimantName;                         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHCHitResult                           K2Node_ComponentBoundEvent_hitResult;              // 0x00B8(0x01C0)(ConstParm, ContainsInstancedReference)
	int32                                         K2Node_ComponentBoundEvent_damage;                 // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHCBadState                                   K2Node_ComponentBoundEvent_bad_state_1;            // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E13[0x3];                                     // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_attacker;               // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHCBadState                                   K2Node_ComponentBoundEvent_bad_state;              // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHCBadState                                   K2Node_Event_bad;                                  // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E14[0x2];                                     // 0x028A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E15[0x3];                                     // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_IdlingSec;                            // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_IdleRestoreDelay;                     // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnEnemyAssetLoad_Return;                  // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E16[0x3];                                     // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x02B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x02C4(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x034D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E17[0x2];                                     // 0x034E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0364(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0370(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x037C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0398(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x03B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x03BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionChannel                             CallFunc_GetCollisionObjectType_ReturnValue;       // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E18[0x3];                                     // 0x03C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E19[0x3];                                     // 0x03D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EnemyManager_C*                     CallFunc_GetEnemyManager_Manager;                  // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E1A[0x7];                                     // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetupAnimController_Dummy;                // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E1B[0x6];                                     // 0x03FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_CustomEvent_Montage;                        // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Interrupted;                    // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnDestroy_Dummy;                          // 0x0409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E1C[0x2];                                     // 0x040A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Sin_ReturnValue;                          // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CreateEnemyWeapon_Dummy;                  // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E1D[0x2];                                     // 0x0412(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_discoverPos;                          // 0x0414(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProcFellOutOfWorld_Dummy;                 // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDead_bDead;                             // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInBeginPlay_InBegin;                    // 0x0422(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnDestroy_Dummy_1;                        // 0x0423(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnStartHideArmor_dummy;                   // 0x0424(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InitSaveBodyWeakValue_Dummy;              // 0x0425(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E1E[0x2];                                     // 0x0426(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddCharaCollisionList_ListNo;             // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x042C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E1F[0x3];                                     // 0x042D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetEnemyEnumLength_Length;                // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E20[0x4];                                     // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0438(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_EnemyFixParam_C*                    CallFunc_GetEnemyFixParam_Param;                   // 0x0448(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetGroundLocationSimple_ReturnValue;      // 0x0450(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E21[0x4];                                     // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDamagePartCollisionComponent*          CallFunc_GetCoreCollision_CoreCollision;           // 0x0460(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnStartAction_Dummy;                      // 0x0469(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x046A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x046B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E22[0x4];                                     // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnemyAiComponentBase*                  CallFunc_GetEnemyAiComponent_ReturnValue;          // 0x0470(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFlyEnemyCheck_NewParam;                 // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x047A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x047B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x047C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E23[0x3];                                     // 0x047D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_EnemyBattleLog_C*                   K2Node_DynamicCast_AsBP_Enemy_Battle_Log_1;        // 0x0480(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetEnemyName_dummy;                       // 0x0489(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x048A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x048B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckRepopCharaInList_Inlist;             // 0x048C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EventDeath_Dummy;                         // 0x048D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E24[0x2];                                     // 0x048E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TriggerEffectManager_C*             CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager; // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0499(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x049A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x049B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E25[0x4];                                     // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x04A0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSLevelSequenceActor*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_2;            // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetActorAllTickEnabled_ReturnValue;       // 0x04E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E26[0x2];                                     // 0x04E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetWalkableFloorAngle_ReturnValue;     // 0x04E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ElapsedTime;                          // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ToTargetLenge;                        // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ForceDisp;                            // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x04F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x04F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E27[0x5];                                     // 0x04F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHCHitResult                           CallFunc_ReplaceHitResult_ReturnValue;             // 0x04F8(0x01C0)(ContainsInstancedReference)
	float                                         CallFunc_UpdateOutRangeFade_DeitherValue;          // 0x06B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x06BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_18;                   // 0x06BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E28[0x2];                                     // 0x06BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_EnemyBattleLog_C*                   K2Node_DynamicCast_AsBP_Enemy_Battle_Log_2;        // 0x06C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E29[0x7];                                     // 0x06C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDamageParam_dummy;                     // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E2A[0x7];                                     // 0x06D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IRSGameModeBPInterface_C> K2Node_DynamicCast_AsRSGame_Mode_BPInterface;      // 0x06E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDevelopmentBP_IsDevelopment;            // 0x06F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_19;                   // 0x06F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E2B[0x1];                                     // 0x06F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActorLevelAreaID_locationID;           // 0x06F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActorLevelAreaID_AreaID;               // 0x06F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x06FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnCrashVisionDead_ReturnValue;            // 0x06FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E2C[0x2];                                     // 0x06FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0700(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UBP_EnemyBattleLog_C*                   CallFunc_AddComponent_ReturnValue;                 // 0x0730(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0738(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_SwitchDispCore_Dummy_1;                   // 0x0748(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBrainCrashAccess_ReturnValue;           // 0x0749(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E2D[0x2];                                     // 0x074A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float DeltaSeconds)>           K2Node_CreateDelegate_OutputDelegate_1;            // 0x074C(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy) == 0x000010, "Wrong alignment on RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy");
static_assert(sizeof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy) == 0x000760, "Wrong size on RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, EntryPoint) == 0x000000, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::EntryPoint' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_Event_bBeginActor_1) == 0x000004, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_Event_bBeginActor_1' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_IsDead_ReturnValue) == 0x000006, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_Event_bBeginActor) == 0x000007, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_Event_bBeginActor' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_Event_PlayerEndMontage) == 0x000008, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_Event_PlayerEndMontage' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_GetBattleManager_BattleManager) == 0x000010, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_GetBattleManager_BattleManager' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_GetAnimInstance_ReturnValue) == 0x000018, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_DynamicCast_AsRSEnemy_Anim_Instance) == 0x000020, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_DynamicCast_AsRSEnemy_Anim_Instance' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_GetBlackboard_ReturnValue) == 0x000030, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_MakeLiteralName_ReturnValue) == 0x000038, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000040, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_DynamicCast_AsRSEnemy_Anim_Instance_1) == 0x000048, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_DynamicCast_AsRSEnemy_Anim_Instance_1' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_OnBrainCrashAccessOn_Dummy) == 0x000051, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_OnBrainCrashAccessOn_Dummy' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_OnBrainCrashAccessOff_Dummy) == 0x000052, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_OnBrainCrashAccessOff_Dummy' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_GetBrainCore_CoreObject) == 0x000058, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_GetBrainCore_CoreObject' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_GetBrainCore_CoreObject_1) == 0x000068, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_GetBrainCore_CoreObject_1' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_IsValid_ReturnValue_2) == 0x000070, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_IsValid_ReturnValue_3) == 0x000071, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_IsVisible_ReturnValue) == 0x000072, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_IsVisible_ReturnValue_1) == 0x000073, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_SwitchDispCore_Dummy) == 0x000074, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_SwitchDispCore_Dummy' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_DynamicCast_AsBP_Enemy_Battle_Log) == 0x000078, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_DynamicCast_AsBP_Enemy_Battle_Log' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_IsValid_ReturnValue_4) == 0x000081, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_OutputLog_BrainCrash_dummy) == 0x000082, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_OutputLog_BrainCrash_dummy' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_Event_DeltaSeconds) == 0x000084, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, Temp_bool_IsClosed_Variable) == 0x000088, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_Event_Result) == 0x000090, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_Event_Result' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000A0, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_OnHitDamageCall_ret) == 0x0000AC, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_OnHitDamageCall_ret' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_Event_bSuperArmor) == 0x0000AD, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_Event_bSuperArmor' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_Event_ClaimantName) == 0x0000B0, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_Event_ClaimantName' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_ComponentBoundEvent_hitResult) == 0x0000B8, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_ComponentBoundEvent_hitResult' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_ComponentBoundEvent_damage) == 0x000278, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_ComponentBoundEvent_damage' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_ComponentBoundEvent_bad_state_1) == 0x00027C, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_ComponentBoundEvent_bad_state_1' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_ComponentBoundEvent_attacker) == 0x000280, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_ComponentBoundEvent_attacker' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_ComponentBoundEvent_bad_state) == 0x000288, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_ComponentBoundEvent_bad_state' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_Event_bad) == 0x000289, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_Event_bad' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00028C, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_Event_EndPlayReason) == 0x000290, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_Event_IdlingSec) == 0x000294, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_Event_IdlingSec' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_Event_IdleRestoreDelay) == 0x000298, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_Event_IdleRestoreDelay' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_OnEnemyAssetLoad_Return) == 0x00029C, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_OnEnemyAssetLoad_Return' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_ComponentBoundEvent_HitComponent) == 0x0002A0, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_ComponentBoundEvent_OtherActor) == 0x0002A8, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_ComponentBoundEvent_OtherComp) == 0x0002B0, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_ComponentBoundEvent_NormalImpulse) == 0x0002B8, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_ComponentBoundEvent_Hit) == 0x0002C4, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_BreakHitResult_bBlockingHit) == 0x00034C, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_BreakHitResult_bInitialOverlap) == 0x00034D, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_BreakHitResult_Time) == 0x000350, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_BreakHitResult_Distance) == 0x000354, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_BreakHitResult_Location) == 0x000358, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_BreakHitResult_ImpactPoint) == 0x000364, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_BreakHitResult_Normal) == 0x000370, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_BreakHitResult_ImpactNormal) == 0x00037C, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_BreakHitResult_PhysMat) == 0x000388, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_BreakHitResult_HitActor) == 0x000390, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_BreakHitResult_HitComponent) == 0x000398, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_BreakHitResult_HitBoneName) == 0x0003A0, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_BreakHitResult_HitItem) == 0x0003A8, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_BreakHitResult_FaceIndex) == 0x0003AC, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_BreakHitResult_TraceStart) == 0x0003B0, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_BreakHitResult_TraceEnd) == 0x0003BC, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_GetCollisionObjectType_ReturnValue) == 0x0003C8, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_GetCollisionObjectType_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_BreakVector_X) == 0x0003CC, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_BreakVector_Y) == 0x0003D0, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_BreakVector_Z) == 0x0003D4, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_SwitchEnum_CmpSuccess) == 0x0003D8, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_Abs_ReturnValue) == 0x0003DC, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_GetEnemyManager_Manager) == 0x0003E0, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_GetEnemyManager_Manager' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_IsValid_ReturnValue_5) == 0x0003E8, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_GetHUDMainGame_HUDMainGame) == 0x0003F0, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_IsValid_ReturnValue_6) == 0x0003F8, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_SetupAnimController_Dummy) == 0x0003F9, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_SetupAnimController_Dummy' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_CustomEvent_Montage) == 0x000400, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_CustomEvent_Montage' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_CustomEvent_Interrupted) == 0x000408, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_CustomEvent_Interrupted' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_OnDestroy_Dummy) == 0x000409, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_OnDestroy_Dummy' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_Sin_ReturnValue) == 0x00040C, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_Sin_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000410, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_CreateEnemyWeapon_Dummy) == 0x000411, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_CreateEnemyWeapon_Dummy' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_Event_discoverPos) == 0x000414, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_Event_discoverPos' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_ProcFellOutOfWorld_Dummy) == 0x000420, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_ProcFellOutOfWorld_Dummy' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_IsDead_bDead) == 0x000421, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_IsDead_bDead' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_IsInBeginPlay_InBegin) == 0x000422, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_IsInBeginPlay_InBegin' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_OnDestroy_Dummy_1) == 0x000423, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_OnDestroy_Dummy_1' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_OnStartHideArmor_dummy) == 0x000424, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_OnStartHideArmor_dummy' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_InitSaveBodyWeakValue_Dummy) == 0x000425, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_InitSaveBodyWeakValue_Dummy' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_AddCharaCollisionList_ListNo) == 0x000428, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_AddCharaCollisionList_ListNo' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_IsValid_ReturnValue_7) == 0x00042C, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_GetEnemyEnumLength_Length) == 0x000430, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_GetEnemyEnumLength_Length' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_GetDisplayName_ReturnValue) == 0x000438, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_GetEnemyFixParam_Param) == 0x000448, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_GetEnemyFixParam_Param' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_GetGroundLocationSimple_ReturnValue) == 0x000450, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_GetGroundLocationSimple_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_GetCoreCollision_CoreCollision) == 0x000460, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_GetCoreCollision_CoreCollision' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_IsValid_ReturnValue_8) == 0x000468, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_OnStartAction_Dummy) == 0x000469, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_OnStartAction_Dummy' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_IsValid_ReturnValue_9) == 0x00046A, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_IsValid_ReturnValue_10) == 0x00046B, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_GetEnemyAiComponent_ReturnValue) == 0x000470, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_GetEnemyAiComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_IsFlyEnemyCheck_NewParam) == 0x000478, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_IsFlyEnemyCheck_NewParam' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, Temp_bool_Has_Been_Initd_Variable) == 0x000479, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, Temp_bool_IsClosed_Variable_1) == 0x00047A, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_IsValid_ReturnValue_11) == 0x00047B, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00047C, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_DynamicCast_AsBP_Enemy_Battle_Log_1) == 0x000480, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_DynamicCast_AsBP_Enemy_Battle_Log_1' has a wrong offset!");
static_assert(offsetof(RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy, K2Node_DynamicCast_bSuccess_3) == 0x000488, "Member 'RSBattleEnemy_C_ExecuteUbergraph_RSBattleEnemy::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
