#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RSGameModeBP

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function RSGameModeBP.RSGameModeBP_C.ExecuteUbergraph_RSGameModeBP
// 0x02D0 (0x02D0 - 0x0000)
struct RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F1B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F1C[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IRSGameInstanceBPInterface_C> K2Node_DynamicCast_AsRSGame_Instance_BPInterface;  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F1D[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F1E[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARSBattlePlayer_C*>              CallFunc_GetAllActorsOfClass_OutActors;            // 0x0048(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F1F[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager_1;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPPlayerManagerInterface_C> K2Node_DynamicCast_AsBPPlayer_Manager_Interface;   // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F20[0x6];                                     // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARSCharacterBase*>               CallFunc_GetPlayerList_ReturnValue;                // 0x00A0(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	class AEnemyManager*                          CallFunc_GetEnemyManager_EnemyManager;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F21[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F22[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARSCharacterBase*>               CallFunc_GetEnemyList_ReturnValue;                 // 0x00D8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F23[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattlefieldManager*                    CallFunc_GetBattleFieldManager_BattleFieldManager; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F24[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEmptyGameMode_C*                       K2Node_DynamicCast_AsEmpty_Game_Mode;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F25[0x3];                                     // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSGameInstanceBP_C*                    K2Node_DynamicCast_AsRSGame_Instance_BP;           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F26[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetSceneManager_SceneManager;             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPSceneManagerInterface_C> K2Node_DynamicCast_AsBPScene_Manager_Interface;    // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F27[0x6];                                     // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IRSGameModeBPInterface_C> K2Node_DynamicCast_AsRSGame_Mode_BPInterface;      // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F28[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleCharacterInterface_C> K2Node_DynamicCast_AsBPI_Battle_Character_Interface; // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F29[0x3];                                     // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F2A[0x3];                                     // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      CallFunc_Array_Get_Item_2;                         // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ARSCharacterBase*>               CallFunc_GetPlayersAll_Players;                    // 0x01A0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_Array_Get_Item_3;                         // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F2B[0x4];                                     // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleCharacterInterface_C> K2Node_DynamicCast_AsBPI_Battle_Character_Interface_1; // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Enable;                               // 0x01D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F2C[0x4];                                     // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager_2;         // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEnemyManager*                          CallFunc_GetEnemyManager_EnemyManager_1;           // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F2D[0x6];                                     // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARSCharacterBase*>               CallFunc_GetEnemyList_ReturnValue_1;               // 0x01F0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class ARSCharacterBase*>               CallFunc_GetPlayerList_ReturnValue_1;              // 0x0200(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F2E[0x6];                                     // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AEnemyManager*                          CallFunc_GetEnemyManager_EnemyManager_2;           // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ARSCharacterBase*>               CallFunc_GetEnemyList_ReturnValue_2;               // 0x0228(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F2F[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_Event_NewPlayer;                            // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IRSGameInstanceBPInterface_C> K2Node_DynamicCast_AsRSGame_Instance_BPInterface_1; // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F30[0x3];                                     // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F31[0x3];                                     // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F32[0x4];                                     // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_4;                         // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattleCharacter_C*                   K2Node_DynamicCast_AsRSBattle_Character;           // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F33[0x7];                                     // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_currentLevelName_1;                   // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_currentLevelName;                     // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_LoadedLevel;                          // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_UnloadedLevel;                        // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPersistentLevel_IsPersistenceLevel;     // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x02C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F34[0x2];                                     // 0x02C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP) == 0x000008, "Wrong alignment on RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP");
static_assert(sizeof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP) == 0x0002D0, "Wrong size on RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, EntryPoint) == 0x000000, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, Temp_int_Array_Index_Variable) == 0x000010, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_DynamicCast_AsRSGame_Instance_BPInterface) == 0x000018, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_DynamicCast_AsRSGame_Instance_BPInterface' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, Temp_int_Array_Index_Variable_1) == 0x000034, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, Temp_int_Loop_Counter_Variable_1) == 0x000038, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Add_IntInt_ReturnValue_1) == 0x00003C, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, Temp_int_Loop_Counter_Variable_2) == 0x000040, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_GetAllActorsOfClass_OutActors) == 0x000048, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Add_IntInt_ReturnValue_2) == 0x00005C, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, Temp_int_Array_Index_Variable_2) == 0x000060, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, Temp_int_Array_Index_Variable_3) == 0x000064, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, Temp_int_Array_Index_Variable_4) == 0x000068, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, Temp_int_Loop_Counter_Variable_3) == 0x00006C, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Add_IntInt_ReturnValue_3) == 0x000070, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_GetPlayerManager_PlayerManager) == 0x000078, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_GetPlayerManager_PlayerManager_1) == 0x000080, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_GetPlayerManager_PlayerManager_1' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_DynamicCast_AsBPPlayer_Manager_Interface) == 0x000088, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_DynamicCast_AsBPPlayer_Manager_Interface' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_IsValid_ReturnValue_1) == 0x000099, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_GetPlayerList_ReturnValue) == 0x0000A0, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_GetPlayerList_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_GetEnemyManager_EnemyManager) == 0x0000B0, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_GetEnemyManager_EnemyManager' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_IsValid_ReturnValue_2) == 0x0000C0, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_DynamicCast_AsRSBattle_Player) == 0x0000C8, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_DynamicCast_bSuccess_2) == 0x0000D0, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_GetEnemyList_ReturnValue) == 0x0000D8, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_GetEnemyList_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Array_Length_ReturnValue_1) == 0x0000E8, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Array_Length_ReturnValue_2) == 0x0000EC, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Less_IntInt_ReturnValue) == 0x0000F0, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_GetBattleFieldManager_BattleFieldManager) == 0x0000F8, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_GetBattleFieldManager_BattleFieldManager' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, Temp_int_Loop_Counter_Variable_4) == 0x000100, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_GetGameMode_ReturnValue) == 0x000108, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_DynamicCast_AsEmpty_Game_Mode) == 0x000110, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_DynamicCast_AsEmpty_Game_Mode' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_DynamicCast_bSuccess_3) == 0x000118, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Add_IntInt_ReturnValue_4) == 0x00011C, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_GetRSGameInstance_RSGameInstance) == 0x000120, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_GetRSGameInstance_RSGameInstance' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_DynamicCast_AsRSGame_Instance_BP) == 0x000128, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_DynamicCast_AsRSGame_Instance_BP' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_DynamicCast_bSuccess_4) == 0x000130, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_GetSceneManager_SceneManager) == 0x000138, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_GetSceneManager_SceneManager' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_DynamicCast_AsBPScene_Manager_Interface) == 0x000140, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_DynamicCast_AsBPScene_Manager_Interface' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_DynamicCast_bSuccess_5) == 0x000150, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_IsValid_ReturnValue_3) == 0x000151, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Array_Get_Item_1) == 0x000158, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_DynamicCast_AsRSGame_Mode_BPInterface) == 0x000160, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_DynamicCast_AsRSGame_Mode_BPInterface' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_DynamicCast_bSuccess_6) == 0x000170, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_DynamicCast_AsBPI_Battle_Character_Interface) == 0x000178, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_DynamicCast_AsBPI_Battle_Character_Interface' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_DynamicCast_bSuccess_7) == 0x000188, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Array_Length_ReturnValue_3) == 0x00018C, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Less_IntInt_ReturnValue_1) == 0x000190, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, Temp_int_Array_Index_Variable_5) == 0x000194, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Array_Get_Item_2) == 0x000198, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_GetPlayersAll_Players) == 0x0001A0, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_GetPlayersAll_Players' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Array_Get_Item_3) == 0x0001B0, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Array_Length_ReturnValue_4) == 0x0001B8, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_DynamicCast_AsBPI_Battle_Character_Interface_1) == 0x0001C0, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_DynamicCast_AsBPI_Battle_Character_Interface_1' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_DynamicCast_bSuccess_8) == 0x0001D0, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001D1, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_IsValid_ReturnValue_4) == 0x0001D2, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_Event_Enable) == 0x0001D3, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_Event_Enable' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_GetPlayerManager_PlayerManager_2) == 0x0001D8, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_GetPlayerManager_PlayerManager_2' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_GetEnemyManager_EnemyManager_1) == 0x0001E0, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_GetEnemyManager_EnemyManager_1' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_IsValid_ReturnValue_5) == 0x0001E8, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_IsValid_ReturnValue_6) == 0x0001E9, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_GetEnemyList_ReturnValue_1) == 0x0001F0, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_GetEnemyList_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_GetPlayerList_ReturnValue_1) == 0x000200, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_GetPlayerList_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Array_Length_ReturnValue_5) == 0x000210, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Array_Length_ReturnValue_6) == 0x000214, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Less_IntInt_ReturnValue_3) == 0x000218, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Less_IntInt_ReturnValue_4) == 0x000219, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_GetEnemyManager_EnemyManager_2) == 0x000220, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_GetEnemyManager_EnemyManager_2' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_GetEnemyList_ReturnValue_2) == 0x000228, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_GetEnemyList_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_IsValid_ReturnValue_7) == 0x000238, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_GetGameInstance_ReturnValue_1) == 0x000240, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_Event_NewPlayer) == 0x000248, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_Event_NewPlayer' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_DynamicCast_AsRSGame_Instance_BPInterface_1) == 0x000250, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_DynamicCast_AsRSGame_Instance_BPInterface_1' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_DynamicCast_bSuccess_9) == 0x000260, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, Temp_int_Loop_Counter_Variable_5) == 0x000264, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Less_IntInt_ReturnValue_5) == 0x000268, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Add_IntInt_ReturnValue_5) == 0x00026C, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, Temp_int_Array_Index_Variable_6) == 0x000270, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::Temp_int_Array_Index_Variable_6' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Array_Get_Item_4) == 0x000278, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_DynamicCast_AsRSBattle_Character) == 0x000280, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_DynamicCast_AsRSBattle_Character' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_DynamicCast_bSuccess_10) == 0x000288, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_Event_currentLevelName_1) == 0x000290, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_Event_currentLevelName_1' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_Event_currentLevelName) == 0x0002A0, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_Event_currentLevelName' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_Event_LoadedLevel) == 0x0002B0, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_Event_LoadedLevel' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, K2Node_Event_UnloadedLevel) == 0x0002B8, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::K2Node_Event_UnloadedLevel' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, Temp_int_Loop_Counter_Variable_6) == 0x0002C0, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::Temp_int_Loop_Counter_Variable_6' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_IsPersistentLevel_IsPersistenceLevel) == 0x0002C4, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_IsPersistentLevel_IsPersistenceLevel' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Less_IntInt_ReturnValue_6) == 0x0002C5, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Less_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP, CallFunc_Add_IntInt_ReturnValue_6) == 0x0002C8, "Member 'RSGameModeBP_C_ExecuteUbergraph_RSGameModeBP::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");

// Function RSGameModeBP.RSGameModeBP_C.OnUnloadedLevel
// 0x0008 (0x0008 - 0x0000)
struct RSGameModeBP_C_OnUnloadedLevel final
{
public:
	class UObject*                                UnloadedLevel;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RSGameModeBP_C_OnUnloadedLevel) == 0x000008, "Wrong alignment on RSGameModeBP_C_OnUnloadedLevel");
static_assert(sizeof(RSGameModeBP_C_OnUnloadedLevel) == 0x000008, "Wrong size on RSGameModeBP_C_OnUnloadedLevel");
static_assert(offsetof(RSGameModeBP_C_OnUnloadedLevel, UnloadedLevel) == 0x000000, "Member 'RSGameModeBP_C_OnUnloadedLevel::UnloadedLevel' has a wrong offset!");

// Function RSGameModeBP.RSGameModeBP_C.OnLoadedLevel
// 0x0008 (0x0008 - 0x0000)
struct RSGameModeBP_C_OnLoadedLevel final
{
public:
	class UObject*                                LoadedLevel;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RSGameModeBP_C_OnLoadedLevel) == 0x000008, "Wrong alignment on RSGameModeBP_C_OnLoadedLevel");
static_assert(sizeof(RSGameModeBP_C_OnLoadedLevel) == 0x000008, "Wrong size on RSGameModeBP_C_OnLoadedLevel");
static_assert(offsetof(RSGameModeBP_C_OnLoadedLevel, LoadedLevel) == 0x000000, "Member 'RSGameModeBP_C_OnLoadedLevel::LoadedLevel' has a wrong offset!");

// Function RSGameModeBP.RSGameModeBP_C.OnPreStartPlay
// 0x0010 (0x0010 - 0x0000)
struct RSGameModeBP_C_OnPreStartPlay final
{
public:
	class FString                                 CurrentLevelName;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(RSGameModeBP_C_OnPreStartPlay) == 0x000008, "Wrong alignment on RSGameModeBP_C_OnPreStartPlay");
static_assert(sizeof(RSGameModeBP_C_OnPreStartPlay) == 0x000010, "Wrong size on RSGameModeBP_C_OnPreStartPlay");
static_assert(offsetof(RSGameModeBP_C_OnPreStartPlay, CurrentLevelName) == 0x000000, "Member 'RSGameModeBP_C_OnPreStartPlay::CurrentLevelName' has a wrong offset!");

// Function RSGameModeBP.RSGameModeBP_C.OnPostInitGame
// 0x0010 (0x0010 - 0x0000)
struct RSGameModeBP_C_OnPostInitGame final
{
public:
	class FString                                 CurrentLevelName;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(RSGameModeBP_C_OnPostInitGame) == 0x000008, "Wrong alignment on RSGameModeBP_C_OnPostInitGame");
static_assert(sizeof(RSGameModeBP_C_OnPostInitGame) == 0x000010, "Wrong size on RSGameModeBP_C_OnPostInitGame");
static_assert(offsetof(RSGameModeBP_C_OnPostInitGame, CurrentLevelName) == 0x000000, "Member 'RSGameModeBP_C_OnPostInitGame::CurrentLevelName' has a wrong offset!");

// Function RSGameModeBP.RSGameModeBP_C.HandleStartingNewPlayer
// 0x0008 (0x0008 - 0x0000)
struct RSGameModeBP_C_HandleStartingNewPlayer final
{
public:
	class APlayerController*                      NewPlayer;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RSGameModeBP_C_HandleStartingNewPlayer) == 0x000008, "Wrong alignment on RSGameModeBP_C_HandleStartingNewPlayer");
static_assert(sizeof(RSGameModeBP_C_HandleStartingNewPlayer) == 0x000008, "Wrong size on RSGameModeBP_C_HandleStartingNewPlayer");
static_assert(offsetof(RSGameModeBP_C_HandleStartingNewPlayer, NewPlayer) == 0x000000, "Member 'RSGameModeBP_C_HandleStartingNewPlayer::NewPlayer' has a wrong offset!");

// Function RSGameModeBP.RSGameModeBP_C.SetPlayerAndEnemyGravity
// 0x0001 (0x0001 - 0x0000)
struct RSGameModeBP_C_SetPlayerAndEnemyGravity final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RSGameModeBP_C_SetPlayerAndEnemyGravity) == 0x000001, "Wrong alignment on RSGameModeBP_C_SetPlayerAndEnemyGravity");
static_assert(sizeof(RSGameModeBP_C_SetPlayerAndEnemyGravity) == 0x000001, "Wrong size on RSGameModeBP_C_SetPlayerAndEnemyGravity");
static_assert(offsetof(RSGameModeBP_C_SetPlayerAndEnemyGravity, Enable) == 0x000000, "Member 'RSGameModeBP_C_SetPlayerAndEnemyGravity::Enable' has a wrong offset!");

// Function RSGameModeBP.RSGameModeBP_C.MakeArrayPlayerToBase
// 0x0058 (0x0058 - 0x0000)
struct RSGameModeBP_C_MakeArrayPlayerToBase final
{
public:
	TArray<class ARSBattlePlayer_C*>              Players;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	TArray<class ARSCharacterBase*>               Bases;                                             // 0x0010(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	TArray<class ARSCharacterBase*>               Ary_l;                                             // 0x0020(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F35[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F36[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RSGameModeBP_C_MakeArrayPlayerToBase) == 0x000008, "Wrong alignment on RSGameModeBP_C_MakeArrayPlayerToBase");
static_assert(sizeof(RSGameModeBP_C_MakeArrayPlayerToBase) == 0x000058, "Wrong size on RSGameModeBP_C_MakeArrayPlayerToBase");
static_assert(offsetof(RSGameModeBP_C_MakeArrayPlayerToBase, Players) == 0x000000, "Member 'RSGameModeBP_C_MakeArrayPlayerToBase::Players' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_MakeArrayPlayerToBase, Bases) == 0x000010, "Member 'RSGameModeBP_C_MakeArrayPlayerToBase::Bases' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_MakeArrayPlayerToBase, Ary_l) == 0x000020, "Member 'RSGameModeBP_C_MakeArrayPlayerToBase::Ary_l' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_MakeArrayPlayerToBase, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'RSGameModeBP_C_MakeArrayPlayerToBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_MakeArrayPlayerToBase, Temp_int_Array_Index_Variable) == 0x000034, "Member 'RSGameModeBP_C_MakeArrayPlayerToBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_MakeArrayPlayerToBase, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'RSGameModeBP_C_MakeArrayPlayerToBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_MakeArrayPlayerToBase, CallFunc_Array_Get_Item) == 0x000040, "Member 'RSGameModeBP_C_MakeArrayPlayerToBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_MakeArrayPlayerToBase, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'RSGameModeBP_C_MakeArrayPlayerToBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_MakeArrayPlayerToBase, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'RSGameModeBP_C_MakeArrayPlayerToBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_MakeArrayPlayerToBase, CallFunc_Array_Add_ReturnValue) == 0x000050, "Member 'RSGameModeBP_C_MakeArrayPlayerToBase::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function RSGameModeBP.RSGameModeBP_C.MakeArrayBaseToPlayer
// 0x0060 (0x0060 - 0x0000)
struct RSGameModeBP_C_MakeArrayBaseToPlayer final
{
public:
	TArray<class ARSCharacterBase*>               Bases;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	TArray<class ARSBattlePlayer_C*>              Players;                                           // 0x0010(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	TArray<class ARSBattlePlayer_C*>              Ary_l;                                             // 0x0020(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F37[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F38[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RSGameModeBP_C_MakeArrayBaseToPlayer) == 0x000008, "Wrong alignment on RSGameModeBP_C_MakeArrayBaseToPlayer");
static_assert(sizeof(RSGameModeBP_C_MakeArrayBaseToPlayer) == 0x000060, "Wrong size on RSGameModeBP_C_MakeArrayBaseToPlayer");
static_assert(offsetof(RSGameModeBP_C_MakeArrayBaseToPlayer, Bases) == 0x000000, "Member 'RSGameModeBP_C_MakeArrayBaseToPlayer::Bases' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_MakeArrayBaseToPlayer, Players) == 0x000010, "Member 'RSGameModeBP_C_MakeArrayBaseToPlayer::Players' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_MakeArrayBaseToPlayer, Ary_l) == 0x000020, "Member 'RSGameModeBP_C_MakeArrayBaseToPlayer::Ary_l' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_MakeArrayBaseToPlayer, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'RSGameModeBP_C_MakeArrayBaseToPlayer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_MakeArrayBaseToPlayer, Temp_int_Array_Index_Variable) == 0x000034, "Member 'RSGameModeBP_C_MakeArrayBaseToPlayer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_MakeArrayBaseToPlayer, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'RSGameModeBP_C_MakeArrayBaseToPlayer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_MakeArrayBaseToPlayer, CallFunc_Array_Get_Item) == 0x000040, "Member 'RSGameModeBP_C_MakeArrayBaseToPlayer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_MakeArrayBaseToPlayer, K2Node_DynamicCast_AsRSBattle_Player) == 0x000048, "Member 'RSGameModeBP_C_MakeArrayBaseToPlayer::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_MakeArrayBaseToPlayer, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'RSGameModeBP_C_MakeArrayBaseToPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_MakeArrayBaseToPlayer, CallFunc_Less_IntInt_ReturnValue) == 0x000051, "Member 'RSGameModeBP_C_MakeArrayBaseToPlayer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_MakeArrayBaseToPlayer, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'RSGameModeBP_C_MakeArrayBaseToPlayer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSGameModeBP_C_MakeArrayBaseToPlayer, CallFunc_Array_Add_ReturnValue) == 0x000058, "Member 'RSGameModeBP_C_MakeArrayBaseToPlayer::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function RSGameModeBP.RSGameModeBP_C.IndexToPartyPlayerKind
// 0x0010 (0x0010 - 0x0000)
struct RSGameModeBP_C_IndexToPartyPlayerKind final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERSPartyPlayerKind                            Kind;                                              // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F39[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERSPartyPlayerKind                            Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERSPartyPlayerKind                            Temp_byte_Variable_1;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
