#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RSGameInstanceBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function RSGameInstanceBP.RSGameInstanceBP_C.ExecuteUbergraph_RSGameInstanceBP
// 0x00F0 (0x00F0 - 0x0000)
struct RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3802[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSGameInstance*                        K2Node_DynamicCast_AsRSGame_Instance;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3803[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSGameInstance*                        K2Node_DynamicCast_AsRSGame_Instance_1;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3804[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstance*                        K2Node_DynamicCast_AsRSGame_Instance_2;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3805[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSGameInstance*                        K2Node_DynamicCast_AsRSGame_Instance_3;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3806[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_4;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSGameInstance*                        K2Node_DynamicCast_AsRSGame_Instance_4;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3807[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IRSGameModeBPInterface_C> K2Node_DynamicCast_AsRSGame_Mode_BPInterface;      // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3808[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IRSGameModeBPInterface_C> K2Node_DynamicCast_AsRSGame_Mode_BPInterface_1;    // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGameFlowLevelBP_ReturnValue;            // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3809[0x6];                                     // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSInGameFlow*                          CallFunc_GetRSInGameFlow_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_380A[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetRenderTargetManager_ReturnValue;       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_RenderTargetManager_C> K2Node_DynamicCast_AsBPI_Render_Target_Manager;    // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP) == 0x000008, "Wrong alignment on RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP");
static_assert(sizeof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP) == 0x0000F0, "Wrong size on RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, EntryPoint) == 0x000000, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, K2Node_DynamicCast_AsRSGame_Instance) == 0x000010, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::K2Node_DynamicCast_AsRSGame_Instance' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, CallFunc_GetGameInstance_ReturnValue_1) == 0x000020, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, CallFunc_GetGameInstance_ReturnValue_2) == 0x000028, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, K2Node_DynamicCast_AsRSGame_Instance_1) == 0x000030, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::K2Node_DynamicCast_AsRSGame_Instance_1' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, K2Node_DynamicCast_AsRSGame_Instance_2) == 0x000040, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::K2Node_DynamicCast_AsRSGame_Instance_2' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, CallFunc_GetGameInstance_ReturnValue_3) == 0x000050, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::CallFunc_GetGameInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, K2Node_DynamicCast_AsRSGame_Instance_3) == 0x000058, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::K2Node_DynamicCast_AsRSGame_Instance_3' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, K2Node_DynamicCast_bSuccess_3) == 0x000060, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, CallFunc_GetGameInstance_ReturnValue_4) == 0x000068, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::CallFunc_GetGameInstance_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, K2Node_DynamicCast_AsRSGame_Instance_4) == 0x000070, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::K2Node_DynamicCast_AsRSGame_Instance_4' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, K2Node_DynamicCast_bSuccess_4) == 0x000078, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, CallFunc_GetGameMode_ReturnValue) == 0x000080, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, K2Node_DynamicCast_AsRSGame_Mode_BPInterface) == 0x000088, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::K2Node_DynamicCast_AsRSGame_Mode_BPInterface' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, K2Node_DynamicCast_bSuccess_5) == 0x000098, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, K2Node_DynamicCast_AsRSGame_Mode_BPInterface_1) == 0x0000A0, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::K2Node_DynamicCast_AsRSGame_Mode_BPInterface_1' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, K2Node_DynamicCast_bSuccess_6) == 0x0000B0, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, CallFunc_IsGameFlowLevelBP_ReturnValue) == 0x0000B1, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::CallFunc_IsGameFlowLevelBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, CallFunc_GetRSGameInstance_RSGameInstance) == 0x0000B8, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::CallFunc_GetRSGameInstance_RSGameInstance' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, CallFunc_GetRSInGameFlow_ReturnValue) == 0x0000C0, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::CallFunc_GetRSInGameFlow_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, CallFunc_GetRenderTargetManager_ReturnValue) == 0x0000D0, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::CallFunc_GetRenderTargetManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, K2Node_DynamicCast_AsBPI_Render_Target_Manager) == 0x0000D8, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::K2Node_DynamicCast_AsBPI_Render_Target_Manager' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, K2Node_DynamicCast_bSuccess_7) == 0x0000E8, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP, CallFunc_IsValid_ReturnValue_1) == 0x0000E9, "Member 'RSGameInstanceBP_C_ExecuteUbergraph_RSGameInstanceBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function RSGameInstanceBP.RSGameInstanceBP_C.SetUpMouseEvent
// 0x0008 (0x0008 - 0x0000)
struct RSGameInstanceBP_C_SetUpMouseEvent final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RSGameInstanceBP_C_SetUpMouseEvent) == 0x000008, "Wrong alignment on RSGameInstanceBP_C_SetUpMouseEvent");
static_assert(sizeof(RSGameInstanceBP_C_SetUpMouseEvent) == 0x000008, "Wrong size on RSGameInstanceBP_C_SetUpMouseEvent");
static_assert(offsetof(RSGameInstanceBP_C_SetUpMouseEvent, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'RSGameInstanceBP_C_SetUpMouseEvent::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

}

