#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RSOutGameModeBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function RSOutGameModeBP.RSOutGameModeBP_C.ExecuteUbergraph_RSOutGameModeBP
// 0x0080 (0x0080 - 0x0000)
struct RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_currentLevelName_1;                   // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_currentLevelName;                     // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EA4[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstance*                        K2Node_DynamicCast_AsRSGame_Instance;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EA5[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EA6[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstance*                        K2Node_DynamicCast_AsRSGame_Instance_1;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EA7[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IManagerInterface>     K2Node_DynamicCast_AsManager_Interface;            // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InitializeManager_ReturnValue;            // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP) == 0x000008, "Wrong alignment on RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP");
static_assert(sizeof(RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP) == 0x000080, "Wrong size on RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP");
static_assert(offsetof(RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP, EntryPoint) == 0x000000, "Member 'RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP, K2Node_Event_currentLevelName_1) == 0x000008, "Member 'RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP::K2Node_Event_currentLevelName_1' has a wrong offset!");
static_assert(offsetof(RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP, K2Node_Event_currentLevelName) == 0x000018, "Member 'RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP::K2Node_Event_currentLevelName' has a wrong offset!");
static_assert(offsetof(RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP, CallFunc_GetGameInstance_ReturnValue) == 0x000028, "Member 'RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP, K2Node_DynamicCast_AsRSGame_Instance) == 0x000038, "Member 'RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP::K2Node_DynamicCast_AsRSGame_Instance' has a wrong offset!");
static_assert(offsetof(RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP, CallFunc_GetGameInstance_ReturnValue_1) == 0x000048, "Member 'RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP, K2Node_DynamicCast_AsRSGame_Instance_1) == 0x000058, "Member 'RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP::K2Node_DynamicCast_AsRSGame_Instance_1' has a wrong offset!");
static_assert(offsetof(RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP, K2Node_DynamicCast_AsManager_Interface) == 0x000068, "Member 'RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP::K2Node_DynamicCast_AsManager_Interface' has a wrong offset!");
static_assert(offsetof(RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP, CallFunc_InitializeManager_ReturnValue) == 0x000079, "Member 'RSOutGameModeBP_C_ExecuteUbergraph_RSOutGameModeBP::CallFunc_InitializeManager_ReturnValue' has a wrong offset!");

// Function RSOutGameModeBP.RSOutGameModeBP_C.OnPreStartPlay
// 0x0010 (0x0010 - 0x0000)
struct RSOutGameModeBP_C_OnPreStartPlay final
{
public:
	class FString                                 CurrentLevelName;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(RSOutGameModeBP_C_OnPreStartPlay) == 0x000008, "Wrong alignment on RSOutGameModeBP_C_OnPreStartPlay");
static_assert(sizeof(RSOutGameModeBP_C_OnPreStartPlay) == 0x000010, "Wrong size on RSOutGameModeBP_C_OnPreStartPlay");
static_assert(offsetof(RSOutGameModeBP_C_OnPreStartPlay, CurrentLevelName) == 0x000000, "Member 'RSOutGameModeBP_C_OnPreStartPlay::CurrentLevelName' has a wrong offset!");

// Function RSOutGameModeBP.RSOutGameModeBP_C.OnPostInitGame
// 0x0010 (0x0010 - 0x0000)
struct RSOutGameModeBP_C_OnPostInitGame final
{
public:
	class FString                                 CurrentLevelName;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(RSOutGameModeBP_C_OnPostInitGame) == 0x000008, "Wrong alignment on RSOutGameModeBP_C_OnPostInitGame");
static_assert(sizeof(RSOutGameModeBP_C_OnPostInitGame) == 0x000010, "Wrong size on RSOutGameModeBP_C_OnPostInitGame");
static_assert(offsetof(RSOutGameModeBP_C_OnPostInitGame, CurrentLevelName) == 0x000000, "Member 'RSOutGameModeBP_C_OnPostInitGame::CurrentLevelName' has a wrong offset!");

}

