#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_AjitoMemberInfo

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_AjitoMemberInfo.S_AjitoMemberInfo
// 0x0098 (0x0098 - 0x0000)
struct FS_AjitoMemberInfo final
{
public:
	class FName                                   Description_31_E97F24CE4ADFD82BA3551ABE175884F4;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 AnimClass_4_7AB1E56B4450FA78808E76B42ADBD4CA;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UASStateMachine>         StateMachine_6_E27CA5304D48D72381920CA0043D22AD;   // 0x0010(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UASAnimationSet>         AnimationSet_9_2542224A451DD1544297CB893E998D3A;   // 0x0038(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          IsLookAtPlayerInTalking_21_2924455C44EFD4B8B2E431882817E37E; // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47DD[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAjitoMemberAttach>             AttachInfo_15_4B98720F4C7B1EF3A2335F81A35A7519;    // 0x0068(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	EAjitoMemberIdleStateType                     IdleStateType_25_B5ED416644FF50E5CF7BF79CBBB812D3; // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAjitoMemberTalkStateType                     TalkStateType_28_AB1C94FC47C7EA512CDE1F9C35F96908; // 0x0079(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsIdleOnlyAction_33_9F551FED49CEC8E348596E8F41348283; // 0x007A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47DE[0x5];                                     // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 HideItemTags_38_C3E258D44C758775E79638AD2350725B;  // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsSetHeadHeight_44_A642A5B441AB701F56E8A68662BF1282; // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47DF[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HeadHeight_45_661538364565A96822098D9AD92184BE;    // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_AjitoMemberInfo) == 0x000008, "Wrong alignment on FS_AjitoMemberInfo");
static_assert(sizeof(FS_AjitoMemberInfo) == 0x000098, "Wrong size on FS_AjitoMemberInfo");
static_assert(offsetof(FS_AjitoMemberInfo, Description_31_E97F24CE4ADFD82BA3551ABE175884F4) == 0x000000, "Member 'FS_AjitoMemberInfo::Description_31_E97F24CE4ADFD82BA3551ABE175884F4' has a wrong offset!");
static_assert(offsetof(FS_AjitoMemberInfo, AnimClass_4_7AB1E56B4450FA78808E76B42ADBD4CA) == 0x000008, "Member 'FS_AjitoMemberInfo::AnimClass_4_7AB1E56B4450FA78808E76B42ADBD4CA' has a wrong offset!");
static_assert(offsetof(FS_AjitoMemberInfo, StateMachine_6_E27CA5304D48D72381920CA0043D22AD) == 0x000010, "Member 'FS_AjitoMemberInfo::StateMachine_6_E27CA5304D48D72381920CA0043D22AD' has a wrong offset!");
static_assert(offsetof(FS_AjitoMemberInfo, AnimationSet_9_2542224A451DD1544297CB893E998D3A) == 0x000038, "Member 'FS_AjitoMemberInfo::AnimationSet_9_2542224A451DD1544297CB893E998D3A' has a wrong offset!");
static_assert(offsetof(FS_AjitoMemberInfo, IsLookAtPlayerInTalking_21_2924455C44EFD4B8B2E431882817E37E) == 0x000060, "Member 'FS_AjitoMemberInfo::IsLookAtPlayerInTalking_21_2924455C44EFD4B8B2E431882817E37E' has a wrong offset!");
static_assert(offsetof(FS_AjitoMemberInfo, AttachInfo_15_4B98720F4C7B1EF3A2335F81A35A7519) == 0x000068, "Member 'FS_AjitoMemberInfo::AttachInfo_15_4B98720F4C7B1EF3A2335F81A35A7519' has a wrong offset!");
static_assert(offsetof(FS_AjitoMemberInfo, IdleStateType_25_B5ED416644FF50E5CF7BF79CBBB812D3) == 0x000078, "Member 'FS_AjitoMemberInfo::IdleStateType_25_B5ED416644FF50E5CF7BF79CBBB812D3' has a wrong offset!");
static_assert(offsetof(FS_AjitoMemberInfo, TalkStateType_28_AB1C94FC47C7EA512CDE1F9C35F96908) == 0x000079, "Member 'FS_AjitoMemberInfo::TalkStateType_28_AB1C94FC47C7EA512CDE1F9C35F96908' has a wrong offset!");
static_assert(offsetof(FS_AjitoMemberInfo, IsIdleOnlyAction_33_9F551FED49CEC8E348596E8F41348283) == 0x00007A, "Member 'FS_AjitoMemberInfo::IsIdleOnlyAction_33_9F551FED49CEC8E348596E8F41348283' has a wrong offset!");
static_assert(offsetof(FS_AjitoMemberInfo, HideItemTags_38_C3E258D44C758775E79638AD2350725B) == 0x000080, "Member 'FS_AjitoMemberInfo::HideItemTags_38_C3E258D44C758775E79638AD2350725B' has a wrong offset!");
static_assert(offsetof(FS_AjitoMemberInfo, IsSetHeadHeight_44_A642A5B441AB701F56E8A68662BF1282) == 0x000090, "Member 'FS_AjitoMemberInfo::IsSetHeadHeight_44_A642A5B441AB701F56E8A68662BF1282' has a wrong offset!");
static_assert(offsetof(FS_AjitoMemberInfo, HeadHeight_45_661538364565A96822098D9AD92184BE) == 0x000094, "Member 'FS_AjitoMemberInfo::HeadHeight_45_661538364565A96822098D9AD92184BE' has a wrong offset!");

}

