#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_AjitoCharaTable

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_AjitoCharaTable.S_AjitoCharaTable
// 0x0078 (0x0078 - 0x0000)
struct FS_AjitoCharaTable final
{
public:
	EPlayerID                                     PlayerID_3_CFF677AD44EA72241FB3ECA5AD758EEB;       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7410[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CharaID_27_EA5E67FA4660F52356A1C4897F7033C6;       // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CharaName_28_50EE392C4EC79640A37E56AAABC948E2;     // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CharaRoma_30_C3E1DC6B49866A3C0D7B0084BB21C162;     // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         NpcMeshID_14_FCF69C6F4DB3A061257905A76FDA5D2A;     // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7411[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USkeletalMesh>           Mesh_38_78DD41124ADE8E0384AC92B688A08472;          // 0x0040(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UClass*                                 ActorClass_43_63DE75B648F6C8257DA016BDDA559A17;    // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 AnimClass_35_FF99A4BF49B9F9709B89B09D558A72D3;     // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_AjitoCharaTable) == 0x000008, "Wrong alignment on FS_AjitoCharaTable");
static_assert(sizeof(FS_AjitoCharaTable) == 0x000078, "Wrong size on FS_AjitoCharaTable");
static_assert(offsetof(FS_AjitoCharaTable, PlayerID_3_CFF677AD44EA72241FB3ECA5AD758EEB) == 0x000000, "Member 'FS_AjitoCharaTable::PlayerID_3_CFF677AD44EA72241FB3ECA5AD758EEB' has a wrong offset!");
static_assert(offsetof(FS_AjitoCharaTable, CharaID_27_EA5E67FA4660F52356A1C4897F7033C6) == 0x000008, "Member 'FS_AjitoCharaTable::CharaID_27_EA5E67FA4660F52356A1C4897F7033C6' has a wrong offset!");
static_assert(offsetof(FS_AjitoCharaTable, CharaName_28_50EE392C4EC79640A37E56AAABC948E2) == 0x000018, "Member 'FS_AjitoCharaTable::CharaName_28_50EE392C4EC79640A37E56AAABC948E2' has a wrong offset!");
static_assert(offsetof(FS_AjitoCharaTable, CharaRoma_30_C3E1DC6B49866A3C0D7B0084BB21C162) == 0x000028, "Member 'FS_AjitoCharaTable::CharaRoma_30_C3E1DC6B49866A3C0D7B0084BB21C162' has a wrong offset!");
static_assert(offsetof(FS_AjitoCharaTable, NpcMeshID_14_FCF69C6F4DB3A061257905A76FDA5D2A) == 0x000038, "Member 'FS_AjitoCharaTable::NpcMeshID_14_FCF69C6F4DB3A061257905A76FDA5D2A' has a wrong offset!");
static_assert(offsetof(FS_AjitoCharaTable, Mesh_38_78DD41124ADE8E0384AC92B688A08472) == 0x000040, "Member 'FS_AjitoCharaTable::Mesh_38_78DD41124ADE8E0384AC92B688A08472' has a wrong offset!");
static_assert(offsetof(FS_AjitoCharaTable, ActorClass_43_63DE75B648F6C8257DA016BDDA559A17) == 0x000068, "Member 'FS_AjitoCharaTable::ActorClass_43_63DE75B648F6C8257DA016BDDA559A17' has a wrong offset!");
static_assert(offsetof(FS_AjitoCharaTable, AnimClass_35_FF99A4BF49B9F9709B89B09D558A72D3) == 0x000070, "Member 'FS_AjitoCharaTable::AnimClass_35_FF99A4BF49B9F9709B89B09D558A72D3' has a wrong offset!");

}

