#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_AjitoOmReplaceInfo

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_AjitoOmReplaceInfo.S_AjitoOmReplaceInfo
// 0x0018 (0x0018 - 0x0000)
struct FS_AjitoOmReplaceInfo final
{
public:
	class FName                                   PresentId_8_F7E9B6134136CBB29F3838A03F533E74;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   OmName_4_9779EBDC40FA1DBC8DBF8BA7F48C5B6B;         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BgActorName_5_40E46ED240ACB3AEC42E339CE6397A70;    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_AjitoOmReplaceInfo) == 0x000004, "Wrong alignment on FS_AjitoOmReplaceInfo");
static_assert(sizeof(FS_AjitoOmReplaceInfo) == 0x000018, "Wrong size on FS_AjitoOmReplaceInfo");
static_assert(offsetof(FS_AjitoOmReplaceInfo, PresentId_8_F7E9B6134136CBB29F3838A03F533E74) == 0x000000, "Member 'FS_AjitoOmReplaceInfo::PresentId_8_F7E9B6134136CBB29F3838A03F533E74' has a wrong offset!");
static_assert(offsetof(FS_AjitoOmReplaceInfo, OmName_4_9779EBDC40FA1DBC8DBF8BA7F48C5B6B) == 0x000008, "Member 'FS_AjitoOmReplaceInfo::OmName_4_9779EBDC40FA1DBC8DBF8BA7F48C5B6B' has a wrong offset!");
static_assert(offsetof(FS_AjitoOmReplaceInfo, BgActorName_5_40E46ED240ACB3AEC42E339CE6397A70) == 0x000010, "Member 'FS_AjitoOmReplaceInfo::BgActorName_5_40E46ED240ACB3AEC42E339CE6397A70' has a wrong offset!");

}

