#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_AreaInfoTweakCondition

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_AreaInfoTweakCondition.S_AreaInfoTweakCondition
// 0x0010 (0x0010 - 0x0000)
struct FS_AreaInfoTweakCondition final
{
public:
	EAreaInfoTweakCheckType                       CheckType_2_70BBCF5F45CBA36DF49C17BD346A0755;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAreaInfoTweakConditionType                   ConditionType_13_7E9332384189AF2C8467CC86E0F3EA76; // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431A[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Num_9_5FC4767549F404781D5281B76803A9AA;            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Name_8_D6CB121D44AE81CB3BD50CA748CC13D3;           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_AreaInfoTweakCondition) == 0x000004, "Wrong alignment on FS_AreaInfoTweakCondition");
static_assert(sizeof(FS_AreaInfoTweakCondition) == 0x000010, "Wrong size on FS_AreaInfoTweakCondition");
static_assert(offsetof(FS_AreaInfoTweakCondition, CheckType_2_70BBCF5F45CBA36DF49C17BD346A0755) == 0x000000, "Member 'FS_AreaInfoTweakCondition::CheckType_2_70BBCF5F45CBA36DF49C17BD346A0755' has a wrong offset!");
static_assert(offsetof(FS_AreaInfoTweakCondition, ConditionType_13_7E9332384189AF2C8467CC86E0F3EA76) == 0x000001, "Member 'FS_AreaInfoTweakCondition::ConditionType_13_7E9332384189AF2C8467CC86E0F3EA76' has a wrong offset!");
static_assert(offsetof(FS_AreaInfoTweakCondition, Num_9_5FC4767549F404781D5281B76803A9AA) == 0x000004, "Member 'FS_AreaInfoTweakCondition::Num_9_5FC4767549F404781D5281B76803A9AA' has a wrong offset!");
static_assert(offsetof(FS_AreaInfoTweakCondition, Name_8_D6CB121D44AE81CB3BD50CA748CC13D3) == 0x000008, "Member 'FS_AreaInfoTweakCondition::Name_8_D6CB121D44AE81CB3BD50CA748CC13D3' has a wrong offset!");

}

