#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_AreaInfoTweakExec

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "E_SceneType_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_AreaInfoTweakExec.S_AreaInfoTweakExec
// 0x0020 (0x0020 - 0x0000)
struct FS_AreaInfoTweakExec final
{
public:
	EAreaInfoTweakType                            ThenTweakType_10_B0C00314452CE7748C7A07941B772520; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAreaInfoType                                 AreaInfoType_13_C23336EF452B9F0DA5B65C99A87AEFE5;  // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18DF[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           AreaInfoNames_9_B730EC744E178F7514DC969C27000F33;  // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	E_SceneType                                   SceneType_16_90A790824B0620969BC0E88F7D941149;     // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_AreaInfoTweakExec) == 0x000008, "Wrong alignment on FS_AreaInfoTweakExec");
static_assert(sizeof(FS_AreaInfoTweakExec) == 0x000020, "Wrong size on FS_AreaInfoTweakExec");
static_assert(offsetof(FS_AreaInfoTweakExec, ThenTweakType_10_B0C00314452CE7748C7A07941B772520) == 0x000000, "Member 'FS_AreaInfoTweakExec::ThenTweakType_10_B0C00314452CE7748C7A07941B772520' has a wrong offset!");
static_assert(offsetof(FS_AreaInfoTweakExec, AreaInfoType_13_C23336EF452B9F0DA5B65C99A87AEFE5) == 0x000001, "Member 'FS_AreaInfoTweakExec::AreaInfoType_13_C23336EF452B9F0DA5B65C99A87AEFE5' has a wrong offset!");
static_assert(offsetof(FS_AreaInfoTweakExec, AreaInfoNames_9_B730EC744E178F7514DC969C27000F33) == 0x000008, "Member 'FS_AreaInfoTweakExec::AreaInfoNames_9_B730EC744E178F7514DC969C27000F33' has a wrong offset!");
static_assert(offsetof(FS_AreaInfoTweakExec, SceneType_16_90A790824B0620969BC0E88F7D941149) == 0x000018, "Member 'FS_AreaInfoTweakExec::SceneType_16_90A790824B0620969BC0E88F7D941149' has a wrong offset!");

}

