#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_BGAreaInfo

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_BGAreaInfo.S_BGAreaInfo
// 0x0030 (0x0030 - 0x0000)
struct FS_BGAreaInfo final
{
public:
	TArray<TSoftObjectPtr<class UObject>>         PreloadBGLevels_8_5857A313486B9845501B10A2A303CB7B; // 0x0000(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UObject>>         BGLevels_9_E9C3706A4B08953143C97885363CC7B5;       // 0x0010(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UObject>>         LBAndPortal_17_6995F476403F7D002ECBF892B123E228;   // 0x0020(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FS_BGAreaInfo) == 0x000008, "Wrong alignment on FS_BGAreaInfo");
static_assert(sizeof(FS_BGAreaInfo) == 0x000030, "Wrong size on FS_BGAreaInfo");
static_assert(offsetof(FS_BGAreaInfo, PreloadBGLevels_8_5857A313486B9845501B10A2A303CB7B) == 0x000000, "Member 'FS_BGAreaInfo::PreloadBGLevels_8_5857A313486B9845501B10A2A303CB7B' has a wrong offset!");
static_assert(offsetof(FS_BGAreaInfo, BGLevels_9_E9C3706A4B08953143C97885363CC7B5) == 0x000010, "Member 'FS_BGAreaInfo::BGLevels_9_E9C3706A4B08953143C97885363CC7B5' has a wrong offset!");
static_assert(offsetof(FS_BGAreaInfo, LBAndPortal_17_6995F476403F7D002ECBF892B123E228) == 0x000020, "Member 'FS_BGAreaInfo::LBAndPortal_17_6995F476403F7D002ECBF892B123E228' has a wrong offset!");

}

