#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_LevelManagerCommand

#include "Basic.hpp"

#include "E_LevelManagerCommand_structs.hpp"
#include "E_LevelCommandStatus_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_LevelManagerCommand.S_LevelManagerCommand
// 0x0048 (0x0048 - 0x0000)
struct FS_LevelManagerCommand final
{
public:
	E_LevelManagerCommand                         Command_5_4FED40634C93AC6253741994AFCFA307;        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3278[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ArgName_10_76305C1B4E71DB06E4F87ABEF040EAA7;       // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ArgName2_22_3CD3F8AC4C99DC270D528CB0AD8F4627;      // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3279[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 ArgAsset_19_9C03485F41B91C9BF443CBA384467D10;      // 0x0018(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	E_LevelCommandStatus                          Status_8_858B198F4B6F552207B6FBB9893B8A7E;         // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Flag_12_969BD8BB4AB6913B58542DA244054C62;          // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Flag2_24_E76529D942133A168395B991722ECD73;         // 0x0042(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FS_LevelManagerCommand) == 0x000008, "Wrong alignment on FS_LevelManagerCommand");
static_assert(sizeof(FS_LevelManagerCommand) == 0x000048, "Wrong size on FS_LevelManagerCommand");
static_assert(offsetof(FS_LevelManagerCommand, Command_5_4FED40634C93AC6253741994AFCFA307) == 0x000000, "Member 'FS_LevelManagerCommand::Command_5_4FED40634C93AC6253741994AFCFA307' has a wrong offset!");
static_assert(offsetof(FS_LevelManagerCommand, ArgName_10_76305C1B4E71DB06E4F87ABEF040EAA7) == 0x000004, "Member 'FS_LevelManagerCommand::ArgName_10_76305C1B4E71DB06E4F87ABEF040EAA7' has a wrong offset!");
static_assert(offsetof(FS_LevelManagerCommand, ArgName2_22_3CD3F8AC4C99DC270D528CB0AD8F4627) == 0x00000C, "Member 'FS_LevelManagerCommand::ArgName2_22_3CD3F8AC4C99DC270D528CB0AD8F4627' has a wrong offset!");
static_assert(offsetof(FS_LevelManagerCommand, ArgAsset_19_9C03485F41B91C9BF443CBA384467D10) == 0x000018, "Member 'FS_LevelManagerCommand::ArgAsset_19_9C03485F41B91C9BF443CBA384467D10' has a wrong offset!");
static_assert(offsetof(FS_LevelManagerCommand, Status_8_858B198F4B6F552207B6FBB9893B8A7E) == 0x000040, "Member 'FS_LevelManagerCommand::Status_8_858B198F4B6F552207B6FBB9893B8A7E' has a wrong offset!");
static_assert(offsetof(FS_LevelManagerCommand, Flag_12_969BD8BB4AB6913B58542DA244054C62) == 0x000041, "Member 'FS_LevelManagerCommand::Flag_12_969BD8BB4AB6913B58542DA244054C62' has a wrong offset!");
static_assert(offsetof(FS_LevelManagerCommand, Flag2_24_E76529D942133A168395B991722ECD73) == 0x000042, "Member 'FS_LevelManagerCommand::Flag2_24_E76529D942133A168395B991722ECD73' has a wrong offset!");

}

