#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_LoadedLevelInfo

#include "Basic.hpp"

#include "E_LevelLoadStatus_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_LoadedLevelInfo.S_LoadedLevelInfo
// 0x0048 (0x0048 - 0x0000)
struct FS_LoadedLevelInfo final
{
public:
	TSoftObjectPtr<class UObject>                 LevelRef_12_FC3BC72C44769422E4D0BC985785F37B;      // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          Visible_4_322AFC9B400D0A02021575A093C6B648;        // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShouldVisible_16_9D78D7CF4486CCA22F1C679CBECCDF71; // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_LevelLoadStatus                             Status_7_7DF38F1441C9AD6FF746B0B16DFE5992;         // 0x002A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_452B[0x5];                                     // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           UsingAreaNames_11_3C32EA644D21866161F261AAC7796DBB; // 0x0030(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          IsChangingVisible_14_3C7443AA484C54CFA7DD8EBB618183C8; // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FS_LoadedLevelInfo) == 0x000008, "Wrong alignment on FS_LoadedLevelInfo");
static_assert(sizeof(FS_LoadedLevelInfo) == 0x000048, "Wrong size on FS_LoadedLevelInfo");
static_assert(offsetof(FS_LoadedLevelInfo, LevelRef_12_FC3BC72C44769422E4D0BC985785F37B) == 0x000000, "Member 'FS_LoadedLevelInfo::LevelRef_12_FC3BC72C44769422E4D0BC985785F37B' has a wrong offset!");
static_assert(offsetof(FS_LoadedLevelInfo, Visible_4_322AFC9B400D0A02021575A093C6B648) == 0x000028, "Member 'FS_LoadedLevelInfo::Visible_4_322AFC9B400D0A02021575A093C6B648' has a wrong offset!");
static_assert(offsetof(FS_LoadedLevelInfo, ShouldVisible_16_9D78D7CF4486CCA22F1C679CBECCDF71) == 0x000029, "Member 'FS_LoadedLevelInfo::ShouldVisible_16_9D78D7CF4486CCA22F1C679CBECCDF71' has a wrong offset!");
static_assert(offsetof(FS_LoadedLevelInfo, Status_7_7DF38F1441C9AD6FF746B0B16DFE5992) == 0x00002A, "Member 'FS_LoadedLevelInfo::Status_7_7DF38F1441C9AD6FF746B0B16DFE5992' has a wrong offset!");
static_assert(offsetof(FS_LoadedLevelInfo, UsingAreaNames_11_3C32EA644D21866161F261AAC7796DBB) == 0x000030, "Member 'FS_LoadedLevelInfo::UsingAreaNames_11_3C32EA644D21866161F261AAC7796DBB' has a wrong offset!");
static_assert(offsetof(FS_LoadedLevelInfo, IsChangingVisible_14_3C7443AA484C54CFA7DD8EBB618183C8) == 0x000040, "Member 'FS_LoadedLevelInfo::IsChangingVisible_14_3C7443AA484C54CFA7DD8EBB618183C8' has a wrong offset!");

}

