#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SASCableAnim

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct SASCableAnim.BoneAnimParts
// 0x0048 (0x0048 - 0x0000)
struct FBoneAnimParts final
{
public:
	uint8                                         Pad_15D0[0xC];                                     // 0x0000(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                boneLocationIgnoreAnimation;                       // 0x000C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15D1[0x18];                                    // 0x0018(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               boneRotationIgnoreAnimation;                       // 0x0030(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_15D2[0xC];                                     // 0x003C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FBoneAnimParts) == 0x000004, "Wrong alignment on FBoneAnimParts");
static_assert(sizeof(FBoneAnimParts) == 0x000048, "Wrong size on FBoneAnimParts");
static_assert(offsetof(FBoneAnimParts, boneLocationIgnoreAnimation) == 0x00000C, "Member 'FBoneAnimParts::boneLocationIgnoreAnimation' has a wrong offset!");
static_assert(offsetof(FBoneAnimParts, boneRotationIgnoreAnimation) == 0x000030, "Member 'FBoneAnimParts::boneRotationIgnoreAnimation' has a wrong offset!");

}

