#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SASCableAnim

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SASCableAnim.SCAnimInstance.SetSASCodeSocketWorldLocations
// 0x0050 (0x0050 - 0x0000)
struct SCAnimInstance_SetSASCodeSocketWorldLocations final
{
public:
	TMap<class FName, struct FTransform>          Locations;                                         // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCAnimInstance_SetSASCodeSocketWorldLocations) == 0x000008, "Wrong alignment on SCAnimInstance_SetSASCodeSocketWorldLocations");
static_assert(sizeof(SCAnimInstance_SetSASCodeSocketWorldLocations) == 0x000050, "Wrong size on SCAnimInstance_SetSASCodeSocketWorldLocations");
static_assert(offsetof(SCAnimInstance_SetSASCodeSocketWorldLocations, Locations) == 0x000000, "Member 'SCAnimInstance_SetSASCodeSocketWorldLocations::Locations' has a wrong offset!");

// Function SASCableAnim.SCAnimInstance.Update
// 0x0004 (0x0004 - 0x0000)
struct SCAnimInstance_Update final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCAnimInstance_Update) == 0x000004, "Wrong alignment on SCAnimInstance_Update");
static_assert(sizeof(SCAnimInstance_Update) == 0x000004, "Wrong size on SCAnimInstance_Update");
static_assert(offsetof(SCAnimInstance_Update, DeltaTime) == 0x000000, "Member 'SCAnimInstance_Update::DeltaTime' has a wrong offset!");

}

