#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SNpcSelfRecoveryData

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK
{

// UserDefinedStruct SNpcSelfRecoveryData.SNpcSelfRecoveryData
// 0x000C (0x000C - 0x0000)
struct FSNpcSelfRecoveryData final
{
public:
	EConsumeItemID                                ItemID_2_99E51CEC4B80E630CA56D6A40D494FD6;         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45EF[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HPRate_9_2530726F4C008E709AE262958533A3FF;         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RecoveryRate_11_546EED0D433F61EFBE43DD9B813F44D3;  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSNpcSelfRecoveryData) == 0x000004, "Wrong alignment on FSNpcSelfRecoveryData");
static_assert(sizeof(FSNpcSelfRecoveryData) == 0x00000C, "Wrong size on FSNpcSelfRecoveryData");
static_assert(offsetof(FSNpcSelfRecoveryData, ItemID_2_99E51CEC4B80E630CA56D6A40D494FD6) == 0x000000, "Member 'FSNpcSelfRecoveryData::ItemID_2_99E51CEC4B80E630CA56D6A40D494FD6' has a wrong offset!");
static_assert(offsetof(FSNpcSelfRecoveryData, HPRate_9_2530726F4C008E709AE262958533A3FF) == 0x000004, "Member 'FSNpcSelfRecoveryData::HPRate_9_2530726F4C008E709AE262958533A3FF' has a wrong offset!");
static_assert(offsetof(FSNpcSelfRecoveryData, RecoveryRate_11_546EED0D433F61EFBE43DD9B813F44D3) == 0x000008, "Member 'FSNpcSelfRecoveryData::RecoveryRate_11_546EED0D433F61EFBE43DD9B813F44D3' has a wrong offset!");

}

