#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SPlayerAIAssistThinkData

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK
{

// UserDefinedStruct SPlayerAIAssistThinkData.SPlayerAIAssistThinkData
// 0x0014 (0x0014 - 0x0000)
struct FSPlayerAIAssistThinkData final
{
public:
	EConsumeItemID                                ItemNo_24_490E3DE94BF39B638D6DC78B40ED8CBA;        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46EE[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ConditionRate_21_806004BA4EC9246753A3239BC2F47DC4; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActionRate_15_10EF967844603F83599466B7497E91F0;    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DyingConditionRate_29_1C8AD17148C588AFA7AE0F897D556094; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DyingActionRate_30_E26DAFB248F84CD2FEFD46827E454C13; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSPlayerAIAssistThinkData) == 0x000004, "Wrong alignment on FSPlayerAIAssistThinkData");
static_assert(sizeof(FSPlayerAIAssistThinkData) == 0x000014, "Wrong size on FSPlayerAIAssistThinkData");
static_assert(offsetof(FSPlayerAIAssistThinkData, ItemNo_24_490E3DE94BF39B638D6DC78B40ED8CBA) == 0x000000, "Member 'FSPlayerAIAssistThinkData::ItemNo_24_490E3DE94BF39B638D6DC78B40ED8CBA' has a wrong offset!");
static_assert(offsetof(FSPlayerAIAssistThinkData, ConditionRate_21_806004BA4EC9246753A3239BC2F47DC4) == 0x000004, "Member 'FSPlayerAIAssistThinkData::ConditionRate_21_806004BA4EC9246753A3239BC2F47DC4' has a wrong offset!");
static_assert(offsetof(FSPlayerAIAssistThinkData, ActionRate_15_10EF967844603F83599466B7497E91F0) == 0x000008, "Member 'FSPlayerAIAssistThinkData::ActionRate_15_10EF967844603F83599466B7497E91F0' has a wrong offset!");
static_assert(offsetof(FSPlayerAIAssistThinkData, DyingConditionRate_29_1C8AD17148C588AFA7AE0F897D556094) == 0x00000C, "Member 'FSPlayerAIAssistThinkData::DyingConditionRate_29_1C8AD17148C588AFA7AE0F897D556094' has a wrong offset!");
static_assert(offsetof(FSPlayerAIAssistThinkData, DyingActionRate_30_E26DAFB248F84CD2FEFD46827E454C13) == 0x000010, "Member 'FSPlayerAIAssistThinkData::DyingActionRate_30_E26DAFB248F84CD2FEFD46827E454C13' has a wrong offset!");

}

