#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SprintComponentBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function SprintComponentBP.SprintComponentBP_C.ExecuteUbergraph_SprintComponentBP
// 0x0004 (0x0004 - 0x0000)
struct SprintComponentBP_C_ExecuteUbergraph_SprintComponentBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SprintComponentBP_C_ExecuteUbergraph_SprintComponentBP) == 0x000004, "Wrong alignment on SprintComponentBP_C_ExecuteUbergraph_SprintComponentBP");
static_assert(sizeof(SprintComponentBP_C_ExecuteUbergraph_SprintComponentBP) == 0x000004, "Wrong size on SprintComponentBP_C_ExecuteUbergraph_SprintComponentBP");
static_assert(offsetof(SprintComponentBP_C_ExecuteUbergraph_SprintComponentBP, EntryPoint) == 0x000000, "Member 'SprintComponentBP_C_ExecuteUbergraph_SprintComponentBP::EntryPoint' has a wrong offset!");

// Function SprintComponentBP.SprintComponentBP_C.InitParameter
// 0x0018 (0x0018 - 0x0000)
struct SprintComponentBP_C_InitParameter final
{
public:
	class UBP_PlayerFixParamater_C*               Param;                                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayerFixParamater_C*               CallFunc_GetPlayerFixParam_Param;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SprintComponentBP_C_InitParameter) == 0x000008, "Wrong alignment on SprintComponentBP_C_InitParameter");
static_assert(sizeof(SprintComponentBP_C_InitParameter) == 0x000018, "Wrong size on SprintComponentBP_C_InitParameter");
static_assert(offsetof(SprintComponentBP_C_InitParameter, Param) == 0x000000, "Member 'SprintComponentBP_C_InitParameter::Param' has a wrong offset!");
static_assert(offsetof(SprintComponentBP_C_InitParameter, CallFunc_GetPlayerFixParam_Param) == 0x000008, "Member 'SprintComponentBP_C_InitParameter::CallFunc_GetPlayerFixParam_Param' has a wrong offset!");
static_assert(offsetof(SprintComponentBP_C_InitParameter, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'SprintComponentBP_C_InitParameter::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

