#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SprintComponentBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SprintComponentBP.SprintComponentBP_C
// 0x0010 (0x0140 - 0x0130)
class USprintComponentBP_C final : public USprintComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0130(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         SprintCameraLength;                                // 0x0138(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpeedUpStartTime;                                  // 0x013C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SprintComponentBP(int32 EntryPoint);
	void ReceiveBeginPlay();
	void InitParameter();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SprintComponentBP_C">();
	}
	static class USprintComponentBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USprintComponentBP_C>();
	}
};
static_assert(alignof(USprintComponentBP_C) == 0x000008, "Wrong alignment on USprintComponentBP_C");
static_assert(sizeof(USprintComponentBP_C) == 0x000140, "Wrong size on USprintComponentBP_C");
static_assert(offsetof(USprintComponentBP_C, UberGraphFrame) == 0x000130, "Member 'USprintComponentBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USprintComponentBP_C, SprintCameraLength) == 0x000138, "Member 'USprintComponentBP_C::SprintCameraLength' has a wrong offset!");
static_assert(offsetof(USprintComponentBP_C, SpeedUpStartTime) == 0x00013C, "Member 'USprintComponentBP_C::SpeedUpStartTime' has a wrong offset!");

}

