#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SPsychicCaptureMaterial

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct SPsychicCaptureMaterial.SPsychicCaptureMaterial
// 0x00A0 (0x00A0 - 0x0000)
struct FSPsychicCaptureMaterial final
{
public:
	struct FLinearColor                           BaseColor_43_81175ED34D6A5799CDBF52B091089544;     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PatternColor_44_B2132BBE46886DD5227D76AD30E8E914;  // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BaseMaxPower_26_E0709CD5446C1E51930EC4ADDE50DC17;  // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BaseMinPower_27_5659AB6345FCAAD9C28DF3BA171EE32B;  // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BaseTimeRange_28_419DBF5A4DD18F65D148A690848FA0D7; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PatternDensity_29_42849F24472C8CE03152CEBCCDFAC83F; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PatternMap1Density_30_DABC08124F9BC94AD68195BF1A348385; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PatternMap1UVScaleX_31_5FA9BA724BCAE785C5FE9CA3D8C378C9; // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PatternMap1UVScaleY_32_068A66C84AE78F94F6861B9FBF3EC21D; // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PatternMap1UVSpeedX_33_89342A044AE4F15043F3BE8E4546F008; // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PatternMap1UVSpeedY_34_C89C83EB4603D44553C14981DC40C18A; // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PatternMap2ScaleX_35_CB3A2DD94436E4B1BA1989B63E45AD2E; // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PatternMap2ScaleY_36_14279C144BEABE662743E49023A0771E; // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PatternMap2UVSpeedX_37_F37451AA46B9D96A8F849EA6CC9FB3F0; // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PatternMap2UVSpeedY_38_FA382A6744D86ED0535AEAADF9F45181; // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PatternMaxPower_46_6D41D36F46B559FB998879AFBD1EDDFF; // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PatternMinPower_49_B1D235EE46490E1096517F9A8E987F7A; // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PatternScale_40_120DFE524B2EB7E625D1AD9376990A43;  // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PatternUseGreenChannel_42_90F49A7746E18F52B79F63B4AA831073; // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47B2[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           StartEmissiveColor_52_17F0294E4086FB7B54AD5A96AAA68B4E; // 0x0064(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47B3[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UCurveVector>            StartEmissiveCurve_55_7194151A4084162B11F1B0B0AB8B026D; // 0x0078(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FSPsychicCaptureMaterial) == 0x000008, "Wrong alignment on FSPsychicCaptureMaterial");
static_assert(sizeof(FSPsychicCaptureMaterial) == 0x0000A0, "Wrong size on FSPsychicCaptureMaterial");
static_assert(offsetof(FSPsychicCaptureMaterial, BaseColor_43_81175ED34D6A5799CDBF52B091089544) == 0x000000, "Member 'FSPsychicCaptureMaterial::BaseColor_43_81175ED34D6A5799CDBF52B091089544' has a wrong offset!");
static_assert(offsetof(FSPsychicCaptureMaterial, PatternColor_44_B2132BBE46886DD5227D76AD30E8E914) == 0x000010, "Member 'FSPsychicCaptureMaterial::PatternColor_44_B2132BBE46886DD5227D76AD30E8E914' has a wrong offset!");
static_assert(offsetof(FSPsychicCaptureMaterial, BaseMaxPower_26_E0709CD5446C1E51930EC4ADDE50DC17) == 0x000020, "Member 'FSPsychicCaptureMaterial::BaseMaxPower_26_E0709CD5446C1E51930EC4ADDE50DC17' has a wrong offset!");
static_assert(offsetof(FSPsychicCaptureMaterial, BaseMinPower_27_5659AB6345FCAAD9C28DF3BA171EE32B) == 0x000024, "Member 'FSPsychicCaptureMaterial::BaseMinPower_27_5659AB6345FCAAD9C28DF3BA171EE32B' has a wrong offset!");
static_assert(offsetof(FSPsychicCaptureMaterial, BaseTimeRange_28_419DBF5A4DD18F65D148A690848FA0D7) == 0x000028, "Member 'FSPsychicCaptureMaterial::BaseTimeRange_28_419DBF5A4DD18F65D148A690848FA0D7' has a wrong offset!");
static_assert(offsetof(FSPsychicCaptureMaterial, PatternDensity_29_42849F24472C8CE03152CEBCCDFAC83F) == 0x00002C, "Member 'FSPsychicCaptureMaterial::PatternDensity_29_42849F24472C8CE03152CEBCCDFAC83F' has a wrong offset!");
static_assert(offsetof(FSPsychicCaptureMaterial, PatternMap1Density_30_DABC08124F9BC94AD68195BF1A348385) == 0x000030, "Member 'FSPsychicCaptureMaterial::PatternMap1Density_30_DABC08124F9BC94AD68195BF1A348385' has a wrong offset!");
static_assert(offsetof(FSPsychicCaptureMaterial, PatternMap1UVScaleX_31_5FA9BA724BCAE785C5FE9CA3D8C378C9) == 0x000034, "Member 'FSPsychicCaptureMaterial::PatternMap1UVScaleX_31_5FA9BA724BCAE785C5FE9CA3D8C378C9' has a wrong offset!");
static_assert(offsetof(FSPsychicCaptureMaterial, PatternMap1UVScaleY_32_068A66C84AE78F94F6861B9FBF3EC21D) == 0x000038, "Member 'FSPsychicCaptureMaterial::PatternMap1UVScaleY_32_068A66C84AE78F94F6861B9FBF3EC21D' has a wrong offset!");
static_assert(offsetof(FSPsychicCaptureMaterial, PatternMap1UVSpeedX_33_89342A044AE4F15043F3BE8E4546F008) == 0x00003C, "Member 'FSPsychicCaptureMaterial::PatternMap1UVSpeedX_33_89342A044AE4F15043F3BE8E4546F008' has a wrong offset!");
static_assert(offsetof(FSPsychicCaptureMaterial, PatternMap1UVSpeedY_34_C89C83EB4603D44553C14981DC40C18A) == 0x000040, "Member 'FSPsychicCaptureMaterial::PatternMap1UVSpeedY_34_C89C83EB4603D44553C14981DC40C18A' has a wrong offset!");
static_assert(offsetof(FSPsychicCaptureMaterial, PatternMap2ScaleX_35_CB3A2DD94436E4B1BA1989B63E45AD2E) == 0x000044, "Member 'FSPsychicCaptureMaterial::PatternMap2ScaleX_35_CB3A2DD94436E4B1BA1989B63E45AD2E' has a wrong offset!");
static_assert(offsetof(FSPsychicCaptureMaterial, PatternMap2ScaleY_36_14279C144BEABE662743E49023A0771E) == 0x000048, "Member 'FSPsychicCaptureMaterial::PatternMap2ScaleY_36_14279C144BEABE662743E49023A0771E' has a wrong offset!");
static_assert(offsetof(FSPsychicCaptureMaterial, PatternMap2UVSpeedX_37_F37451AA46B9D96A8F849EA6CC9FB3F0) == 0x00004C, "Member 'FSPsychicCaptureMaterial::PatternMap2UVSpeedX_37_F37451AA46B9D96A8F849EA6CC9FB3F0' has a wrong offset!");
static_assert(offsetof(FSPsychicCaptureMaterial, PatternMap2UVSpeedY_38_FA382A6744D86ED0535AEAADF9F45181) == 0x000050, "Member 'FSPsychicCaptureMaterial::PatternMap2UVSpeedY_38_FA382A6744D86ED0535AEAADF9F45181' has a wrong offset!");
static_assert(offsetof(FSPsychicCaptureMaterial, PatternMaxPower_46_6D41D36F46B559FB998879AFBD1EDDFF) == 0x000054, "Member 'FSPsychicCaptureMaterial::PatternMaxPower_46_6D41D36F46B559FB998879AFBD1EDDFF' has a wrong offset!");
static_assert(offsetof(FSPsychicCaptureMaterial, PatternMinPower_49_B1D235EE46490E1096517F9A8E987F7A) == 0x000058, "Member 'FSPsychicCaptureMaterial::PatternMinPower_49_B1D235EE46490E1096517F9A8E987F7A' has a wrong offset!");
static_assert(offsetof(FSPsychicCaptureMaterial, PatternScale_40_120DFE524B2EB7E625D1AD9376990A43) == 0x00005C, "Member 'FSPsychicCaptureMaterial::PatternScale_40_120DFE524B2EB7E625D1AD9376990A43' has a wrong offset!");
static_assert(offsetof(FSPsychicCaptureMaterial, PatternUseGreenChannel_42_90F49A7746E18F52B79F63B4AA831073) == 0x000060, "Member 'FSPsychicCaptureMaterial::PatternUseGreenChannel_42_90F49A7746E18F52B79F63B4AA831073' has a wrong offset!");
static_assert(offsetof(FSPsychicCaptureMaterial, StartEmissiveColor_52_17F0294E4086FB7B54AD5A96AAA68B4E) == 0x000064, "Member 'FSPsychicCaptureMaterial::StartEmissiveColor_52_17F0294E4086FB7B54AD5A96AAA68B4E' has a wrong offset!");
static_assert(offsetof(FSPsychicCaptureMaterial, StartEmissiveCurve_55_7194151A4084162B11F1B0B0AB8B026D) == 0x000078, "Member 'FSPsychicCaptureMaterial::StartEmissiveCurve_55_7194151A4084162B11F1B0B0AB8B026D' has a wrong offset!");

}

