#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SStaticBGEffectParameter

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct SStaticBGEffectParameter.SStaticBGEffectParameter
// 0x001C (0x001C - 0x0000)
struct FSStaticBGEffectParameter final
{
public:
	float                                         EffectRandomTimeMinSeconds_19_13DC266C4DCECEBAF39E2D9C7D7EF7B6; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EffectRandomTimeMaxSeconds_20_28ABCB1F400A3E1E83E69E877759139F; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlockNoiseUVFlipRandomTimeMinSeconds_25_6BB853274B393643574F9FA56B52E5AF; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlockNoiseUVFlipRandomTimeMaxSeconds_26_8ADEE3904CA617184E46ED9C555C6A7F; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BlockNoiseUVFlipRandomPercentage_27_FECF20474ECA12D49CFB4AB0E8FEC373; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BlockNoiseUVFlipAwakeEffect_30_EE0F077F45695B0AAAED1BA0B6D3200D; // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4167[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BlockNoiseValueStartRandomPercentage_33_BAA66FFD418EE78FD8F0308CE9836B98; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSStaticBGEffectParameter) == 0x000004, "Wrong alignment on FSStaticBGEffectParameter");
static_assert(sizeof(FSStaticBGEffectParameter) == 0x00001C, "Wrong size on FSStaticBGEffectParameter");
static_assert(offsetof(FSStaticBGEffectParameter, EffectRandomTimeMinSeconds_19_13DC266C4DCECEBAF39E2D9C7D7EF7B6) == 0x000000, "Member 'FSStaticBGEffectParameter::EffectRandomTimeMinSeconds_19_13DC266C4DCECEBAF39E2D9C7D7EF7B6' has a wrong offset!");
static_assert(offsetof(FSStaticBGEffectParameter, EffectRandomTimeMaxSeconds_20_28ABCB1F400A3E1E83E69E877759139F) == 0x000004, "Member 'FSStaticBGEffectParameter::EffectRandomTimeMaxSeconds_20_28ABCB1F400A3E1E83E69E877759139F' has a wrong offset!");
static_assert(offsetof(FSStaticBGEffectParameter, BlockNoiseUVFlipRandomTimeMinSeconds_25_6BB853274B393643574F9FA56B52E5AF) == 0x000008, "Member 'FSStaticBGEffectParameter::BlockNoiseUVFlipRandomTimeMinSeconds_25_6BB853274B393643574F9FA56B52E5AF' has a wrong offset!");
static_assert(offsetof(FSStaticBGEffectParameter, BlockNoiseUVFlipRandomTimeMaxSeconds_26_8ADEE3904CA617184E46ED9C555C6A7F) == 0x00000C, "Member 'FSStaticBGEffectParameter::BlockNoiseUVFlipRandomTimeMaxSeconds_26_8ADEE3904CA617184E46ED9C555C6A7F' has a wrong offset!");
static_assert(offsetof(FSStaticBGEffectParameter, BlockNoiseUVFlipRandomPercentage_27_FECF20474ECA12D49CFB4AB0E8FEC373) == 0x000010, "Member 'FSStaticBGEffectParameter::BlockNoiseUVFlipRandomPercentage_27_FECF20474ECA12D49CFB4AB0E8FEC373' has a wrong offset!");
static_assert(offsetof(FSStaticBGEffectParameter, BlockNoiseUVFlipAwakeEffect_30_EE0F077F45695B0AAAED1BA0B6D3200D) == 0x000014, "Member 'FSStaticBGEffectParameter::BlockNoiseUVFlipAwakeEffect_30_EE0F077F45695B0AAAED1BA0B6D3200D' has a wrong offset!");
static_assert(offsetof(FSStaticBGEffectParameter, BlockNoiseValueStartRandomPercentage_33_BAA66FFD418EE78FD8F0308CE9836B98) == 0x000018, "Member 'FSStaticBGEffectParameter::BlockNoiseValueStartRandomPercentage_33_BAA66FFD418EE78FD8F0308CE9836B98' has a wrong offset!");

}

