#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_em_ChangeRateParam

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_em_ChangeRateParam.ST_em_ChangeRateParam
// 0x0014 (0x0014 - 0x0000)
struct FST_em_ChangeRateParam final
{
public:
	float                                         StartPlayRate_2_7837F22E46B89587D783C0B9CF64A149;  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LearpTime_4_AB9B816A481A038F54E814BE971D8134;      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEasingFunc                                   EaseFunc_9_747328864AFF88F87B1B1A88FA9E2C2F;       // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C6[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EaseBlendExp_10_1B7B416C4ECA831407B2689FD77AAAF3;  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Steps_13_1D08E7374DD6D2E18FE799B72755F8BA;         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_em_ChangeRateParam) == 0x000004, "Wrong alignment on FST_em_ChangeRateParam");
static_assert(sizeof(FST_em_ChangeRateParam) == 0x000014, "Wrong size on FST_em_ChangeRateParam");
static_assert(offsetof(FST_em_ChangeRateParam, StartPlayRate_2_7837F22E46B89587D783C0B9CF64A149) == 0x000000, "Member 'FST_em_ChangeRateParam::StartPlayRate_2_7837F22E46B89587D783C0B9CF64A149' has a wrong offset!");
static_assert(offsetof(FST_em_ChangeRateParam, LearpTime_4_AB9B816A481A038F54E814BE971D8134) == 0x000004, "Member 'FST_em_ChangeRateParam::LearpTime_4_AB9B816A481A038F54E814BE971D8134' has a wrong offset!");
static_assert(offsetof(FST_em_ChangeRateParam, EaseFunc_9_747328864AFF88F87B1B1A88FA9E2C2F) == 0x000008, "Member 'FST_em_ChangeRateParam::EaseFunc_9_747328864AFF88F87B1B1A88FA9E2C2F' has a wrong offset!");
static_assert(offsetof(FST_em_ChangeRateParam, EaseBlendExp_10_1B7B416C4ECA831407B2689FD77AAAF3) == 0x00000C, "Member 'FST_em_ChangeRateParam::EaseBlendExp_10_1B7B416C4ECA831407B2689FD77AAAF3' has a wrong offset!");
static_assert(offsetof(FST_em_ChangeRateParam, Steps_13_1D08E7374DD6D2E18FE799B72755F8BA) == 0x000010, "Member 'FST_em_ChangeRateParam::Steps_13_1D08E7374DD6D2E18FE799B72755F8BA' has a wrong offset!");

}

