#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_emWeakMaterial

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ST_emWeakMaterial.ST_emWeakMaterial
// 0x0020 (0x0020 - 0x0000)
struct FST_emWeakMaterial final
{
public:
	class FString                                 MaterialEmissiveName_29_4863A8CF4264C15D1BE8B3B653133E08; // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	float                                         Timer_30_AD8D866E4D09F4D01FF67693320EAD87;         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnd_32_F75E07844C9EA95B164F27B2E54869E0;          // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1125[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EndTimer_35_5BAB46744BF1C5BE7E62519A9D1A9781;      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_emWeakMaterial) == 0x000008, "Wrong alignment on FST_emWeakMaterial");
static_assert(sizeof(FST_emWeakMaterial) == 0x000020, "Wrong size on FST_emWeakMaterial");
static_assert(offsetof(FST_emWeakMaterial, MaterialEmissiveName_29_4863A8CF4264C15D1BE8B3B653133E08) == 0x000000, "Member 'FST_emWeakMaterial::MaterialEmissiveName_29_4863A8CF4264C15D1BE8B3B653133E08' has a wrong offset!");
static_assert(offsetof(FST_emWeakMaterial, Timer_30_AD8D866E4D09F4D01FF67693320EAD87) == 0x000010, "Member 'FST_emWeakMaterial::Timer_30_AD8D866E4D09F4D01FF67693320EAD87' has a wrong offset!");
static_assert(offsetof(FST_emWeakMaterial, bEnd_32_F75E07844C9EA95B164F27B2E54869E0) == 0x000014, "Member 'FST_emWeakMaterial::bEnd_32_F75E07844C9EA95B164F27B2E54869E0' has a wrong offset!");
static_assert(offsetof(FST_emWeakMaterial, EndTimer_35_5BAB46744BF1C5BE7E62519A9D1A9781) == 0x000018, "Member 'FST_emWeakMaterial::EndTimer_35_5BAB46744BF1C5BE7E62519A9D1A9781' has a wrong offset!");

}

