#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_emEnableWeakData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ST_emEnableWeakData.ST_emEnableWeakData
// 0x0040 (0x0040 - 0x0000)
struct FST_emEnableWeakData final
{
public:
	TArray<class FString>                         WeakNameList_25_4863A8CF4264C15D1BE8B3B653133E08;  // 0x0000(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class FString>                         DummyWeakNameList_27_14C02BF544851601DFA81D9FBCB7F2F7; // 0x0010(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	float                                         EnableTime_14_AD8D866E4D09F4D01FF67693320EAD87;    // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bStartEnableWeak_7_94E47D6C4164FF24C3E9138548661E82; // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42D6[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 WeakSlotName_23_24022918494D386D534C71A06ABA220F;  // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          DispAroundEffectWhenInactive_29_26D603374C37095A9A99999EA09EC7FE; // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FST_emEnableWeakData) == 0x000008, "Wrong alignment on FST_emEnableWeakData");
static_assert(sizeof(FST_emEnableWeakData) == 0x000040, "Wrong size on FST_emEnableWeakData");
static_assert(offsetof(FST_emEnableWeakData, WeakNameList_25_4863A8CF4264C15D1BE8B3B653133E08) == 0x000000, "Member 'FST_emEnableWeakData::WeakNameList_25_4863A8CF4264C15D1BE8B3B653133E08' has a wrong offset!");
static_assert(offsetof(FST_emEnableWeakData, DummyWeakNameList_27_14C02BF544851601DFA81D9FBCB7F2F7) == 0x000010, "Member 'FST_emEnableWeakData::DummyWeakNameList_27_14C02BF544851601DFA81D9FBCB7F2F7' has a wrong offset!");
static_assert(offsetof(FST_emEnableWeakData, EnableTime_14_AD8D866E4D09F4D01FF67693320EAD87) == 0x000020, "Member 'FST_emEnableWeakData::EnableTime_14_AD8D866E4D09F4D01FF67693320EAD87' has a wrong offset!");
static_assert(offsetof(FST_emEnableWeakData, bStartEnableWeak_7_94E47D6C4164FF24C3E9138548661E82) == 0x000024, "Member 'FST_emEnableWeakData::bStartEnableWeak_7_94E47D6C4164FF24C3E9138548661E82' has a wrong offset!");
static_assert(offsetof(FST_emEnableWeakData, WeakSlotName_23_24022918494D386D534C71A06ABA220F) == 0x000028, "Member 'FST_emEnableWeakData::WeakSlotName_23_24022918494D386D534C71A06ABA220F' has a wrong offset!");
static_assert(offsetof(FST_emEnableWeakData, DispAroundEffectWhenInactive_29_26D603374C37095A9A99999EA09EC7FE) == 0x000038, "Member 'FST_emEnableWeakData::DispAroundEffectWhenInactive_29_26D603374C37095A9A99999EA09EC7FE' has a wrong offset!");

}

