#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_em8220_CableInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_em8220_CableInfo.ST_em8220_CableInfo
// 0x0080 (0x0080 - 0x0000)
struct FST_em8220_CableInfo final
{
public:
	int32                                         CableIndex_24_6300709B44EAC94EADC995BDB60E074F;    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttachSocketName_2_10664FBB412A937D07950E8BDD6875FD; // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45EA[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimMontage>            CableAnimation_27_BFC9261D45D8227F1FF0D5A9C5B03207; // 0x0010(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	uint8                                         Pad_45EB[0x8];                                     // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             OffsetTransform_12_778459394F90B3AA99EBB7BFF1FE884F; // 0x0040(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	float                                         BeginDispTime_25_3EEC7CCB4D747FC89A29899A36EDA430; // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndDispTime_26_2D81167D44F75FB429EDF0B73F024BCA;   // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_em8220_CableInfo) == 0x000010, "Wrong alignment on FST_em8220_CableInfo");
static_assert(sizeof(FST_em8220_CableInfo) == 0x000080, "Wrong size on FST_em8220_CableInfo");
static_assert(offsetof(FST_em8220_CableInfo, CableIndex_24_6300709B44EAC94EADC995BDB60E074F) == 0x000000, "Member 'FST_em8220_CableInfo::CableIndex_24_6300709B44EAC94EADC995BDB60E074F' has a wrong offset!");
static_assert(offsetof(FST_em8220_CableInfo, AttachSocketName_2_10664FBB412A937D07950E8BDD6875FD) == 0x000004, "Member 'FST_em8220_CableInfo::AttachSocketName_2_10664FBB412A937D07950E8BDD6875FD' has a wrong offset!");
static_assert(offsetof(FST_em8220_CableInfo, CableAnimation_27_BFC9261D45D8227F1FF0D5A9C5B03207) == 0x000010, "Member 'FST_em8220_CableInfo::CableAnimation_27_BFC9261D45D8227F1FF0D5A9C5B03207' has a wrong offset!");
static_assert(offsetof(FST_em8220_CableInfo, OffsetTransform_12_778459394F90B3AA99EBB7BFF1FE884F) == 0x000040, "Member 'FST_em8220_CableInfo::OffsetTransform_12_778459394F90B3AA99EBB7BFF1FE884F' has a wrong offset!");
static_assert(offsetof(FST_em8220_CableInfo, BeginDispTime_25_3EEC7CCB4D747FC89A29899A36EDA430) == 0x000070, "Member 'FST_em8220_CableInfo::BeginDispTime_25_3EEC7CCB4D747FC89A29899A36EDA430' has a wrong offset!");
static_assert(offsetof(FST_em8220_CableInfo, EndDispTime_26_2D81167D44F75FB429EDF0B73F024BCA) == 0x000074, "Member 'FST_em8220_CableInfo::EndDispTime_26_2D81167D44F75FB429EDF0B73F024BCA' has a wrong offset!");

}

