#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_ShowDestinationActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FScenarioFlagCheckData_structs.hpp"
#include "EEventEnableCheckType_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_ShowDestinationActor.ST_ShowDestinationActor
// 0x0048 (0x0048 - 0x0000)
struct FST_ShowDestinationActor final
{
public:
	class FString                                 Location_47_7D738CCB4D0F7749A2D01DB62356744E;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Area_48_19D203044A7BB54B72283B8E8B26BA33;          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                Position_6_E3F1C50D4F74BC005AF061AEBE8F5218;       // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEventEnableCheckType                         CheckType_50_12927793414C7F048301699ABCC9063F;     // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5467[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ProgressID_27_24F2998845B4F349D02E70A14B5B33C8;    // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UpperLimitProgressID_36_07374F8D4B7D453F4FA230B53889DD70; // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFScenarioFlagCheckData>        CheckScenarioFlagList_37_3E1516EC4C1D76390E9AFF880CA23285; // 0x0038(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FST_ShowDestinationActor) == 0x000008, "Wrong alignment on FST_ShowDestinationActor");
static_assert(sizeof(FST_ShowDestinationActor) == 0x000048, "Wrong size on FST_ShowDestinationActor");
static_assert(offsetof(FST_ShowDestinationActor, Location_47_7D738CCB4D0F7749A2D01DB62356744E) == 0x000000, "Member 'FST_ShowDestinationActor::Location_47_7D738CCB4D0F7749A2D01DB62356744E' has a wrong offset!");
static_assert(offsetof(FST_ShowDestinationActor, Area_48_19D203044A7BB54B72283B8E8B26BA33) == 0x000010, "Member 'FST_ShowDestinationActor::Area_48_19D203044A7BB54B72283B8E8B26BA33' has a wrong offset!");
static_assert(offsetof(FST_ShowDestinationActor, Position_6_E3F1C50D4F74BC005AF061AEBE8F5218) == 0x000020, "Member 'FST_ShowDestinationActor::Position_6_E3F1C50D4F74BC005AF061AEBE8F5218' has a wrong offset!");
static_assert(offsetof(FST_ShowDestinationActor, CheckType_50_12927793414C7F048301699ABCC9063F) == 0x00002C, "Member 'FST_ShowDestinationActor::CheckType_50_12927793414C7F048301699ABCC9063F' has a wrong offset!");
static_assert(offsetof(FST_ShowDestinationActor, ProgressID_27_24F2998845B4F349D02E70A14B5B33C8) == 0x000030, "Member 'FST_ShowDestinationActor::ProgressID_27_24F2998845B4F349D02E70A14B5B33C8' has a wrong offset!");
static_assert(offsetof(FST_ShowDestinationActor, UpperLimitProgressID_36_07374F8D4B7D453F4FA230B53889DD70) == 0x000034, "Member 'FST_ShowDestinationActor::UpperLimitProgressID_36_07374F8D4B7D453F4FA230B53889DD70' has a wrong offset!");
static_assert(offsetof(FST_ShowDestinationActor, CheckScenarioFlagList_37_3E1516EC4C1D76390E9AFF880CA23285) == 0x000038, "Member 'FST_ShowDestinationActor::CheckScenarioFlagList_37_3E1516EC4C1D76390E9AFF880CA23285' has a wrong offset!");

}

