#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StealthWeakComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "StealthWeakData_structs.hpp"


namespace SDK::Params
{

// Function StealthWeakComponent.StealthWeakComponent_C.ExecuteUbergraph_StealthWeakComponent
// 0x0020 (0x0020 - 0x0000)
struct StealthWeakComponent_C_ExecuteUbergraph_StealthWeakComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6232[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattleEnemy_C*                       K2Node_DynamicCast_AsRSBattle_Enemy;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StealthWeakComponent_C_ExecuteUbergraph_StealthWeakComponent) == 0x000008, "Wrong alignment on StealthWeakComponent_C_ExecuteUbergraph_StealthWeakComponent");
static_assert(sizeof(StealthWeakComponent_C_ExecuteUbergraph_StealthWeakComponent) == 0x000020, "Wrong size on StealthWeakComponent_C_ExecuteUbergraph_StealthWeakComponent");
static_assert(offsetof(StealthWeakComponent_C_ExecuteUbergraph_StealthWeakComponent, EntryPoint) == 0x000000, "Member 'StealthWeakComponent_C_ExecuteUbergraph_StealthWeakComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_ExecuteUbergraph_StealthWeakComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'StealthWeakComponent_C_ExecuteUbergraph_StealthWeakComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_ExecuteUbergraph_StealthWeakComponent, K2Node_DynamicCast_AsRSBattle_Enemy) == 0x000010, "Member 'StealthWeakComponent_C_ExecuteUbergraph_StealthWeakComponent::K2Node_DynamicCast_AsRSBattle_Enemy' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_ExecuteUbergraph_StealthWeakComponent, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'StealthWeakComponent_C_ExecuteUbergraph_StealthWeakComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_ExecuteUbergraph_StealthWeakComponent, K2Node_Event_EndPlayReason) == 0x000019, "Member 'StealthWeakComponent_C_ExecuteUbergraph_StealthWeakComponent::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function StealthWeakComponent.StealthWeakComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct StealthWeakComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StealthWeakComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on StealthWeakComponent_C_ReceiveEndPlay");
static_assert(sizeof(StealthWeakComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on StealthWeakComponent_C_ReceiveEndPlay");
static_assert(offsetof(StealthWeakComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'StealthWeakComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function StealthWeakComponent.StealthWeakComponent_C.CreateParticle
// 0x00C0 (0x00C0 - 0x0000)
struct StealthWeakComponent_C_CreateParticle final
{
public:
	class UParticleSystem*                        L_particle;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSeeThroughStencil_Stencil;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAcceleratorStencil_Stencil;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Or_IntInt_ReturnValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6233[0x1];                                     // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStealthWeakData                       CallFunc_Array_Get_Item;                           // 0x0028(0x0068)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6234[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadSoftObject_ReturnValue;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6235[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Or_IntInt_ReturnValue_1;                  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StealthWeakComponent_C_CreateParticle) == 0x000008, "Wrong alignment on StealthWeakComponent_C_CreateParticle");
static_assert(sizeof(StealthWeakComponent_C_CreateParticle) == 0x0000C0, "Wrong size on StealthWeakComponent_C_CreateParticle");
static_assert(offsetof(StealthWeakComponent_C_CreateParticle, L_particle) == 0x000000, "Member 'StealthWeakComponent_C_CreateParticle::L_particle' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_CreateParticle, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'StealthWeakComponent_C_CreateParticle::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_CreateParticle, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'StealthWeakComponent_C_CreateParticle::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_CreateParticle, Temp_int_Array_Index_Variable) == 0x000010, "Member 'StealthWeakComponent_C_CreateParticle::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_CreateParticle, CallFunc_GetSeeThroughStencil_Stencil) == 0x000014, "Member 'StealthWeakComponent_C_CreateParticle::CallFunc_GetSeeThroughStencil_Stencil' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_CreateParticle, CallFunc_GetAcceleratorStencil_Stencil) == 0x000018, "Member 'StealthWeakComponent_C_CreateParticle::CallFunc_GetAcceleratorStencil_Stencil' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_CreateParticle, CallFunc_Or_IntInt_ReturnValue) == 0x00001C, "Member 'StealthWeakComponent_C_CreateParticle::CallFunc_Or_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_CreateParticle, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'StealthWeakComponent_C_CreateParticle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_CreateParticle, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'StealthWeakComponent_C_CreateParticle::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_CreateParticle, CallFunc_IsValid_ReturnValue_2) == 0x000022, "Member 'StealthWeakComponent_C_CreateParticle::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_CreateParticle, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'StealthWeakComponent_C_CreateParticle::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_CreateParticle, CallFunc_Array_Get_Item) == 0x000028, "Member 'StealthWeakComponent_C_CreateParticle::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_CreateParticle, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'StealthWeakComponent_C_CreateParticle::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_CreateParticle, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000098, "Member 'StealthWeakComponent_C_CreateParticle::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_CreateParticle, CallFunc_LoadSoftObject_ReturnValue) == 0x0000A0, "Member 'StealthWeakComponent_C_CreateParticle::CallFunc_LoadSoftObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_CreateParticle, K2Node_DynamicCast_AsParticle_System) == 0x0000A8, "Member 'StealthWeakComponent_C_CreateParticle::K2Node_DynamicCast_AsParticle_System' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_CreateParticle, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'StealthWeakComponent_C_CreateParticle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_CreateParticle, CallFunc_Or_IntInt_ReturnValue_1) == 0x0000B4, "Member 'StealthWeakComponent_C_CreateParticle::CallFunc_Or_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_CreateParticle, CallFunc_Array_Add_ReturnValue) == 0x0000B8, "Member 'StealthWeakComponent_C_CreateParticle::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function StealthWeakComponent.StealthWeakComponent_C.EndParticle
// 0x0020 (0x0020 - 0x0000)
struct StealthWeakComponent_C_EndParticle final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6236[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URSParticleSystemComponentBase*         CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StealthWeakComponent_C_EndParticle) == 0x000008, "Wrong alignment on StealthWeakComponent_C_EndParticle");
static_assert(sizeof(StealthWeakComponent_C_EndParticle) == 0x000020, "Wrong size on StealthWeakComponent_C_EndParticle");
static_assert(offsetof(StealthWeakComponent_C_EndParticle, Temp_int_Array_Index_Variable) == 0x000000, "Member 'StealthWeakComponent_C_EndParticle::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_EndParticle, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'StealthWeakComponent_C_EndParticle::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_EndParticle, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'StealthWeakComponent_C_EndParticle::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_EndParticle, CallFunc_Array_Get_Item) == 0x000010, "Member 'StealthWeakComponent_C_EndParticle::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_EndParticle, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'StealthWeakComponent_C_EndParticle::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_EndParticle, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'StealthWeakComponent_C_EndParticle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(StealthWeakComponent_C_EndParticle, CallFunc_Less_IntInt_ReturnValue) == 0x00001D, "Member 'StealthWeakComponent_C_EndParticle::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

