#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_ui_brainmap_info

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "Enum_ui_skill_type_structs.hpp"


namespace SDK
{

// UserDefinedStruct struct_ui_brainmap_info.struct_ui_brainmap_info
// 0x0030 (0x0030 - 0x0000)
struct FStruct_ui_brainmap_info final
{
public:
	EPlayerSkill                                  SkillID_2_2C76D6084103302E2A73CDBBF2A6FC9E;        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_ui_skill_type                            SkillType_20_9800A3DD44BAF33F4703CA81F9797D69;     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DBC[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StartIndex_5_3D9CB31645129A35E0F704BF2098F419;     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ConnectNum_12_A2C2864843666A7D1497D4A1A420556A;    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DBD[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 ConnectSkillIndexList_16_36D795474081BF2D4ADBD0A6805DB58D; // 0x0010(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<int32>                                 ConnectLineIndexList_17_0183621643D8B759D209AAAEF638E3EC; // 0x0020(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_ui_brainmap_info) == 0x000008, "Wrong alignment on FStruct_ui_brainmap_info");
static_assert(sizeof(FStruct_ui_brainmap_info) == 0x000030, "Wrong size on FStruct_ui_brainmap_info");
static_assert(offsetof(FStruct_ui_brainmap_info, SkillID_2_2C76D6084103302E2A73CDBBF2A6FC9E) == 0x000000, "Member 'FStruct_ui_brainmap_info::SkillID_2_2C76D6084103302E2A73CDBBF2A6FC9E' has a wrong offset!");
static_assert(offsetof(FStruct_ui_brainmap_info, SkillType_20_9800A3DD44BAF33F4703CA81F9797D69) == 0x000001, "Member 'FStruct_ui_brainmap_info::SkillType_20_9800A3DD44BAF33F4703CA81F9797D69' has a wrong offset!");
static_assert(offsetof(FStruct_ui_brainmap_info, StartIndex_5_3D9CB31645129A35E0F704BF2098F419) == 0x000004, "Member 'FStruct_ui_brainmap_info::StartIndex_5_3D9CB31645129A35E0F704BF2098F419' has a wrong offset!");
static_assert(offsetof(FStruct_ui_brainmap_info, ConnectNum_12_A2C2864843666A7D1497D4A1A420556A) == 0x000008, "Member 'FStruct_ui_brainmap_info::ConnectNum_12_A2C2864843666A7D1497D4A1A420556A' has a wrong offset!");
static_assert(offsetof(FStruct_ui_brainmap_info, ConnectSkillIndexList_16_36D795474081BF2D4ADBD0A6805DB58D) == 0x000010, "Member 'FStruct_ui_brainmap_info::ConnectSkillIndexList_16_36D795474081BF2D4ADBD0A6805DB58D' has a wrong offset!");
static_assert(offsetof(FStruct_ui_brainmap_info, ConnectLineIndexList_17_0183621643D8B759D209AAAEF638E3EC) == 0x000020, "Member 'FStruct_ui_brainmap_info::ConnectLineIndexList_17_0183621643D8B759D209AAAEF638E3EC' has a wrong offset!");

}

