#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_EnemyDeadLogParam

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct struct_EnemyDeadLogParam.struct_EnemyDeadLogParam
// 0x0020 (0x0020 - 0x0000)
struct FStruct_EnemyDeadLogParam final
{
public:
	class FName                                   CharacterID_10_E27646FD466C5237B80FE897B20FACD6;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Experience_6_6A6A3C2B41F6C3F808247D8F8EB01DFC;     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Money_8_4D411A6A4EB2EAC039339B922AE90084;          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CrushBonus_13_9B2C105C4342A95C7A610FB7B74B5E18;    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DropItemID_16_06446DF04A20EB4FBB4601AED8D808DF;    // 0x0014(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DropItemNum_19_D010B02944F724A3EACE17BFCD1F95E5;   // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_EnemyDeadLogParam) == 0x000004, "Wrong alignment on FStruct_EnemyDeadLogParam");
static_assert(sizeof(FStruct_EnemyDeadLogParam) == 0x000020, "Wrong size on FStruct_EnemyDeadLogParam");
static_assert(offsetof(FStruct_EnemyDeadLogParam, CharacterID_10_E27646FD466C5237B80FE897B20FACD6) == 0x000000, "Member 'FStruct_EnemyDeadLogParam::CharacterID_10_E27646FD466C5237B80FE897B20FACD6' has a wrong offset!");
static_assert(offsetof(FStruct_EnemyDeadLogParam, Experience_6_6A6A3C2B41F6C3F808247D8F8EB01DFC) == 0x000008, "Member 'FStruct_EnemyDeadLogParam::Experience_6_6A6A3C2B41F6C3F808247D8F8EB01DFC' has a wrong offset!");
static_assert(offsetof(FStruct_EnemyDeadLogParam, Money_8_4D411A6A4EB2EAC039339B922AE90084) == 0x00000C, "Member 'FStruct_EnemyDeadLogParam::Money_8_4D411A6A4EB2EAC039339B922AE90084' has a wrong offset!");
static_assert(offsetof(FStruct_EnemyDeadLogParam, CrushBonus_13_9B2C105C4342A95C7A610FB7B74B5E18) == 0x000010, "Member 'FStruct_EnemyDeadLogParam::CrushBonus_13_9B2C105C4342A95C7A610FB7B74B5E18' has a wrong offset!");
static_assert(offsetof(FStruct_EnemyDeadLogParam, DropItemID_16_06446DF04A20EB4FBB4601AED8D808DF) == 0x000014, "Member 'FStruct_EnemyDeadLogParam::DropItemID_16_06446DF04A20EB4FBB4601AED8D808DF' has a wrong offset!");
static_assert(offsetof(FStruct_EnemyDeadLogParam, DropItemNum_19_D010B02944F724A3EACE17BFCD1F95E5) == 0x00001C, "Member 'FStruct_EnemyDeadLogParam::DropItemNum_19_D010B02944F724A3EACE17BFCD1F95E5' has a wrong offset!");

}

