#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_ui_brainmes_work

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct struct_ui_brainmes_work.struct_ui_brainmes_work
// 0x000C (0x000C - 0x0000)
struct FStruct_ui_brainmes_work final
{
public:
	int32                                         ThreadIndex_12_3CEC85F047F296BB3CE0CB817A0F4A7B;   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MessageNum_3_08072BC44D0234C4819ADA85FAA996BD;     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsReply_4_07A7DBA548C427A8A2CB328A63794E83;        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsStartBondEpisode_7_3B8E10284C160EDDB572ACB0B5FFE44E; // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsEnableReply_9_1D00D02E4638AD849387FCAF079E0744;  // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FStruct_ui_brainmes_work) == 0x000004, "Wrong alignment on FStruct_ui_brainmes_work");
static_assert(sizeof(FStruct_ui_brainmes_work) == 0x00000C, "Wrong size on FStruct_ui_brainmes_work");
static_assert(offsetof(FStruct_ui_brainmes_work, ThreadIndex_12_3CEC85F047F296BB3CE0CB817A0F4A7B) == 0x000000, "Member 'FStruct_ui_brainmes_work::ThreadIndex_12_3CEC85F047F296BB3CE0CB817A0F4A7B' has a wrong offset!");
static_assert(offsetof(FStruct_ui_brainmes_work, MessageNum_3_08072BC44D0234C4819ADA85FAA996BD) == 0x000004, "Member 'FStruct_ui_brainmes_work::MessageNum_3_08072BC44D0234C4819ADA85FAA996BD' has a wrong offset!");
static_assert(offsetof(FStruct_ui_brainmes_work, IsReply_4_07A7DBA548C427A8A2CB328A63794E83) == 0x000008, "Member 'FStruct_ui_brainmes_work::IsReply_4_07A7DBA548C427A8A2CB328A63794E83' has a wrong offset!");
static_assert(offsetof(FStruct_ui_brainmes_work, IsStartBondEpisode_7_3B8E10284C160EDDB572ACB0B5FFE44E) == 0x000009, "Member 'FStruct_ui_brainmes_work::IsStartBondEpisode_7_3B8E10284C160EDDB572ACB0B5FFE44E' has a wrong offset!");
static_assert(offsetof(FStruct_ui_brainmes_work, IsEnableReply_9_1D00D02E4638AD849387FCAF079E0744) == 0x00000A, "Member 'FStruct_ui_brainmes_work::IsEnableReply_9_1D00D02E4638AD849387FCAF079E0744' has a wrong offset!");

}

