#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_work_caption

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct struct_work_caption.struct_work_caption
// 0x0098 (0x0098 - 0x0000)
struct FStruct_work_caption final
{
public:
	bool                                          IsChoice_1_75425DEB493591DABC26B59B7F05523C;       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39DF[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ChoiceNum_39_BD8ACCF644DD0F3040DF0B8BFD0EAFB6;     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DefaultChoiceIndex_19_6FF68CD044630ABE8ABB888FDD6BAC90; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CancelChoiceIndex_53_EA2DC0B84224EE0BFD0251AEDAB0B770; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Talker_16_DDBF51D64FF38B00FD7E479468E37A03;        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Message_0_7_8064631045EC8036CC7537A573CBD84C;      // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Message_1_6_C1D10F2F4C748F61D96E2C91D9D43B33;      // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Message_2_42_161BA36E41135DEE373002AC025C430F;     // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Message_3_44_AD0A41804DE90770BAD5C2A845A9FB57;     // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Message_4_49_6FEB84CE4FE541B35AC321A044F193D9;     // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         WindowType_35_489B14534EA919DE9E1DB08369A2ED58;    // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DrawSecond_13_F48E671041163B068FB841A0AC4E1B59;    // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlagEnableSkip_30_E6D1180B4A370743CBBE9584A4EE52FA; // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39E0[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAtomComponentBase*                   Voice_36_EDCB08FB4AA6A321312AAEA7A8142B7E;         // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSkipVoiceEnd_32_27B6AFA64971B37247E72CB582365C2C; // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39E1[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Result_10_DD0F506F4BEC5F33A2631288FF24247C;        // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMessageWithVoice_46_7AE3EA554FC0B4746B368490DD8806DE; // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsWaitMode_55_8BD388C249EA0997B69246AD6B9DC981;    // 0x0091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FStruct_work_caption) == 0x000008, "Wrong alignment on FStruct_work_caption");
static_assert(sizeof(FStruct_work_caption) == 0x000098, "Wrong size on FStruct_work_caption");
static_assert(offsetof(FStruct_work_caption, IsChoice_1_75425DEB493591DABC26B59B7F05523C) == 0x000000, "Member 'FStruct_work_caption::IsChoice_1_75425DEB493591DABC26B59B7F05523C' has a wrong offset!");
static_assert(offsetof(FStruct_work_caption, ChoiceNum_39_BD8ACCF644DD0F3040DF0B8BFD0EAFB6) == 0x000004, "Member 'FStruct_work_caption::ChoiceNum_39_BD8ACCF644DD0F3040DF0B8BFD0EAFB6' has a wrong offset!");
static_assert(offsetof(FStruct_work_caption, DefaultChoiceIndex_19_6FF68CD044630ABE8ABB888FDD6BAC90) == 0x000008, "Member 'FStruct_work_caption::DefaultChoiceIndex_19_6FF68CD044630ABE8ABB888FDD6BAC90' has a wrong offset!");
static_assert(offsetof(FStruct_work_caption, CancelChoiceIndex_53_EA2DC0B84224EE0BFD0251AEDAB0B770) == 0x00000C, "Member 'FStruct_work_caption::CancelChoiceIndex_53_EA2DC0B84224EE0BFD0251AEDAB0B770' has a wrong offset!");
static_assert(offsetof(FStruct_work_caption, Talker_16_DDBF51D64FF38B00FD7E479468E37A03) == 0x000010, "Member 'FStruct_work_caption::Talker_16_DDBF51D64FF38B00FD7E479468E37A03' has a wrong offset!");
static_assert(offsetof(FStruct_work_caption, Message_0_7_8064631045EC8036CC7537A573CBD84C) == 0x000020, "Member 'FStruct_work_caption::Message_0_7_8064631045EC8036CC7537A573CBD84C' has a wrong offset!");
static_assert(offsetof(FStruct_work_caption, Message_1_6_C1D10F2F4C748F61D96E2C91D9D43B33) == 0x000030, "Member 'FStruct_work_caption::Message_1_6_C1D10F2F4C748F61D96E2C91D9D43B33' has a wrong offset!");
static_assert(offsetof(FStruct_work_caption, Message_2_42_161BA36E41135DEE373002AC025C430F) == 0x000040, "Member 'FStruct_work_caption::Message_2_42_161BA36E41135DEE373002AC025C430F' has a wrong offset!");
static_assert(offsetof(FStruct_work_caption, Message_3_44_AD0A41804DE90770BAD5C2A845A9FB57) == 0x000050, "Member 'FStruct_work_caption::Message_3_44_AD0A41804DE90770BAD5C2A845A9FB57' has a wrong offset!");
static_assert(offsetof(FStruct_work_caption, Message_4_49_6FEB84CE4FE541B35AC321A044F193D9) == 0x000060, "Member 'FStruct_work_caption::Message_4_49_6FEB84CE4FE541B35AC321A044F193D9' has a wrong offset!");
static_assert(offsetof(FStruct_work_caption, WindowType_35_489B14534EA919DE9E1DB08369A2ED58) == 0x000070, "Member 'FStruct_work_caption::WindowType_35_489B14534EA919DE9E1DB08369A2ED58' has a wrong offset!");
static_assert(offsetof(FStruct_work_caption, DrawSecond_13_F48E671041163B068FB841A0AC4E1B59) == 0x000074, "Member 'FStruct_work_caption::DrawSecond_13_F48E671041163B068FB841A0AC4E1B59' has a wrong offset!");
static_assert(offsetof(FStruct_work_caption, FlagEnableSkip_30_E6D1180B4A370743CBBE9584A4EE52FA) == 0x000078, "Member 'FStruct_work_caption::FlagEnableSkip_30_E6D1180B4A370743CBBE9584A4EE52FA' has a wrong offset!");
static_assert(offsetof(FStruct_work_caption, Voice_36_EDCB08FB4AA6A321312AAEA7A8142B7E) == 0x000080, "Member 'FStruct_work_caption::Voice_36_EDCB08FB4AA6A321312AAEA7A8142B7E' has a wrong offset!");
static_assert(offsetof(FStruct_work_caption, IsSkipVoiceEnd_32_27B6AFA64971B37247E72CB582365C2C) == 0x000088, "Member 'FStruct_work_caption::IsSkipVoiceEnd_32_27B6AFA64971B37247E72CB582365C2C' has a wrong offset!");
static_assert(offsetof(FStruct_work_caption, Result_10_DD0F506F4BEC5F33A2631288FF24247C) == 0x00008C, "Member 'FStruct_work_caption::Result_10_DD0F506F4BEC5F33A2631288FF24247C' has a wrong offset!");
static_assert(offsetof(FStruct_work_caption, IsMessageWithVoice_46_7AE3EA554FC0B4746B368490DD8806DE) == 0x000090, "Member 'FStruct_work_caption::IsMessageWithVoice_46_7AE3EA554FC0B4746B368490DD8806DE' has a wrong offset!");
static_assert(offsetof(FStruct_work_caption, IsWaitMode_55_8BD388C249EA0997B69246AD6B9DC981) == 0x000091, "Member 'FStruct_work_caption::IsWaitMode_55_8BD388C249EA0997B69246AD6B9DC981' has a wrong offset!");

}

