#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_ui_equip_item_list

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK
{

// UserDefinedStruct struct_ui_equip_item_list.struct_ui_equip_item_list
// 0x0040 (0x0040 - 0x0000)
struct FStruct_ui_equip_item_list final
{
public:
	class FName                                   ID_2_C827FA294CF1DF70346D368BDED759E3;             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_20_EC8EBFFF4E0CC9DBF6F8B6997AB75DB5;         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentNum_5_E611C53D4A9E61D42D254EB1CA31C9F2;     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxNum_7_4C584AAF4681F54976FEEFB30649036D;         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNew_9_778EB6E44C508EAE9FE478B4846A0DB1;          // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemRarity                                   Rarity_12_EEB271D149175F4588CD3DA3C5FAED77;        // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEquip_17_24B7C59B4870DA320167BB8D9ADCD385;       // 0x0016(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50A9[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IDNumber_23_223996854A2CCB71C9BFEDA6C6A82364;      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50AA[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ItemNameString_34_6D0B71C24414191E00E6CDA0B8E7BD7A; // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         AttackPoint_33_8BF5BA0348C51F0E00D9BABE7627AEE1;   // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastAcquisitionTime_42_A1D2B52F499432B4D429458CEFE34ED5; // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnable_44_CE651A1444E3C4C5F33F04849D4ABA7C;      // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsUseSkin_46_EA6EC5AC45364CFFF0D1EEB80E5AD040;     // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FStruct_ui_equip_item_list) == 0x000008, "Wrong alignment on FStruct_ui_equip_item_list");
static_assert(sizeof(FStruct_ui_equip_item_list) == 0x000040, "Wrong size on FStruct_ui_equip_item_list");
static_assert(offsetof(FStruct_ui_equip_item_list, ID_2_C827FA294CF1DF70346D368BDED759E3) == 0x000000, "Member 'FStruct_ui_equip_item_list::ID_2_C827FA294CF1DF70346D368BDED759E3' has a wrong offset!");
static_assert(offsetof(FStruct_ui_equip_item_list, Index_20_EC8EBFFF4E0CC9DBF6F8B6997AB75DB5) == 0x000008, "Member 'FStruct_ui_equip_item_list::Index_20_EC8EBFFF4E0CC9DBF6F8B6997AB75DB5' has a wrong offset!");
static_assert(offsetof(FStruct_ui_equip_item_list, CurrentNum_5_E611C53D4A9E61D42D254EB1CA31C9F2) == 0x00000C, "Member 'FStruct_ui_equip_item_list::CurrentNum_5_E611C53D4A9E61D42D254EB1CA31C9F2' has a wrong offset!");
static_assert(offsetof(FStruct_ui_equip_item_list, MaxNum_7_4C584AAF4681F54976FEEFB30649036D) == 0x000010, "Member 'FStruct_ui_equip_item_list::MaxNum_7_4C584AAF4681F54976FEEFB30649036D' has a wrong offset!");
static_assert(offsetof(FStruct_ui_equip_item_list, IsNew_9_778EB6E44C508EAE9FE478B4846A0DB1) == 0x000014, "Member 'FStruct_ui_equip_item_list::IsNew_9_778EB6E44C508EAE9FE478B4846A0DB1' has a wrong offset!");
static_assert(offsetof(FStruct_ui_equip_item_list, Rarity_12_EEB271D149175F4588CD3DA3C5FAED77) == 0x000015, "Member 'FStruct_ui_equip_item_list::Rarity_12_EEB271D149175F4588CD3DA3C5FAED77' has a wrong offset!");
static_assert(offsetof(FStruct_ui_equip_item_list, IsEquip_17_24B7C59B4870DA320167BB8D9ADCD385) == 0x000016, "Member 'FStruct_ui_equip_item_list::IsEquip_17_24B7C59B4870DA320167BB8D9ADCD385' has a wrong offset!");
static_assert(offsetof(FStruct_ui_equip_item_list, IDNumber_23_223996854A2CCB71C9BFEDA6C6A82364) == 0x000018, "Member 'FStruct_ui_equip_item_list::IDNumber_23_223996854A2CCB71C9BFEDA6C6A82364' has a wrong offset!");
static_assert(offsetof(FStruct_ui_equip_item_list, ItemNameString_34_6D0B71C24414191E00E6CDA0B8E7BD7A) == 0x000020, "Member 'FStruct_ui_equip_item_list::ItemNameString_34_6D0B71C24414191E00E6CDA0B8E7BD7A' has a wrong offset!");
static_assert(offsetof(FStruct_ui_equip_item_list, AttackPoint_33_8BF5BA0348C51F0E00D9BABE7627AEE1) == 0x000030, "Member 'FStruct_ui_equip_item_list::AttackPoint_33_8BF5BA0348C51F0E00D9BABE7627AEE1' has a wrong offset!");
static_assert(offsetof(FStruct_ui_equip_item_list, LastAcquisitionTime_42_A1D2B52F499432B4D429458CEFE34ED5) == 0x000034, "Member 'FStruct_ui_equip_item_list::LastAcquisitionTime_42_A1D2B52F499432B4D429458CEFE34ED5' has a wrong offset!");
static_assert(offsetof(FStruct_ui_equip_item_list, IsEnable_44_CE651A1444E3C4C5F33F04849D4ABA7C) == 0x000038, "Member 'FStruct_ui_equip_item_list::IsEnable_44_CE651A1444E3C4C5F33F04849D4ABA7C' has a wrong offset!");
static_assert(offsetof(FStruct_ui_equip_item_list, IsUseSkin_46_EA6EC5AC45364CFFF0D1EEB80E5AD040) == 0x000039, "Member 'FStruct_ui_equip_item_list::IsUseSkin_46_EA6EC5AC45364CFFF0D1EEB80E5AD040' has a wrong offset!");

}

