#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ui_menu_battle_control

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "Enum_ui_pk_weight_gauge_button_structs.hpp"
#include "Enum_ui_object_guide_structs.hpp"
#include "UMG_structs.hpp"
#include "Enum_ui_action_icon_device_type_structs.hpp"


namespace SDK::Params
{

// Function ui_menu_battle_control.ui_menu_battle_control_C.ExecuteUbergraph_ui_menu_battle_control
// 0x00E8 (0x00E8 - 0x0000)
struct Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bExtend)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool IsNotSelectable)>         K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96D9[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_State;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ChangePlayUI_ReturnValue;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96DA[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserParamManager*                      CallFunc_GetUserParamManager_UserParamManager;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bExtend;                        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96DB[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFlagManager*                           CallFunc_GetFlagManager_ReturnValue;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EContentsOpening                              K2Node_CustomEvent_Contents_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bOpen_1;                        // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96DC[0x5];                                     // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0018)()
	TDelegate<void(EOperationRestriction Contents, bool bOpen)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ChangePlayUI_ReturnValue_1;               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96DD[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IRSGameModeBPInterface_C> K2Node_DynamicCast_AsRSGame_Mode_BPInterface;      // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLV_MainPersistent_IsLV_MainPersistence; // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOperationRestriction                         K2Node_CustomEvent_Contents;                       // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bOpen;                          // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96DE[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserParamManager*                      CallFunc_GetUserParamManager_UserParamManager_1;   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_isNotSelectable;                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_isVisible;                            // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96DF[0x2];                                     // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EContentsOpening Contents, bool bOpen)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00D4(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control) == 0x000008, "Wrong alignment on Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control");
static_assert(sizeof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control) == 0x0000E8, "Wrong size on Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, EntryPoint) == 0x000000, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, K2Node_Event_State) == 0x000028, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, K2Node_Event_SubState) == 0x00002C, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, K2Node_Event_DeltaSeconds) == 0x000030, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, CallFunc_ChangePlayUI_ReturnValue) == 0x000034, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::CallFunc_ChangePlayUI_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, CallFunc_GetUserParamManager_UserParamManager) == 0x000038, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::CallFunc_GetUserParamManager_UserParamManager' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, K2Node_CustomEvent_bExtend) == 0x000040, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::K2Node_CustomEvent_bExtend' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, CallFunc_GetRSGameInstance_RSGameInstance) == 0x000048, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::CallFunc_GetRSGameInstance_RSGameInstance' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, CallFunc_GetFlagManager_ReturnValue) == 0x000050, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::CallFunc_GetFlagManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, K2Node_CustomEvent_Contents_1) == 0x000058, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::K2Node_CustomEvent_Contents_1' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, K2Node_CustomEvent_bOpen_1) == 0x000059, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::K2Node_CustomEvent_bOpen_1' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00005A, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, CallFunc_GetDataBaseManager_Manager) == 0x000060, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, CallFunc_GetText_ReturnValue) == 0x000068, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, CallFunc_Conv_StringToText_ReturnValue) == 0x000078, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, K2Node_CreateDelegate_OutputDelegate_2) == 0x000090, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, CallFunc_GetGameMode_ReturnValue) == 0x0000A0, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, CallFunc_ChangePlayUI_ReturnValue_1) == 0x0000A8, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::CallFunc_ChangePlayUI_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, K2Node_DynamicCast_AsRSGame_Mode_BPInterface) == 0x0000B0, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::K2Node_DynamicCast_AsRSGame_Mode_BPInterface' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, CallFunc_IsLV_MainPersistent_IsLV_MainPersistence) == 0x0000C1, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::CallFunc_IsLV_MainPersistent_IsLV_MainPersistence' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, K2Node_CustomEvent_Contents) == 0x0000C2, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::K2Node_CustomEvent_Contents' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, K2Node_CustomEvent_bOpen) == 0x0000C3, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::K2Node_CustomEvent_bOpen' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, CallFunc_GetUserParamManager_UserParamManager_1) == 0x0000C8, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::CallFunc_GetUserParamManager_UserParamManager_1' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, K2Node_CustomEvent_isNotSelectable) == 0x0000D0, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::K2Node_CustomEvent_isNotSelectable' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, K2Node_Event_isVisible) == 0x0000D1, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::K2Node_Event_isVisible' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000D4, "Member 'Ui_menu_battle_control_C_ExecuteUbergraph_ui_menu_battle_control::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function ui_menu_battle_control.ui_menu_battle_control_C.SetVisibleIntercept
// 0x0001 (0x0001 - 0x0000)
struct Ui_menu_battle_control_C_SetVisibleIntercept final
{
public:
	bool                                          Param_IsVisible;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ui_menu_battle_control_C_SetVisibleIntercept) == 0x000001, "Wrong alignment on Ui_menu_battle_control_C_SetVisibleIntercept");
static_assert(sizeof(Ui_menu_battle_control_C_SetVisibleIntercept) == 0x000001, "Wrong size on Ui_menu_battle_control_C_SetVisibleIntercept");
static_assert(offsetof(Ui_menu_battle_control_C_SetVisibleIntercept, Param_IsVisible) == 0x000000, "Member 'Ui_menu_battle_control_C_SetVisibleIntercept::Param_IsVisible' has a wrong offset!");

// Function ui_menu_battle_control.ui_menu_battle_control_C.Event_SelectableChange
// 0x0001 (0x0001 - 0x0000)
struct Ui_menu_battle_control_C_Event_SelectableChange final
{
public:
	bool                                          IsNotSelectable;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ui_menu_battle_control_C_Event_SelectableChange) == 0x000001, "Wrong alignment on Ui_menu_battle_control_C_Event_SelectableChange");
static_assert(sizeof(Ui_menu_battle_control_C_Event_SelectableChange) == 0x000001, "Wrong size on Ui_menu_battle_control_C_Event_SelectableChange");
static_assert(offsetof(Ui_menu_battle_control_C_Event_SelectableChange, IsNotSelectable) == 0x000000, "Member 'Ui_menu_battle_control_C_Event_SelectableChange::IsNotSelectable' has a wrong offset!");

// Function ui_menu_battle_control.ui_menu_battle_control_C.Event_ContentsRestricted
// 0x0002 (0x0002 - 0x0000)
struct Ui_menu_battle_control_C_Event_ContentsRestricted final
{
public:
	EOperationRestriction                         Contents;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOpen;                                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ui_menu_battle_control_C_Event_ContentsRestricted) == 0x000001, "Wrong alignment on Ui_menu_battle_control_C_Event_ContentsRestricted");
static_assert(sizeof(Ui_menu_battle_control_C_Event_ContentsRestricted) == 0x000002, "Wrong size on Ui_menu_battle_control_C_Event_ContentsRestricted");
static_assert(offsetof(Ui_menu_battle_control_C_Event_ContentsRestricted, Contents) == 0x000000, "Member 'Ui_menu_battle_control_C_Event_ContentsRestricted::Contents' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_Event_ContentsRestricted, bOpen) == 0x000001, "Member 'Ui_menu_battle_control_C_Event_ContentsRestricted::bOpen' has a wrong offset!");

// Function ui_menu_battle_control.ui_menu_battle_control_C.Event_ContentsOpened
// 0x0002 (0x0002 - 0x0000)
struct Ui_menu_battle_control_C_Event_ContentsOpened final
{
public:
	EContentsOpening                              Contents;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOpen;                                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ui_menu_battle_control_C_Event_ContentsOpened) == 0x000001, "Wrong alignment on Ui_menu_battle_control_C_Event_ContentsOpened");
static_assert(sizeof(Ui_menu_battle_control_C_Event_ContentsOpened) == 0x000002, "Wrong size on Ui_menu_battle_control_C_Event_ContentsOpened");
static_assert(offsetof(Ui_menu_battle_control_C_Event_ContentsOpened, Contents) == 0x000000, "Member 'Ui_menu_battle_control_C_Event_ContentsOpened::Contents' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_Event_ContentsOpened, bOpen) == 0x000001, "Member 'Ui_menu_battle_control_C_Event_ContentsOpened::bOpen' has a wrong offset!");

// Function ui_menu_battle_control.ui_menu_battle_control_C.Event_SasEquipExtend
// 0x0001 (0x0001 - 0x0000)
struct Ui_menu_battle_control_C_Event_SasEquipExtend final
{
public:
	bool                                          bExtend;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ui_menu_battle_control_C_Event_SasEquipExtend) == 0x000001, "Wrong alignment on Ui_menu_battle_control_C_Event_SasEquipExtend");
static_assert(sizeof(Ui_menu_battle_control_C_Event_SasEquipExtend) == 0x000001, "Wrong size on Ui_menu_battle_control_C_Event_SasEquipExtend");
static_assert(offsetof(Ui_menu_battle_control_C_Event_SasEquipExtend, bExtend) == 0x000000, "Member 'Ui_menu_battle_control_C_Event_SasEquipExtend::bExtend' has a wrong offset!");

// Function ui_menu_battle_control.ui_menu_battle_control_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct Ui_menu_battle_control_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ui_menu_battle_control_C_UpdateState) == 0x000004, "Wrong alignment on Ui_menu_battle_control_C_UpdateState");
static_assert(sizeof(Ui_menu_battle_control_C_UpdateState) == 0x00000C, "Wrong size on Ui_menu_battle_control_C_UpdateState");
static_assert(offsetof(Ui_menu_battle_control_C_UpdateState, State) == 0x000000, "Member 'Ui_menu_battle_control_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_UpdateState, SubState) == 0x000004, "Member 'Ui_menu_battle_control_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'Ui_menu_battle_control_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function ui_menu_battle_control.ui_menu_battle_control_C.CreateWidgetEnemyHp
// 0x0020 (0x0020 - 0x0000)
struct Ui_menu_battle_control_C_CreateWidgetEnemyHp final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96E0[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_Vitality_en_02_C*                CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ui_menu_battle_control_C_CreateWidgetEnemyHp) == 0x000008, "Wrong alignment on Ui_menu_battle_control_C_CreateWidgetEnemyHp");
static_assert(sizeof(Ui_menu_battle_control_C_CreateWidgetEnemyHp) == 0x000020, "Wrong size on Ui_menu_battle_control_C_CreateWidgetEnemyHp");
static_assert(offsetof(Ui_menu_battle_control_C_CreateWidgetEnemyHp, Temp_int_Array_Index_Variable) == 0x000000, "Member 'Ui_menu_battle_control_C_CreateWidgetEnemyHp::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_CreateWidgetEnemyHp, Temp_int_Loop_Num_Variable) == 0x000004, "Member 'Ui_menu_battle_control_C_CreateWidgetEnemyHp::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_CreateWidgetEnemyHp, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Ui_menu_battle_control_C_CreateWidgetEnemyHp::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_CreateWidgetEnemyHp, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'Ui_menu_battle_control_C_CreateWidgetEnemyHp::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_CreateWidgetEnemyHp, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'Ui_menu_battle_control_C_CreateWidgetEnemyHp::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_CreateWidgetEnemyHp, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'Ui_menu_battle_control_C_CreateWidgetEnemyHp::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_CreateWidgetEnemyHp, CallFunc_Create_ReturnValue) == 0x000018, "Member 'Ui_menu_battle_control_C_CreateWidgetEnemyHp::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function ui_menu_battle_control.ui_menu_battle_control_C.CreateTargetCursor
// 0x0008 (0x0008 - 0x0000)
struct Ui_menu_battle_control_C_CreateTargetCursor final
{
public:
	class UWB_ui_Target_1_C*                      CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ui_menu_battle_control_C_CreateTargetCursor) == 0x000008, "Wrong alignment on Ui_menu_battle_control_C_CreateTargetCursor");
static_assert(sizeof(Ui_menu_battle_control_C_CreateTargetCursor) == 0x000008, "Wrong size on Ui_menu_battle_control_C_CreateTargetCursor");
static_assert(offsetof(Ui_menu_battle_control_C_CreateTargetCursor, CallFunc_Create_ReturnValue) == 0x000000, "Member 'Ui_menu_battle_control_C_CreateTargetCursor::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function ui_menu_battle_control.ui_menu_battle_control_C.CreateBrainTargetCursor
// 0x0048 (0x0048 - 0x0000)
struct Ui_menu_battle_control_C_CreateBrainTargetCursor final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96E1[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96E2[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_Target_Brain_1_C*                CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUIBrainTargetInfo                     K2Node_MakeStruct_UIBrainTargetInfo;               // 0x0020(0x0018)(NoDestructor, ContainsInstancedReference)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96E3[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ui_menu_battle_control_C_CreateBrainTargetCursor) == 0x000008, "Wrong alignment on Ui_menu_battle_control_C_CreateBrainTargetCursor");
static_assert(sizeof(Ui_menu_battle_control_C_CreateBrainTargetCursor) == 0x000048, "Wrong size on Ui_menu_battle_control_C_CreateBrainTargetCursor");
static_assert(offsetof(Ui_menu_battle_control_C_CreateBrainTargetCursor, Temp_int_Array_Index_Variable) == 0x000000, "Member 'Ui_menu_battle_control_C_CreateBrainTargetCursor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_CreateBrainTargetCursor, Temp_int_Loop_Num_Variable) == 0x000004, "Member 'Ui_menu_battle_control_C_CreateBrainTargetCursor::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_CreateBrainTargetCursor, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Ui_menu_battle_control_C_CreateBrainTargetCursor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_CreateBrainTargetCursor, CallFunc_Less_IntInt_ReturnValue) == 0x00000C, "Member 'Ui_menu_battle_control_C_CreateBrainTargetCursor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_CreateBrainTargetCursor, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'Ui_menu_battle_control_C_CreateBrainTargetCursor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_CreateBrainTargetCursor, CallFunc_Create_ReturnValue) == 0x000018, "Member 'Ui_menu_battle_control_C_CreateBrainTargetCursor::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_CreateBrainTargetCursor, K2Node_MakeStruct_UIBrainTargetInfo) == 0x000020, "Member 'Ui_menu_battle_control_C_CreateBrainTargetCursor::K2Node_MakeStruct_UIBrainTargetInfo' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_CreateBrainTargetCursor, CallFunc_MakeLiteralByte_ReturnValue) == 0x000038, "Member 'Ui_menu_battle_control_C_CreateBrainTargetCursor::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_CreateBrainTargetCursor, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00003C, "Member 'Ui_menu_battle_control_C_CreateBrainTargetCursor::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_CreateBrainTargetCursor, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'Ui_menu_battle_control_C_CreateBrainTargetCursor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function ui_menu_battle_control.ui_menu_battle_control_C.IsFlagPlayUI
// 0x0001 (0x0001 - 0x0000)
struct Ui_menu_battle_control_C_IsFlagPlayUI final
{
public:
	bool                                          Param_IsFlagPlayUI;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ui_menu_battle_control_C_IsFlagPlayUI) == 0x000001, "Wrong alignment on Ui_menu_battle_control_C_IsFlagPlayUI");
static_assert(sizeof(Ui_menu_battle_control_C_IsFlagPlayUI) == 0x000001, "Wrong size on Ui_menu_battle_control_C_IsFlagPlayUI");
static_assert(offsetof(Ui_menu_battle_control_C_IsFlagPlayUI, Param_IsFlagPlayUI) == 0x000000, "Member 'Ui_menu_battle_control_C_IsFlagPlayUI::Param_IsFlagPlayUI' has a wrong offset!");

// Function ui_menu_battle_control.ui_menu_battle_control_C.CreateGameOver
// 0x0008 (0x0008 - 0x0000)
struct Ui_menu_battle_control_C_CreateGameOver final
{
public:
	class UWB_ui_GameOver_C*                      CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ui_menu_battle_control_C_CreateGameOver) == 0x000008, "Wrong alignment on Ui_menu_battle_control_C_CreateGameOver");
static_assert(sizeof(Ui_menu_battle_control_C_CreateGameOver) == 0x000008, "Wrong size on Ui_menu_battle_control_C_CreateGameOver");
static_assert(offsetof(Ui_menu_battle_control_C_CreateGameOver, CallFunc_Create_ReturnValue) == 0x000000, "Member 'Ui_menu_battle_control_C_CreateGameOver::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function ui_menu_battle_control.ui_menu_battle_control_C.CreateBossName
// 0x0008 (0x0008 - 0x0000)
struct Ui_menu_battle_control_C_CreateBossName final
{
public:
	class UWB_ui_BossName_C*                      CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ui_menu_battle_control_C_CreateBossName) == 0x000008, "Wrong alignment on Ui_menu_battle_control_C_CreateBossName");
static_assert(sizeof(Ui_menu_battle_control_C_CreateBossName) == 0x000008, "Wrong size on Ui_menu_battle_control_C_CreateBossName");
static_assert(offsetof(Ui_menu_battle_control_C_CreateBossName, CallFunc_Create_ReturnValue) == 0x000000, "Member 'Ui_menu_battle_control_C_CreateBossName::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function ui_menu_battle_control.ui_menu_battle_control_C.ChangePlayUI
// 0x0038 (0x0038 - 0x0000)
struct Ui_menu_battle_control_C_ChangePlayUI final
{
public:
	bool                                          IsPlay;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96E4[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_GetHpTargetCharacter_instance;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHpTargetCharacter_isEnable;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96E5[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattleCharacter_C*                   K2Node_DynamicCast_AsRSBattle_Character;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96E6[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ui_menu_battle_control_C_ChangePlayUI) == 0x000008, "Wrong alignment on Ui_menu_battle_control_C_ChangePlayUI");
static_assert(sizeof(Ui_menu_battle_control_C_ChangePlayUI) == 0x000038, "Wrong size on Ui_menu_battle_control_C_ChangePlayUI");
static_assert(offsetof(Ui_menu_battle_control_C_ChangePlayUI, IsPlay) == 0x000000, "Member 'Ui_menu_battle_control_C_ChangePlayUI::IsPlay' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ChangePlayUI, ReturnValue) == 0x000001, "Member 'Ui_menu_battle_control_C_ChangePlayUI::ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ChangePlayUI, Temp_int_Variable) == 0x000004, "Member 'Ui_menu_battle_control_C_ChangePlayUI::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ChangePlayUI, CallFunc_GetHpTargetCharacter_instance) == 0x000008, "Member 'Ui_menu_battle_control_C_ChangePlayUI::CallFunc_GetHpTargetCharacter_instance' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ChangePlayUI, CallFunc_GetHpTargetCharacter_isEnable) == 0x000010, "Member 'Ui_menu_battle_control_C_ChangePlayUI::CallFunc_GetHpTargetCharacter_isEnable' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ChangePlayUI, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'Ui_menu_battle_control_C_ChangePlayUI::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ChangePlayUI, K2Node_DynamicCast_AsRSBattle_Character) == 0x000020, "Member 'Ui_menu_battle_control_C_ChangePlayUI::K2Node_DynamicCast_AsRSBattle_Character' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ChangePlayUI, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Ui_menu_battle_control_C_ChangePlayUI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ChangePlayUI, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000029, "Member 'Ui_menu_battle_control_C_ChangePlayUI::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ChangePlayUI, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'Ui_menu_battle_control_C_ChangePlayUI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ChangePlayUI, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000030, "Member 'Ui_menu_battle_control_C_ChangePlayUI::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function ui_menu_battle_control.ui_menu_battle_control_C.CreateInterceptIcon
// 0x0008 (0x0008 - 0x0000)
struct Ui_menu_battle_control_C_CreateInterceptIcon final
{
public:
	class UWB_ui_Intercept_1_C*                   CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ui_menu_battle_control_C_CreateInterceptIcon) == 0x000008, "Wrong alignment on Ui_menu_battle_control_C_CreateInterceptIcon");
static_assert(sizeof(Ui_menu_battle_control_C_CreateInterceptIcon) == 0x000008, "Wrong size on Ui_menu_battle_control_C_CreateInterceptIcon");
static_assert(offsetof(Ui_menu_battle_control_C_CreateInterceptIcon, CallFunc_Create_ReturnValue) == 0x000000, "Member 'Ui_menu_battle_control_C_CreateInterceptIcon::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function ui_menu_battle_control.ui_menu_battle_control_C.ReleaseInterceptIcon
// 0x0001 (0x0001 - 0x0000)
struct Ui_menu_battle_control_C_ReleaseInterceptIcon final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ui_menu_battle_control_C_ReleaseInterceptIcon) == 0x000001, "Wrong alignment on Ui_menu_battle_control_C_ReleaseInterceptIcon");
static_assert(sizeof(Ui_menu_battle_control_C_ReleaseInterceptIcon) == 0x000001, "Wrong size on Ui_menu_battle_control_C_ReleaseInterceptIcon");
static_assert(offsetof(Ui_menu_battle_control_C_ReleaseInterceptIcon, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'Ui_menu_battle_control_C_ReleaseInterceptIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ui_menu_battle_control.ui_menu_battle_control_C.SetIntercept
// 0x0008 (0x0008 - 0x0000)
struct Ui_menu_battle_control_C_SetIntercept final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ui_menu_battle_control_C_SetIntercept) == 0x000008, "Wrong alignment on Ui_menu_battle_control_C_SetIntercept");
static_assert(sizeof(Ui_menu_battle_control_C_SetIntercept) == 0x000008, "Wrong size on Ui_menu_battle_control_C_SetIntercept");
static_assert(offsetof(Ui_menu_battle_control_C_SetIntercept, Target) == 0x000000, "Member 'Ui_menu_battle_control_C_SetIntercept::Target' has a wrong offset!");

// Function ui_menu_battle_control.ui_menu_battle_control_C.InterceptUpdate
// 0x0024 (0x0024 - 0x0000)
struct Ui_menu_battle_control_C_InterceptUpdate final
{
public:
	struct FVector2D                              _InterceptPosition;                                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ui_menu_battle_control_C_InterceptUpdate) == 0x000004, "Wrong alignment on Ui_menu_battle_control_C_InterceptUpdate");
static_assert(sizeof(Ui_menu_battle_control_C_InterceptUpdate) == 0x000024, "Wrong size on Ui_menu_battle_control_C_InterceptUpdate");
static_assert(offsetof(Ui_menu_battle_control_C_InterceptUpdate, _InterceptPosition) == 0x000000, "Member 'Ui_menu_battle_control_C_InterceptUpdate::_InterceptPosition' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_InterceptUpdate, CallFunc_GetViewportSize_ReturnValue) == 0x000008, "Member 'Ui_menu_battle_control_C_InterceptUpdate::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_InterceptUpdate, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x000010, "Member 'Ui_menu_battle_control_C_InterceptUpdate::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_InterceptUpdate, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000018, "Member 'Ui_menu_battle_control_C_InterceptUpdate::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_InterceptUpdate, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'Ui_menu_battle_control_C_InterceptUpdate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_InterceptUpdate, K2Node_SwitchInteger_CmpSuccess) == 0x000021, "Member 'Ui_menu_battle_control_C_InterceptUpdate::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function ui_menu_battle_control.ui_menu_battle_control_C.ChangeTown
// 0x0006 (0x0006 - 0x0000)
struct Ui_menu_battle_control_C_ChangeTown final
{
public:
	bool                                          IsTown;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsAjito;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          _Work;                                             // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChangePlayUI_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ui_menu_battle_control_C_ChangeTown) == 0x000001, "Wrong alignment on Ui_menu_battle_control_C_ChangeTown");
static_assert(sizeof(Ui_menu_battle_control_C_ChangeTown) == 0x000006, "Wrong size on Ui_menu_battle_control_C_ChangeTown");
static_assert(offsetof(Ui_menu_battle_control_C_ChangeTown, IsTown) == 0x000000, "Member 'Ui_menu_battle_control_C_ChangeTown::IsTown' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ChangeTown, IsAjito) == 0x000001, "Member 'Ui_menu_battle_control_C_ChangeTown::IsAjito' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ChangeTown, ReturnValue) == 0x000002, "Member 'Ui_menu_battle_control_C_ChangeTown::ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ChangeTown, _Work) == 0x000003, "Member 'Ui_menu_battle_control_C_ChangeTown::_Work' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ChangeTown, CallFunc_ChangePlayUI_ReturnValue) == 0x000004, "Member 'Ui_menu_battle_control_C_ChangeTown::CallFunc_ChangePlayUI_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_ChangeTown, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'Ui_menu_battle_control_C_ChangeTown::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function ui_menu_battle_control.ui_menu_battle_control_C.StartBrainCrashOverwrite
// 0x0020 (0x0020 - 0x0000)
struct Ui_menu_battle_control_C_StartBrainCrashOverwrite final
{
public:
	TArray<bool>                                  NewLocalVar_0;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<bool>                                  K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(Ui_menu_battle_control_C_StartBrainCrashOverwrite) == 0x000008, "Wrong alignment on Ui_menu_battle_control_C_StartBrainCrashOverwrite");
static_assert(sizeof(Ui_menu_battle_control_C_StartBrainCrashOverwrite) == 0x000020, "Wrong size on Ui_menu_battle_control_C_StartBrainCrashOverwrite");
static_assert(offsetof(Ui_menu_battle_control_C_StartBrainCrashOverwrite, NewLocalVar_0) == 0x000000, "Member 'Ui_menu_battle_control_C_StartBrainCrashOverwrite::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_StartBrainCrashOverwrite, K2Node_MakeArray_Array) == 0x000010, "Member 'Ui_menu_battle_control_C_StartBrainCrashOverwrite::K2Node_MakeArray_Array' has a wrong offset!");

// Function ui_menu_battle_control.ui_menu_battle_control_C.SetPsychicGauge
// 0x0004 (0x0004 - 0x0000)
struct Ui_menu_battle_control_C_SetPsychicGauge final
{
public:
	float                                         Param;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ui_menu_battle_control_C_SetPsychicGauge) == 0x000004, "Wrong alignment on Ui_menu_battle_control_C_SetPsychicGauge");
static_assert(sizeof(Ui_menu_battle_control_C_SetPsychicGauge) == 0x000004, "Wrong size on Ui_menu_battle_control_C_SetPsychicGauge");
static_assert(offsetof(Ui_menu_battle_control_C_SetPsychicGauge, Param) == 0x000000, "Member 'Ui_menu_battle_control_C_SetPsychicGauge::Param' has a wrong offset!");

// Function ui_menu_battle_control.ui_menu_battle_control_C.StartPsychicWeightGauge
// 0x0030 (0x0030 - 0x0000)
struct Ui_menu_battle_control_C_StartPsychicWeightGauge final
{
public:
	Enum_ui_pk_weight_gauge_button                Button;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96E7[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Target;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsExObject;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96E8[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         _WorkIndex;                                        // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 _WorkTarget;                                       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _CurrentIndex;                                     // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96E9[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ui_menu_battle_control_C_StartPsychicWeightGauge) == 0x000008, "Wrong alignment on Ui_menu_battle_control_C_StartPsychicWeightGauge");
static_assert(sizeof(Ui_menu_battle_control_C_StartPsychicWeightGauge) == 0x000030, "Wrong size on Ui_menu_battle_control_C_StartPsychicWeightGauge");
static_assert(offsetof(Ui_menu_battle_control_C_StartPsychicWeightGauge, Button) == 0x000000, "Member 'Ui_menu_battle_control_C_StartPsychicWeightGauge::Button' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_StartPsychicWeightGauge, Target) == 0x000008, "Member 'Ui_menu_battle_control_C_StartPsychicWeightGauge::Target' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_StartPsychicWeightGauge, IsExObject) == 0x000010, "Member 'Ui_menu_battle_control_C_StartPsychicWeightGauge::IsExObject' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_StartPsychicWeightGauge, _WorkIndex) == 0x000014, "Member 'Ui_menu_battle_control_C_StartPsychicWeightGauge::_WorkIndex' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_StartPsychicWeightGauge, _WorkTarget) == 0x000018, "Member 'Ui_menu_battle_control_C_StartPsychicWeightGauge::_WorkTarget' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_StartPsychicWeightGauge, _CurrentIndex) == 0x000020, "Member 'Ui_menu_battle_control_C_StartPsychicWeightGauge::_CurrentIndex' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_StartPsychicWeightGauge, Temp_bool_Variable) == 0x000024, "Member 'Ui_menu_battle_control_C_StartPsychicWeightGauge::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_StartPsychicWeightGauge, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000028, "Member 'Ui_menu_battle_control_C_StartPsychicWeightGauge::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function ui_menu_battle_control.ui_menu_battle_control_C.SetPsychicWeightGaugeStyle
// 0x000C (0x000C - 0x0000)
struct Ui_menu_battle_control_C_SetPsychicWeightGaugeStyle final
{
public:
	EPsychicWeightGaugeButton                     Button;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPsychicWeightGaugeSize                       Size;                                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96EA[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxLevel;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ui_menu_battle_control_C_SetPsychicWeightGaugeStyle) == 0x000004, "Wrong alignment on Ui_menu_battle_control_C_SetPsychicWeightGaugeStyle");
static_assert(sizeof(Ui_menu_battle_control_C_SetPsychicWeightGaugeStyle) == 0x00000C, "Wrong size on Ui_menu_battle_control_C_SetPsychicWeightGaugeStyle");
static_assert(offsetof(Ui_menu_battle_control_C_SetPsychicWeightGaugeStyle, Button) == 0x000000, "Member 'Ui_menu_battle_control_C_SetPsychicWeightGaugeStyle::Button' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_SetPsychicWeightGaugeStyle, Size) == 0x000001, "Member 'Ui_menu_battle_control_C_SetPsychicWeightGaugeStyle::Size' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_SetPsychicWeightGaugeStyle, MaxLevel) == 0x000004, "Member 'Ui_menu_battle_control_C_SetPsychicWeightGaugeStyle::MaxLevel' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_SetPsychicWeightGaugeStyle, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'Ui_menu_battle_control_C_SetPsychicWeightGaugeStyle::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function ui_menu_battle_control.ui_menu_battle_control_C.SetPsychicWeightGauge
// 0x0018 (0x0018 - 0x0000)
struct Ui_menu_battle_control_C_SetPsychicWeightGauge final
{
public:
	EPsychicWeightGaugeButton                     Button;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96EB[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Level;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Percent;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_PK_weight_gauge_1_C*             CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ui_menu_battle_control_C_SetPsychicWeightGauge) == 0x000008, "Wrong alignment on Ui_menu_battle_control_C_SetPsychicWeightGauge");
static_assert(sizeof(Ui_menu_battle_control_C_SetPsychicWeightGauge) == 0x000018, "Wrong size on Ui_menu_battle_control_C_SetPsychicWeightGauge");
static_assert(offsetof(Ui_menu_battle_control_C_SetPsychicWeightGauge, Button) == 0x000000, "Member 'Ui_menu_battle_control_C_SetPsychicWeightGauge::Button' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_SetPsychicWeightGauge, Level) == 0x000004, "Member 'Ui_menu_battle_control_C_SetPsychicWeightGauge::Level' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_SetPsychicWeightGauge, Percent) == 0x000008, "Member 'Ui_menu_battle_control_C_SetPsychicWeightGauge::Percent' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_SetPsychicWeightGauge, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00000C, "Member 'Ui_menu_battle_control_C_SetPsychicWeightGauge::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ui_menu_battle_control_C_SetPsychicWeightGauge, CallFunc_Array_Get_Item) == 0x000010, "Member 'Ui_menu_battle_control_C_SetPsychicWeightGauge::CallFunc_Array_Get_Item' has a wrong offset!");

// Function ui_menu_battle_control.ui_menu_battle_control_C.EndPsychicWeightGauge
// 0x0010 (0x0010 - 0x0000)
struct Ui_menu_battle_control_C_EndPsychicWeightGauge final
{
public:
	Enum_ui_pk_weight_gauge_button                Button;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSuccess;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96EC[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         _Work;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
