#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UniqueObjectAttackInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct UniqueObjectAttackInfo.UniqueObjectAttackInfo
// 0x0178 (0x0178 - 0x0000)
struct FUniqueObjectAttackInfo final
{
public:
	TArray<TSoftObjectPtr<class UParticleSystem>> UniqueEffectList_90_5078AA2E43B64513D30254B393BFD540; // 0x0000(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class FName>                           UniqueEffectSocketList_89_2B13DC38432BD78050FEC5AC5CB16422; // 0x0010(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FVector>                        UniqueEffectScaleList_91_6127FDCB45567DBC77C5218AF0AC2BE3; // 0x0020(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<bool>                                  UniqueEffectApplyThrowRotList_94_C018B46E4678037E98D390BB2F80B420; // 0x0030(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          SkipNormalEffect_96_F394746F4DC7B388CD206783DE340A8D; // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E24[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UParticleSystem>         UniqueEffect_35_6874068445580A365532CAB04F68ABBF;  // 0x0048(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   UniqueEffectSocket_41_FEB89F2848E56038CE0280B411780AEB; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseNormalEffect_38_C768400546638EBCF4B3ED9D0AFA30CB; // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E25[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UParticleSystem>         WeakEffect_34_51BC799243AD5F65AFF16B807851EE25;    // 0x0080(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UParticleSystem>         ArmorEffect_33_D332931E457AEBF797FA2BA6F31303D6;   // 0x00A8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UParticleSystem>         NormalEffect_29_94BCDD3D4777004C76016D98E9108B7C;  // 0x00D0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CameraShake_32_DA82F0CF490EEBCF336440BCE8DBCFF3;   // 0x00F8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	float                                         CameraShakeScale_24_578F154A45849B8C34D5DB85894A73FB; // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E26[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UCurveVector>            ObjectShake_61_E9BFD8F945DD59CC109DFCB6BDA38657;   // 0x0128(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          ObjectShakeUseAsLoop_73_71FC6FD64D1D4F500FD8369415BD3D9A; // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E27[0x3];                                     // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ObjectShakeLoopScale_69_910990C24FE6524E767684B4B8F62956; // 0x0154(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ObjectShakeLoopTimeRate_78_6FE7546146E2959CB31AB08425E79AB3; // 0x0160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ObjectShakeScale_59_7719CE4940B458657BA341AD64A8C6A9; // 0x0164(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ObjectShakeTimeRate_77_11119F5648A5C7FBA787E99D78EB5BC1; // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ObjectShakeTime_68_AB9A293B422B8CBD84164CBCCECE5F60; // 0x0174(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FUniqueObjectAttackInfo) == 0x000008, "Wrong alignment on FUniqueObjectAttackInfo");
static_assert(sizeof(FUniqueObjectAttackInfo) == 0x000178, "Wrong size on FUniqueObjectAttackInfo");
static_assert(offsetof(FUniqueObjectAttackInfo, UniqueEffectList_90_5078AA2E43B64513D30254B393BFD540) == 0x000000, "Member 'FUniqueObjectAttackInfo::UniqueEffectList_90_5078AA2E43B64513D30254B393BFD540' has a wrong offset!");
static_assert(offsetof(FUniqueObjectAttackInfo, UniqueEffectSocketList_89_2B13DC38432BD78050FEC5AC5CB16422) == 0x000010, "Member 'FUniqueObjectAttackInfo::UniqueEffectSocketList_89_2B13DC38432BD78050FEC5AC5CB16422' has a wrong offset!");
static_assert(offsetof(FUniqueObjectAttackInfo, UniqueEffectScaleList_91_6127FDCB45567DBC77C5218AF0AC2BE3) == 0x000020, "Member 'FUniqueObjectAttackInfo::UniqueEffectScaleList_91_6127FDCB45567DBC77C5218AF0AC2BE3' has a wrong offset!");
static_assert(offsetof(FUniqueObjectAttackInfo, UniqueEffectApplyThrowRotList_94_C018B46E4678037E98D390BB2F80B420) == 0x000030, "Member 'FUniqueObjectAttackInfo::UniqueEffectApplyThrowRotList_94_C018B46E4678037E98D390BB2F80B420' has a wrong offset!");
static_assert(offsetof(FUniqueObjectAttackInfo, SkipNormalEffect_96_F394746F4DC7B388CD206783DE340A8D) == 0x000040, "Member 'FUniqueObjectAttackInfo::SkipNormalEffect_96_F394746F4DC7B388CD206783DE340A8D' has a wrong offset!");
static_assert(offsetof(FUniqueObjectAttackInfo, UniqueEffect_35_6874068445580A365532CAB04F68ABBF) == 0x000048, "Member 'FUniqueObjectAttackInfo::UniqueEffect_35_6874068445580A365532CAB04F68ABBF' has a wrong offset!");
static_assert(offsetof(FUniqueObjectAttackInfo, UniqueEffectSocket_41_FEB89F2848E56038CE0280B411780AEB) == 0x000070, "Member 'FUniqueObjectAttackInfo::UniqueEffectSocket_41_FEB89F2848E56038CE0280B411780AEB' has a wrong offset!");
static_assert(offsetof(FUniqueObjectAttackInfo, UseNormalEffect_38_C768400546638EBCF4B3ED9D0AFA30CB) == 0x000078, "Member 'FUniqueObjectAttackInfo::UseNormalEffect_38_C768400546638EBCF4B3ED9D0AFA30CB' has a wrong offset!");
static_assert(offsetof(FUniqueObjectAttackInfo, WeakEffect_34_51BC799243AD5F65AFF16B807851EE25) == 0x000080, "Member 'FUniqueObjectAttackInfo::WeakEffect_34_51BC799243AD5F65AFF16B807851EE25' has a wrong offset!");
static_assert(offsetof(FUniqueObjectAttackInfo, ArmorEffect_33_D332931E457AEBF797FA2BA6F31303D6) == 0x0000A8, "Member 'FUniqueObjectAttackInfo::ArmorEffect_33_D332931E457AEBF797FA2BA6F31303D6' has a wrong offset!");
static_assert(offsetof(FUniqueObjectAttackInfo, NormalEffect_29_94BCDD3D4777004C76016D98E9108B7C) == 0x0000D0, "Member 'FUniqueObjectAttackInfo::NormalEffect_29_94BCDD3D4777004C76016D98E9108B7C' has a wrong offset!");
static_assert(offsetof(FUniqueObjectAttackInfo, CameraShake_32_DA82F0CF490EEBCF336440BCE8DBCFF3) == 0x0000F8, "Member 'FUniqueObjectAttackInfo::CameraShake_32_DA82F0CF490EEBCF336440BCE8DBCFF3' has a wrong offset!");
static_assert(offsetof(FUniqueObjectAttackInfo, CameraShakeScale_24_578F154A45849B8C34D5DB85894A73FB) == 0x000120, "Member 'FUniqueObjectAttackInfo::CameraShakeScale_24_578F154A45849B8C34D5DB85894A73FB' has a wrong offset!");
static_assert(offsetof(FUniqueObjectAttackInfo, ObjectShake_61_E9BFD8F945DD59CC109DFCB6BDA38657) == 0x000128, "Member 'FUniqueObjectAttackInfo::ObjectShake_61_E9BFD8F945DD59CC109DFCB6BDA38657' has a wrong offset!");
static_assert(offsetof(FUniqueObjectAttackInfo, ObjectShakeUseAsLoop_73_71FC6FD64D1D4F500FD8369415BD3D9A) == 0x000150, "Member 'FUniqueObjectAttackInfo::ObjectShakeUseAsLoop_73_71FC6FD64D1D4F500FD8369415BD3D9A' has a wrong offset!");
static_assert(offsetof(FUniqueObjectAttackInfo, ObjectShakeLoopScale_69_910990C24FE6524E767684B4B8F62956) == 0x000154, "Member 'FUniqueObjectAttackInfo::ObjectShakeLoopScale_69_910990C24FE6524E767684B4B8F62956' has a wrong offset!");
static_assert(offsetof(FUniqueObjectAttackInfo, ObjectShakeLoopTimeRate_78_6FE7546146E2959CB31AB08425E79AB3) == 0x000160, "Member 'FUniqueObjectAttackInfo::ObjectShakeLoopTimeRate_78_6FE7546146E2959CB31AB08425E79AB3' has a wrong offset!");
static_assert(offsetof(FUniqueObjectAttackInfo, ObjectShakeScale_59_7719CE4940B458657BA341AD64A8C6A9) == 0x000164, "Member 'FUniqueObjectAttackInfo::ObjectShakeScale_59_7719CE4940B458657BA341AD64A8C6A9' has a wrong offset!");
static_assert(offsetof(FUniqueObjectAttackInfo, ObjectShakeTimeRate_77_11119F5648A5C7FBA787E99D78EB5BC1) == 0x000170, "Member 'FUniqueObjectAttackInfo::ObjectShakeTimeRate_77_11119F5648A5C7FBA787E99D78EB5BC1' has a wrong offset!");
static_assert(offsetof(FUniqueObjectAttackInfo, ObjectShakeTime_68_AB9A293B422B8CBD84164CBCCECE5F60) == 0x000174, "Member 'FUniqueObjectAttackInfo::ObjectShakeTime_68_AB9A293B422B8CBD84164CBCCECE5F60' has a wrong offset!");

}

