#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UniqueObjectElectricPoleEffectParameter

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct UniqueObjectElectricPoleEffectParameter.UniqueObjectElectricPoleEffectParameter
// 0x0040 (0x0040 - 0x0000)
struct FUniqueObjectElectricPoleEffectParameter final
{
public:
	TSoftObjectPtr<class UParticleSystem>         EffectParticle_8_1397E818451F25ADCE94F3A3DA9BC550; // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	float                                         IntervalMin_14_4D69511C4C114CBCFF82739E139A91CD;   // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IntervalMax_15_4A6EC4854F0492961F9149985CF073BB;   // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           SocketList_6_B82399884476F08901D8EEB385CBA201;     // 0x0030(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FUniqueObjectElectricPoleEffectParameter) == 0x000008, "Wrong alignment on FUniqueObjectElectricPoleEffectParameter");
static_assert(sizeof(FUniqueObjectElectricPoleEffectParameter) == 0x000040, "Wrong size on FUniqueObjectElectricPoleEffectParameter");
static_assert(offsetof(FUniqueObjectElectricPoleEffectParameter, EffectParticle_8_1397E818451F25ADCE94F3A3DA9BC550) == 0x000000, "Member 'FUniqueObjectElectricPoleEffectParameter::EffectParticle_8_1397E818451F25ADCE94F3A3DA9BC550' has a wrong offset!");
static_assert(offsetof(FUniqueObjectElectricPoleEffectParameter, IntervalMin_14_4D69511C4C114CBCFF82739E139A91CD) == 0x000028, "Member 'FUniqueObjectElectricPoleEffectParameter::IntervalMin_14_4D69511C4C114CBCFF82739E139A91CD' has a wrong offset!");
static_assert(offsetof(FUniqueObjectElectricPoleEffectParameter, IntervalMax_15_4A6EC4854F0492961F9149985CF073BB) == 0x00002C, "Member 'FUniqueObjectElectricPoleEffectParameter::IntervalMax_15_4A6EC4854F0492961F9149985CF073BB' has a wrong offset!");
static_assert(offsetof(FUniqueObjectElectricPoleEffectParameter, SocketList_6_B82399884476F08901D8EEB385CBA201) == 0x000030, "Member 'FUniqueObjectElectricPoleEffectParameter::SocketList_6_B82399884476F08901D8EEB385CBA201' has a wrong offset!");

}

