#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VanishEnemyComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass VanishEnemyComponent.VanishEnemyComponent_C
// 0x0040 (0x0100 - 0x00C0)
class UVanishEnemyComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         VanishValue;                                       // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Emissive;                                          // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmissiveSec;                                       // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VenishSec;                                         // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefalultEmissiveSec;                               // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultVenishSec;                                  // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VanishPastSec;                                     // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmmisiveEndValue;                                  // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VanishEndValue;                                    // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         VanishState;                                       // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartVanishParam;                                  // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndVanishParam;                                    // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSBattleEnemy_C*                       OwnerEnemy;                                        // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VanishEnemyComponent(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void StartVanish(float VanishSec, float Param_StartVanish, float EndVanish);
	void UpdateVanishValue(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VanishEnemyComponent_C">();
	}
	static class UVanishEnemyComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVanishEnemyComponent_C>();
	}
};
static_assert(alignof(UVanishEnemyComponent_C) == 0x000008, "Wrong alignment on UVanishEnemyComponent_C");
static_assert(sizeof(UVanishEnemyComponent_C) == 0x000100, "Wrong size on UVanishEnemyComponent_C");
static_assert(offsetof(UVanishEnemyComponent_C, UberGraphFrame) == 0x0000C0, "Member 'UVanishEnemyComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVanishEnemyComponent_C, VanishValue) == 0x0000C8, "Member 'UVanishEnemyComponent_C::VanishValue' has a wrong offset!");
static_assert(offsetof(UVanishEnemyComponent_C, Emissive) == 0x0000CC, "Member 'UVanishEnemyComponent_C::Emissive' has a wrong offset!");
static_assert(offsetof(UVanishEnemyComponent_C, EmissiveSec) == 0x0000D0, "Member 'UVanishEnemyComponent_C::EmissiveSec' has a wrong offset!");
static_assert(offsetof(UVanishEnemyComponent_C, VenishSec) == 0x0000D4, "Member 'UVanishEnemyComponent_C::VenishSec' has a wrong offset!");
static_assert(offsetof(UVanishEnemyComponent_C, DefalultEmissiveSec) == 0x0000D8, "Member 'UVanishEnemyComponent_C::DefalultEmissiveSec' has a wrong offset!");
static_assert(offsetof(UVanishEnemyComponent_C, DefaultVenishSec) == 0x0000DC, "Member 'UVanishEnemyComponent_C::DefaultVenishSec' has a wrong offset!");
static_assert(offsetof(UVanishEnemyComponent_C, VanishPastSec) == 0x0000E0, "Member 'UVanishEnemyComponent_C::VanishPastSec' has a wrong offset!");
static_assert(offsetof(UVanishEnemyComponent_C, EmmisiveEndValue) == 0x0000E4, "Member 'UVanishEnemyComponent_C::EmmisiveEndValue' has a wrong offset!");
static_assert(offsetof(UVanishEnemyComponent_C, VanishEndValue) == 0x0000E8, "Member 'UVanishEnemyComponent_C::VanishEndValue' has a wrong offset!");
static_assert(offsetof(UVanishEnemyComponent_C, VanishState) == 0x0000EC, "Member 'UVanishEnemyComponent_C::VanishState' has a wrong offset!");
static_assert(offsetof(UVanishEnemyComponent_C, StartVanishParam) == 0x0000F0, "Member 'UVanishEnemyComponent_C::StartVanishParam' has a wrong offset!");
static_assert(offsetof(UVanishEnemyComponent_C, EndVanishParam) == 0x0000F4, "Member 'UVanishEnemyComponent_C::EndVanishParam' has a wrong offset!");
static_assert(offsetof(UVanishEnemyComponent_C, OwnerEnemy) == 0x0000F8, "Member 'UVanishEnemyComponent_C::OwnerEnemy' has a wrong offset!");

}

