#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CriMovie

#include "Basic.hpp"

#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_CriMovie.WB_CriMovie_C
// 0x0018 (0x03A0 - 0x0388)
class UWB_CriMovie_C final : public UUIBase
{
public:
	class UImage*                                 BlackBand_Un;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BlackBand_Up;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBase;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_CriMovie_C">();
	}
	static class UWB_CriMovie_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_CriMovie_C>();
	}
};
static_assert(alignof(UWB_CriMovie_C) == 0x000008, "Wrong alignment on UWB_CriMovie_C");
static_assert(sizeof(UWB_CriMovie_C) == 0x0003A0, "Wrong size on UWB_CriMovie_C");
static_assert(offsetof(UWB_CriMovie_C, BlackBand_Un) == 0x000388, "Member 'UWB_CriMovie_C::BlackBand_Un' has a wrong offset!");
static_assert(offsetof(UWB_CriMovie_C, BlackBand_Up) == 0x000390, "Member 'UWB_CriMovie_C::BlackBand_Up' has a wrong offset!");
static_assert(offsetof(UWB_CriMovie_C, ImageBase) == 0x000398, "Member 'UWB_CriMovie_C::ImageBase' has a wrong offset!");

}

