#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_LetterBoxMask

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_LetterBoxMask.WB_LetterBoxMask_C
// 0x0018 (0x03B0 - 0x0398)
class UWB_LetterBoxMask_C final : public UUILetterBoxMask
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 One;                                               // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Two;                                               // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_LetterBoxMask(int32 EntryPoint);
	void OnGameUserSettingsUINeedsUpdate();
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_LetterBoxMask_C">();
	}
	static class UWB_LetterBoxMask_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_LetterBoxMask_C>();
	}
};
static_assert(alignof(UWB_LetterBoxMask_C) == 0x000008, "Wrong alignment on UWB_LetterBoxMask_C");
static_assert(sizeof(UWB_LetterBoxMask_C) == 0x0003B0, "Wrong size on UWB_LetterBoxMask_C");
static_assert(offsetof(UWB_LetterBoxMask_C, UberGraphFrame) == 0x000398, "Member 'UWB_LetterBoxMask_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_LetterBoxMask_C, One) == 0x0003A0, "Member 'UWB_LetterBoxMask_C::One' has a wrong offset!");
static_assert(offsetof(UWB_LetterBoxMask_C, Two) == 0x0003A8, "Member 'UWB_LetterBoxMask_C::Two' has a wrong offset!");

}

