#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Config

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Config.WB_ui_Config_C.ExecuteUbergraph_WB_ui_Config
// 0x00C0 (0x00C0 - 0x0000)
struct WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12CB[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FKey& KeyName)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_Event_State;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12CC[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_CustomEvent_KeyName;                        // 0x0040(0x0018)(HasGetValueTypeHash)
	class ABP_InputManager_C*                     CallFunc_GetInputManager_BP_InputManager;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_InputManager_C*                     CallFunc_GetInputManager_BP_InputManager_1;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue_1;            // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12CD[0x2];                                     // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12CE[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWB_ui_MainContents_Parts_6_C*>  K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UWB_ui_MainContents_Parts_6_C*>  K2Node_MakeArray_Array_1;                          // 0x0090(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12CF[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_TriggerEffectManager_C*             CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config) == 0x000008, "Wrong alignment on WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config");
static_assert(sizeof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config) == 0x0000C0, "Wrong size on WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, EntryPoint) == 0x000000, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, Temp_int_Loop_Num_Variable) == 0x000010, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, CallFunc_Less_IntInt_ReturnValue) == 0x000014, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, K2Node_Event_State) == 0x000028, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, K2Node_Event_SubState) == 0x00002C, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, K2Node_Event_DeltaSeconds) == 0x000030, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, Temp_int_Array_Index_Variable_1) == 0x000034, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, CallFunc_GetPlatformType_ReturnValue) == 0x000038, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000039, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, K2Node_CustomEvent_KeyName) == 0x000040, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::K2Node_CustomEvent_KeyName' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, CallFunc_GetInputManager_BP_InputManager) == 0x000058, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::CallFunc_GetInputManager_BP_InputManager' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, CallFunc_GetInputManager_BP_InputManager_1) == 0x000060, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::CallFunc_GetInputManager_BP_InputManager_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, Temp_int_Loop_Num_Variable_1) == 0x000068, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, CallFunc_GetPlatformType_ReturnValue_1) == 0x00006C, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::CallFunc_GetPlatformType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00006D, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, Temp_int_Loop_Counter_Variable_1) == 0x000070, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, CallFunc_Less_IntInt_ReturnValue_1) == 0x000078, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, CallFunc_Add_IntInt_ReturnValue_1) == 0x00007C, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, K2Node_MakeArray_Array) == 0x000080, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, K2Node_MakeArray_Array_1) == 0x000090, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, CallFunc_GetPlayerController_ReturnValue) == 0x0000A0, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, CallFunc_Array_Length_ReturnValue_1) == 0x0000AC, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager) == 0x0000B0, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::CallFunc_GetTriggerEffectManager_BP_TriggerEffectManager' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config, CallFunc_IsValid_ReturnValue_1) == 0x0000B8, "Member 'WB_ui_Config_C_ExecuteUbergraph_WB_ui_Config::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WB_ui_Config.WB_ui_Config_C.AnyKey
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_Config_C_AnyKey final
{
public:
	struct FKey                                   KeyName;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Config_C_AnyKey) == 0x000008, "Wrong alignment on WB_ui_Config_C_AnyKey");
static_assert(sizeof(WB_ui_Config_C_AnyKey) == 0x000018, "Wrong size on WB_ui_Config_C_AnyKey");
static_assert(offsetof(WB_ui_Config_C_AnyKey, KeyName) == 0x000000, "Member 'WB_ui_Config_C_AnyKey::KeyName' has a wrong offset!");

// Function WB_ui_Config.WB_ui_Config_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Config_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Config_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Config_C_UpdateState");
static_assert(sizeof(WB_ui_Config_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Config_C_UpdateState");
static_assert(offsetof(WB_ui_Config_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Config_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Config_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Config_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Config_C_UpdateState::DeltaSeconds' has a wrong offset!");

}

