#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_BrainMes

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "Struct_ui_brainmes_work_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_BrainMes.WB_ui_BrainMes_C.CallBondEpisode__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_BrainMes_C_CallBondEpisode__DelegateSignature final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_C_CallBondEpisode__DelegateSignature) == 0x000008, "Wrong alignment on WB_ui_BrainMes_C_CallBondEpisode__DelegateSignature");
static_assert(sizeof(WB_ui_BrainMes_C_CallBondEpisode__DelegateSignature) == 0x000010, "Wrong size on WB_ui_BrainMes_C_CallBondEpisode__DelegateSignature");
static_assert(offsetof(WB_ui_BrainMes_C_CallBondEpisode__DelegateSignature, Path) == 0x000000, "Member 'WB_ui_BrainMes_C_CallBondEpisode__DelegateSignature::Path' has a wrong offset!");

// Function WB_ui_BrainMes.WB_ui_BrainMes_C.SetPopupMode__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_BrainMes_C_SetPopupMode__DelegateSignature final
{
public:
	bool                                          IsPopup;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_BrainMes_C_SetPopupMode__DelegateSignature) == 0x000001, "Wrong alignment on WB_ui_BrainMes_C_SetPopupMode__DelegateSignature");
static_assert(sizeof(WB_ui_BrainMes_C_SetPopupMode__DelegateSignature) == 0x000001, "Wrong size on WB_ui_BrainMes_C_SetPopupMode__DelegateSignature");
static_assert(offsetof(WB_ui_BrainMes_C_SetPopupMode__DelegateSignature, IsPopup) == 0x000000, "Member 'WB_ui_BrainMes_C_SetPopupMode__DelegateSignature::IsPopup' has a wrong offset!");

// Function WB_ui_BrainMes.WB_ui_BrainMes_C.ExecuteUbergraph_WB_ui_BrainMes
// 0x0218 (0x0218 - 0x0000)
struct WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15F5[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15F6[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUserWidget* PWidget)>   K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15F7[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUserWidget* PWidget)>   K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_index_1;                        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_pWidget_6;                      // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_BrainMes_Parts_1_C*              K2Node_DynamicCast_AsWB_Ui_Brain_Mes_Parts_1;      // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15F8[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EUINoticeMessageCallType SenderType, class FName DatatableId)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 IsMouseScroll, int32 Cursor, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 IsMouseScroll, int32 Cursor, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_15F9[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_pWidget_5;                      // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_pWidget_4;                      // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_BrainMes_Parts_1_C*              K2Node_DynamicCast_AsWB_Ui_Brain_Mes_Parts_1_1;    // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15FA[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_BrainMes_Parts_1_C*              K2Node_DynamicCast_AsWB_Ui_Brain_Mes_Parts_1_2;    // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15FB[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetThreadIndex_Index;                     // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsThreadNew_IsNew;                        // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15FC[0x2];                                     // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_index;                          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15FD[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_pWidget_3;                      // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15FE[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_BrainMes_Parts_2_C*              K2Node_DynamicCast_AsWB_Ui_Brain_Mes_Parts_2;      // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15FF[0x3];                                     // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1600[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_pWidget_2;                      // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_BrainMes_Parts_2_C*              K2Node_DynamicCast_AsWB_Ui_Brain_Mes_Parts_2_1;    // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1601[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_pWidget_1;                      // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_BrainMes_Parts_2_C*              K2Node_DynamicCast_AsWB_Ui_Brain_Mes_Parts_2_2;    // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1602[0x3];                                     // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Cursor, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 Index, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0138(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue;              // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x014B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1603[0x3];                                     // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* PWidget)>   K2Node_CreateDelegate_OutputDelegate_7;            // 0x015C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_Event_ThreadID;                             // 0x016C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_cursor;                         // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_pWidget;                        // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1604[0x3];                                     // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUserWidget* PWidget)>   K2Node_CreateDelegate_OutputDelegate_8;            // 0x0184(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_isMouseScroll_1;                      // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index_1;                              // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget_1;                             // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Index, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	class UWB_ui_BrainMes_Parts_1_C*              K2Node_DynamicCast_AsWB_Ui_Brain_Mes_Parts_1_3;    // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1605[0x2];                                     // 0x01C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_isMouseScroll;                        // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1606[0x4];                                     // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_Widget;                               // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_BrainMes_Parts_1_C*              K2Node_DynamicCast_AsWB_Ui_Brain_Mes_Parts_1_4;    // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1607[0x6];                                     // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstanceBP_C*                    CallFunc_GetRSGameInstance_AsRSGame_Instance_BP;   // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUINoticeMessageCallType                      K2Node_CustomEvent_senderType;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1608[0x3];                                     // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_datatableId;                    // 0x01F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1609[0x4];                                     // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserParamManager*                      CallFunc_GetUserParamManager_ReturnValue;          // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBrainMessageParamManager*              CallFunc_GetBrainMessageParamManager_ReturnValue;  // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue;                       // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes) == 0x000008, "Wrong alignment on WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes");
static_assert(sizeof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes) == 0x000218, "Wrong size on WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, EntryPoint) == 0x000000, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_Event_State) == 0x00000C, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_Event_SubState) == 0x000010, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00002C, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000040, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_CustomEvent_index_1) == 0x000044, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_CustomEvent_index_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_CustomEvent_pWidget_6) == 0x000048, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_CustomEvent_pWidget_6' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_DynamicCast_AsWB_Ui_Brain_Mes_Parts_1) == 0x000050, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_DynamicCast_AsWB_Ui_Brain_Mes_Parts_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_CreateDelegate_OutputDelegate_2) == 0x00005C, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_CreateDelegate_OutputDelegate_3) == 0x00006C, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_CreateDelegate_OutputDelegate_4) == 0x00007C, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_CustomEvent_pWidget_5) == 0x000090, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_CustomEvent_pWidget_5' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_CustomEvent_pWidget_4) == 0x000098, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_CustomEvent_pWidget_4' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_DynamicCast_AsWB_Ui_Brain_Mes_Parts_1_1) == 0x0000A0, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_DynamicCast_AsWB_Ui_Brain_Mes_Parts_1_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_DynamicCast_AsWB_Ui_Brain_Mes_Parts_1_2) == 0x0000B0, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_DynamicCast_AsWB_Ui_Brain_Mes_Parts_1_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_DynamicCast_bSuccess_2) == 0x0000B8, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_GetThreadIndex_Index) == 0x0000BC, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_GetThreadIndex_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_IsThreadNew_IsNew) == 0x0000C0, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_IsThreadNew_IsNew' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x0000C1, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x0000C4, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_CustomEvent_index) == 0x0000C8, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_CustomEvent_index' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_CustomEvent_pWidget_3) == 0x0000D0, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_CustomEvent_pWidget_3' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x0000D8, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_DynamicCast_AsWB_Ui_Brain_Mes_Parts_2) == 0x0000E0, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_DynamicCast_AsWB_Ui_Brain_Mes_Parts_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_DynamicCast_bSuccess_3) == 0x0000E8, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x0000EC, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x0000F0, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_CustomEvent_pWidget_2) == 0x0000F8, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_CustomEvent_pWidget_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_DynamicCast_AsWB_Ui_Brain_Mes_Parts_2_1) == 0x000100, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_DynamicCast_AsWB_Ui_Brain_Mes_Parts_2_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_DynamicCast_bSuccess_4) == 0x000108, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x00010C, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_CustomEvent_pWidget_1) == 0x000110, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_CustomEvent_pWidget_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_DynamicCast_AsWB_Ui_Brain_Mes_Parts_2_2) == 0x000118, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_DynamicCast_AsWB_Ui_Brain_Mes_Parts_2_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_DynamicCast_bSuccess_5) == 0x000120, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_Add_FloatFloat_ReturnValue) == 0x000124, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_CreateDelegate_OutputDelegate_5) == 0x000128, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_CreateDelegate_OutputDelegate_6) == 0x000138, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_Event_IsDesignTime) == 0x000148, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_GetPlatformType_ReturnValue) == 0x000149, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x00014A, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00014B, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x00014C, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000150, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x000154, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000158, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_CreateDelegate_OutputDelegate_7) == 0x00015C, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_Event_ThreadID) == 0x00016C, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_Event_ThreadID' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_CustomEvent_cursor) == 0x000174, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_CustomEvent_cursor' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_CustomEvent_pWidget) == 0x000178, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_CustomEvent_pWidget' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000180, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_CreateDelegate_OutputDelegate_8) == 0x000184, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x000194, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_Event_isMouseScroll_1) == 0x000198, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_Event_isMouseScroll_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_Event_index_1) == 0x00019C, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_Event_index_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_Event_Widget_1) == 0x0001A0, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_Event_Widget_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_CreateDelegate_OutputDelegate_9) == 0x0001A8, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_DynamicCast_AsWB_Ui_Brain_Mes_Parts_1_3) == 0x0001B8, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_DynamicCast_AsWB_Ui_Brain_Mes_Parts_1_3' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_DynamicCast_bSuccess_6) == 0x0001C0, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001C1, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_Event_isMouseScroll) == 0x0001C4, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_Event_isMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_Event_index) == 0x0001C8, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_Event_Widget) == 0x0001D0, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_Event_Widget' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_DynamicCast_AsWB_Ui_Brain_Mes_Parts_1_4) == 0x0001D8, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_DynamicCast_AsWB_Ui_Brain_Mes_Parts_1_4' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_DynamicCast_bSuccess_7) == 0x0001E0, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0001E1, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_GetRSGameInstance_AsRSGame_Instance_BP) == 0x0001E8, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_GetRSGameInstance_AsRSGame_Instance_BP' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_CustomEvent_senderType) == 0x0001F0, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_CustomEvent_senderType' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, K2Node_CustomEvent_datatableId) == 0x0001F4, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::K2Node_CustomEvent_datatableId' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_GetUserParamManager_ReturnValue) == 0x000200, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_GetUserParamManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_GetBrainMessageParamManager_ReturnValue) == 0x000208, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_GetBrainMessageParamManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes, CallFunc_PlaySE_ReturnValue) == 0x000210, "Member 'WB_ui_BrainMes_C_ExecuteUbergraph_WB_ui_BrainMes::CallFunc_PlaySE_ReturnValue' has a wrong offset!");

// Function WB_ui_BrainMes.WB_ui_BrainMes_C.Event_Reply2
// 0x000C (0x000C - 0x0000)
struct WB_ui_BrainMes_C_Event_Reply2 final
{
public:
	EUINoticeMessageCallType                      SenderType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_160A[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DatatableId;                                       // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_C_Event_Reply2) == 0x000004, "Wrong alignment on WB_ui_BrainMes_C_Event_Reply2");
static_assert(sizeof(WB_ui_BrainMes_C_Event_Reply2) == 0x00000C, "Wrong size on WB_ui_BrainMes_C_Event_Reply2");
static_assert(offsetof(WB_ui_BrainMes_C_Event_Reply2, SenderType) == 0x000000, "Member 'WB_ui_BrainMes_C_Event_Reply2::SenderType' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_Event_Reply2, DatatableId) == 0x000004, "Member 'WB_ui_BrainMes_C_Event_Reply2::DatatableId' has a wrong offset!");

// Function WB_ui_BrainMes.WB_ui_BrainMes_C.ListUnFocusMouse
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_BrainMes_C_ListUnFocusMouse final
{
public:
	int32                                         IsMouseScroll;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_C_ListUnFocusMouse) == 0x000008, "Wrong alignment on WB_ui_BrainMes_C_ListUnFocusMouse");
static_assert(sizeof(WB_ui_BrainMes_C_ListUnFocusMouse) == 0x000010, "Wrong size on WB_ui_BrainMes_C_ListUnFocusMouse");
static_assert(offsetof(WB_ui_BrainMes_C_ListUnFocusMouse, IsMouseScroll) == 0x000000, "Member 'WB_ui_BrainMes_C_ListUnFocusMouse::IsMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ListUnFocusMouse, Param_Index) == 0x000004, "Member 'WB_ui_BrainMes_C_ListUnFocusMouse::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ListUnFocusMouse, Widget) == 0x000008, "Member 'WB_ui_BrainMes_C_ListUnFocusMouse::Widget' has a wrong offset!");

// Function WB_ui_BrainMes.WB_ui_BrainMes_C.ListFocusMouse
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_BrainMes_C_ListFocusMouse final
{
public:
	int32                                         IsMouseScroll;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_C_ListFocusMouse) == 0x000008, "Wrong alignment on WB_ui_BrainMes_C_ListFocusMouse");
static_assert(sizeof(WB_ui_BrainMes_C_ListFocusMouse) == 0x000010, "Wrong size on WB_ui_BrainMes_C_ListFocusMouse");
static_assert(offsetof(WB_ui_BrainMes_C_ListFocusMouse, IsMouseScroll) == 0x000000, "Member 'WB_ui_BrainMes_C_ListFocusMouse::IsMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ListFocusMouse, Param_Index) == 0x000004, "Member 'WB_ui_BrainMes_C_ListFocusMouse::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_ListFocusMouse, Widget) == 0x000008, "Member 'WB_ui_BrainMes_C_ListFocusMouse::Widget' has a wrong offset!");

// Function WB_ui_BrainMes.WB_ui_BrainMes_C.Þ¦¹g¼UŒ_
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_BrainMes_C____g_U__ final
{
public:
	int32                                         Param_Cursor;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_160B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            PWidget;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_C____g_U__) == 0x000008, "Wrong alignment on WB_ui_BrainMes_C____g_U__");
static_assert(sizeof(WB_ui_BrainMes_C____g_U__) == 0x000010, "Wrong size on WB_ui_BrainMes_C____g_U__");
static_assert(offsetof(WB_ui_BrainMes_C____g_U__, Param_Cursor) == 0x000000, "Member 'WB_ui_BrainMes_C____g_U__::Param_Cursor' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C____g_U__, PWidget) == 0x000008, "Member 'WB_ui_BrainMes_C____g_U__::PWidget' has a wrong offset!");

// Function WB_ui_BrainMes.WB_ui_BrainMes_C.SetDefaultThread
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_BrainMes_C_SetDefaultThread final
{
public:
	class FName                                   ThreadID;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_C_SetDefaultThread) == 0x000004, "Wrong alignment on WB_ui_BrainMes_C_SetDefaultThread");
static_assert(sizeof(WB_ui_BrainMes_C_SetDefaultThread) == 0x000008, "Wrong size on WB_ui_BrainMes_C_SetDefaultThread");
static_assert(offsetof(WB_ui_BrainMes_C_SetDefaultThread, ThreadID) == 0x000000, "Member 'WB_ui_BrainMes_C_SetDefaultThread::ThreadID' has a wrong offset!");

// Function WB_ui_BrainMes.WB_ui_BrainMes_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_BrainMes_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_BrainMes_C_PreConstruct) == 0x000001, "Wrong alignment on WB_ui_BrainMes_C_PreConstruct");
static_assert(sizeof(WB_ui_BrainMes_C_PreConstruct) == 0x000001, "Wrong size on WB_ui_BrainMes_C_PreConstruct");
static_assert(offsetof(WB_ui_BrainMes_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_ui_BrainMes_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_ui_BrainMes.WB_ui_BrainMes_C.Event_UnFocusListMessage
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_BrainMes_C_Event_UnFocusListMessage final
{
public:
	class UUserWidget*                            PWidget;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_C_Event_UnFocusListMessage) == 0x000008, "Wrong alignment on WB_ui_BrainMes_C_Event_UnFocusListMessage");
static_assert(sizeof(WB_ui_BrainMes_C_Event_UnFocusListMessage) == 0x000008, "Wrong size on WB_ui_BrainMes_C_Event_UnFocusListMessage");
static_assert(offsetof(WB_ui_BrainMes_C_Event_UnFocusListMessage, PWidget) == 0x000000, "Member 'WB_ui_BrainMes_C_Event_UnFocusListMessage::PWidget' has a wrong offset!");

// Function WB_ui_BrainMes.WB_ui_BrainMes_C.Event_FocusListMessage
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_BrainMes_C_Event_FocusListMessage final
{
public:
	class UUserWidget*                            PWidget;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_C_Event_FocusListMessage) == 0x000008, "Wrong alignment on WB_ui_BrainMes_C_Event_FocusListMessage");
static_assert(sizeof(WB_ui_BrainMes_C_Event_FocusListMessage) == 0x000008, "Wrong size on WB_ui_BrainMes_C_Event_FocusListMessage");
static_assert(offsetof(WB_ui_BrainMes_C_Event_FocusListMessage, PWidget) == 0x000000, "Member 'WB_ui_BrainMes_C_Event_FocusListMessage::PWidget' has a wrong offset!");

// Function WB_ui_BrainMes.WB_ui_BrainMes_C.Event_UpdateElementListMessage
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_BrainMes_C_Event_UpdateElementListMessage final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_160C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            PWidget;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_C_Event_UpdateElementListMessage) == 0x000008, "Wrong alignment on WB_ui_BrainMes_C_Event_UpdateElementListMessage");
static_assert(sizeof(WB_ui_BrainMes_C_Event_UpdateElementListMessage) == 0x000010, "Wrong size on WB_ui_BrainMes_C_Event_UpdateElementListMessage");
static_assert(offsetof(WB_ui_BrainMes_C_Event_UpdateElementListMessage, Param_Index) == 0x000000, "Member 'WB_ui_BrainMes_C_Event_UpdateElementListMessage::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_Event_UpdateElementListMessage, PWidget) == 0x000008, "Member 'WB_ui_BrainMes_C_Event_UpdateElementListMessage::PWidget' has a wrong offset!");

// Function WB_ui_BrainMes.WB_ui_BrainMes_C.Event_UnFocusListThread
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_BrainMes_C_Event_UnFocusListThread final
{
public:
	class UUserWidget*                            PWidget;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_C_Event_UnFocusListThread) == 0x000008, "Wrong alignment on WB_ui_BrainMes_C_Event_UnFocusListThread");
static_assert(sizeof(WB_ui_BrainMes_C_Event_UnFocusListThread) == 0x000008, "Wrong size on WB_ui_BrainMes_C_Event_UnFocusListThread");
static_assert(offsetof(WB_ui_BrainMes_C_Event_UnFocusListThread, PWidget) == 0x000000, "Member 'WB_ui_BrainMes_C_Event_UnFocusListThread::PWidget' has a wrong offset!");

// Function WB_ui_BrainMes.WB_ui_BrainMes_C.Event_FocusListThread
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_BrainMes_C_Event_FocusListThread final
{
public:
	class UUserWidget*                            PWidget;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_C_Event_FocusListThread) == 0x000008, "Wrong alignment on WB_ui_BrainMes_C_Event_FocusListThread");
static_assert(sizeof(WB_ui_BrainMes_C_Event_FocusListThread) == 0x000008, "Wrong size on WB_ui_BrainMes_C_Event_FocusListThread");
static_assert(offsetof(WB_ui_BrainMes_C_Event_FocusListThread, PWidget) == 0x000000, "Member 'WB_ui_BrainMes_C_Event_FocusListThread::PWidget' has a wrong offset!");

// Function WB_ui_BrainMes.WB_ui_BrainMes_C.Event_UpdateElementListThread
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_BrainMes_C_Event_UpdateElementListThread final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_160D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            PWidget;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_C_Event_UpdateElementListThread) == 0x000008, "Wrong alignment on WB_ui_BrainMes_C_Event_UpdateElementListThread");
static_assert(sizeof(WB_ui_BrainMes_C_Event_UpdateElementListThread) == 0x000010, "Wrong size on WB_ui_BrainMes_C_Event_UpdateElementListThread");
static_assert(offsetof(WB_ui_BrainMes_C_Event_UpdateElementListThread, Param_Index) == 0x000000, "Member 'WB_ui_BrainMes_C_Event_UpdateElementListThread::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_Event_UpdateElementListThread, PWidget) == 0x000008, "Member 'WB_ui_BrainMes_C_Event_UpdateElementListThread::PWidget' has a wrong offset!");

// Function WB_ui_BrainMes.WB_ui_BrainMes_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_BrainMes_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_BrainMes_C_UpdateState");
static_assert(sizeof(WB_ui_BrainMes_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_BrainMes_C_UpdateState");
static_assert(offsetof(WB_ui_BrainMes_C_UpdateState, State) == 0x000000, "Member 'WB_ui_BrainMes_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_BrainMes_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_BrainMes_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_BrainMes.WB_ui_BrainMes_C.StateNone
// 0x0040 (0x0040 - 0x0000)
struct WB_ui_BrainMes_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableReply_IsEnableReply;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_160E[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstanceBP_C*                    CallFunc_GetRSGameInstance_AsRSGame_Instance_BP;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BattleManager_C*                    CallFunc_GetBattleManager_BattleManager;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserParamManager*                      CallFunc_GetUserParamManager_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBattleMode_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_160F[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBrainMessageParamManager*              CallFunc_GetBrainMessageParamManager_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1610[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_C_StateNone) == 0x000008, "Wrong alignment on WB_ui_BrainMes_C_StateNone");
static_assert(sizeof(WB_ui_BrainMes_C_StateNone) == 0x000040, "Wrong size on WB_ui_BrainMes_C_StateNone");
static_assert(offsetof(WB_ui_BrainMes_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_BrainMes_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_BrainMes_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_StateNone, CallFunc_IsEnableReply_IsEnableReply) == 0x000005, "Member 'WB_ui_BrainMes_C_StateNone::CallFunc_IsEnableReply_IsEnableReply' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_StateNone, CallFunc_GetRSGameInstance_AsRSGame_Instance_BP) == 0x000008, "Member 'WB_ui_BrainMes_C_StateNone::CallFunc_GetRSGameInstance_AsRSGame_Instance_BP' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_StateNone, CallFunc_GetBattleManager_BattleManager) == 0x000010, "Member 'WB_ui_BrainMes_C_StateNone::CallFunc_GetBattleManager_BattleManager' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_StateNone, CallFunc_GetUserParamManager_ReturnValue) == 0x000018, "Member 'WB_ui_BrainMes_C_StateNone::CallFunc_GetUserParamManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_StateNone, CallFunc_IsBattleMode_ReturnValue) == 0x000020, "Member 'WB_ui_BrainMes_C_StateNone::CallFunc_IsBattleMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_StateNone, CallFunc_GetBrainMessageParamManager_ReturnValue) == 0x000028, "Member 'WB_ui_BrainMes_C_StateNone::CallFunc_GetBrainMessageParamManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000030, "Member 'WB_ui_BrainMes_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000031, "Member 'WB_ui_BrainMes_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000034, "Member 'WB_ui_BrainMes_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000038, "Member 'WB_ui_BrainMes_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_BrainMes.WB_ui_BrainMes_C.StateOpen
// 0x000C (0x000C - 0x0000)
struct WB_ui_BrainMes_C_StateOpen final
{
public:
