#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_TownName

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_TownName.WB_ui_TownName_C
// 0x00C8 (0x04A8 - 0x03E0)
class UWB_ui_TownName_C final : public UUITownName
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 bg_grid01_mask;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 bg_grid02;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 bg_grid_add_line01;                                // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 bg_grid_add_line02;                                // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 bg_grid_waku01;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 bg_grid_waku02;                                    // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 bg_grid_waku03;                                    // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Blue;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Green;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Red;                                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDRetainerBox*                        CA_RetainerBox_1;                                  // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ghost1;                                            // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NameDot01;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NameDot02;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NameLine;                                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NameLine_glow;                                     // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Town_location_01;                             // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Town_location_02;                             // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Town_location_03;                             // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Town_location_04;                             // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_TownName(int32 EntryPoint);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void UpdateTownNameGridMaterial();
	void UpdateTownNameOutlineMaterial();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_TownName_C">();
	}
	static class UWB_ui_TownName_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_TownName_C>();
	}
};
static_assert(alignof(UWB_ui_TownName_C) == 0x000008, "Wrong alignment on UWB_ui_TownName_C");
static_assert(sizeof(UWB_ui_TownName_C) == 0x0004A8, "Wrong size on UWB_ui_TownName_C");
static_assert(offsetof(UWB_ui_TownName_C, UberGraphFrame) == 0x0003E0, "Member 'UWB_ui_TownName_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_TownName_C, Out) == 0x0003E8, "Member 'UWB_ui_TownName_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_TownName_C, In) == 0x0003F0, "Member 'UWB_ui_TownName_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_TownName_C, Default_none) == 0x0003F8, "Member 'UWB_ui_TownName_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_TownName_C, Default) == 0x000400, "Member 'UWB_ui_TownName_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_TownName_C, bg_grid01_mask) == 0x000408, "Member 'UWB_ui_TownName_C::bg_grid01_mask' has a wrong offset!");
static_assert(offsetof(UWB_ui_TownName_C, bg_grid02) == 0x000410, "Member 'UWB_ui_TownName_C::bg_grid02' has a wrong offset!");
static_assert(offsetof(UWB_ui_TownName_C, bg_grid_add_line01) == 0x000418, "Member 'UWB_ui_TownName_C::bg_grid_add_line01' has a wrong offset!");
static_assert(offsetof(UWB_ui_TownName_C, bg_grid_add_line02) == 0x000420, "Member 'UWB_ui_TownName_C::bg_grid_add_line02' has a wrong offset!");
static_assert(offsetof(UWB_ui_TownName_C, bg_grid_waku01) == 0x000428, "Member 'UWB_ui_TownName_C::bg_grid_waku01' has a wrong offset!");
static_assert(offsetof(UWB_ui_TownName_C, bg_grid_waku02) == 0x000430, "Member 'UWB_ui_TownName_C::bg_grid_waku02' has a wrong offset!");
static_assert(offsetof(UWB_ui_TownName_C, bg_grid_waku03) == 0x000438, "Member 'UWB_ui_TownName_C::bg_grid_waku03' has a wrong offset!");
static_assert(offsetof(UWB_ui_TownName_C, CA_Image_Blue) == 0x000440, "Member 'UWB_ui_TownName_C::CA_Image_Blue' has a wrong offset!");
static_assert(offsetof(UWB_ui_TownName_C, CA_Image_Green) == 0x000448, "Member 'UWB_ui_TownName_C::CA_Image_Green' has a wrong offset!");
static_assert(offsetof(UWB_ui_TownName_C, CA_Image_Red) == 0x000450, "Member 'UWB_ui_TownName_C::CA_Image_Red' has a wrong offset!");
static_assert(offsetof(UWB_ui_TownName_C, CA_RetainerBox_1) == 0x000458, "Member 'UWB_ui_TownName_C::CA_RetainerBox_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_TownName_C, Ghost1) == 0x000460, "Member 'UWB_ui_TownName_C::Ghost1' has a wrong offset!");
static_assert(offsetof(UWB_ui_TownName_C, NameDot01) == 0x000468, "Member 'UWB_ui_TownName_C::NameDot01' has a wrong offset!");
static_assert(offsetof(UWB_ui_TownName_C, NameDot02) == 0x000470, "Member 'UWB_ui_TownName_C::NameDot02' has a wrong offset!");
static_assert(offsetof(UWB_ui_TownName_C, NameLine) == 0x000478, "Member 'UWB_ui_TownName_C::NameLine' has a wrong offset!");
static_assert(offsetof(UWB_ui_TownName_C, NameLine_glow) == 0x000480, "Member 'UWB_ui_TownName_C::NameLine_glow' has a wrong offset!");
static_assert(offsetof(UWB_ui_TownName_C, Text_Town_location_01) == 0x000488, "Member 'UWB_ui_TownName_C::Text_Town_location_01' has a wrong offset!");
static_assert(offsetof(UWB_ui_TownName_C, Text_Town_location_02) == 0x000490, "Member 'UWB_ui_TownName_C::Text_Town_location_02' has a wrong offset!");
static_assert(offsetof(UWB_ui_TownName_C, Text_Town_location_03) == 0x000498, "Member 'UWB_ui_TownName_C::Text_Town_location_03' has a wrong offset!");
static_assert(offsetof(UWB_ui_TownName_C, Text_Town_location_04) == 0x0004A0, "Member 'UWB_ui_TownName_C::Text_Town_location_04' has a wrong offset!");

}

