#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Parts_minimap_distance_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Parts_minimap_distance_1.WB_ui_Parts_minimap_distance_1_C
// 0x0038 (0x03E8 - 0x03B0)
class UWB_ui_Parts_minimap_distance_1_C final : public UUIMinimapDistance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default_red;                                       // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base;                                              // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_minimap_distance_1;                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_minimap_distance_2;                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Parts_minimap_distance_1(int32 EntryPoint);
	void SetThumbnail(EUIMinmapDistanceIcon Param_Icon);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Parts_minimap_distance_1_C">();
	}
	static class UWB_ui_Parts_minimap_distance_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Parts_minimap_distance_1_C>();
	}
};
static_assert(alignof(UWB_ui_Parts_minimap_distance_1_C) == 0x000008, "Wrong alignment on UWB_ui_Parts_minimap_distance_1_C");
static_assert(sizeof(UWB_ui_Parts_minimap_distance_1_C) == 0x0003E8, "Wrong size on UWB_ui_Parts_minimap_distance_1_C");
static_assert(offsetof(UWB_ui_Parts_minimap_distance_1_C, UberGraphFrame) == 0x0003B0, "Member 'UWB_ui_Parts_minimap_distance_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Parts_minimap_distance_1_C, Default_red) == 0x0003B8, "Member 'UWB_ui_Parts_minimap_distance_1_C::Default_red' has a wrong offset!");
static_assert(offsetof(UWB_ui_Parts_minimap_distance_1_C, Default) == 0x0003C0, "Member 'UWB_ui_Parts_minimap_distance_1_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Parts_minimap_distance_1_C, Base) == 0x0003C8, "Member 'UWB_ui_Parts_minimap_distance_1_C::Base' has a wrong offset!");
static_assert(offsetof(UWB_ui_Parts_minimap_distance_1_C, Icon) == 0x0003D0, "Member 'UWB_ui_Parts_minimap_distance_1_C::Icon' has a wrong offset!");
static_assert(offsetof(UWB_ui_Parts_minimap_distance_1_C, Text_minimap_distance_1) == 0x0003D8, "Member 'UWB_ui_Parts_minimap_distance_1_C::Text_minimap_distance_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Parts_minimap_distance_1_C, Text_minimap_distance_2) == 0x0003E0, "Member 'UWB_ui_Parts_minimap_distance_1_C::Text_minimap_distance_2' has a wrong offset!");

}

