#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_ConfigList_Parts_2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_ConfigList_Parts_2.WB_ui_ConfigList_Parts_2_C
// 0x0088 (0x0578 - 0x04F0)
class UWB_ui_ConfigList_Parts_2_C final : public UUIConfigSelect2
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Select_out;                                        // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_in;                                         // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select;                                            // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_1;                                            // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_1;                                           // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDHorizonFlipbookWidget*              PF_Arrow_L;                                        // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDHorizonFlipbookWidget*              PF_Arrow_R;                                        // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_config_list_1;                                // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Config_Parts_1_C*                WB_ui_Config_Parts_1_1;                            // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Config_Parts_1_C*                WB_ui_Config_Parts_1_2;                            // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPaperFlipbook*                         DefaultPF;                                         // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperFlipbook*                         SelectPF;                                          // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperFlipbook*                         SelectInPF;                                        // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperFlipbook*                         SelectOutPF;                                       // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperFlipbook*                         DecisionPF;                                        // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_ConfigList_Parts_2(int32 EntryPoint);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_ConfigList_Parts_2_C">();
	}
	static class UWB_ui_ConfigList_Parts_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_ConfigList_Parts_2_C>();
	}
};
static_assert(alignof(UWB_ui_ConfigList_Parts_2_C) == 0x000008, "Wrong alignment on UWB_ui_ConfigList_Parts_2_C");
static_assert(sizeof(UWB_ui_ConfigList_Parts_2_C) == 0x000578, "Wrong size on UWB_ui_ConfigList_Parts_2_C");
static_assert(offsetof(UWB_ui_ConfigList_Parts_2_C, UberGraphFrame) == 0x0004F0, "Member 'UWB_ui_ConfigList_Parts_2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_ConfigList_Parts_2_C, Select_out) == 0x0004F8, "Member 'UWB_ui_ConfigList_Parts_2_C::Select_out' has a wrong offset!");
static_assert(offsetof(UWB_ui_ConfigList_Parts_2_C, Select_in) == 0x000500, "Member 'UWB_ui_ConfigList_Parts_2_C::Select_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_ConfigList_Parts_2_C, Select) == 0x000508, "Member 'UWB_ui_ConfigList_Parts_2_C::Select' has a wrong offset!");
static_assert(offsetof(UWB_ui_ConfigList_Parts_2_C, Default) == 0x000510, "Member 'UWB_ui_ConfigList_Parts_2_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_ConfigList_Parts_2_C, Base_1) == 0x000518, "Member 'UWB_ui_ConfigList_Parts_2_C::Base_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_ConfigList_Parts_2_C, Frame_1) == 0x000520, "Member 'UWB_ui_ConfigList_Parts_2_C::Frame_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_ConfigList_Parts_2_C, PF_Arrow_L) == 0x000528, "Member 'UWB_ui_ConfigList_Parts_2_C::PF_Arrow_L' has a wrong offset!");
static_assert(offsetof(UWB_ui_ConfigList_Parts_2_C, PF_Arrow_R) == 0x000530, "Member 'UWB_ui_ConfigList_Parts_2_C::PF_Arrow_R' has a wrong offset!");
static_assert(offsetof(UWB_ui_ConfigList_Parts_2_C, Text_config_list_1) == 0x000538, "Member 'UWB_ui_ConfigList_Parts_2_C::Text_config_list_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_ConfigList_Parts_2_C, WB_ui_Config_Parts_1_1) == 0x000540, "Member 'UWB_ui_ConfigList_Parts_2_C::WB_ui_Config_Parts_1_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_ConfigList_Parts_2_C, WB_ui_Config_Parts_1_2) == 0x000548, "Member 'UWB_ui_ConfigList_Parts_2_C::WB_ui_Config_Parts_1_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_ConfigList_Parts_2_C, DefaultPF) == 0x000550, "Member 'UWB_ui_ConfigList_Parts_2_C::DefaultPF' has a wrong offset!");
static_assert(offsetof(UWB_ui_ConfigList_Parts_2_C, SelectPF) == 0x000558, "Member 'UWB_ui_ConfigList_Parts_2_C::SelectPF' has a wrong offset!");
static_assert(offsetof(UWB_ui_ConfigList_Parts_2_C, SelectInPF) == 0x000560, "Member 'UWB_ui_ConfigList_Parts_2_C::SelectInPF' has a wrong offset!");
static_assert(offsetof(UWB_ui_ConfigList_Parts_2_C, SelectOutPF) == 0x000568, "Member 'UWB_ui_ConfigList_Parts_2_C::SelectOutPF' has a wrong offset!");
static_assert(offsetof(UWB_ui_ConfigList_Parts_2_C, DecisionPF) == 0x000570, "Member 'UWB_ui_ConfigList_Parts_2_C::DecisionPF' has a wrong offset!");

}

