#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_NexusDrive_pl_02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_NexusDrive_pl_02.WB_ui_NexusDrive_pl_02_C
// 0x0068 (0x0448 - 0x03E0)
class UWB_ui_NexusDrive_pl_02_C final : public UUINexusDrive
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Change_2;                                          // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out_2;                                             // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_2;                                              // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_2;                                         // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_1;                                          // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out_1;                                             // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_1;                                              // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_1;                                         // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 base_c;                                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_L;                                            // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_R;                                            // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_nexusdrive_02;                                // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_NexusDrive_pl_02(int32 EntryPoint);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void OnInitialized();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_NexusDrive_pl_02_C">();
	}
	static class UWB_ui_NexusDrive_pl_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_NexusDrive_pl_02_C>();
	}
};
static_assert(alignof(UWB_ui_NexusDrive_pl_02_C) == 0x000008, "Wrong alignment on UWB_ui_NexusDrive_pl_02_C");
static_assert(sizeof(UWB_ui_NexusDrive_pl_02_C) == 0x000448, "Wrong size on UWB_ui_NexusDrive_pl_02_C");
static_assert(offsetof(UWB_ui_NexusDrive_pl_02_C, UberGraphFrame) == 0x0003E0, "Member 'UWB_ui_NexusDrive_pl_02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_NexusDrive_pl_02_C, Change_2) == 0x0003E8, "Member 'UWB_ui_NexusDrive_pl_02_C::Change_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_NexusDrive_pl_02_C, Out_2) == 0x0003F0, "Member 'UWB_ui_NexusDrive_pl_02_C::Out_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_NexusDrive_pl_02_C, In_2) == 0x0003F8, "Member 'UWB_ui_NexusDrive_pl_02_C::In_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_NexusDrive_pl_02_C, Default_2) == 0x000400, "Member 'UWB_ui_NexusDrive_pl_02_C::Default_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_NexusDrive_pl_02_C, Change_1) == 0x000408, "Member 'UWB_ui_NexusDrive_pl_02_C::Change_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_NexusDrive_pl_02_C, Out_1) == 0x000410, "Member 'UWB_ui_NexusDrive_pl_02_C::Out_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_NexusDrive_pl_02_C, In_1) == 0x000418, "Member 'UWB_ui_NexusDrive_pl_02_C::In_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_NexusDrive_pl_02_C, Default_1) == 0x000420, "Member 'UWB_ui_NexusDrive_pl_02_C::Default_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_NexusDrive_pl_02_C, base_c) == 0x000428, "Member 'UWB_ui_NexusDrive_pl_02_C::base_c' has a wrong offset!");
static_assert(offsetof(UWB_ui_NexusDrive_pl_02_C, Base_L) == 0x000430, "Member 'UWB_ui_NexusDrive_pl_02_C::Base_L' has a wrong offset!");
static_assert(offsetof(UWB_ui_NexusDrive_pl_02_C, Base_R) == 0x000438, "Member 'UWB_ui_NexusDrive_pl_02_C::Base_R' has a wrong offset!");
static_assert(offsetof(UWB_ui_NexusDrive_pl_02_C, Text_nexusdrive_02) == 0x000440, "Member 'UWB_ui_NexusDrive_pl_02_C::Text_nexusdrive_02' has a wrong offset!");

}

