#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_GameOver

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_ui_GameOver.WB_ui_GameOver_C.ExecuteUbergraph_WB_ui_GameOver
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_GameOver_C_ExecuteUbergraph_WB_ui_GameOver final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_GameOver_C_ExecuteUbergraph_WB_ui_GameOver) == 0x000004, "Wrong alignment on WB_ui_GameOver_C_ExecuteUbergraph_WB_ui_GameOver");
static_assert(sizeof(WB_ui_GameOver_C_ExecuteUbergraph_WB_ui_GameOver) == 0x000010, "Wrong size on WB_ui_GameOver_C_ExecuteUbergraph_WB_ui_GameOver");
static_assert(offsetof(WB_ui_GameOver_C_ExecuteUbergraph_WB_ui_GameOver, EntryPoint) == 0x000000, "Member 'WB_ui_GameOver_C_ExecuteUbergraph_WB_ui_GameOver::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_GameOver_C_ExecuteUbergraph_WB_ui_GameOver, K2Node_Event_State) == 0x000004, "Member 'WB_ui_GameOver_C_ExecuteUbergraph_WB_ui_GameOver::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_GameOver_C_ExecuteUbergraph_WB_ui_GameOver, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_GameOver_C_ExecuteUbergraph_WB_ui_GameOver::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_GameOver_C_ExecuteUbergraph_WB_ui_GameOver, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_GameOver_C_ExecuteUbergraph_WB_ui_GameOver::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function WB_ui_GameOver.WB_ui_GameOver_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_GameOver_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_GameOver_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_GameOver_C_UpdateState");
static_assert(sizeof(WB_ui_GameOver_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_GameOver_C_UpdateState");
static_assert(offsetof(WB_ui_GameOver_C_UpdateState, State) == 0x000000, "Member 'WB_ui_GameOver_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_GameOver_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_GameOver_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_GameOver_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_GameOver_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_GameOver.WB_ui_GameOver_C.getTargetBossID
// 0x0058 (0x0058 - 0x0000)
struct WB_ui_GameOver_C_GetTargetBossID final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_663D[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      CallFunc_GetMainPlayer_Player;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARsBattleHero_C*                        K2Node_DynamicCast_AsRs_Battle_Hero;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_663E[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetTargetBoss_LockBoss;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_663F[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       K2Node_DynamicCast_AsRSCharacter_Base;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6640[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetName_ReturnValue;                      // 0x004C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_GameOver_C_GetTargetBossID) == 0x000008, "Wrong alignment on WB_ui_GameOver_C_GetTargetBossID");
static_assert(sizeof(WB_ui_GameOver_C_GetTargetBossID) == 0x000058, "Wrong size on WB_ui_GameOver_C_GetTargetBossID");
static_assert(offsetof(WB_ui_GameOver_C_GetTargetBossID, ReturnValue) == 0x000000, "Member 'WB_ui_GameOver_C_GetTargetBossID::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_GameOver_C_GetTargetBossID, CallFunc_GetPlayerManager_PlayerManager) == 0x000008, "Member 'WB_ui_GameOver_C_GetTargetBossID::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(WB_ui_GameOver_C_GetTargetBossID, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WB_ui_GameOver_C_GetTargetBossID::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_GameOver_C_GetTargetBossID, CallFunc_GetMainPlayer_Player) == 0x000018, "Member 'WB_ui_GameOver_C_GetTargetBossID::CallFunc_GetMainPlayer_Player' has a wrong offset!");
static_assert(offsetof(WB_ui_GameOver_C_GetTargetBossID, K2Node_DynamicCast_AsRs_Battle_Hero) == 0x000020, "Member 'WB_ui_GameOver_C_GetTargetBossID::K2Node_DynamicCast_AsRs_Battle_Hero' has a wrong offset!");
static_assert(offsetof(WB_ui_GameOver_C_GetTargetBossID, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WB_ui_GameOver_C_GetTargetBossID::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_GameOver_C_GetTargetBossID, CallFunc_GetTargetBoss_LockBoss) == 0x000030, "Member 'WB_ui_GameOver_C_GetTargetBossID::CallFunc_GetTargetBoss_LockBoss' has a wrong offset!");
static_assert(offsetof(WB_ui_GameOver_C_GetTargetBossID, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'WB_ui_GameOver_C_GetTargetBossID::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_GameOver_C_GetTargetBossID, K2Node_DynamicCast_AsRSCharacter_Base) == 0x000040, "Member 'WB_ui_GameOver_C_GetTargetBossID::K2Node_DynamicCast_AsRSCharacter_Base' has a wrong offset!");
static_assert(offsetof(WB_ui_GameOver_C_GetTargetBossID, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'WB_ui_GameOver_C_GetTargetBossID::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_ui_GameOver_C_GetTargetBossID, CallFunc_GetName_ReturnValue) == 0x00004C, "Member 'WB_ui_GameOver_C_GetTargetBossID::CallFunc_GetName_ReturnValue' has a wrong offset!");

}

