#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Intercept_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Intercept_1.WB_ui_Intercept_1_C
// 0x00C8 (0x0450 - 0x0388)
class UWB_ui_Intercept_1_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default_none;                                      // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Button_base_1;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Blue;                                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Green;                                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Red;                                      // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDRetainerBox*                        CA_RetainerBox;                                    // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_1;                                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff;                                               // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Frame;                                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_;                                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Base;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Grow_1;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Intercept_icon_font;                               // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_1;                                            // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_2;                                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Name_grow_1;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise;                                             // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Size_add;                                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_add;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Symbol_Battle_intercept;                           // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Battle_Intercept_1;                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPsychicObjectUniqueInputButton               Button;                                            // 0x0444(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F72[0x3];                                     // 0x0445(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              baseOffset;                                        // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Intercept_1(int32 EntryPoint);
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void StateNone(int32 SubState);
	void StateLoop(int32 SubState);
	void SetButton(EPsychicObjectUniqueInputButton Param_Button);
	void UpdateButton();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Intercept_1_C">();
	}
	static class UWB_ui_Intercept_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Intercept_1_C>();
	}
};
static_assert(alignof(UWB_ui_Intercept_1_C) == 0x000008, "Wrong alignment on UWB_ui_Intercept_1_C");
static_assert(sizeof(UWB_ui_Intercept_1_C) == 0x000450, "Wrong size on UWB_ui_Intercept_1_C");
static_assert(offsetof(UWB_ui_Intercept_1_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_Intercept_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, Default_none) == 0x000390, "Member 'UWB_ui_Intercept_1_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, Default) == 0x000398, "Member 'UWB_ui_Intercept_1_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, Button_base_1) == 0x0003A0, "Member 'UWB_ui_Intercept_1_C::Button_base_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, CA_Image_Blue) == 0x0003A8, "Member 'UWB_ui_Intercept_1_C::CA_Image_Blue' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, CA_Image_Green) == 0x0003B0, "Member 'UWB_ui_Intercept_1_C::CA_Image_Green' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, CA_Image_Red) == 0x0003B8, "Member 'UWB_ui_Intercept_1_C::CA_Image_Red' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, CA_RetainerBox) == 0x0003C0, "Member 'UWB_ui_Intercept_1_C::CA_RetainerBox' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, Dot_1) == 0x0003C8, "Member 'UWB_ui_Intercept_1_C::Dot_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, Eff) == 0x0003D0, "Member 'UWB_ui_Intercept_1_C::Eff' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, Frame) == 0x0003D8, "Member 'UWB_ui_Intercept_1_C::Frame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, Frame_) == 0x0003E0, "Member 'UWB_ui_Intercept_1_C::Frame_' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, Frame_Base) == 0x0003E8, "Member 'UWB_ui_Intercept_1_C::Frame_Base' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, Frame_Grow_1) == 0x0003F0, "Member 'UWB_ui_Intercept_1_C::Frame_Grow_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, Intercept_icon_font) == 0x0003F8, "Member 'UWB_ui_Intercept_1_C::Intercept_icon_font' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, Line_1) == 0x000400, "Member 'UWB_ui_Intercept_1_C::Line_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, Line_2) == 0x000408, "Member 'UWB_ui_Intercept_1_C::Line_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, Name_grow_1) == 0x000410, "Member 'UWB_ui_Intercept_1_C::Name_grow_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, Noise) == 0x000418, "Member 'UWB_ui_Intercept_1_C::Noise' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, Size_add) == 0x000420, "Member 'UWB_ui_Intercept_1_C::Size_add' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, SizeBox_add) == 0x000428, "Member 'UWB_ui_Intercept_1_C::SizeBox_add' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, Symbol_Battle_intercept) == 0x000430, "Member 'UWB_ui_Intercept_1_C::Symbol_Battle_intercept' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, Text_Battle_Intercept_1) == 0x000438, "Member 'UWB_ui_Intercept_1_C::Text_Battle_Intercept_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, ButtonIndex) == 0x000440, "Member 'UWB_ui_Intercept_1_C::ButtonIndex' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, Button) == 0x000444, "Member 'UWB_ui_Intercept_1_C::Button' has a wrong offset!");
static_assert(offsetof(UWB_ui_Intercept_1_C, baseOffset) == 0x000448, "Member 'UWB_ui_Intercept_1_C::baseOffset' has a wrong offset!");

}

