#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Graphic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Graphic.WB_ui_Graphic_C
// 0x0068 (0x0480 - 0x0418)
class UWB_ui_Graphic_C final : public UUIConfigGraphics
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default;                                           // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                All_Color;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_ViewRange;                             // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDScrollBoxSimple*                    REDScrollBoxSimple_0;                              // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_1_C*            WB_ui_ConfigList_Parts_1_1;                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_1_C*            WB_ui_ConfigList_Parts_1_2;                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_1_C*            WB_ui_ConfigList_Parts_1_3;                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_1_C*            WB_ui_ConfigList_Parts_1_4;                        // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_1_C*            WB_ui_ConfigList_Parts_1_5;                        // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_1_C*            WB_ui_ConfigList_Parts_1_6;                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_2_C*            WB_ui_ConfigList_Parts_2_1;                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_3_C*            WB_ui_ConfigList_Parts_3_1;                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Graphic(int32 EntryPoint);
	void Construct();
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Graphic_C">();
	}
	static class UWB_ui_Graphic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Graphic_C>();
	}
};
static_assert(alignof(UWB_ui_Graphic_C) == 0x000008, "Wrong alignment on UWB_ui_Graphic_C");
static_assert(sizeof(UWB_ui_Graphic_C) == 0x000480, "Wrong size on UWB_ui_Graphic_C");
static_assert(offsetof(UWB_ui_Graphic_C, UberGraphFrame) == 0x000418, "Member 'UWB_ui_Graphic_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Graphic_C, Default) == 0x000420, "Member 'UWB_ui_Graphic_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Graphic_C, All_Color) == 0x000428, "Member 'UWB_ui_Graphic_C::All_Color' has a wrong offset!");
static_assert(offsetof(UWB_ui_Graphic_C, CanvasPanel_ViewRange) == 0x000430, "Member 'UWB_ui_Graphic_C::CanvasPanel_ViewRange' has a wrong offset!");
static_assert(offsetof(UWB_ui_Graphic_C, REDScrollBoxSimple_0) == 0x000438, "Member 'UWB_ui_Graphic_C::REDScrollBoxSimple_0' has a wrong offset!");
static_assert(offsetof(UWB_ui_Graphic_C, WB_ui_ConfigList_Parts_1_1) == 0x000440, "Member 'UWB_ui_Graphic_C::WB_ui_ConfigList_Parts_1_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Graphic_C, WB_ui_ConfigList_Parts_1_2) == 0x000448, "Member 'UWB_ui_Graphic_C::WB_ui_ConfigList_Parts_1_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Graphic_C, WB_ui_ConfigList_Parts_1_3) == 0x000450, "Member 'UWB_ui_Graphic_C::WB_ui_ConfigList_Parts_1_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Graphic_C, WB_ui_ConfigList_Parts_1_4) == 0x000458, "Member 'UWB_ui_Graphic_C::WB_ui_ConfigList_Parts_1_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Graphic_C, WB_ui_ConfigList_Parts_1_5) == 0x000460, "Member 'UWB_ui_Graphic_C::WB_ui_ConfigList_Parts_1_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Graphic_C, WB_ui_ConfigList_Parts_1_6) == 0x000468, "Member 'UWB_ui_Graphic_C::WB_ui_ConfigList_Parts_1_6' has a wrong offset!");
static_assert(offsetof(UWB_ui_Graphic_C, WB_ui_ConfigList_Parts_2_1) == 0x000470, "Member 'UWB_ui_Graphic_C::WB_ui_ConfigList_Parts_2_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Graphic_C, WB_ui_ConfigList_Parts_3_1) == 0x000478, "Member 'UWB_ui_Graphic_C::WB_ui_ConfigList_Parts_3_1' has a wrong offset!");

}

