#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Chara_Info_Parts_2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Chara_Info_Parts_2.WB_ui_Chara_Info_Parts_2_C
// 0x00C8 (0x0530 - 0x0468)
class UWB_ui_Chara_Info_Parts_2_C final : public UUICharaPresentWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0468(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               All;                                               // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               All_Set;                                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_ViewRange;                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Face_a2;                                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_E;                                            // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font;                                         // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_item;                                         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_rarity;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Item_icon_frame_1;                                 // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDScrollBox*                          RedScrollBox_PresentName;                          // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_books_chara_1;                                // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_books_chara_3;                                // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_books_chara_1_num;                            // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_books_chara_2_num;                            // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_books_chara_4_num;                            // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_books_chara_contents_1;                       // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_books_chara_iteminfo_1;                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_books_chara_iteminfo_2;                       // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_books_chara_iteminfo_3;                       // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Text_color_chara_1_num;                            // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Text_color_chara_2_num;                            // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thubnail_Present;                                  // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Chara_Info_Parts_3_C*            WB_ui_Chara_Info_Parts_3;                          // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Guide_C*                         WB_ui_Guide;                                       // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Chara_Info_Parts_2(int32 EntryPoint);
	void OnInitialized();
	void ListUnFocusMouse(int32 IsMouseScroll, int32 Param_Index, class UUserWidget* Widget);
	void ListFocusMouse(int32 IsMouseScroll, int32 Param_Index, class UUserWidget* Widget);
	void ListUnFocus(class UUserWidget* Widget);
	void ListFocus(class UUserWidget* Widget);
	void ListUpdateElement(int32 Param_Index, class UUserWidget* Widget);
	void Construct();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	bool SetFavorabilityIcon(EItemFavorability Favorability);
	bool SetFaceIcon(EPlayerID CharacterId);
	bool SetItemInfo(const class FName& ItemId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Chara_Info_Parts_2_C">();
	}
	static class UWB_ui_Chara_Info_Parts_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Chara_Info_Parts_2_C>();
	}
};
static_assert(alignof(UWB_ui_Chara_Info_Parts_2_C) == 0x000008, "Wrong alignment on UWB_ui_Chara_Info_Parts_2_C");
static_assert(sizeof(UWB_ui_Chara_Info_Parts_2_C) == 0x000530, "Wrong size on UWB_ui_Chara_Info_Parts_2_C");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, UberGraphFrame) == 0x000468, "Member 'UWB_ui_Chara_Info_Parts_2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, All) == 0x000470, "Member 'UWB_ui_Chara_Info_Parts_2_C::All' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, All_Set) == 0x000478, "Member 'UWB_ui_Chara_Info_Parts_2_C::All_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, CanvasPanel_ViewRange) == 0x000480, "Member 'UWB_ui_Chara_Info_Parts_2_C::CanvasPanel_ViewRange' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, Face_a2) == 0x000488, "Member 'UWB_ui_Chara_Info_Parts_2_C::Face_a2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, Icon_E) == 0x000490, "Member 'UWB_ui_Chara_Info_Parts_2_C::Icon_E' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, Icon_font) == 0x000498, "Member 'UWB_ui_Chara_Info_Parts_2_C::Icon_font' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, Icon_item) == 0x0004A0, "Member 'UWB_ui_Chara_Info_Parts_2_C::Icon_item' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, Icon_rarity) == 0x0004A8, "Member 'UWB_ui_Chara_Info_Parts_2_C::Icon_rarity' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, Item_icon_frame_1) == 0x0004B0, "Member 'UWB_ui_Chara_Info_Parts_2_C::Item_icon_frame_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, RedScrollBox_PresentName) == 0x0004B8, "Member 'UWB_ui_Chara_Info_Parts_2_C::RedScrollBox_PresentName' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, Text_books_chara_1) == 0x0004C0, "Member 'UWB_ui_Chara_Info_Parts_2_C::Text_books_chara_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, Text_books_chara_3) == 0x0004C8, "Member 'UWB_ui_Chara_Info_Parts_2_C::Text_books_chara_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, Text_books_chara_1_num) == 0x0004D0, "Member 'UWB_ui_Chara_Info_Parts_2_C::Text_books_chara_1_num' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, Text_books_chara_2_num) == 0x0004D8, "Member 'UWB_ui_Chara_Info_Parts_2_C::Text_books_chara_2_num' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, Text_books_chara_4_num) == 0x0004E0, "Member 'UWB_ui_Chara_Info_Parts_2_C::Text_books_chara_4_num' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, Text_books_chara_contents_1) == 0x0004E8, "Member 'UWB_ui_Chara_Info_Parts_2_C::Text_books_chara_contents_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, Text_books_chara_iteminfo_1) == 0x0004F0, "Member 'UWB_ui_Chara_Info_Parts_2_C::Text_books_chara_iteminfo_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, Text_books_chara_iteminfo_2) == 0x0004F8, "Member 'UWB_ui_Chara_Info_Parts_2_C::Text_books_chara_iteminfo_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, Text_books_chara_iteminfo_3) == 0x000500, "Member 'UWB_ui_Chara_Info_Parts_2_C::Text_books_chara_iteminfo_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, Text_color_chara_1_num) == 0x000508, "Member 'UWB_ui_Chara_Info_Parts_2_C::Text_color_chara_1_num' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, Text_color_chara_2_num) == 0x000510, "Member 'UWB_ui_Chara_Info_Parts_2_C::Text_color_chara_2_num' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, Thubnail_Present) == 0x000518, "Member 'UWB_ui_Chara_Info_Parts_2_C::Thubnail_Present' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, WB_ui_Chara_Info_Parts_3) == 0x000520, "Member 'UWB_ui_Chara_Info_Parts_2_C::WB_ui_Chara_Info_Parts_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_Info_Parts_2_C, WB_ui_Guide) == 0x000528, "Member 'UWB_ui_Chara_Info_Parts_2_C::WB_ui_Guide' has a wrong offset!");

}

