#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_TutoTips_Parts_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_TutoTips_Parts_1.WB_ui_TutoTips_Parts_1_C
// 0x0078 (0x04C8 - 0x0450)
class UWB_ui_TutoTips_Parts_1_C final : public UUITutoTipsParts
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default_none;                                      // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_2;                                         // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_1;                                         // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Text_info_set;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_tutorial_body_1;                              // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_tutorial_page_1_num;                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_tutorial_page_2_num;                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_tutorial_slash_1;                             // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_tutorial_title_1;                             // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thubnail_Base;                                     // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thubnail_Frame;                                    // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thubnail_Shade;                                    // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Tutorial_Image_1;                                  // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_TutoTips_Parts_1(int32 EntryPoint);
	void StopMovieForce();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void Destruct();
	bool IsMovieStop();
	void StateMovie(int32 SubState);
	void StatePicture(int32 SubState);
	bool InitializeMovie();
	bool IsPlayMovie();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_TutoTips_Parts_1_C">();
	}
	static class UWB_ui_TutoTips_Parts_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_TutoTips_Parts_1_C>();
	}
};
static_assert(alignof(UWB_ui_TutoTips_Parts_1_C) == 0x000008, "Wrong alignment on UWB_ui_TutoTips_Parts_1_C");
static_assert(sizeof(UWB_ui_TutoTips_Parts_1_C) == 0x0004C8, "Wrong size on UWB_ui_TutoTips_Parts_1_C");
static_assert(offsetof(UWB_ui_TutoTips_Parts_1_C, UberGraphFrame) == 0x000450, "Member 'UWB_ui_TutoTips_Parts_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_TutoTips_Parts_1_C, Default_none) == 0x000458, "Member 'UWB_ui_TutoTips_Parts_1_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_TutoTips_Parts_1_C, Default_2) == 0x000460, "Member 'UWB_ui_TutoTips_Parts_1_C::Default_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_TutoTips_Parts_1_C, Default_1) == 0x000468, "Member 'UWB_ui_TutoTips_Parts_1_C::Default_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_TutoTips_Parts_1_C, Icon_font) == 0x000470, "Member 'UWB_ui_TutoTips_Parts_1_C::Icon_font' has a wrong offset!");
static_assert(offsetof(UWB_ui_TutoTips_Parts_1_C, Text_info_set) == 0x000478, "Member 'UWB_ui_TutoTips_Parts_1_C::Text_info_set' has a wrong offset!");
static_assert(offsetof(UWB_ui_TutoTips_Parts_1_C, Text_tutorial_body_1) == 0x000480, "Member 'UWB_ui_TutoTips_Parts_1_C::Text_tutorial_body_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_TutoTips_Parts_1_C, Text_tutorial_page_1_num) == 0x000488, "Member 'UWB_ui_TutoTips_Parts_1_C::Text_tutorial_page_1_num' has a wrong offset!");
static_assert(offsetof(UWB_ui_TutoTips_Parts_1_C, Text_tutorial_page_2_num) == 0x000490, "Member 'UWB_ui_TutoTips_Parts_1_C::Text_tutorial_page_2_num' has a wrong offset!");
static_assert(offsetof(UWB_ui_TutoTips_Parts_1_C, Text_tutorial_slash_1) == 0x000498, "Member 'UWB_ui_TutoTips_Parts_1_C::Text_tutorial_slash_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_TutoTips_Parts_1_C, Text_tutorial_title_1) == 0x0004A0, "Member 'UWB_ui_TutoTips_Parts_1_C::Text_tutorial_title_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_TutoTips_Parts_1_C, Thubnail_Base) == 0x0004A8, "Member 'UWB_ui_TutoTips_Parts_1_C::Thubnail_Base' has a wrong offset!");
static_assert(offsetof(UWB_ui_TutoTips_Parts_1_C, Thubnail_Frame) == 0x0004B0, "Member 'UWB_ui_TutoTips_Parts_1_C::Thubnail_Frame' has a wrong offset!");
static_assert(offsetof(UWB_ui_TutoTips_Parts_1_C, Thubnail_Shade) == 0x0004B8, "Member 'UWB_ui_TutoTips_Parts_1_C::Thubnail_Shade' has a wrong offset!");
static_assert(offsetof(UWB_ui_TutoTips_Parts_1_C, Tutorial_Image_1) == 0x0004C0, "Member 'UWB_ui_TutoTips_Parts_1_C::Tutorial_Image_1' has a wrong offset!");

}

