#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Vitality_pl_03_frame

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Vitality_pl_03_frame.WB_ui_Vitality_pl_03_frame_C.ExecuteUbergraph_WB_ui_Vitality_pl_03_frame
// 0x0068 (0x0068 - 0x0000)
struct WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6658[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	int32                                         K2Node_Event_State;                                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6659[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 K2Node_Event_icon_1;                               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index_1;                              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_665A[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 K2Node_Event_icon;                                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame) == 0x000008, "Wrong alignment on WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame");
static_assert(sizeof(WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame) == 0x000068, "Wrong size on WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame");
static_assert(offsetof(WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame, EntryPoint) == 0x000000, "Member 'WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame, CallFunc_GetDataBaseManager_Manager) == 0x000008, "Member 'WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame, CallFunc_GetText_ReturnValue) == 0x000010, "Member 'WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame, K2Node_Event_State) == 0x000038, "Member 'WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame, K2Node_Event_SubState) == 0x00003C, "Member 'WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame, K2Node_Event_DeltaSeconds) == 0x000040, "Member 'WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame, K2Node_Event_icon_1) == 0x000048, "Member 'WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame::K2Node_Event_icon_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame, K2Node_Event_index_1) == 0x000050, "Member 'WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame::K2Node_Event_index_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame, K2Node_Event_icon) == 0x000058, "Member 'WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame::K2Node_Event_icon' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame, K2Node_Event_index) == 0x000060, "Member 'WB_ui_Vitality_pl_03_frame_C_ExecuteUbergraph_WB_ui_Vitality_pl_03_frame::K2Node_Event_index' has a wrong offset!");

// Function WB_ui_Vitality_pl_03_frame.WB_ui_Vitality_pl_03_frame_C.SetIcon2
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Vitality_pl_03_frame_C_SetIcon2 final
{
public:
	class UImage*                                 Icon;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Vitality_pl_03_frame_C_SetIcon2) == 0x000008, "Wrong alignment on WB_ui_Vitality_pl_03_frame_C_SetIcon2");
static_assert(sizeof(WB_ui_Vitality_pl_03_frame_C_SetIcon2) == 0x000010, "Wrong size on WB_ui_Vitality_pl_03_frame_C_SetIcon2");
static_assert(offsetof(WB_ui_Vitality_pl_03_frame_C_SetIcon2, Icon) == 0x000000, "Member 'WB_ui_Vitality_pl_03_frame_C_SetIcon2::Icon' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_03_frame_C_SetIcon2, Param_Index) == 0x000008, "Member 'WB_ui_Vitality_pl_03_frame_C_SetIcon2::Param_Index' has a wrong offset!");

// Function WB_ui_Vitality_pl_03_frame.WB_ui_Vitality_pl_03_frame_C.SetIcon1
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Vitality_pl_03_frame_C_SetIcon1 final
{
public:
	class UImage*                                 Icon;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Vitality_pl_03_frame_C_SetIcon1) == 0x000008, "Wrong alignment on WB_ui_Vitality_pl_03_frame_C_SetIcon1");
static_assert(sizeof(WB_ui_Vitality_pl_03_frame_C_SetIcon1) == 0x000010, "Wrong size on WB_ui_Vitality_pl_03_frame_C_SetIcon1");
static_assert(offsetof(WB_ui_Vitality_pl_03_frame_C_SetIcon1, Icon) == 0x000000, "Member 'WB_ui_Vitality_pl_03_frame_C_SetIcon1::Icon' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_03_frame_C_SetIcon1, Param_Index) == 0x000008, "Member 'WB_ui_Vitality_pl_03_frame_C_SetIcon1::Param_Index' has a wrong offset!");

// Function WB_ui_Vitality_pl_03_frame.WB_ui_Vitality_pl_03_frame_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Vitality_pl_03_frame_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Vitality_pl_03_frame_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Vitality_pl_03_frame_C_UpdateState");
static_assert(sizeof(WB_ui_Vitality_pl_03_frame_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Vitality_pl_03_frame_C_UpdateState");
static_assert(offsetof(WB_ui_Vitality_pl_03_frame_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Vitality_pl_03_frame_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_03_frame_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Vitality_pl_03_frame_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_03_frame_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Vitality_pl_03_frame_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Vitality_pl_03_frame.WB_ui_Vitality_pl_03_frame_C.IsUnlockPlayerChara
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_Vitality_pl_03_frame_C_IsUnlockPlayerChara final
{
public:
	EPlayerID                                     CharaID;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_665B[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisibleCharaNameForProgressID_ReturnValue; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Vitality_pl_03_frame_C_IsUnlockPlayerChara) == 0x000008, "Wrong alignment on WB_ui_Vitality_pl_03_frame_C_IsUnlockPlayerChara");
static_assert(sizeof(WB_ui_Vitality_pl_03_frame_C_IsUnlockPlayerChara) == 0x000018, "Wrong size on WB_ui_Vitality_pl_03_frame_C_IsUnlockPlayerChara");
static_assert(offsetof(WB_ui_Vitality_pl_03_frame_C_IsUnlockPlayerChara, CharaID) == 0x000000, "Member 'WB_ui_Vitality_pl_03_frame_C_IsUnlockPlayerChara::CharaID' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_03_frame_C_IsUnlockPlayerChara, ReturnValue) == 0x000001, "Member 'WB_ui_Vitality_pl_03_frame_C_IsUnlockPlayerChara::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_03_frame_C_IsUnlockPlayerChara, CallFunc_GetEventManager_EventManager) == 0x000008, "Member 'WB_ui_Vitality_pl_03_frame_C_IsUnlockPlayerChara::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_03_frame_C_IsUnlockPlayerChara, CallFunc_IsVisibleCharaNameForProgressID_ReturnValue) == 0x000010, "Member 'WB_ui_Vitality_pl_03_frame_C_IsUnlockPlayerChara::CallFunc_IsVisibleCharaNameForProgressID_ReturnValue' has a wrong offset!");

}

