#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Item_Menu_1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Item_Menu_1.WB_ui_Item_Menu_1_C.ExecuteUbergraph_WB_ui_Item_Menu_1
// 0x00B4 (0x00B4 - 0x0000)
struct WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C3F[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C40[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C41[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C42[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C43[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_8;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_9;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_10;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_11;           // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C44[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_10;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_11;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_12;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_13;           // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C45[0x2];                                     // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_12;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_13;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_14;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C46[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_14;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_15;           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C47[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_15;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_16;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C48[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_16;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_17;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C49[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_17;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_18;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C4A[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_State;                                // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_18;            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_19;           // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C4B[0x2];                                     // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_19;            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_20;           // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C4C[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_20;            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_21;           // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C4D[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_21;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_22;           // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C4E[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_22;            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_23;           // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C4F[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_23;            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1) == 0x000004, "Wrong alignment on WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1");
static_assert(sizeof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1) == 0x0000B4, "Wrong size on WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, EntryPoint) == 0x000000, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000011, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000018, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x00001C, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x00001D, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000020, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000024, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000028, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000029, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x00002C, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x000030, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x000034, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_MakeLiteralByte_ReturnValue_9) == 0x000035, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_MakeLiteralByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_Conv_ByteToInt_ReturnValue_8) == 0x000038, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_Conv_ByteToInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_Conv_ByteToInt_ReturnValue_9) == 0x00003C, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_Conv_ByteToInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_MakeLiteralByte_ReturnValue_10) == 0x000040, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_MakeLiteralByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_MakeLiteralByte_ReturnValue_11) == 0x000041, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_MakeLiteralByte_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_Conv_ByteToInt_ReturnValue_10) == 0x000044, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_Conv_ByteToInt_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_Conv_ByteToInt_ReturnValue_11) == 0x000048, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_Conv_ByteToInt_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_MakeLiteralByte_ReturnValue_12) == 0x00004C, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_MakeLiteralByte_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_MakeLiteralByte_ReturnValue_13) == 0x00004D, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_MakeLiteralByte_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_Conv_ByteToInt_ReturnValue_12) == 0x000050, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_Conv_ByteToInt_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_Conv_ByteToInt_ReturnValue_13) == 0x000054, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_Conv_ByteToInt_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_MakeLiteralByte_ReturnValue_14) == 0x000058, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_MakeLiteralByte_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_Conv_ByteToInt_ReturnValue_14) == 0x00005C, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_Conv_ByteToInt_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_MakeLiteralByte_ReturnValue_15) == 0x000060, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_MakeLiteralByte_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_Conv_ByteToInt_ReturnValue_15) == 0x000064, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_Conv_ByteToInt_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_MakeLiteralByte_ReturnValue_16) == 0x000068, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_MakeLiteralByte_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_Conv_ByteToInt_ReturnValue_16) == 0x00006C, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_Conv_ByteToInt_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_MakeLiteralByte_ReturnValue_17) == 0x000070, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_MakeLiteralByte_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_Conv_ByteToInt_ReturnValue_17) == 0x000074, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_Conv_ByteToInt_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_MakeLiteralByte_ReturnValue_18) == 0x000078, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_MakeLiteralByte_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, K2Node_Event_State) == 0x00007C, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, K2Node_Event_SubState) == 0x000080, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, K2Node_Event_DeltaSeconds) == 0x000084, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_Conv_ByteToInt_ReturnValue_18) == 0x000088, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_Conv_ByteToInt_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, K2Node_SwitchInteger_CmpSuccess) == 0x00008C, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_MakeLiteralByte_ReturnValue_19) == 0x00008D, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_MakeLiteralByte_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_Conv_ByteToInt_ReturnValue_19) == 0x000090, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_Conv_ByteToInt_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_MakeLiteralByte_ReturnValue_20) == 0x000094, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_MakeLiteralByte_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_Conv_ByteToInt_ReturnValue_20) == 0x000098, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_Conv_ByteToInt_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_MakeLiteralByte_ReturnValue_21) == 0x00009C, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_MakeLiteralByte_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_Conv_ByteToInt_ReturnValue_21) == 0x0000A0, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_Conv_ByteToInt_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_MakeLiteralByte_ReturnValue_22) == 0x0000A4, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_MakeLiteralByte_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_Conv_ByteToInt_ReturnValue_22) == 0x0000A8, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_Conv_ByteToInt_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_MakeLiteralByte_ReturnValue_23) == 0x0000AC, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_MakeLiteralByte_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1, CallFunc_Conv_ByteToInt_ReturnValue_23) == 0x0000B0, "Member 'WB_ui_Item_Menu_1_C_ExecuteUbergraph_WB_ui_Item_Menu_1::CallFunc_Conv_ByteToInt_ReturnValue_23' has a wrong offset!");

// Function WB_ui_Item_Menu_1.WB_ui_Item_Menu_1_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Item_Menu_1_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Item_Menu_1_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Item_Menu_1_C_UpdateState");
static_assert(sizeof(WB_ui_Item_Menu_1_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Item_Menu_1_C_UpdateState");
static_assert(offsetof(WB_ui_Item_Menu_1_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Item_Menu_1_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Item_Menu_1_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Item_Menu_1_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Item_Menu_1.WB_ui_Item_Menu_1_C.StateNone
// 0x0040 (0x0040 - 0x0000)
struct WB_ui_Item_Menu_1_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C50[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserParamManager*                      CallFunc_GetUserParamManager_UserParamManager;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C51[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMapUsableItemListNum_ReturnValue;      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMapUsableItemListNum_ReturnValue_1;    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckItemTypeNum_IsChange;                // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Item_Menu_1_C_StateNone) == 0x000008, "Wrong alignment on WB_ui_Item_Menu_1_C_StateNone");
static_assert(sizeof(WB_ui_Item_Menu_1_C_StateNone) == 0x000040, "Wrong size on WB_ui_Item_Menu_1_C_StateNone");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_Item_Menu_1_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_Item_Menu_1_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateNone, CallFunc_Less_IntInt_ReturnValue) == 0x000005, "Member 'WB_ui_Item_Menu_1_C_StateNone::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000006, "Member 'WB_ui_Item_Menu_1_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000007, "Member 'WB_ui_Item_Menu_1_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Item_Menu_1_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Item_Menu_1_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_Item_Menu_1_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateNone, CallFunc_GetUserParamManager_UserParamManager) == 0x000018, "Member 'WB_ui_Item_Menu_1_C_StateNone::CallFunc_GetUserParamManager_UserParamManager' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000020, "Member 'WB_ui_Item_Menu_1_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateNone, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'WB_ui_Item_Menu_1_C_StateNone::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateNone, CallFunc_GetMapUsableItemListNum_ReturnValue) == 0x000028, "Member 'WB_ui_Item_Menu_1_C_StateNone::CallFunc_GetMapUsableItemListNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateNone, CallFunc_GetMapUsableItemListNum_ReturnValue_1) == 0x00002C, "Member 'WB_ui_Item_Menu_1_C_StateNone::CallFunc_GetMapUsableItemListNum_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateNone, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'WB_ui_Item_Menu_1_C_StateNone::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateNone, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000034, "Member 'WB_ui_Item_Menu_1_C_StateNone::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateNone, CallFunc_Max_ReturnValue) == 0x000038, "Member 'WB_ui_Item_Menu_1_C_StateNone::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateNone, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00003C, "Member 'WB_ui_Item_Menu_1_C_StateNone::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateNone, CallFunc_CheckItemTypeNum_IsChange) == 0x00003D, "Member 'WB_ui_Item_Menu_1_C_StateNone::CallFunc_CheckItemTypeNum_IsChange' has a wrong offset!");

// Function WB_ui_Item_Menu_1.WB_ui_Item_Menu_1_C.StateOpen
// 0x0040 (0x0040 - 0x0000)
struct WB_ui_Item_Menu_1_C_StateOpen final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C52[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C53[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserParamManager*                      CallFunc_GetUserParamManager_UserParamManager;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C54[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserItemInfo                          CallFunc_GetMapUsableItemListInfo_ReturnValue;     // 0x001C(0x0010)(NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C55[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Item_Menu_1_C_StateOpen) == 0x000008, "Wrong alignment on WB_ui_Item_Menu_1_C_StateOpen");
static_assert(sizeof(WB_ui_Item_Menu_1_C_StateOpen) == 0x000040, "Wrong size on WB_ui_Item_Menu_1_C_StateOpen");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateOpen, SubState) == 0x000000, "Member 'WB_ui_Item_Menu_1_C_StateOpen::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Item_Menu_1_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateOpen, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Item_Menu_1_C_StateOpen::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Item_Menu_1_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateOpen, CallFunc_GetUserParamManager_UserParamManager) == 0x000010, "Member 'WB_ui_Item_Menu_1_C_StateOpen::CallFunc_GetUserParamManager_UserParamManager' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000018, "Member 'WB_ui_Item_Menu_1_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateOpen, CallFunc_GetMapUsableItemListInfo_ReturnValue) == 0x00001C, "Member 'WB_ui_Item_Menu_1_C_StateOpen::CallFunc_GetMapUsableItemListInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00002C, "Member 'WB_ui_Item_Menu_1_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000030, "Member 'WB_ui_Item_Menu_1_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateOpen, CallFunc_BooleanOR_ReturnValue) == 0x000031, "Member 'WB_ui_Item_Menu_1_C_StateOpen::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000034, "Member 'WB_ui_Item_Menu_1_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateOpen, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'WB_ui_Item_Menu_1_C_StateOpen::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateOpen, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000039, "Member 'WB_ui_Item_Menu_1_C_StateOpen::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x00003A, "Member 'WB_ui_Item_Menu_1_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateOpen, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x00003B, "Member 'WB_ui_Item_Menu_1_C_StateOpen::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x00003C, "Member 'WB_ui_Item_Menu_1_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");

// Function WB_ui_Item_Menu_1.WB_ui_Item_Menu_1_C.State Loop Enable
// 0x0048 (0x0048 - 0x0000)
struct WB_ui_Item_Menu_1_C_State_Loop_Enable final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C56[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckItemTypeNum_IsChange;                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C57[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ItemSelect_IsSelect;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C58[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_1;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C59[0x1];                                     // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C5A[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SoundManager_C*                     CallFunc_GetSoundManager_Sound_Manager;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Item_Menu_1_C_State_Loop_Enable) == 0x000008, "Wrong alignment on WB_ui_Item_Menu_1_C_State_Loop_Enable");
static_assert(sizeof(WB_ui_Item_Menu_1_C_State_Loop_Enable) == 0x000048, "Wrong size on WB_ui_Item_Menu_1_C_State_Loop_Enable");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, SubState) == 0x000000, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, CallFunc_MakeLiteralByte_ReturnValue) == 0x000005, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000006, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, CallFunc_CheckItemTypeNum_IsChange) == 0x00000D, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::CallFunc_CheckItemTypeNum_IsChange' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000010, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, CallFunc_ItemSelect_IsSelect) == 0x000014, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::CallFunc_ItemSelect_IsSelect' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, CallFunc_Greater_IntInt_ReturnValue) == 0x000015, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000016, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, CallFunc_BooleanAND_ReturnValue) == 0x000017, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, CallFunc_BooleanAND_ReturnValue_1) == 0x000018, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000019, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x00001C, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, CallFunc_IsPlayUICurrentAnimation_isPlay_1) == 0x000020, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::CallFunc_IsPlayUICurrentAnimation_isPlay_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000021, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000022, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000024, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000028, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x00002C, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x00002D, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000030, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x000034, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, CallFunc_GetSoundManager_Sound_Manager) == 0x000038, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::CallFunc_GetSoundManager_Sound_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_State_Loop_Enable, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WB_ui_Item_Menu_1_C_State_Loop_Enable::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WB_ui_Item_Menu_1.WB_ui_Item_Menu_1_C.StateClose
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_Item_Menu_1_C_StateClose final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C5B[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C5C[0x1];                                     // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Item_Menu_1_C_StateClose) == 0x000004, "Wrong alignment on WB_ui_Item_Menu_1_C_StateClose");
static_assert(sizeof(WB_ui_Item_Menu_1_C_StateClose) == 0x000018, "Wrong size on WB_ui_Item_Menu_1_C_StateClose");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateClose, SubState) == 0x000000, "Member 'WB_ui_Item_Menu_1_C_StateClose::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Item_Menu_1_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateClose, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Item_Menu_1_C_StateClose::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_Item_Menu_1_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Item_Menu_1_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Item_Menu_1_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateClose, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'WB_ui_Item_Menu_1_C_StateClose::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000011, "Member 'WB_ui_Item_Menu_1_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateClose, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000012, "Member 'WB_ui_Item_Menu_1_C_StateClose::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_Menu_1_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_Item_Menu_1_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");

// Function WB_ui_Item_Menu_1.WB_ui_Item_Menu_1_C.State Add Item
// 0x0098 (0x0098 - 0x0000)
struct WB_ui_Item_Menu_1_C_State_Add_Item final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   _BackupRight;                                      // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
