#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_GameOver

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_GameOver.WB_ui_GameOver_C
// 0x0040 (0x0498 - 0x0458)
class UWB_ui_GameOver_C final : public UUIGameOver
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0458(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out_title;                                         // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out_retry;                                         // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UREDRetainerBox*                        REDRetainerBox_Menu_base;                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_GameOver_Parts_1_C*              WB_ui_GameOver_Parts_1;                            // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Guide_C*                         WB_ui_Guide;                                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_GameOver(int32 EntryPoint);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	class FName GetTargetBossID();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_GameOver_C">();
	}
	static class UWB_ui_GameOver_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_GameOver_C>();
	}
};
static_assert(alignof(UWB_ui_GameOver_C) == 0x000008, "Wrong alignment on UWB_ui_GameOver_C");
static_assert(sizeof(UWB_ui_GameOver_C) == 0x000498, "Wrong size on UWB_ui_GameOver_C");
static_assert(offsetof(UWB_ui_GameOver_C, UberGraphFrame) == 0x000458, "Member 'UWB_ui_GameOver_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_GameOver_C, Out_title) == 0x000460, "Member 'UWB_ui_GameOver_C::Out_title' has a wrong offset!");
static_assert(offsetof(UWB_ui_GameOver_C, Out_retry) == 0x000468, "Member 'UWB_ui_GameOver_C::Out_retry' has a wrong offset!");
static_assert(offsetof(UWB_ui_GameOver_C, In) == 0x000470, "Member 'UWB_ui_GameOver_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_GameOver_C, Default) == 0x000478, "Member 'UWB_ui_GameOver_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_GameOver_C, REDRetainerBox_Menu_base) == 0x000480, "Member 'UWB_ui_GameOver_C::REDRetainerBox_Menu_base' has a wrong offset!");
static_assert(offsetof(UWB_ui_GameOver_C, WB_ui_GameOver_Parts_1) == 0x000488, "Member 'UWB_ui_GameOver_C::WB_ui_GameOver_Parts_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_GameOver_C, WB_ui_Guide) == 0x000490, "Member 'UWB_ui_GameOver_C::WB_ui_Guide' has a wrong offset!");

}

