#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_ShopContents_Parts_6

#include "Basic.hpp"

#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_ShopContents_Parts_6.WB_ui_ShopContents_Parts_6_C
// 0x0048 (0x03D0 - 0x0388)
class UWB_ui_ShopContents_Parts_6_C final : public UUIBase
{
public:
	class UWidgetAnimation*                       Unselect;                                          // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Decision;                                          // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_out;                                        // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_in;                                         // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select;                                            // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_2_select;                                     // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_main_category_sub_1;                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void StateNone(int32 SubState);
	void StateLoop(int32 SubState);
	void UpdateShopFontOutlineMaterial();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_ShopContents_Parts_6_C">();
	}
	static class UWB_ui_ShopContents_Parts_6_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_ShopContents_Parts_6_C>();
	}
};
static_assert(alignof(UWB_ui_ShopContents_Parts_6_C) == 0x000008, "Wrong alignment on UWB_ui_ShopContents_Parts_6_C");
static_assert(sizeof(UWB_ui_ShopContents_Parts_6_C) == 0x0003D0, "Wrong size on UWB_ui_ShopContents_Parts_6_C");
static_assert(offsetof(UWB_ui_ShopContents_Parts_6_C, Unselect) == 0x000388, "Member 'UWB_ui_ShopContents_Parts_6_C::Unselect' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopContents_Parts_6_C, Decision) == 0x000390, "Member 'UWB_ui_ShopContents_Parts_6_C::Decision' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopContents_Parts_6_C, Select_out) == 0x000398, "Member 'UWB_ui_ShopContents_Parts_6_C::Select_out' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopContents_Parts_6_C, Select_in) == 0x0003A0, "Member 'UWB_ui_ShopContents_Parts_6_C::Select_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopContents_Parts_6_C, Select) == 0x0003A8, "Member 'UWB_ui_ShopContents_Parts_6_C::Select' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopContents_Parts_6_C, Default) == 0x0003B0, "Member 'UWB_ui_ShopContents_Parts_6_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopContents_Parts_6_C, Base_2_select) == 0x0003B8, "Member 'UWB_ui_ShopContents_Parts_6_C::Base_2_select' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopContents_Parts_6_C, Frame) == 0x0003C0, "Member 'UWB_ui_ShopContents_Parts_6_C::Frame' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopContents_Parts_6_C, Text_main_category_sub_1) == 0x0003C8, "Member 'UWB_ui_ShopContents_Parts_6_C::Text_main_category_sub_1' has a wrong offset!");

}

