#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_CharaName

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_CharaName.WB_ui_CharaName_C
// 0x0060 (0x0428 - 0x03C8)
class UWB_ui_CharaName_C final : public UUICharaName
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Blue_2;                                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Green_2;                                  // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Red_2;                                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDRetainerBox*                        CA_RetainerBox;                                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ghost;                                             // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDRetainerBox*                        Mask_RetainerBox;                                  // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_CharaName_01;                                 // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_CharaName_02;                                 // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_CharaName(int32 EntryPoint);
	void InitUICharaName();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void UpdateCharaNameMaterial();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_CharaName_C">();
	}
	static class UWB_ui_CharaName_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_CharaName_C>();
	}
};
static_assert(alignof(UWB_ui_CharaName_C) == 0x000008, "Wrong alignment on UWB_ui_CharaName_C");
static_assert(sizeof(UWB_ui_CharaName_C) == 0x000428, "Wrong size on UWB_ui_CharaName_C");
static_assert(offsetof(UWB_ui_CharaName_C, UberGraphFrame) == 0x0003C8, "Member 'UWB_ui_CharaName_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_CharaName_C, Out) == 0x0003D0, "Member 'UWB_ui_CharaName_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_CharaName_C, In) == 0x0003D8, "Member 'UWB_ui_CharaName_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_CharaName_C, Default) == 0x0003E0, "Member 'UWB_ui_CharaName_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_CharaName_C, CA_Image_Blue_2) == 0x0003E8, "Member 'UWB_ui_CharaName_C::CA_Image_Blue_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_CharaName_C, CA_Image_Green_2) == 0x0003F0, "Member 'UWB_ui_CharaName_C::CA_Image_Green_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_CharaName_C, CA_Image_Red_2) == 0x0003F8, "Member 'UWB_ui_CharaName_C::CA_Image_Red_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_CharaName_C, CA_RetainerBox) == 0x000400, "Member 'UWB_ui_CharaName_C::CA_RetainerBox' has a wrong offset!");
static_assert(offsetof(UWB_ui_CharaName_C, Ghost) == 0x000408, "Member 'UWB_ui_CharaName_C::Ghost' has a wrong offset!");
static_assert(offsetof(UWB_ui_CharaName_C, Mask_RetainerBox) == 0x000410, "Member 'UWB_ui_CharaName_C::Mask_RetainerBox' has a wrong offset!");
static_assert(offsetof(UWB_ui_CharaName_C, Text_CharaName_01) == 0x000418, "Member 'UWB_ui_CharaName_C::Text_CharaName_01' has a wrong offset!");
static_assert(offsetof(UWB_ui_CharaName_C, Text_CharaName_02) == 0x000420, "Member 'UWB_ui_CharaName_C::Text_CharaName_02' has a wrong offset!");

}

