#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Quest

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Quest.WB_ui_Quest_C.ExecuteUbergraph_WB_ui_Quest
// 0x00C8 (0x00C8 - 0x0000)
struct WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 IsMouseScroll, int32 Cursor, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWB_ui_MainContents_Parts_6_C*>  K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TDelegate<void(int32 IsMouseScroll, int32 Cursor, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index_2;                              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget_4;                             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget_3;                             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* PWidget)>   K2Node_CreateDelegate_OutputDelegate_2;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class UUserWidget*                            K2Node_Event_Widget_2;                             // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue;              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C0F[0x2];                                     // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUserWidget* PWidget)>   K2Node_CreateDelegate_OutputDelegate_3;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C10[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_isMouseScroll_1;                      // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index_1;                              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget_1;                             // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_isMouseScroll;                        // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget;                               // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Index, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest) == 0x000008, "Wrong alignment on WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest");
static_assert(sizeof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest) == 0x0000C8, "Wrong size on WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, EntryPoint) == 0x000000, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, Temp_int_Loop_Num_Variable) == 0x000018, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, K2Node_Event_State) == 0x00001C, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, K2Node_Event_SubState) == 0x000020, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, K2Node_MakeArray_Array) == 0x000028, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, K2Node_Event_index_2) == 0x00004C, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::K2Node_Event_index_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, K2Node_Event_Widget_4) == 0x000050, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::K2Node_Event_Widget_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, K2Node_Event_Widget_3) == 0x000058, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::K2Node_Event_Widget_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, K2Node_CreateDelegate_OutputDelegate_2) == 0x000060, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, K2Node_Event_Widget_2) == 0x000070, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::K2Node_Event_Widget_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, CallFunc_GetPlatformType_ReturnValue) == 0x000078, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000079, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, K2Node_CreateDelegate_OutputDelegate_3) == 0x00007C, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, Temp_int_Loop_Counter_Variable) == 0x00008C, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, K2Node_Event_isMouseScroll_1) == 0x000098, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::K2Node_Event_isMouseScroll_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, K2Node_Event_index_1) == 0x00009C, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::K2Node_Event_index_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, K2Node_Event_Widget_1) == 0x0000A0, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::K2Node_Event_Widget_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, K2Node_Event_isMouseScroll) == 0x0000A8, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::K2Node_Event_isMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, K2Node_Event_index) == 0x0000AC, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, K2Node_Event_Widget) == 0x0000B0, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::K2Node_Event_Widget' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000B8, "Member 'WB_ui_Quest_C_ExecuteUbergraph_WB_ui_Quest::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function WB_ui_Quest.WB_ui_Quest_C.ListUnFocusMouse
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Quest_C_ListUnFocusMouse final
{
public:
	int32                                         IsMouseScroll;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Quest_C_ListUnFocusMouse) == 0x000008, "Wrong alignment on WB_ui_Quest_C_ListUnFocusMouse");
static_assert(sizeof(WB_ui_Quest_C_ListUnFocusMouse) == 0x000010, "Wrong size on WB_ui_Quest_C_ListUnFocusMouse");
static_assert(offsetof(WB_ui_Quest_C_ListUnFocusMouse, IsMouseScroll) == 0x000000, "Member 'WB_ui_Quest_C_ListUnFocusMouse::IsMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ListUnFocusMouse, Param_Index) == 0x000004, "Member 'WB_ui_Quest_C_ListUnFocusMouse::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ListUnFocusMouse, Widget) == 0x000008, "Member 'WB_ui_Quest_C_ListUnFocusMouse::Widget' has a wrong offset!");

// Function WB_ui_Quest.WB_ui_Quest_C.ListFocusMouse
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Quest_C_ListFocusMouse final
{
public:
	int32                                         IsMouseScroll;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Quest_C_ListFocusMouse) == 0x000008, "Wrong alignment on WB_ui_Quest_C_ListFocusMouse");
static_assert(sizeof(WB_ui_Quest_C_ListFocusMouse) == 0x000010, "Wrong size on WB_ui_Quest_C_ListFocusMouse");
static_assert(offsetof(WB_ui_Quest_C_ListFocusMouse, IsMouseScroll) == 0x000000, "Member 'WB_ui_Quest_C_ListFocusMouse::IsMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ListFocusMouse, Param_Index) == 0x000004, "Member 'WB_ui_Quest_C_ListFocusMouse::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ListFocusMouse, Widget) == 0x000008, "Member 'WB_ui_Quest_C_ListFocusMouse::Widget' has a wrong offset!");

// Function WB_ui_Quest.WB_ui_Quest_C.ListFocus
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_Quest_C_ListFocus final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Quest_C_ListFocus) == 0x000008, "Wrong alignment on WB_ui_Quest_C_ListFocus");
static_assert(sizeof(WB_ui_Quest_C_ListFocus) == 0x000008, "Wrong size on WB_ui_Quest_C_ListFocus");
static_assert(offsetof(WB_ui_Quest_C_ListFocus, Widget) == 0x000000, "Member 'WB_ui_Quest_C_ListFocus::Widget' has a wrong offset!");

// Function WB_ui_Quest.WB_ui_Quest_C.ListUnFocus
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_Quest_C_ListUnFocus final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Quest_C_ListUnFocus) == 0x000008, "Wrong alignment on WB_ui_Quest_C_ListUnFocus");
static_assert(sizeof(WB_ui_Quest_C_ListUnFocus) == 0x000008, "Wrong size on WB_ui_Quest_C_ListUnFocus");
static_assert(offsetof(WB_ui_Quest_C_ListUnFocus, Widget) == 0x000000, "Member 'WB_ui_Quest_C_ListUnFocus::Widget' has a wrong offset!");

// Function WB_ui_Quest.WB_ui_Quest_C.ListUpdateElement
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Quest_C_ListUpdateElement final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C11[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Quest_C_ListUpdateElement) == 0x000008, "Wrong alignment on WB_ui_Quest_C_ListUpdateElement");
static_assert(sizeof(WB_ui_Quest_C_ListUpdateElement) == 0x000010, "Wrong size on WB_ui_Quest_C_ListUpdateElement");
static_assert(offsetof(WB_ui_Quest_C_ListUpdateElement, Param_Index) == 0x000000, "Member 'WB_ui_Quest_C_ListUpdateElement::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_ListUpdateElement, Widget) == 0x000008, "Member 'WB_ui_Quest_C_ListUpdateElement::Widget' has a wrong offset!");

// Function WB_ui_Quest.WB_ui_Quest_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Quest_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Quest_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Quest_C_UpdateState");
static_assert(sizeof(WB_ui_Quest_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Quest_C_UpdateState");
static_assert(offsetof(WB_ui_Quest_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Quest_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Quest_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Quest_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Quest.WB_ui_Quest_C.isEndErrorPopup
// 0x000C (0x000C - 0x0000)
struct WB_ui_Quest_C_IsEndErrorPopup final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C12[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetResultIndex_ResultIndex;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Quest_C_IsEndErrorPopup) == 0x000004, "Wrong alignment on WB_ui_Quest_C_IsEndErrorPopup");
static_assert(sizeof(WB_ui_Quest_C_IsEndErrorPopup) == 0x00000C, "Wrong size on WB_ui_Quest_C_IsEndErrorPopup");
static_assert(offsetof(WB_ui_Quest_C_IsEndErrorPopup, ReturnValue) == 0x000000, "Member 'WB_ui_Quest_C_IsEndErrorPopup::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_IsEndErrorPopup, CallFunc_GetResultIndex_ResultIndex) == 0x000004, "Member 'WB_ui_Quest_C_IsEndErrorPopup::CallFunc_GetResultIndex_ResultIndex' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_C_IsEndErrorPopup, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000008, "Member 'WB_ui_Quest_C_IsEndErrorPopup::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

}

