#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Number_damage_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Number_damage_1.WB_ui_Number_damage_1_C
// 0x00C8 (0x0538 - 0x0470)
class UWB_ui_Number_damage_1_C final : public UUINumberDamage
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       braincrash_clitical;                               // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Sas_clitical;                                      // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Nodamage;                                          // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Heal;                                              // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Enemy_clitical;                                    // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Enemy;                                             // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         Clitical_set;                                      // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Name_grow_1;                                       // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Nodamage_set;                                      // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Normal_set;                                        // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Number_1_1;                                        // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Number_1_10;                                       // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Number_1_100;                                      // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Number_1_1000;                                     // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Number_1_10000;                                    // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Number_1_100000;                                   // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Number_3_1;                                        // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Number_3_10;                                       // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Number_3_100;                                      // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Number_3_1000;                                     // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Number_3_10000;                                    // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Number_3_100000;                                   // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Parent;                                    // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Number_damage_1;                              // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Number_damage_1(int32 EntryPoint);
	void WidgetAnimationEvt_nodamage_K2Node_WidgetAnimationEvent_0();
	void Construct();
	void OnInitialized();
	void SetThumbnailNumebr3(class UImage* Image, int32 Value);
	void SetThumbnailNumebr1(class UImage* Image, int32 Value);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Number_damage_1_C">();
	}
	static class UWB_ui_Number_damage_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Number_damage_1_C>();
	}
};
static_assert(alignof(UWB_ui_Number_damage_1_C) == 0x000008, "Wrong alignment on UWB_ui_Number_damage_1_C");
static_assert(sizeof(UWB_ui_Number_damage_1_C) == 0x000538, "Wrong size on UWB_ui_Number_damage_1_C");
static_assert(offsetof(UWB_ui_Number_damage_1_C, UberGraphFrame) == 0x000470, "Member 'UWB_ui_Number_damage_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Number_damage_1_C, braincrash_clitical) == 0x000478, "Member 'UWB_ui_Number_damage_1_C::braincrash_clitical' has a wrong offset!");
static_assert(offsetof(UWB_ui_Number_damage_1_C, Sas_clitical) == 0x000480, "Member 'UWB_ui_Number_damage_1_C::Sas_clitical' has a wrong offset!");
static_assert(offsetof(UWB_ui_Number_damage_1_C, Nodamage) == 0x000488, "Member 'UWB_ui_Number_damage_1_C::Nodamage' has a wrong offset!");
static_assert(offsetof(UWB_ui_Number_damage_1_C, Heal) == 0x000490, "Member 'UWB_ui_Number_damage_1_C::Heal' has a wrong offset!");
static_assert(offsetof(UWB_ui_Number_damage_1_C, Enemy_clitical) == 0x000498, "Member 'UWB_ui_Number_damage_1_C::Enemy_clitical' has a wrong offset!");
static_assert(offsetof(UWB_ui_Number_damage_1_C, Enemy) == 0x0004A0, "Member 'UWB_ui_Number_damage_1_C::Enemy' has a wrong offset!");
static_assert(offsetof(UWB_ui_Number_damage_1_C, Clitical_set) == 0x0004A8, "Member 'UWB_ui_Number_damage_1_C::Clitical_set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Number_damage_1_C, Name_grow_1) == 0x0004B0, "Member 'UWB_ui_Number_damage_1_C::Name_grow_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Number_damage_1_C, Nodamage_set) == 0x0004B8, "Member 'UWB_ui_Number_damage_1_C::Nodamage_set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Number_damage_1_C, Normal_set) == 0x0004C0, "Member 'UWB_ui_Number_damage_1_C::Normal_set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Number_damage_1_C, Number_1_1) == 0x0004C8, "Member 'UWB_ui_Number_damage_1_C::Number_1_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Number_damage_1_C, Number_1_10) == 0x0004D0, "Member 'UWB_ui_Number_damage_1_C::Number_1_10' has a wrong offset!");
static_assert(offsetof(UWB_ui_Number_damage_1_C, Number_1_100) == 0x0004D8, "Member 'UWB_ui_Number_damage_1_C::Number_1_100' has a wrong offset!");
static_assert(offsetof(UWB_ui_Number_damage_1_C, Number_1_1000) == 0x0004E0, "Member 'UWB_ui_Number_damage_1_C::Number_1_1000' has a wrong offset!");
static_assert(offsetof(UWB_ui_Number_damage_1_C, Number_1_10000) == 0x0004E8, "Member 'UWB_ui_Number_damage_1_C::Number_1_10000' has a wrong offset!");
static_assert(offsetof(UWB_ui_Number_damage_1_C, Number_1_100000) == 0x0004F0, "Member 'UWB_ui_Number_damage_1_C::Number_1_100000' has a wrong offset!");
static_assert(offsetof(UWB_ui_Number_damage_1_C, Number_3_1) == 0x0004F8, "Member 'UWB_ui_Number_damage_1_C::Number_3_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Number_damage_1_C, Number_3_10) == 0x000500, "Member 'UWB_ui_Number_damage_1_C::Number_3_10' has a wrong offset!");
static_assert(offsetof(UWB_ui_Number_damage_1_C, Number_3_100) == 0x000508, "Member 'UWB_ui_Number_damage_1_C::Number_3_100' has a wrong offset!");
static_assert(offsetof(UWB_ui_Number_damage_1_C, Number_3_1000) == 0x000510, "Member 'UWB_ui_Number_damage_1_C::Number_3_1000' has a wrong offset!");
static_assert(offsetof(UWB_ui_Number_damage_1_C, Number_3_10000) == 0x000518, "Member 'UWB_ui_Number_damage_1_C::Number_3_10000' has a wrong offset!");
static_assert(offsetof(UWB_ui_Number_damage_1_C, Number_3_100000) == 0x000520, "Member 'UWB_ui_Number_damage_1_C::Number_3_100000' has a wrong offset!");
static_assert(offsetof(UWB_ui_Number_damage_1_C, Overlay_Parent) == 0x000528, "Member 'UWB_ui_Number_damage_1_C::Overlay_Parent' has a wrong offset!");
static_assert(offsetof(UWB_ui_Number_damage_1_C, Text_Number_damage_1) == 0x000530, "Member 'UWB_ui_Number_damage_1_C::Text_Number_damage_1' has a wrong offset!");

}

