#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_MatchID

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_MatchID.WB_ui_MatchID_C
// 0x0040 (0x0440 - 0x0400)
class UWB_ui_MatchID_C final : public UUIMatchID
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                MatchID_Set;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                MatchName_Set;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_MatchID_ID_1;                                 // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_MatchID_Name_1;                               // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_MatchID(int32 EntryPoint);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_MatchID_C">();
	}
	static class UWB_ui_MatchID_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_MatchID_C>();
	}
};
static_assert(alignof(UWB_ui_MatchID_C) == 0x000008, "Wrong alignment on UWB_ui_MatchID_C");
static_assert(sizeof(UWB_ui_MatchID_C) == 0x000440, "Wrong size on UWB_ui_MatchID_C");
static_assert(offsetof(UWB_ui_MatchID_C, UberGraphFrame) == 0x000400, "Member 'UWB_ui_MatchID_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_MatchID_C, Out) == 0x000408, "Member 'UWB_ui_MatchID_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_MatchID_C, In) == 0x000410, "Member 'UWB_ui_MatchID_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_MatchID_C, Default) == 0x000418, "Member 'UWB_ui_MatchID_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_MatchID_C, MatchID_Set) == 0x000420, "Member 'UWB_ui_MatchID_C::MatchID_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_MatchID_C, MatchName_Set) == 0x000428, "Member 'UWB_ui_MatchID_C::MatchName_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_MatchID_C, Text_MatchID_ID_1) == 0x000430, "Member 'UWB_ui_MatchID_C::Text_MatchID_ID_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_MatchID_C, Text_MatchID_Name_1) == 0x000438, "Member 'UWB_ui_MatchID_C::Text_MatchID_Name_1' has a wrong offset!");

}

