#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_MissionResult

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_MissionResult.WB_ui_MissionResult_C.ExecuteUbergraph_WB_ui_MissionResult
// 0x0030 (0x0030 - 0x0000)
struct WB_ui_MissionResult_C_ExecuteUbergraph_WB_ui_MissionResult final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F4F[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_MissionResult_C_ExecuteUbergraph_WB_ui_MissionResult) == 0x000008, "Wrong alignment on WB_ui_MissionResult_C_ExecuteUbergraph_WB_ui_MissionResult");
static_assert(sizeof(WB_ui_MissionResult_C_ExecuteUbergraph_WB_ui_MissionResult) == 0x000030, "Wrong size on WB_ui_MissionResult_C_ExecuteUbergraph_WB_ui_MissionResult");
static_assert(offsetof(WB_ui_MissionResult_C_ExecuteUbergraph_WB_ui_MissionResult, EntryPoint) == 0x000000, "Member 'WB_ui_MissionResult_C_ExecuteUbergraph_WB_ui_MissionResult::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_ExecuteUbergraph_WB_ui_MissionResult, K2Node_Event_State) == 0x000004, "Member 'WB_ui_MissionResult_C_ExecuteUbergraph_WB_ui_MissionResult::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_ExecuteUbergraph_WB_ui_MissionResult, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_MissionResult_C_ExecuteUbergraph_WB_ui_MissionResult::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_ExecuteUbergraph_WB_ui_MissionResult, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_MissionResult_C_ExecuteUbergraph_WB_ui_MissionResult::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_ExecuteUbergraph_WB_ui_MissionResult, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'WB_ui_MissionResult_C_ExecuteUbergraph_WB_ui_MissionResult::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_ExecuteUbergraph_WB_ui_MissionResult, CallFunc_GetPlatformName_ReturnValue) == 0x000018, "Member 'WB_ui_MissionResult_C_ExecuteUbergraph_WB_ui_MissionResult::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_ExecuteUbergraph_WB_ui_MissionResult, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000028, "Member 'WB_ui_MissionResult_C_ExecuteUbergraph_WB_ui_MissionResult::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function WB_ui_MissionResult.WB_ui_MissionResult_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_MissionResult_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_MissionResult_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_MissionResult_C_UpdateState");
static_assert(sizeof(WB_ui_MissionResult_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_MissionResult_C_UpdateState");
static_assert(offsetof(WB_ui_MissionResult_C_UpdateState, State) == 0x000000, "Member 'WB_ui_MissionResult_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_MissionResult_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_MissionResult_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_MissionResult.WB_ui_MissionResult_C.StateNone
// 0x0030 (0x0030 - 0x0000)
struct WB_ui_MissionResult_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F50[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_InputManager_C*                     CallFunc_GetInputManager_BP_InputManager;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABattleSimulatorManager*                CallFunc_GetBattleSimulatorManager_BattleSimulatorManager; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMissionCleared_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMissionCleared_ReturnValue_1;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F51[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     CallFunc_GetBattleMemberPlayerID_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_MissionResult_C_StateNone) == 0x000008, "Wrong alignment on WB_ui_MissionResult_C_StateNone");
static_assert(sizeof(WB_ui_MissionResult_C_StateNone) == 0x000030, "Wrong size on WB_ui_MissionResult_C_StateNone");
static_assert(offsetof(WB_ui_MissionResult_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_MissionResult_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_MissionResult_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateNone, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'WB_ui_MissionResult_C_StateNone::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateNone, CallFunc_GetInputManager_BP_InputManager) == 0x000008, "Member 'WB_ui_MissionResult_C_StateNone::CallFunc_GetInputManager_BP_InputManager' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateNone, CallFunc_GetBattleSimulatorManager_BattleSimulatorManager) == 0x000010, "Member 'WB_ui_MissionResult_C_StateNone::CallFunc_GetBattleSimulatorManager_BattleSimulatorManager' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateNone, CallFunc_IsMissionCleared_ReturnValue) == 0x000018, "Member 'WB_ui_MissionResult_C_StateNone::CallFunc_IsMissionCleared_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateNone, CallFunc_IsMissionCleared_ReturnValue_1) == 0x000019, "Member 'WB_ui_MissionResult_C_StateNone::CallFunc_IsMissionCleared_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateNone, CallFunc_GetPlayerManager_PlayerManager) == 0x000020, "Member 'WB_ui_MissionResult_C_StateNone::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateNone, CallFunc_GetBattleMemberPlayerID_ReturnValue) == 0x000028, "Member 'WB_ui_MissionResult_C_StateNone::CallFunc_GetBattleMemberPlayerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateNone, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000029, "Member 'WB_ui_MissionResult_C_StateNone::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WB_ui_MissionResult.WB_ui_MissionResult_C.StateOpen
// 0x000C (0x000C - 0x0000)
struct WB_ui_MissionResult_C_StateOpen final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSkipInAnimation_IsSkip;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_MissionResult_C_StateOpen) == 0x000004, "Wrong alignment on WB_ui_MissionResult_C_StateOpen");
static_assert(sizeof(WB_ui_MissionResult_C_StateOpen) == 0x00000C, "Wrong size on WB_ui_MissionResult_C_StateOpen");
static_assert(offsetof(WB_ui_MissionResult_C_StateOpen, SubState) == 0x000000, "Member 'WB_ui_MissionResult_C_StateOpen::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateOpen, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_MissionResult_C_StateOpen::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateOpen, CallFunc_IsSkipInAnimation_IsSkip) == 0x000005, "Member 'WB_ui_MissionResult_C_StateOpen::CallFunc_IsSkipInAnimation_IsSkip' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateOpen, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'WB_ui_MissionResult_C_StateOpen::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateOpen, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000007, "Member 'WB_ui_MissionResult_C_StateOpen::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateOpen, CallFunc_BooleanAND_ReturnValue) == 0x000008, "Member 'WB_ui_MissionResult_C_StateOpen::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WB_ui_MissionResult.WB_ui_MissionResult_C.StateLoop
// 0x0070 (0x0070 - 0x0000)
struct WB_ui_MissionResult_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F52[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInput_IsInput;                       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInput_IsInput_1;                     // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F53[0x5];                                     // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame_1;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_isEndSystemMessage_ReturnValue;           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F54[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame_2;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Share_ReturnValue;                        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInput_IsInput_2;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F55[0x5];                                     // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame_3;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStreaming_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F56[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGeneralChoiceResult_ReturnValue;       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEndGeneralChoice_ReturnValue;           // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInput_IsInput_3;                     // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_1;        // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInput_IsInput_4;                     // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInput_IsInput_5;                     // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInput_IsInput_6;                     // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_MissionResult_C_StateLoop) == 0x000008, "Wrong alignment on WB_ui_MissionResult_C_StateLoop");
static_assert(sizeof(WB_ui_MissionResult_C_StateLoop) == 0x000070, "Wrong size on WB_ui_MissionResult_C_StateLoop");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_MissionResult_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000008, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'WB_ui_MissionResult_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_CheckInput_IsInput) == 0x000011, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_CheckInput_IsInput' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_CheckInput_IsInput_1) == 0x000012, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_CheckInput_IsInput_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_GetHUDMainGame_HUDMainGame_1) == 0x000018, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_GetHUDMainGame_HUDMainGame_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_BooleanOR_ReturnValue) == 0x000020, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_isEndSystemMessage_ReturnValue) == 0x000021, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_isEndSystemMessage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_GetDataBaseManager_Manager) == 0x000028, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_GetHUDMainGame_HUDMainGame_2) == 0x000030, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_GetHUDMainGame_HUDMainGame_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_GetText_ReturnValue) == 0x000038, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_Share_ReturnValue) == 0x000048, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_Share_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_CheckInput_IsInput_2) == 0x000049, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_CheckInput_IsInput_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_Not_PreBool_ReturnValue) == 0x00004A, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_GetHUDMainGame_HUDMainGame_3) == 0x000050, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_GetHUDMainGame_HUDMainGame_3' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_IsStreaming_ReturnValue) == 0x000058, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_IsStreaming_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_GetGeneralChoiceResult_ReturnValue) == 0x00005C, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_GetGeneralChoiceResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_Not_PreBool_ReturnValue_1) == 0x000060, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000061, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_BooleanAND_ReturnValue) == 0x000062, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_BooleanAND_ReturnValue_1) == 0x000063, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_IsEndGeneralChoice_ReturnValue) == 0x000064, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_IsEndGeneralChoice_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_CheckInput_IsInput_3) == 0x000065, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_CheckInput_IsInput_3' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_BooleanOR_ReturnValue_1) == 0x000066, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_Not_PreBool_ReturnValue_2) == 0x000067, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000068, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_IsPlayUICurrentAnimation_isPlay_1) == 0x000069, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_IsPlayUICurrentAnimation_isPlay_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_CheckInput_IsInput_4) == 0x00006A, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_CheckInput_IsInput_4' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_CheckInput_IsInput_5) == 0x00006B, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_CheckInput_IsInput_5' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_BooleanAND_ReturnValue_2) == 0x00006C, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateLoop, CallFunc_CheckInput_IsInput_6) == 0x00006D, "Member 'WB_ui_MissionResult_C_StateLoop::CallFunc_CheckInput_IsInput_6' has a wrong offset!");

// Function WB_ui_MissionResult.WB_ui_MissionResult_C.StateClose
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_MissionResult_C_StateClose final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F57[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_InputManager_C*                     CallFunc_GetInputManager_BP_InputManager;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_MissionResult_C_StateClose) == 0x000008, "Wrong alignment on WB_ui_MissionResult_C_StateClose");
static_assert(sizeof(WB_ui_MissionResult_C_StateClose) == 0x000018, "Wrong size on WB_ui_MissionResult_C_StateClose");
static_assert(offsetof(WB_ui_MissionResult_C_StateClose, SubState) == 0x000000, "Member 'WB_ui_MissionResult_C_StateClose::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateClose, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_MissionResult_C_StateClose::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateClose, CallFunc_GetInputManager_BP_InputManager) == 0x000008, "Member 'WB_ui_MissionResult_C_StateClose::CallFunc_GetInputManager_BP_InputManager' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_StateClose, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000010, "Member 'WB_ui_MissionResult_C_StateClose::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");

// Function WB_ui_MissionResult.WB_ui_MissionResult_C.SetCheckMode
// 0x000C (0x000C - 0x0000)
struct WB_ui_MissionResult_C_SetCheckMode final
{
public:
	bool                                          IsCheckMode;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F58[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MissionTitle;                                      // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_MissionResult_C_SetCheckMode) == 0x000004, "Wrong alignment on WB_ui_MissionResult_C_SetCheckMode");
static_assert(sizeof(WB_ui_MissionResult_C_SetCheckMode) == 0x00000C, "Wrong size on WB_ui_MissionResult_C_SetCheckMode");
static_assert(offsetof(WB_ui_MissionResult_C_SetCheckMode, IsCheckMode) == 0x000000, "Member 'WB_ui_MissionResult_C_SetCheckMode::IsCheckMode' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetCheckMode, MissionTitle) == 0x000004, "Member 'WB_ui_MissionResult_C_SetCheckMode::MissionTitle' has a wrong offset!");

// Function WB_ui_MissionResult.WB_ui_MissionResult_C.SetupText
// 0x02B0 (0x02B0 - 0x0000)
struct WB_ui_MissionResult_C_SetupText final
{
public:
	class UDatabaseManager*                       _Manager;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetMenuCommonMessage_ReturnValue;         // 0x0008(0x0018)()
	class FText                                   CallFunc_GetMenuCommonMessage_ReturnValue_1;       // 0x0020(0x0018)()
	class FText                                   CallFunc_GetMenuCommonMessage_ReturnValue_2;       // 0x0038(0x0018)()
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	class FString                                 CallFunc_GetText_ReturnValue_1;                    // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue_2;                    // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0098(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x00B0(0x0018)()
	class FString                                 CallFunc_GetText_ReturnValue_3;                    // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue_4;                    // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x00E8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0100(0x0018)()
	class FString                                 CallFunc_GetText_ReturnValue_5;                    // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_5;          // 0x0128(0x0018)()
	class FString                                 CallFunc_GetText_ReturnValue_6;                    // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_6;          // 0x0150(0x0018)()
	class FString                                 CallFunc_GetText_ReturnValue_7;                    // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_7;          // 0x0178(0x0018)()
	class FString                                 CallFunc_GetText_ReturnValue_8;                    // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_8;          // 0x01A0(0x0018)()
	class FString                                 CallFunc_GetText_ReturnValue_9;                    // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_9;          // 0x01C8(0x0018)()
	class FString                                 CallFunc_GetText_ReturnValue_10;                   // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_10;         // 0x01F0(0x0018)()
	class FString                                 CallFunc_GetText_ReturnValue_11;                   // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_11;         // 0x0218(0x0018)()
	class FString                                 CallFunc_GetText_ReturnValue_12;                   // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue_13;                   // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_12;         // 0x0250(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_13;         // 0x0268(0x0018)()
	class FString                                 CallFunc_GetText_ReturnValue_14;                   // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_14;         // 0x0290(0x0018)()
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_MissionResult_C_SetupText) == 0x000008, "Wrong alignment on WB_ui_MissionResult_C_SetupText");
static_assert(sizeof(WB_ui_MissionResult_C_SetupText) == 0x0002B0, "Wrong size on WB_ui_MissionResult_C_SetupText");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, _Manager) == 0x000000, "Member 'WB_ui_MissionResult_C_SetupText::_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_GetMenuCommonMessage_ReturnValue) == 0x000008, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_GetMenuCommonMessage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_GetMenuCommonMessage_ReturnValue_1) == 0x000020, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_GetMenuCommonMessage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_GetMenuCommonMessage_ReturnValue_2) == 0x000038, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_GetMenuCommonMessage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_GetText_ReturnValue) == 0x000050, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_GetText_ReturnValue_1) == 0x000078, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_GetText_ReturnValue_2) == 0x000088, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_GetText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000098, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0000B0, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_GetText_ReturnValue_3) == 0x0000C8, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_GetText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_GetText_ReturnValue_4) == 0x0000D8, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_GetText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_Conv_StringToText_ReturnValue_3) == 0x0000E8, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_Conv_StringToText_ReturnValue_4) == 0x000100, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_GetText_ReturnValue_5) == 0x000118, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_GetText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_Conv_StringToText_ReturnValue_5) == 0x000128, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_Conv_StringToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_GetText_ReturnValue_6) == 0x000140, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_GetText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_Conv_StringToText_ReturnValue_6) == 0x000150, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_Conv_StringToText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_GetText_ReturnValue_7) == 0x000168, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_GetText_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_Conv_StringToText_ReturnValue_7) == 0x000178, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_Conv_StringToText_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_GetText_ReturnValue_8) == 0x000190, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_GetText_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_Conv_StringToText_ReturnValue_8) == 0x0001A0, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_Conv_StringToText_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_GetText_ReturnValue_9) == 0x0001B8, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_GetText_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_Conv_StringToText_ReturnValue_9) == 0x0001C8, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_Conv_StringToText_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_GetText_ReturnValue_10) == 0x0001E0, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_GetText_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_Conv_StringToText_ReturnValue_10) == 0x0001F0, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_Conv_StringToText_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_GetText_ReturnValue_11) == 0x000208, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_GetText_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_Conv_StringToText_ReturnValue_11) == 0x000218, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_Conv_StringToText_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_GetText_ReturnValue_12) == 0x000230, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_GetText_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_GetText_ReturnValue_13) == 0x000240, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_GetText_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_Conv_StringToText_ReturnValue_12) == 0x000250, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_Conv_StringToText_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_Conv_StringToText_ReturnValue_13) == 0x000268, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_Conv_StringToText_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_GetText_ReturnValue_14) == 0x000280, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_GetText_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_Conv_StringToText_ReturnValue_14) == 0x000290, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_Conv_StringToText_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupText, CallFunc_GetDataBaseManager_Manager) == 0x0002A8, "Member 'WB_ui_MissionResult_C_SetupText::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");

// Function WB_ui_MissionResult.WB_ui_MissionResult_C.SetupGuide
// 0x0038 (0x0038 - 0x0000)
struct WB_ui_MissionResult_C_SetupGuide final
{
public:
	bool                                          _IsEnableShare;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F59[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         _index;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStreaming_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue;              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F5A[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_MissionResult_C_SetupGuide) == 0x000004, "Wrong alignment on WB_ui_MissionResult_C_SetupGuide");
static_assert(sizeof(WB_ui_MissionResult_C_SetupGuide) == 0x000038, "Wrong size on WB_ui_MissionResult_C_SetupGuide");
static_assert(offsetof(WB_ui_MissionResult_C_SetupGuide, _IsEnableShare) == 0x000000, "Member 'WB_ui_MissionResult_C_SetupGuide::_IsEnableShare' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupGuide, _index) == 0x000004, "Member 'WB_ui_MissionResult_C_SetupGuide::_index' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupGuide, Temp_int_Variable) == 0x000008, "Member 'WB_ui_MissionResult_C_SetupGuide::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupGuide, Temp_int_Variable_1) == 0x00000C, "Member 'WB_ui_MissionResult_C_SetupGuide::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupGuide, Temp_int_Variable_2) == 0x000010, "Member 'WB_ui_MissionResult_C_SetupGuide::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupGuide, CallFunc_IsStreaming_ReturnValue) == 0x000014, "Member 'WB_ui_MissionResult_C_SetupGuide::CallFunc_IsStreaming_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupGuide, CallFunc_Not_PreBool_ReturnValue) == 0x000015, "Member 'WB_ui_MissionResult_C_SetupGuide::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupGuide, CallFunc_GetPlatformType_ReturnValue) == 0x000016, "Member 'WB_ui_MissionResult_C_SetupGuide::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupGuide, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000017, "Member 'WB_ui_MissionResult_C_SetupGuide::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupGuide, CallFunc_BooleanAND_ReturnValue) == 0x000018, "Member 'WB_ui_MissionResult_C_SetupGuide::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupGuide, Temp_int_Variable_3) == 0x00001C, "Member 'WB_ui_MissionResult_C_SetupGuide::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupGuide, Temp_int_Variable_4) == 0x000020, "Member 'WB_ui_MissionResult_C_SetupGuide::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupGuide, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WB_ui_MissionResult_C_SetupGuide::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupGuide, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'WB_ui_MissionResult_C_SetupGuide::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupGuide, CallFunc_Add_IntInt_ReturnValue_2) == 0x00002C, "Member 'WB_ui_MissionResult_C_SetupGuide::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupGuide, CallFunc_Add_IntInt_ReturnValue_3) == 0x000030, "Member 'WB_ui_MissionResult_C_SetupGuide::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupGuide, CallFunc_Add_IntInt_ReturnValue_4) == 0x000034, "Member 'WB_ui_MissionResult_C_SetupGuide::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");

// Function WB_ui_MissionResult.WB_ui_MissionResult_C.SetupParamEach
// 0x00A0 (0x00A0 - 0x0000)
struct WB_ui_MissionResult_C_SetupParamEach final
{
public:
	int32                                         Type;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Score;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleSimulatorRank                          Rank;                                              // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F5B[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F5C[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UREDTextBlock*                          CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F5D[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0018)()
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0048(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0060(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0078(0x0018)()
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F5E[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UREDTextBlock*                          CallFunc_Array_Get_Item_1;                         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_MissionResult_C_SetupParamEach) == 0x000008, "Wrong alignment on WB_ui_MissionResult_C_SetupParamEach");
static_assert(sizeof(WB_ui_MissionResult_C_SetupParamEach) == 0x0000A0, "Wrong size on WB_ui_MissionResult_C_SetupParamEach");
static_assert(offsetof(WB_ui_MissionResult_C_SetupParamEach, Type) == 0x000000, "Member 'WB_ui_MissionResult_C_SetupParamEach::Type' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupParamEach, Param) == 0x000004, "Member 'WB_ui_MissionResult_C_SetupParamEach::Param' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupParamEach, Score) == 0x000008, "Member 'WB_ui_MissionResult_C_SetupParamEach::Score' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupParamEach, Rank) == 0x00000C, "Member 'WB_ui_MissionResult_C_SetupParamEach::Rank' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupParamEach, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000010, "Member 'WB_ui_MissionResult_C_SetupParamEach::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupParamEach, CallFunc_Array_Get_Item) == 0x000018, "Member 'WB_ui_MissionResult_C_SetupParamEach::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupParamEach, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'WB_ui_MissionResult_C_SetupParamEach::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupParamEach, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'WB_ui_MissionResult_C_SetupParamEach::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupParamEach, CallFunc_Percent_IntInt_ReturnValue) == 0x000040, "Member 'WB_ui_MissionResult_C_SetupParamEach::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupParamEach, CallFunc_Divide_IntInt_ReturnValue) == 0x000044, "Member 'WB_ui_MissionResult_C_SetupParamEach::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupParamEach, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000048, "Member 'WB_ui_MissionResult_C_SetupParamEach::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupParamEach, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000060, "Member 'WB_ui_MissionResult_C_SetupParamEach::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupParamEach, CallFunc_Conv_IntToText_ReturnValue_3) == 0x000078, "Member 'WB_ui_MissionResult_C_SetupParamEach::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupParamEach, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000090, "Member 'WB_ui_MissionResult_C_SetupParamEach::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionResult_C_SetupParamEach, CallFunc_Array_Get_Item_1) == 0x000098, "Member 'WB_ui_MissionResult_C_SetupParamEach::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function WB_ui_MissionResult.WB_ui_MissionResult_C.SetupRank
// 0x00B8 (0x00B8 - 0x0000)
struct WB_ui_MissionResult_C_SetupRank final
{
public:
	int32                                         Type;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Rank;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _Work;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F5F[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CallFunc_Array_Get_Item_2;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CallFunc_Array_Get_Item_3;                         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_3;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F60[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
