#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Keyboard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Keyboard.WB_ui_Keyboard_C
// 0x0030 (0x0418 - 0x03E8)
class UWB_ui_Keyboard_C final : public UUIConfigKeyboardMouse
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default;                                           // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                All_Color;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_ViewRange;                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDScrollBox*                          REDScrollBox_0;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_KeyboardList_Parts_1_C*          WB_ui_KeyboardList_Parts_1;                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Keyboard(int32 EntryPoint);
	void Construct();
	void ListUnFocus(class UUserWidget* Widget);
	void ListFocus(class UUserWidget* Widget);
	void ListUnFocusMouse(int32 IsMouseScroll, int32 Param_Index, class UUserWidget* Widget);
	void ListFocusMouse(int32 IsMouseScroll, int32 Param_Index, class UUserWidget* Widget);
	void ListUpdateElement(int32 Param_Index, class UUserWidget* Widget);
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Keyboard_C">();
	}
	static class UWB_ui_Keyboard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Keyboard_C>();
	}
};
static_assert(alignof(UWB_ui_Keyboard_C) == 0x000008, "Wrong alignment on UWB_ui_Keyboard_C");
static_assert(sizeof(UWB_ui_Keyboard_C) == 0x000418, "Wrong size on UWB_ui_Keyboard_C");
static_assert(offsetof(UWB_ui_Keyboard_C, UberGraphFrame) == 0x0003E8, "Member 'UWB_ui_Keyboard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Keyboard_C, Default) == 0x0003F0, "Member 'UWB_ui_Keyboard_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Keyboard_C, All_Color) == 0x0003F8, "Member 'UWB_ui_Keyboard_C::All_Color' has a wrong offset!");
static_assert(offsetof(UWB_ui_Keyboard_C, CanvasPanel_ViewRange) == 0x000400, "Member 'UWB_ui_Keyboard_C::CanvasPanel_ViewRange' has a wrong offset!");
static_assert(offsetof(UWB_ui_Keyboard_C, REDScrollBox_0) == 0x000408, "Member 'UWB_ui_Keyboard_C::REDScrollBox_0' has a wrong offset!");
static_assert(offsetof(UWB_ui_Keyboard_C, WB_ui_KeyboardList_Parts_1) == 0x000410, "Member 'UWB_ui_Keyboard_C::WB_ui_KeyboardList_Parts_1' has a wrong offset!");

}

