#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_MissionContents_Parts_6

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_MissionContents_Parts_6.WB_ui_MissionContents_Parts_6_C
// 0x0048 (0x0420 - 0x03D8)
class UWB_ui_MissionContents_Parts_6_C final : public UUIMainContentsSubTab
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Unselect;                                          // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Decision;                                          // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_out;                                        // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_in;                                         // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select;                                            // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_mission_category_sub_1;                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_MissionContents_Parts_6(int32 EntryPoint);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_MissionContents_Parts_6_C">();
	}
	static class UWB_ui_MissionContents_Parts_6_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_MissionContents_Parts_6_C>();
	}
};
static_assert(alignof(UWB_ui_MissionContents_Parts_6_C) == 0x000008, "Wrong alignment on UWB_ui_MissionContents_Parts_6_C");
static_assert(sizeof(UWB_ui_MissionContents_Parts_6_C) == 0x000420, "Wrong size on UWB_ui_MissionContents_Parts_6_C");
static_assert(offsetof(UWB_ui_MissionContents_Parts_6_C, UberGraphFrame) == 0x0003D8, "Member 'UWB_ui_MissionContents_Parts_6_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_MissionContents_Parts_6_C, Unselect) == 0x0003E0, "Member 'UWB_ui_MissionContents_Parts_6_C::Unselect' has a wrong offset!");
static_assert(offsetof(UWB_ui_MissionContents_Parts_6_C, Decision) == 0x0003E8, "Member 'UWB_ui_MissionContents_Parts_6_C::Decision' has a wrong offset!");
static_assert(offsetof(UWB_ui_MissionContents_Parts_6_C, Select_out) == 0x0003F0, "Member 'UWB_ui_MissionContents_Parts_6_C::Select_out' has a wrong offset!");
static_assert(offsetof(UWB_ui_MissionContents_Parts_6_C, Select_in) == 0x0003F8, "Member 'UWB_ui_MissionContents_Parts_6_C::Select_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_MissionContents_Parts_6_C, Select) == 0x000400, "Member 'UWB_ui_MissionContents_Parts_6_C::Select' has a wrong offset!");
static_assert(offsetof(UWB_ui_MissionContents_Parts_6_C, Default_none) == 0x000408, "Member 'UWB_ui_MissionContents_Parts_6_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_MissionContents_Parts_6_C, Default) == 0x000410, "Member 'UWB_ui_MissionContents_Parts_6_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_MissionContents_Parts_6_C, Text_mission_category_sub_1) == 0x000418, "Member 'UWB_ui_MissionContents_Parts_6_C::Text_mission_category_sub_1' has a wrong offset!");

}

