#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_DetailMap_Parts_1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "Enum_ui_help_window_type_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_DetailMap_Parts_1.WB_ui_DetailMap_Parts_1_C.ExecuteUbergraph_WB_ui_DetailMap_Parts_1
// 0x00E0 (0x00E0 - 0x0000)
struct WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FRedMouseArgument& Argument, class UObject* PWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FRedMouseArgument& Argument, class UObject* PWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62F3[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FRedMouseArgument& Argument, class UObject* PWidget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FRedMouseArgument& Argument, class UObject* PWidget)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62F4[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62F5[0x2];                                     // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62F6[0x1];                                     // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue_1;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62F7[0x2];                                     // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRedMouseArgument                      K2Node_CustomEvent_argument_3;                     // 0x007C(0x000C)(NoDestructor)
	class UObject*                                K2Node_CustomEvent_pWidget_3;                      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRedMouseArgument                      K2Node_CustomEvent_argument_2;                     // 0x0090(0x000C)(NoDestructor)
	uint8                                         Pad_62F8[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_pWidget_2;                      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62F9[0x2];                                     // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRedMouseArgument                      K2Node_CustomEvent_argument_1;                     // 0x00AC(0x000C)(NoDestructor)
	class UObject*                                K2Node_CustomEvent_pWidget_1;                      // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRedMouseArgument                      K2Node_CustomEvent_argument;                       // 0x00C0(0x000C)(NoDestructor)
	uint8                                         Pad_62FA[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_pWidget;                        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_3;        // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62FB[0x1];                                     // 0x00DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1) == 0x000008, "Wrong alignment on WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1");
static_assert(sizeof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1) == 0x0000E0, "Wrong size on WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, EntryPoint) == 0x000000, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, CallFunc_MakeLiteralByte_ReturnValue) == 0x000024, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000038, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, K2Node_CreateDelegate_OutputDelegate_3) == 0x00003C, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, CallFunc_MakeLiteralInt_ReturnValue) == 0x00004C, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, K2Node_Event_State) == 0x000050, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, K2Node_Event_SubState) == 0x000054, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, K2Node_Event_DeltaSeconds) == 0x000058, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00005C, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000060, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000064, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000065, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000068, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x00006C, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, CallFunc_GetPlatformType_ReturnValue) == 0x000070, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000071, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000072, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000074, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, CallFunc_GetPlatformType_ReturnValue_1) == 0x000078, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::CallFunc_GetPlatformType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000079, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, K2Node_CustomEvent_argument_3) == 0x00007C, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::K2Node_CustomEvent_argument_3' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, K2Node_CustomEvent_pWidget_3) == 0x000088, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::K2Node_CustomEvent_pWidget_3' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, K2Node_CustomEvent_argument_2) == 0x000090, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::K2Node_CustomEvent_argument_2' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, K2Node_CustomEvent_pWidget_2) == 0x0000A0, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::K2Node_CustomEvent_pWidget_2' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000A8, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x0000A9, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, K2Node_CustomEvent_argument_1) == 0x0000AC, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::K2Node_CustomEvent_argument_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, K2Node_CustomEvent_pWidget_1) == 0x0000B8, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::K2Node_CustomEvent_pWidget_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, K2Node_CustomEvent_argument) == 0x0000C0, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::K2Node_CustomEvent_argument' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, K2Node_CustomEvent_pWidget) == 0x0000D0, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::K2Node_CustomEvent_pWidget' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x0000D8, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, CallFunc_EqualEqual_NameName_ReturnValue_3) == 0x0000D9, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::CallFunc_EqualEqual_NameName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x0000DA, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x0000DC, "Member 'WB_ui_DetailMap_Parts_1_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");

// Function WB_ui_DetailMap_Parts_1.WB_ui_DetailMap_Parts_1_C.PlayBlockRMouse
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_DetailMap_Parts_1_C_PlayBlockRMouse final
{
public:
	struct FRedMouseArgument                      Argument;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	uint8                                         Pad_62FC[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                PWidget;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_DetailMap_Parts_1_C_PlayBlockRMouse) == 0x000008, "Wrong alignment on WB_ui_DetailMap_Parts_1_C_PlayBlockRMouse");
static_assert(sizeof(WB_ui_DetailMap_Parts_1_C_PlayBlockRMouse) == 0x000018, "Wrong size on WB_ui_DetailMap_Parts_1_C_PlayBlockRMouse");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_PlayBlockRMouse, Argument) == 0x000000, "Member 'WB_ui_DetailMap_Parts_1_C_PlayBlockRMouse::Argument' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_PlayBlockRMouse, PWidget) == 0x000010, "Member 'WB_ui_DetailMap_Parts_1_C_PlayBlockRMouse::PWidget' has a wrong offset!");

// Function WB_ui_DetailMap_Parts_1.WB_ui_DetailMap_Parts_1_C.PlayBlockLMouse
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_DetailMap_Parts_1_C_PlayBlockLMouse final
{
public:
	struct FRedMouseArgument                      Argument;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	uint8                                         Pad_62FD[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                PWidget;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_DetailMap_Parts_1_C_PlayBlockLMouse) == 0x000008, "Wrong alignment on WB_ui_DetailMap_Parts_1_C_PlayBlockLMouse");
static_assert(sizeof(WB_ui_DetailMap_Parts_1_C_PlayBlockLMouse) == 0x000018, "Wrong size on WB_ui_DetailMap_Parts_1_C_PlayBlockLMouse");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_PlayBlockLMouse, Argument) == 0x000000, "Member 'WB_ui_DetailMap_Parts_1_C_PlayBlockLMouse::Argument' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_PlayBlockLMouse, PWidget) == 0x000010, "Member 'WB_ui_DetailMap_Parts_1_C_PlayBlockLMouse::PWidget' has a wrong offset!");

// Function WB_ui_DetailMap_Parts_1.WB_ui_DetailMap_Parts_1_C.PlayAreaRMouse
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_DetailMap_Parts_1_C_PlayAreaRMouse final
{
public:
	struct FRedMouseArgument                      Argument;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	uint8                                         Pad_62FE[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                PWidget;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_DetailMap_Parts_1_C_PlayAreaRMouse) == 0x000008, "Wrong alignment on WB_ui_DetailMap_Parts_1_C_PlayAreaRMouse");
static_assert(sizeof(WB_ui_DetailMap_Parts_1_C_PlayAreaRMouse) == 0x000018, "Wrong size on WB_ui_DetailMap_Parts_1_C_PlayAreaRMouse");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_PlayAreaRMouse, Argument) == 0x000000, "Member 'WB_ui_DetailMap_Parts_1_C_PlayAreaRMouse::Argument' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_PlayAreaRMouse, PWidget) == 0x000010, "Member 'WB_ui_DetailMap_Parts_1_C_PlayAreaRMouse::PWidget' has a wrong offset!");

// Function WB_ui_DetailMap_Parts_1.WB_ui_DetailMap_Parts_1_C.PlayAreaLMouse
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_DetailMap_Parts_1_C_PlayAreaLMouse final
{
public:
	struct FRedMouseArgument                      Argument;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	uint8                                         Pad_62FF[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                PWidget;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_DetailMap_Parts_1_C_PlayAreaLMouse) == 0x000008, "Wrong alignment on WB_ui_DetailMap_Parts_1_C_PlayAreaLMouse");
static_assert(sizeof(WB_ui_DetailMap_Parts_1_C_PlayAreaLMouse) == 0x000018, "Wrong size on WB_ui_DetailMap_Parts_1_C_PlayAreaLMouse");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_PlayAreaLMouse, Argument) == 0x000000, "Member 'WB_ui_DetailMap_Parts_1_C_PlayAreaLMouse::Argument' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_PlayAreaLMouse, PWidget) == 0x000010, "Member 'WB_ui_DetailMap_Parts_1_C_PlayAreaLMouse::PWidget' has a wrong offset!");

// Function WB_ui_DetailMap_Parts_1.WB_ui_DetailMap_Parts_1_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_DetailMap_Parts_1_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_DetailMap_Parts_1_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_DetailMap_Parts_1_C_UpdateState");
static_assert(sizeof(WB_ui_DetailMap_Parts_1_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_DetailMap_Parts_1_C_UpdateState");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateState, State) == 0x000000, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_DetailMap_Parts_1.WB_ui_DetailMap_Parts_1_C.UpdateText
// 0x0168 (0x0168 - 0x0000)
struct WB_ui_DetailMap_Parts_1_C_UpdateText final
{
public:
	int32                                         LocationNo;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_AreaNo;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0020(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6300[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UWB_ui_DetailMap_Parts_4_C*             CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_DetailMap_Parts_4_C*             CallFunc_Array_Get_Item_1;                         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6301[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00F0(0x0018)()
	class UWB_ui_DetailMap_Parts_4_C*             CallFunc_Array_Get_Item_2;                         // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6302[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager_1;             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_DetailMap_Parts_4_C*             CallFunc_Array_Get_Item_3;                         // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue_1;                    // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0138(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0150(0x0018)()
};
static_assert(alignof(WB_ui_DetailMap_Parts_1_C_UpdateText) == 0x000008, "Wrong alignment on WB_ui_DetailMap_Parts_1_C_UpdateText");
static_assert(sizeof(WB_ui_DetailMap_Parts_1_C_UpdateText) == 0x000168, "Wrong size on WB_ui_DetailMap_Parts_1_C_UpdateText");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, LocationNo) == 0x000000, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::LocationNo' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, Param_AreaNo) == 0x000004, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::Param_AreaNo' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000020, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, CallFunc_Conv_TextToString_ReturnValue) == 0x000038, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000048, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000058, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, CallFunc_Concat_StrStr_ReturnValue) == 0x000060, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000070, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000080, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, CallFunc_Array_Get_Item) == 0x000090, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000098, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, CallFunc_Conv_StringToName_ReturnValue) == 0x0000A8, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, CallFunc_Array_Get_Item_1) == 0x0000B0, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, CallFunc_GetDataBaseManager_Manager) == 0x0000B8, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000C0, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, CallFunc_GetText_ReturnValue) == 0x0000C8, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D8, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000F0, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, CallFunc_Array_Get_Item_2) == 0x000108, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000110, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, CallFunc_GetDataBaseManager_Manager_1) == 0x000118, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::CallFunc_GetDataBaseManager_Manager_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, CallFunc_Array_Get_Item_3) == 0x000120, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, CallFunc_GetText_ReturnValue_1) == 0x000128, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000138, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_UpdateText, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000150, "Member 'WB_ui_DetailMap_Parts_1_C_UpdateText::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");

// Function WB_ui_DetailMap_Parts_1.WB_ui_DetailMap_Parts_1_C.SetupDetaileIconInfo
// 0x0140 (0x0140 - 0x0000)
struct WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo final
{
public:
	bool                                          Draw;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6303[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HelpIndex;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_ui_help_window_type                      HelpID;                                            // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6304[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6305[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6306[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array_1;                          // 0x0040(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_getDebugWorldmapUnlockFlag_ReturnValue;   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6307[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_DetailMap_Parts_2_C*             CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6308[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_2;             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_DetailMap_Parts_2_C*             CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6309[0x2];                                     // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_630A[0x1];                                     // 0x00BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_2;             // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_1;              // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_ui_help_window_type                      CallFunc_Array_Get_Item_2;                         // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_630B[0x6];                                     // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager_1;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager_2;             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_3;                         // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UWB_ui_DetailMap_Parts_2_C*             CallFunc_Array_Get_Item_4;                         // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue_1;                    // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue_2;                    // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UWB_ui_DetailMap_Parts_2_C*>     K2Node_MakeArray_Array_2;                          // 0x0130(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo) == 0x000008, "Wrong alignment on WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo");
static_assert(sizeof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo) == 0x000140, "Wrong size on WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, Draw) == 0x000000, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::Draw' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, HelpIndex) == 0x000004, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::HelpIndex' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, HelpID) == 0x000008, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::HelpID' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, Temp_int_Variable) == 0x00000C, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, Temp_int_Variable_1) == 0x000020, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_Conv_IntToByte_ReturnValue) == 0x000024, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_GetValidValue_ReturnValue) == 0x000025, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_Add_IntInt_ReturnValue_2) == 0x000028, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, K2Node_MakeArray_Array) == 0x000030, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, K2Node_MakeArray_Array_1) == 0x000040, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000050, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_getDebugWorldmapUnlockFlag_ReturnValue) == 0x000058, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_getDebugWorldmapUnlockFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_Array_Get_Item) == 0x000060, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_MakeLiteralInt_ReturnValue) == 0x000068, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_Subtract_IntInt_ReturnValue) == 0x00006C, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000070, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_GetDataBaseManager_Manager) == 0x000078, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_GetText_ReturnValue) == 0x000080, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000090, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_MakeLiteralInt_ReturnValue_1) == 0x000094, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_MakeLiteralInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_MakeLiteralInt_ReturnValue_2) == 0x000098, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_MakeLiteralInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00009C, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000A8, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_IsValid_ReturnValue) == 0x0000A9, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000AC, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, Temp_int_Variable_2) == 0x0000B0, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_Add_IntInt_ReturnValue_4) == 0x0000B4, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x0000B8, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x0000B9, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_Less_IntInt_ReturnValue) == 0x0000BA, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x0000BC, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, Temp_int_Variable_3) == 0x0000C0, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_Conv_IntToByte_ReturnValue_2) == 0x0000C4, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_Conv_IntToByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_GetValidValue_ReturnValue_1) == 0x0000C5, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_GetValidValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_Array_Get_Item_2) == 0x0000C6, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000C7, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_Array_Length_ReturnValue) == 0x0000C8, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_Array_Length_ReturnValue_1) == 0x0000CC, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000D0, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000D1, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_GetDataBaseManager_Manager_1) == 0x0000D8, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_GetDataBaseManager_Manager_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_GetDataBaseManager_Manager_2) == 0x0000E0, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_GetDataBaseManager_Manager_2' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_Array_Get_Item_3) == 0x0000E8, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_Array_Get_Item_4) == 0x0000F8, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo, CallFunc_Conv_StringToName_ReturnValue) == 0x000100, "Member 'WB_ui_DetailMap_Parts_1_C_SetupDetaileIconInfo::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
