#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Brightness

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_ui_Brightness.WB_ui_Brightness_C.ExecuteUbergraph_WB_ui_Brightness
// 0x001C (0x001C - 0x0000)
struct WB_ui_Brightness_C_ExecuteUbergraph_WB_ui_Brightness final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fValue;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brightness_C_ExecuteUbergraph_WB_ui_Brightness) == 0x000004, "Wrong alignment on WB_ui_Brightness_C_ExecuteUbergraph_WB_ui_Brightness");
static_assert(sizeof(WB_ui_Brightness_C_ExecuteUbergraph_WB_ui_Brightness) == 0x00001C, "Wrong size on WB_ui_Brightness_C_ExecuteUbergraph_WB_ui_Brightness");
static_assert(offsetof(WB_ui_Brightness_C_ExecuteUbergraph_WB_ui_Brightness, EntryPoint) == 0x000000, "Member 'WB_ui_Brightness_C_ExecuteUbergraph_WB_ui_Brightness::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Brightness_C_ExecuteUbergraph_WB_ui_Brightness, K2Node_Event_State) == 0x000004, "Member 'WB_ui_Brightness_C_ExecuteUbergraph_WB_ui_Brightness::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Brightness_C_ExecuteUbergraph_WB_ui_Brightness, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_Brightness_C_ExecuteUbergraph_WB_ui_Brightness::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Brightness_C_ExecuteUbergraph_WB_ui_Brightness, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_Brightness_C_ExecuteUbergraph_WB_ui_Brightness::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Brightness_C_ExecuteUbergraph_WB_ui_Brightness, K2Node_Event_fValue) == 0x000010, "Member 'WB_ui_Brightness_C_ExecuteUbergraph_WB_ui_Brightness::K2Node_Event_fValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brightness_C_ExecuteUbergraph_WB_ui_Brightness, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000014, "Member 'WB_ui_Brightness_C_ExecuteUbergraph_WB_ui_Brightness::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brightness_C_ExecuteUbergraph_WB_ui_Brightness, CallFunc_FTrunc_ReturnValue) == 0x000018, "Member 'WB_ui_Brightness_C_ExecuteUbergraph_WB_ui_Brightness::CallFunc_FTrunc_ReturnValue' has a wrong offset!");

// Function WB_ui_Brightness.WB_ui_Brightness_C.applyBrightness
// 0x0004 (0x0004 - 0x0000)
struct WB_ui_Brightness_C_ApplyBrightness final
{
public:
	float                                         FValue;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brightness_C_ApplyBrightness) == 0x000004, "Wrong alignment on WB_ui_Brightness_C_ApplyBrightness");
static_assert(sizeof(WB_ui_Brightness_C_ApplyBrightness) == 0x000004, "Wrong size on WB_ui_Brightness_C_ApplyBrightness");
static_assert(offsetof(WB_ui_Brightness_C_ApplyBrightness, FValue) == 0x000000, "Member 'WB_ui_Brightness_C_ApplyBrightness::FValue' has a wrong offset!");

// Function WB_ui_Brightness.WB_ui_Brightness_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Brightness_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brightness_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Brightness_C_UpdateState");
static_assert(sizeof(WB_ui_Brightness_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Brightness_C_UpdateState");
static_assert(offsetof(WB_ui_Brightness_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Brightness_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Brightness_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Brightness_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Brightness_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Brightness_C_UpdateState::DeltaSeconds' has a wrong offset!");

}

