#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Party_MemberList_Parts_1

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "E_SASKind_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Party_MemberList_Parts_1.WB_ui_Party_MemberList_Parts_1_C.ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1
// 0x00D8 (0x00D8 - 0x0000)
struct WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5048[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5049[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_504A[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_504B[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_504C[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_504D[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_8;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_10;           // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_504E[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_9;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_10;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_11;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_504F[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_11;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_12;           // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5050[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_12;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_13;           // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5051[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_State;                                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_13;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_14;           // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5052[0x2];                                     // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0074(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_14;            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_15;           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5053[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_15;            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_16;           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_17;           // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5054[0x2];                                     // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_16;            // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_17;            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5055[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1) == 0x000008, "Wrong alignment on WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1");
static_assert(sizeof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1) == 0x0000D8, "Wrong size on WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, EntryPoint) == 0x000000, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000011, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000018, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x00001C, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x00001D, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000020, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000024, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000028, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x00002C, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x000030, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x000034, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x000038, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_8) == 0x00003C, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_9) == 0x000040, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_10) == 0x000041, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_9) == 0x000044, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_10) == 0x000048, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_11) == 0x00004C, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_11) == 0x000050, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_12) == 0x000054, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_12) == 0x000058, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_13) == 0x00005C, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, K2Node_Event_State) == 0x000060, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, K2Node_Event_SubState) == 0x000064, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, K2Node_Event_DeltaSeconds) == 0x000068, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_13) == 0x00006C, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, K2Node_SwitchInteger_CmpSuccess) == 0x000070, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_14) == 0x000071, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_GetCachedGeometry_ReturnValue) == 0x000074, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_14) == 0x0000AC, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_15) == 0x0000B0, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_15) == 0x0000B4, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_16) == 0x0000B8, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_17) == 0x0000B9, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_16) == 0x0000BC, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_17) == 0x0000C0, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1, K2Node_MakeArray_Array) == 0x0000C8, "Member 'WB_ui_Party_MemberList_Parts_1_C_ExecuteUbergraph_WB_ui_Party_MemberList_Parts_1::K2Node_MakeArray_Array' has a wrong offset!");

// Function WB_ui_Party_MemberList_Parts_1.WB_ui_Party_MemberList_Parts_1_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Party_MemberList_Parts_1_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Party_MemberList_Parts_1_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Party_MemberList_Parts_1_C_UpdateState");
static_assert(sizeof(WB_ui_Party_MemberList_Parts_1_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Party_MemberList_Parts_1_C_UpdateState");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Party_MemberList_Parts_1_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Party_MemberList_Parts_1_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Party_MemberList_Parts_1_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Party_MemberList_Parts_1.WB_ui_Party_MemberList_Parts_1_C.StateNone
// 0x0014 (0x0014 - 0x0000)
struct WB_ui_Party_MemberList_Parts_1_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5056[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5057[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Party_MemberList_Parts_1_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_Party_MemberList_Parts_1_C_StateNone");
static_assert(sizeof(WB_ui_Party_MemberList_Parts_1_C_StateNone) == 0x000014, "Wrong size on WB_ui_Party_MemberList_Parts_1_C_StateNone");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000005, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000010, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_Party_MemberList_Parts_1.WB_ui_Party_MemberList_Parts_1_C.StateLoop
// 0x005C (0x005C - 0x0000)
struct WB_ui_Party_MemberList_Parts_1_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _WorkSubState;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5058[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5059[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_505A[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_505B[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_1;        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_505C[0x1];                                     // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_2;        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_505D[0x2];                                     // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_8;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_10;           // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_505E[0x1];                                     // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_9;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_10;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Party_MemberList_Parts_1_C_StateLoop) == 0x000004, "Wrong alignment on WB_ui_Party_MemberList_Parts_1_C_StateLoop");
static_assert(sizeof(WB_ui_Party_MemberList_Parts_1_C_StateLoop) == 0x00005C, "Wrong size on WB_ui_Party_MemberList_Parts_1_C_StateLoop");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, _WorkSubState) == 0x000004, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::_WorkSubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue) == 0x000008, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00000C, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_Less_IntInt_ReturnValue) == 0x000011, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000013, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000014, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000018, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00001C, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x00001D, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000020, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000024, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000028, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x00002C, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000030, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_IsPlayUICurrentAnimation_isPlay_1) == 0x000031, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_IsPlayUICurrentAnimation_isPlay_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000032, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000034, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_BooleanOR_ReturnValue) == 0x000038, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_BooleanOR_ReturnValue_1) == 0x000039, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_BooleanOR_ReturnValue_2) == 0x00003A, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_Less_IntInt_ReturnValue_1) == 0x00003B, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_BooleanOR_ReturnValue_3) == 0x00003C, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x00003D, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x00003E, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x00003F, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x000040, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x000044, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_IsPlayUICurrentAnimation_isPlay_2) == 0x000048, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_IsPlayUICurrentAnimation_isPlay_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x000049, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_8) == 0x00004C, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000050, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_9) == 0x000051, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_10) == 0x000052, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_9) == 0x000054, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_10) == 0x000058, "Member 'WB_ui_Party_MemberList_Parts_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_10' has a wrong offset!");

// Function WB_ui_Party_MemberList_Parts_1.WB_ui_Party_MemberList_Parts_1_C.SetEnable
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Party_MemberList_Parts_1_C_SetEnable final
{
public:
	bool                                          Param_IsEnable;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Party_MemberList_Parts_1_C_SetEnable) == 0x000001, "Wrong alignment on WB_ui_Party_MemberList_Parts_1_C_SetEnable");
static_assert(sizeof(WB_ui_Party_MemberList_Parts_1_C_SetEnable) == 0x000001, "Wrong size on WB_ui_Party_MemberList_Parts_1_C_SetEnable");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_SetEnable, Param_IsEnable) == 0x000000, "Member 'WB_ui_Party_MemberList_Parts_1_C_SetEnable::Param_IsEnable' has a wrong offset!");

// Function WB_ui_Party_MemberList_Parts_1.WB_ui_Party_MemberList_Parts_1_C.SetSelect
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Party_MemberList_Parts_1_C_SetSelect final
{
public:
	bool                                          Param_IsSelect;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Party_MemberList_Parts_1_C_SetSelect) == 0x000001, "Wrong alignment on WB_ui_Party_MemberList_Parts_1_C_SetSelect");
static_assert(sizeof(WB_ui_Party_MemberList_Parts_1_C_SetSelect) == 0x000001, "Wrong size on WB_ui_Party_MemberList_Parts_1_C_SetSelect");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_SetSelect, Param_IsSelect) == 0x000000, "Member 'WB_ui_Party_MemberList_Parts_1_C_SetSelect::Param_IsSelect' has a wrong offset!");

// Function WB_ui_Party_MemberList_Parts_1.WB_ui_Party_MemberList_Parts_1_C.SetLock
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Party_MemberList_Parts_1_C_SetLock final
{
public:
	bool                                          Param_IsLock;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Party_MemberList_Parts_1_C_SetLock) == 0x000001, "Wrong alignment on WB_ui_Party_MemberList_Parts_1_C_SetLock");
static_assert(sizeof(WB_ui_Party_MemberList_Parts_1_C_SetLock) == 0x000001, "Wrong size on WB_ui_Party_MemberList_Parts_1_C_SetLock");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_SetLock, Param_IsLock) == 0x000000, "Member 'WB_ui_Party_MemberList_Parts_1_C_SetLock::Param_IsLock' has a wrong offset!");

// Function WB_ui_Party_MemberList_Parts_1.WB_ui_Party_MemberList_Parts_1_C.SetCharacterStruct
// 0x01F0 (0x01F0 - 0x0000)
struct WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct final
{
public:
	struct FPlayerInfo                            Param;                                             // 0x0000(0x00D0)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	TArray<E_SASKind>                             _SasList;                                          // 0x00D0(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         TempCharaHP;                                       // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TempCharaLV;                                       // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TempCharaID;                                       // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_505F[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisibleCharaNameForProgressID_ReturnValue; // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_4;         // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5060[0x2];                                     // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0110(0x0018)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5061[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_RightChop_ReturnValue;                    // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5062[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5063[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0178(0x0018)()
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5064[0x4];                                     // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager_1;             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue_1;                    // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01B0(0x0018)()
	TArray<E_SASKind>                             K2Node_MakeArray_Array_1;                          // 0x01C8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class UUserParamManager*                      CallFunc_GetUserParamManager_UserParamManager;     // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5065[0x3];                                     // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBondsMaxLevel_ReturnValue;             // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5066[0x3];                                     // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBondsLevel_ReturnValue;                // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct) == 0x000008, "Wrong alignment on WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct");
static_assert(sizeof(WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct) == 0x0001F0, "Wrong size on WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct, Param) == 0x000000, "Member 'WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct::Param' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct, _SasList) == 0x0000D0, "Member 'WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct::_SasList' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct, TempCharaHP) == 0x0000E0, "Member 'WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct::TempCharaHP' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct, TempCharaLV) == 0x0000E4, "Member 'WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct::TempCharaLV' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct, TempCharaID) == 0x0000E8, "Member 'WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct::TempCharaID' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct, CallFunc_GetEventManager_EventManager) == 0x0000F0, "Member 'WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000F8, "Member 'WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct, CallFunc_IsVisibleCharaNameForProgressID_ReturnValue) == 0x0000F9, "Member 'WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct::CallFunc_IsVisibleCharaNameForProgressID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0000FA, "Member 'WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x0000FB, "Member 'WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct, CallFunc_Greater_FloatFloat_ReturnValue_3) == 0x0000FC, "Member 'WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct::CallFunc_Greater_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct, CallFunc_Greater_FloatFloat_ReturnValue_4) == 0x0000FD, "Member 'WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct::CallFunc_Greater_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct, K2Node_MakeArray_Array) == 0x000100, "Member 'WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct, CallFunc_Conv_IntToText_ReturnValue) == 0x000110, "Member 'WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000128, "Member 'WB_ui_Party_MemberList_Parts_1_C_SetCharacterStruct::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
