#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_ObjectGuide_Parts_1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_ObjectGuide_Parts_1.WB_ui_ObjectGuide_Parts_1_C.ExecuteUbergraph_WB_ui_ObjectGuide_Parts_1
// 0x0014 (0x0014 - 0x0000)
struct WB_ui_ObjectGuide_Parts_1_C_ExecuteUbergraph_WB_ui_ObjectGuide_Parts_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_ObjectGuide_Parts_1_C_ExecuteUbergraph_WB_ui_ObjectGuide_Parts_1) == 0x000004, "Wrong alignment on WB_ui_ObjectGuide_Parts_1_C_ExecuteUbergraph_WB_ui_ObjectGuide_Parts_1");
static_assert(sizeof(WB_ui_ObjectGuide_Parts_1_C_ExecuteUbergraph_WB_ui_ObjectGuide_Parts_1) == 0x000014, "Wrong size on WB_ui_ObjectGuide_Parts_1_C_ExecuteUbergraph_WB_ui_ObjectGuide_Parts_1");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_ExecuteUbergraph_WB_ui_ObjectGuide_Parts_1, EntryPoint) == 0x000000, "Member 'WB_ui_ObjectGuide_Parts_1_C_ExecuteUbergraph_WB_ui_ObjectGuide_Parts_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_ExecuteUbergraph_WB_ui_ObjectGuide_Parts_1, K2Node_Event_State) == 0x000004, "Member 'WB_ui_ObjectGuide_Parts_1_C_ExecuteUbergraph_WB_ui_ObjectGuide_Parts_1::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_ExecuteUbergraph_WB_ui_ObjectGuide_Parts_1, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_ObjectGuide_Parts_1_C_ExecuteUbergraph_WB_ui_ObjectGuide_Parts_1::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_ExecuteUbergraph_WB_ui_ObjectGuide_Parts_1, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_ObjectGuide_Parts_1_C_ExecuteUbergraph_WB_ui_ObjectGuide_Parts_1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_ExecuteUbergraph_WB_ui_ObjectGuide_Parts_1, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'WB_ui_ObjectGuide_Parts_1_C_ExecuteUbergraph_WB_ui_ObjectGuide_Parts_1::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_ui_ObjectGuide_Parts_1.WB_ui_ObjectGuide_Parts_1_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_ObjectGuide_Parts_1_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_ObjectGuide_Parts_1_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_ObjectGuide_Parts_1_C_UpdateState");
static_assert(sizeof(WB_ui_ObjectGuide_Parts_1_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_ObjectGuide_Parts_1_C_UpdateState");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_UpdateState, State) == 0x000000, "Member 'WB_ui_ObjectGuide_Parts_1_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_ObjectGuide_Parts_1_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_ObjectGuide_Parts_1_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_ObjectGuide_Parts_1.WB_ui_ObjectGuide_Parts_1_C.StateNone
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_ObjectGuide_Parts_1_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_ObjectGuide_Parts_1_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_ObjectGuide_Parts_1_C_StateNone");
static_assert(sizeof(WB_ui_ObjectGuide_Parts_1_C_StateNone) == 0x000008, "Wrong size on WB_ui_ObjectGuide_Parts_1_C_StateNone");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_ObjectGuide_Parts_1_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_ObjectGuide_Parts_1_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_ui_ObjectGuide_Parts_1.WB_ui_ObjectGuide_Parts_1_C.StateLoop
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_ObjectGuide_Parts_1_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_1;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_ObjectGuide_Parts_1_C_StateLoop) == 0x000004, "Wrong alignment on WB_ui_ObjectGuide_Parts_1_C_StateLoop");
static_assert(sizeof(WB_ui_ObjectGuide_Parts_1_C_StateLoop) == 0x000008, "Wrong size on WB_ui_ObjectGuide_Parts_1_C_StateLoop");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_ObjectGuide_Parts_1_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_ObjectGuide_Parts_1_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_StateLoop, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000005, "Member 'WB_ui_ObjectGuide_Parts_1_C_StateLoop::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_StateLoop, CallFunc_IsPlayUICurrentAnimation_isPlay_1) == 0x000006, "Member 'WB_ui_ObjectGuide_Parts_1_C_StateLoop::CallFunc_IsPlayUICurrentAnimation_isPlay_1' has a wrong offset!");

// Function WB_ui_ObjectGuide_Parts_1.WB_ui_ObjectGuide_Parts_1_C.setMessage
// 0x0030 (0x0030 - 0x0000)
struct WB_ui_ObjectGuide_Parts_1_C_SetMessage final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_getTextRect_rect;                         // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_ObjectGuide_Parts_1_C_SetMessage) == 0x000010, "Wrong alignment on WB_ui_ObjectGuide_Parts_1_C_SetMessage");
static_assert(sizeof(WB_ui_ObjectGuide_Parts_1_C_SetMessage) == 0x000030, "Wrong size on WB_ui_ObjectGuide_Parts_1_C_SetMessage");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_SetMessage, Message) == 0x000000, "Member 'WB_ui_ObjectGuide_Parts_1_C_SetMessage::Message' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_SetMessage, CallFunc_getTextRect_rect) == 0x000010, "Member 'WB_ui_ObjectGuide_Parts_1_C_SetMessage::CallFunc_getTextRect_rect' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_SetMessage, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000020, "Member 'WB_ui_ObjectGuide_Parts_1_C_SetMessage::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_SetMessage, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000024, "Member 'WB_ui_ObjectGuide_Parts_1_C_SetMessage::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_SetMessage, CallFunc_MakeVector2D_ReturnValue) == 0x000028, "Member 'WB_ui_ObjectGuide_Parts_1_C_SetMessage::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WB_ui_ObjectGuide_Parts_1.WB_ui_ObjectGuide_Parts_1_C.IsPlayingOpenAnimation
// 0x000C (0x000C - 0x0000)
struct WB_ui_ObjectGuide_Parts_1_C_IsPlayingOpenAnimation final
{
public:
	bool                                          Param_IsPlaying;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B6D[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetUICurrentAnimationIndex_Index;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_ObjectGuide_Parts_1_C_IsPlayingOpenAnimation) == 0x000004, "Wrong alignment on WB_ui_ObjectGuide_Parts_1_C_IsPlayingOpenAnimation");
static_assert(sizeof(WB_ui_ObjectGuide_Parts_1_C_IsPlayingOpenAnimation) == 0x00000C, "Wrong size on WB_ui_ObjectGuide_Parts_1_C_IsPlayingOpenAnimation");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_IsPlayingOpenAnimation, Param_IsPlaying) == 0x000000, "Member 'WB_ui_ObjectGuide_Parts_1_C_IsPlayingOpenAnimation::Param_IsPlaying' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_IsPlayingOpenAnimation, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000001, "Member 'WB_ui_ObjectGuide_Parts_1_C_IsPlayingOpenAnimation::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_IsPlayingOpenAnimation, CallFunc_GetUICurrentAnimationIndex_Index) == 0x000004, "Member 'WB_ui_ObjectGuide_Parts_1_C_IsPlayingOpenAnimation::CallFunc_GetUICurrentAnimationIndex_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_IsPlayingOpenAnimation, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'WB_ui_ObjectGuide_Parts_1_C_IsPlayingOpenAnimation::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_IsPlayingOpenAnimation, CallFunc_BooleanAND_ReturnValue) == 0x000009, "Member 'WB_ui_ObjectGuide_Parts_1_C_IsPlayingOpenAnimation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WB_ui_ObjectGuide_Parts_1.WB_ui_ObjectGuide_Parts_1_C.IsPlayingCloseAnimation
// 0x000C (0x000C - 0x0000)
struct WB_ui_ObjectGuide_Parts_1_C_IsPlayingCloseAnimation final
{
public:
	bool                                          Param_IsPlaying;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B6E[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetUICurrentAnimationIndex_Index;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_ObjectGuide_Parts_1_C_IsPlayingCloseAnimation) == 0x000004, "Wrong alignment on WB_ui_ObjectGuide_Parts_1_C_IsPlayingCloseAnimation");
static_assert(sizeof(WB_ui_ObjectGuide_Parts_1_C_IsPlayingCloseAnimation) == 0x00000C, "Wrong size on WB_ui_ObjectGuide_Parts_1_C_IsPlayingCloseAnimation");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_IsPlayingCloseAnimation, Param_IsPlaying) == 0x000000, "Member 'WB_ui_ObjectGuide_Parts_1_C_IsPlayingCloseAnimation::Param_IsPlaying' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_IsPlayingCloseAnimation, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000001, "Member 'WB_ui_ObjectGuide_Parts_1_C_IsPlayingCloseAnimation::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_IsPlayingCloseAnimation, CallFunc_GetUICurrentAnimationIndex_Index) == 0x000004, "Member 'WB_ui_ObjectGuide_Parts_1_C_IsPlayingCloseAnimation::CallFunc_GetUICurrentAnimationIndex_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_IsPlayingCloseAnimation, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'WB_ui_ObjectGuide_Parts_1_C_IsPlayingCloseAnimation::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_Parts_1_C_IsPlayingCloseAnimation, CallFunc_BooleanAND_ReturnValue) == 0x000009, "Member 'WB_ui_ObjectGuide_Parts_1_C_IsPlayingCloseAnimation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

