#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_BrainMap_LineEffect_3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_BrainMap_LineEffect_3.WB_ui_BrainMap_LineEffect_3_C
// 0x0020 (0x03A8 - 0x0388)
class UWB_ui_BrainMap_LineEffect_3_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Decision_2;                                        // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Decision;                                          // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Line_eff_1;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_BrainMap_LineEffect_3(int32 EntryPoint);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_BrainMap_LineEffect_3_C">();
	}
	static class UWB_ui_BrainMap_LineEffect_3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_BrainMap_LineEffect_3_C>();
	}
};
static_assert(alignof(UWB_ui_BrainMap_LineEffect_3_C) == 0x000008, "Wrong alignment on UWB_ui_BrainMap_LineEffect_3_C");
static_assert(sizeof(UWB_ui_BrainMap_LineEffect_3_C) == 0x0003A8, "Wrong size on UWB_ui_BrainMap_LineEffect_3_C");
static_assert(offsetof(UWB_ui_BrainMap_LineEffect_3_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_BrainMap_LineEffect_3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_LineEffect_3_C, Decision_2) == 0x000390, "Member 'UWB_ui_BrainMap_LineEffect_3_C::Decision_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_LineEffect_3_C, Decision) == 0x000398, "Member 'UWB_ui_BrainMap_LineEffect_3_C::Decision' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_LineEffect_3_C, Line_eff_1) == 0x0003A0, "Member 'UWB_ui_BrainMap_LineEffect_3_C::Line_eff_1' has a wrong offset!");

}

