#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Success

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Success.WB_ui_Success_C.ExecuteUbergraph_WB_ui_Success
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_Success_C_ExecuteUbergraph_WB_ui_Success final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_574F[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Success_C_ExecuteUbergraph_WB_ui_Success) == 0x000004, "Wrong alignment on WB_ui_Success_C_ExecuteUbergraph_WB_ui_Success");
static_assert(sizeof(WB_ui_Success_C_ExecuteUbergraph_WB_ui_Success) == 0x000018, "Wrong size on WB_ui_Success_C_ExecuteUbergraph_WB_ui_Success");
static_assert(offsetof(WB_ui_Success_C_ExecuteUbergraph_WB_ui_Success, EntryPoint) == 0x000000, "Member 'WB_ui_Success_C_ExecuteUbergraph_WB_ui_Success::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_ExecuteUbergraph_WB_ui_Success, K2Node_Event_State) == 0x000004, "Member 'WB_ui_Success_C_ExecuteUbergraph_WB_ui_Success::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_ExecuteUbergraph_WB_ui_Success, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_Success_C_ExecuteUbergraph_WB_ui_Success::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_ExecuteUbergraph_WB_ui_Success, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_Success_C_ExecuteUbergraph_WB_ui_Success::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_ExecuteUbergraph_WB_ui_Success, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'WB_ui_Success_C_ExecuteUbergraph_WB_ui_Success::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_ExecuteUbergraph_WB_ui_Success, CallFunc_Add_FloatFloat_ReturnValue) == 0x000014, "Member 'WB_ui_Success_C_ExecuteUbergraph_WB_ui_Success::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function WB_ui_Success.WB_ui_Success_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Success_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Success_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Success_C_UpdateState");
static_assert(sizeof(WB_ui_Success_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Success_C_UpdateState");
static_assert(offsetof(WB_ui_Success_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Success_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Success_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Success_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Success.WB_ui_Success_C.StateNone
// 0x0020 (0x0020 - 0x0000)
struct WB_ui_Success_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5750[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetScreenOffset_calcOffset;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Success_C_StateNone) == 0x000008, "Wrong alignment on WB_ui_Success_C_StateNone");
static_assert(sizeof(WB_ui_Success_C_StateNone) == 0x000020, "Wrong size on WB_ui_Success_C_StateNone");
static_assert(offsetof(WB_ui_Success_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_Success_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_Success_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_StateNone, CallFunc_GetPlayerManager_PlayerManager) == 0x000008, "Member 'WB_ui_Success_C_StateNone::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_StateNone, CallFunc_GetPlayer_ReturnValue) == 0x000010, "Member 'WB_ui_Success_C_StateNone::CallFunc_GetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_StateNone, CallFunc_GetScreenOffset_calcOffset) == 0x000018, "Member 'WB_ui_Success_C_StateNone::CallFunc_GetScreenOffset_calcOffset' has a wrong offset!");

// Function WB_ui_Success.WB_ui_Success_C.StateOpen
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Success_C_StateOpen final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5751[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Success_C_StateOpen) == 0x000008, "Wrong alignment on WB_ui_Success_C_StateOpen");
static_assert(sizeof(WB_ui_Success_C_StateOpen) == 0x000010, "Wrong size on WB_ui_Success_C_StateOpen");
static_assert(offsetof(WB_ui_Success_C_StateOpen, SubState) == 0x000000, "Member 'WB_ui_Success_C_StateOpen::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_StateOpen, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_Success_C_StateOpen::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_StateOpen, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000005, "Member 'WB_ui_Success_C_StateOpen::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_StateOpen, CallFunc_PlaySE_ReturnValue) == 0x000008, "Member 'WB_ui_Success_C_StateOpen::CallFunc_PlaySE_ReturnValue' has a wrong offset!");

// Function WB_ui_Success.WB_ui_Success_C.StateLoop
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_Success_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Success_C_StateLoop) == 0x000004, "Wrong alignment on WB_ui_Success_C_StateLoop");
static_assert(sizeof(WB_ui_Success_C_StateLoop) == 0x000008, "Wrong size on WB_ui_Success_C_StateLoop");
static_assert(offsetof(WB_ui_Success_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_Success_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_Success_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_StateLoop, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000005, "Member 'WB_ui_Success_C_StateLoop::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function WB_ui_Success.WB_ui_Success_C.StateClose
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_Success_C_StateClose final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Success_C_StateClose) == 0x000004, "Wrong alignment on WB_ui_Success_C_StateClose");
static_assert(sizeof(WB_ui_Success_C_StateClose) == 0x000008, "Wrong size on WB_ui_Success_C_StateClose");
static_assert(offsetof(WB_ui_Success_C_StateClose, SubState) == 0x000000, "Member 'WB_ui_Success_C_StateClose::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_StateClose, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_Success_C_StateClose::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_StateClose, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000005, "Member 'WB_ui_Success_C_StateClose::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");

// Function WB_ui_Success.WB_ui_Success_C.setMessage
// 0x0030 (0x0030 - 0x0000)
struct WB_ui_Success_C_SetMessage final
{
public:
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
};
static_assert(alignof(WB_ui_Success_C_SetMessage) == 0x000008, "Wrong alignment on WB_ui_Success_C_SetMessage");
static_assert(sizeof(WB_ui_Success_C_SetMessage) == 0x000030, "Wrong size on WB_ui_Success_C_SetMessage");
static_assert(offsetof(WB_ui_Success_C_SetMessage, CallFunc_GetDataBaseManager_Manager) == 0x000000, "Member 'WB_ui_Success_C_SetMessage::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_SetMessage, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'WB_ui_Success_C_SetMessage::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_SetMessage, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WB_ui_Success_C_SetMessage::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WB_ui_Success.WB_ui_Success_C.UpdatePosition
// 0x0070 (0x0070 - 0x0000)
struct WB_ui_Success_C_UpdatePosition final
{
public:
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5752[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ProjectWorldToScreen2_ScreenPosition;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Success_C_UpdatePosition) == 0x000010, "Wrong alignment on WB_ui_Success_C_UpdatePosition");
static_assert(sizeof(WB_ui_Success_C_UpdatePosition) == 0x000070, "Wrong size on WB_ui_Success_C_UpdatePosition");
static_assert(offsetof(WB_ui_Success_C_UpdatePosition, CallFunc_GetTransform_ReturnValue) == 0x000000, "Member 'WB_ui_Success_C_UpdatePosition::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_UpdatePosition, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WB_ui_Success_C_UpdatePosition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_UpdatePosition, CallFunc_BreakTransform_Location) == 0x000034, "Member 'WB_ui_Success_C_UpdatePosition::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_UpdatePosition, CallFunc_BreakTransform_Rotation) == 0x000040, "Member 'WB_ui_Success_C_UpdatePosition::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_UpdatePosition, CallFunc_BreakTransform_Scale) == 0x00004C, "Member 'WB_ui_Success_C_UpdatePosition::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_UpdatePosition, CallFunc_ProjectWorldToScreen2_ScreenPosition) == 0x000058, "Member 'WB_ui_Success_C_UpdatePosition::CallFunc_ProjectWorldToScreen2_ScreenPosition' has a wrong offset!");
static_assert(offsetof(WB_ui_Success_C_UpdatePosition, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000060, "Member 'WB_ui_Success_C_UpdatePosition::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");

}

