#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Tips

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Tips.WB_ui_Tips_C.ExecuteUbergraph_WB_ui_Tips
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Tips_C_ExecuteUbergraph_WB_ui_Tips final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Tips_C_ExecuteUbergraph_WB_ui_Tips) == 0x000004, "Wrong alignment on WB_ui_Tips_C_ExecuteUbergraph_WB_ui_Tips");
static_assert(sizeof(WB_ui_Tips_C_ExecuteUbergraph_WB_ui_Tips) == 0x000010, "Wrong size on WB_ui_Tips_C_ExecuteUbergraph_WB_ui_Tips");
static_assert(offsetof(WB_ui_Tips_C_ExecuteUbergraph_WB_ui_Tips, EntryPoint) == 0x000000, "Member 'WB_ui_Tips_C_ExecuteUbergraph_WB_ui_Tips::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Tips_C_ExecuteUbergraph_WB_ui_Tips, K2Node_Event_State) == 0x000004, "Member 'WB_ui_Tips_C_ExecuteUbergraph_WB_ui_Tips::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Tips_C_ExecuteUbergraph_WB_ui_Tips, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_Tips_C_ExecuteUbergraph_WB_ui_Tips::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Tips_C_ExecuteUbergraph_WB_ui_Tips, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_Tips_C_ExecuteUbergraph_WB_ui_Tips::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function WB_ui_Tips.WB_ui_Tips_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Tips_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Tips_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Tips_C_UpdateState");
static_assert(sizeof(WB_ui_Tips_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Tips_C_UpdateState");
static_assert(offsetof(WB_ui_Tips_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Tips_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Tips_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Tips_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Tips_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Tips_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Tips.WB_ui_Tips_C.SetupTextSize
// 0x0028 (0x0028 - 0x0000)
struct WB_ui_Tips_C_SetupTextSize final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1787[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstance*                        CallFunc_GetRSGameInstance_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveLoadParamClassManager*             CallFunc_GetSaveLoadParamClassManager_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveLoadExSystemParamManager*          CallFunc_GetSaveLoadExSystemParamManager_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELetterSize                                   CallFunc_GetLetterSize_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Tips_C_SetupTextSize) == 0x000008, "Wrong alignment on WB_ui_Tips_C_SetupTextSize");
static_assert(sizeof(WB_ui_Tips_C_SetupTextSize) == 0x000028, "Wrong size on WB_ui_Tips_C_SetupTextSize");
static_assert(offsetof(WB_ui_Tips_C_SetupTextSize, ReturnValue) == 0x000000, "Member 'WB_ui_Tips_C_SetupTextSize::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Tips_C_SetupTextSize, CallFunc_GetRSGameInstance_ReturnValue) == 0x000008, "Member 'WB_ui_Tips_C_SetupTextSize::CallFunc_GetRSGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Tips_C_SetupTextSize, CallFunc_GetSaveLoadParamClassManager_ReturnValue) == 0x000010, "Member 'WB_ui_Tips_C_SetupTextSize::CallFunc_GetSaveLoadParamClassManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Tips_C_SetupTextSize, CallFunc_GetSaveLoadExSystemParamManager_ReturnValue) == 0x000018, "Member 'WB_ui_Tips_C_SetupTextSize::CallFunc_GetSaveLoadExSystemParamManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Tips_C_SetupTextSize, CallFunc_GetLetterSize_ReturnValue) == 0x000020, "Member 'WB_ui_Tips_C_SetupTextSize::CallFunc_GetLetterSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Tips_C_SetupTextSize, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'WB_ui_Tips_C_SetupTextSize::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

