#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Wish

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Wish.WB_ui_Wish_C
// 0x0030 (0x03D0 - 0x03A0)
class UWB_ui_Wish_C final : public UUIWishList
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                All_Color;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Shop_EStatus_Parts_1_C*          WB_ui_Shop_EStatus_Parts_1;                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ShopIteminfo_Parts_1_C*          WB_ui_ShopIteminfo_Parts_1;                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Trade_C*                         WB_ui_Trade;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Wish(int32 EntryPoint);
	void Construct();
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Wish_C">();
	}
	static class UWB_ui_Wish_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Wish_C>();
	}
};
static_assert(alignof(UWB_ui_Wish_C) == 0x000008, "Wrong alignment on UWB_ui_Wish_C");
static_assert(sizeof(UWB_ui_Wish_C) == 0x0003D0, "Wrong size on UWB_ui_Wish_C");
static_assert(offsetof(UWB_ui_Wish_C, UberGraphFrame) == 0x0003A0, "Member 'UWB_ui_Wish_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Wish_C, All_Color) == 0x0003A8, "Member 'UWB_ui_Wish_C::All_Color' has a wrong offset!");
static_assert(offsetof(UWB_ui_Wish_C, Overlay_1) == 0x0003B0, "Member 'UWB_ui_Wish_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Wish_C, WB_ui_Shop_EStatus_Parts_1) == 0x0003B8, "Member 'UWB_ui_Wish_C::WB_ui_Shop_EStatus_Parts_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Wish_C, WB_ui_ShopIteminfo_Parts_1) == 0x0003C0, "Member 'UWB_ui_Wish_C::WB_ui_ShopIteminfo_Parts_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Wish_C, WB_ui_Trade) == 0x0003C8, "Member 'UWB_ui_Wish_C::WB_ui_Trade' has a wrong offset!");

}

