#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_CrossSave_Updating

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_CrossSave_Updating.WB_ui_CrossSave_Updating_C.ExecuteUbergraph_WB_ui_CrossSave_Updating
// 0x0088 (0x0088 - 0x0000)
struct WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF7[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF8[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF9[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_State;                                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Event_Color;                                // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AFA[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AFB[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AFC[0x2];                                     // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AFD[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating) == 0x000008, "Wrong alignment on WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating");
static_assert(sizeof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating) == 0x000088, "Wrong size on WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, EntryPoint) == 0x000000, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000010, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000018, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00001C, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000020, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, K2Node_Event_State) == 0x000024, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, K2Node_Event_SubState) == 0x000028, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, K2Node_Event_DeltaSeconds) == 0x00002C, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000030, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, K2Node_Event_Color) == 0x000034, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::K2Node_Event_Color' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, K2Node_MakeArray_Array) == 0x000048, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000058, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x00005C, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000060, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x00006D, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, CallFunc_MakeLiteralInt_ReturnValue) == 0x000070, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000074, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000078, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x00007C, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating, CallFunc_GetEffectMaterial_ReturnValue) == 0x000080, "Member 'WB_ui_CrossSave_Updating_C_ExecuteUbergraph_WB_ui_CrossSave_Updating::CallFunc_GetEffectMaterial_ReturnValue' has a wrong offset!");

// Function WB_ui_CrossSave_Updating.WB_ui_CrossSave_Updating_C.SetLoadingColor
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_CrossSave_Updating_C_SetLoadingColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_CrossSave_Updating_C_SetLoadingColor) == 0x000004, "Wrong alignment on WB_ui_CrossSave_Updating_C_SetLoadingColor");
static_assert(sizeof(WB_ui_CrossSave_Updating_C_SetLoadingColor) == 0x000010, "Wrong size on WB_ui_CrossSave_Updating_C_SetLoadingColor");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_SetLoadingColor, Color) == 0x000000, "Member 'WB_ui_CrossSave_Updating_C_SetLoadingColor::Color' has a wrong offset!");

// Function WB_ui_CrossSave_Updating.WB_ui_CrossSave_Updating_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_CrossSave_Updating_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_CrossSave_Updating_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_CrossSave_Updating_C_UpdateState");
static_assert(sizeof(WB_ui_CrossSave_Updating_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_CrossSave_Updating_C_UpdateState");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_UpdateState, State) == 0x000000, "Member 'WB_ui_CrossSave_Updating_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_CrossSave_Updating_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_CrossSave_Updating_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_CrossSave_Updating_C_UpdateState::DeltaSeconds' has a wrong offset!");

}

