#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Choice_window

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Choice_window.WB_ui_Choice_window_C
// 0x00B8 (0x05E0 - 0x0528)
class UWB_ui_Choice_window_C final : public UUIGeneralChoice
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0530(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                All_Color;                                         // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Blue;                                     // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Green;                                    // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Red;                                      // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDRetainerBox*                        CA_RetainerBox;                                    // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Choise_list;                                       // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Base;                                        // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Grow;                                        // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_pattern;                                     // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ghost_size;                                        // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font;                                         // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line;                                              // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise;                                             // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PG_Cover_Black;                                    // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_choice_text_1;                                // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Choise_parts_1_C*                WB_ui_Choise_parts_1_1;                            // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Choise_parts_1_C*                WB_ui_Choise_parts_1_2;                            // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Choise_parts_1_C*                WB_ui_Choise_parts_1_3;                            // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Choise_parts_1_C*                WB_ui_Choise_parts_1_4;                            // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Choice_window(int32 EntryPoint);
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Choice_window_C">();
	}
	static class UWB_ui_Choice_window_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Choice_window_C>();
	}
};
static_assert(alignof(UWB_ui_Choice_window_C) == 0x000008, "Wrong alignment on UWB_ui_Choice_window_C");
static_assert(sizeof(UWB_ui_Choice_window_C) == 0x0005E0, "Wrong size on UWB_ui_Choice_window_C");
static_assert(offsetof(UWB_ui_Choice_window_C, UberGraphFrame) == 0x000528, "Member 'UWB_ui_Choice_window_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Choice_window_C, Out) == 0x000530, "Member 'UWB_ui_Choice_window_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Choice_window_C, In) == 0x000538, "Member 'UWB_ui_Choice_window_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Choice_window_C, Default) == 0x000540, "Member 'UWB_ui_Choice_window_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Choice_window_C, All_Color) == 0x000548, "Member 'UWB_ui_Choice_window_C::All_Color' has a wrong offset!");
static_assert(offsetof(UWB_ui_Choice_window_C, CA_Image_Blue) == 0x000550, "Member 'UWB_ui_Choice_window_C::CA_Image_Blue' has a wrong offset!");
static_assert(offsetof(UWB_ui_Choice_window_C, CA_Image_Green) == 0x000558, "Member 'UWB_ui_Choice_window_C::CA_Image_Green' has a wrong offset!");
static_assert(offsetof(UWB_ui_Choice_window_C, CA_Image_Red) == 0x000560, "Member 'UWB_ui_Choice_window_C::CA_Image_Red' has a wrong offset!");
static_assert(offsetof(UWB_ui_Choice_window_C, CA_RetainerBox) == 0x000568, "Member 'UWB_ui_Choice_window_C::CA_RetainerBox' has a wrong offset!");
static_assert(offsetof(UWB_ui_Choice_window_C, Choise_list) == 0x000570, "Member 'UWB_ui_Choice_window_C::Choise_list' has a wrong offset!");
static_assert(offsetof(UWB_ui_Choice_window_C, Frame_Base) == 0x000578, "Member 'UWB_ui_Choice_window_C::Frame_Base' has a wrong offset!");
static_assert(offsetof(UWB_ui_Choice_window_C, Frame_Grow) == 0x000580, "Member 'UWB_ui_Choice_window_C::Frame_Grow' has a wrong offset!");
static_assert(offsetof(UWB_ui_Choice_window_C, Frame_pattern) == 0x000588, "Member 'UWB_ui_Choice_window_C::Frame_pattern' has a wrong offset!");
static_assert(offsetof(UWB_ui_Choice_window_C, Ghost_size) == 0x000590, "Member 'UWB_ui_Choice_window_C::Ghost_size' has a wrong offset!");
static_assert(offsetof(UWB_ui_Choice_window_C, Icon_font) == 0x000598, "Member 'UWB_ui_Choice_window_C::Icon_font' has a wrong offset!");
static_assert(offsetof(UWB_ui_Choice_window_C, Line) == 0x0005A0, "Member 'UWB_ui_Choice_window_C::Line' has a wrong offset!");
static_assert(offsetof(UWB_ui_Choice_window_C, Noise) == 0x0005A8, "Member 'UWB_ui_Choice_window_C::Noise' has a wrong offset!");
static_assert(offsetof(UWB_ui_Choice_window_C, PG_Cover_Black) == 0x0005B0, "Member 'UWB_ui_Choice_window_C::PG_Cover_Black' has a wrong offset!");
static_assert(offsetof(UWB_ui_Choice_window_C, Text_choice_text_1) == 0x0005B8, "Member 'UWB_ui_Choice_window_C::Text_choice_text_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Choice_window_C, WB_ui_Choise_parts_1_1) == 0x0005C0, "Member 'UWB_ui_Choice_window_C::WB_ui_Choise_parts_1_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Choice_window_C, WB_ui_Choise_parts_1_2) == 0x0005C8, "Member 'UWB_ui_Choice_window_C::WB_ui_Choise_parts_1_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Choice_window_C, WB_ui_Choise_parts_1_3) == 0x0005D0, "Member 'UWB_ui_Choice_window_C::WB_ui_Choise_parts_1_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Choice_window_C, WB_ui_Choise_parts_1_4) == 0x0005D8, "Member 'UWB_ui_Choice_window_C::WB_ui_Choise_parts_1_4' has a wrong offset!");

}

