#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Info_window_1

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_ui_Info_window_1.WB_ui_Info_window_1_C.ExecuteUbergraph_WB_ui_Info_window_1
// 0x0028 (0x0028 - 0x0000)
struct WB_ui_Info_window_1_C_ExecuteUbergraph_WB_ui_Info_window_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Info_window_1_C_ExecuteUbergraph_WB_ui_Info_window_1) == 0x000008, "Wrong alignment on WB_ui_Info_window_1_C_ExecuteUbergraph_WB_ui_Info_window_1");
static_assert(sizeof(WB_ui_Info_window_1_C_ExecuteUbergraph_WB_ui_Info_window_1) == 0x000028, "Wrong size on WB_ui_Info_window_1_C_ExecuteUbergraph_WB_ui_Info_window_1");
static_assert(offsetof(WB_ui_Info_window_1_C_ExecuteUbergraph_WB_ui_Info_window_1, EntryPoint) == 0x000000, "Member 'WB_ui_Info_window_1_C_ExecuteUbergraph_WB_ui_Info_window_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Info_window_1_C_ExecuteUbergraph_WB_ui_Info_window_1, K2Node_Event_State) == 0x000004, "Member 'WB_ui_Info_window_1_C_ExecuteUbergraph_WB_ui_Info_window_1::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Info_window_1_C_ExecuteUbergraph_WB_ui_Info_window_1, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_Info_window_1_C_ExecuteUbergraph_WB_ui_Info_window_1::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Info_window_1_C_ExecuteUbergraph_WB_ui_Info_window_1, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_Info_window_1_C_ExecuteUbergraph_WB_ui_Info_window_1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Info_window_1_C_ExecuteUbergraph_WB_ui_Info_window_1, CallFunc_GetDataBaseManager_Manager) == 0x000010, "Member 'WB_ui_Info_window_1_C_ExecuteUbergraph_WB_ui_Info_window_1::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_Info_window_1_C_ExecuteUbergraph_WB_ui_Info_window_1, CallFunc_GetText_ReturnValue) == 0x000018, "Member 'WB_ui_Info_window_1_C_ExecuteUbergraph_WB_ui_Info_window_1::CallFunc_GetText_ReturnValue' has a wrong offset!");

// Function WB_ui_Info_window_1.WB_ui_Info_window_1_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Info_window_1_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Info_window_1_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Info_window_1_C_UpdateState");
static_assert(sizeof(WB_ui_Info_window_1_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Info_window_1_C_UpdateState");
static_assert(offsetof(WB_ui_Info_window_1_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Info_window_1_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Info_window_1_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Info_window_1_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Info_window_1_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Info_window_1_C_UpdateState::DeltaSeconds' has a wrong offset!");

}

