#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Brain_tutorial1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Brain_tutorial1.WB_ui_Brain_tutorial1_C
// 0x00A8 (0x0430 - 0x0388)
class UWB_ui_Brain_tutorial1_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Decision;                                          // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Button_icon_font_L;                                // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_icon_font_r;                                // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_Icon_L;                                     // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_Icon_L_Base;                                // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_Icon_r;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_Icon_r_Base;                                // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_l_eff;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Button_R;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff01_L_add;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff01_R_add;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_L;                                             // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_R;                                             // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise_l;                                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise_R;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          buttondecide;                                      // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_ui_Brain_tutorial1(int32 EntryPoint);
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void UpdateNone(int32 SubState);
	void UpdateOpen(int32 SubState);
	void UpdateLoop(int32 SubState);
	void UpdateClose(int32 SubState);
	void SetButtonDecision();
	void UpdateButtonText();
	void BrainTutorialOpen();
	void Update_Button_Fixed_Text();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Brain_tutorial1_C">();
	}
	static class UWB_ui_Brain_tutorial1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Brain_tutorial1_C>();
	}
};
static_assert(alignof(UWB_ui_Brain_tutorial1_C) == 0x000008, "Wrong alignment on UWB_ui_Brain_tutorial1_C");
static_assert(sizeof(UWB_ui_Brain_tutorial1_C) == 0x000430, "Wrong size on UWB_ui_Brain_tutorial1_C");
static_assert(offsetof(UWB_ui_Brain_tutorial1_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_Brain_tutorial1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_tutorial1_C, Decision) == 0x000390, "Member 'UWB_ui_Brain_tutorial1_C::Decision' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_tutorial1_C, Out) == 0x000398, "Member 'UWB_ui_Brain_tutorial1_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_tutorial1_C, In) == 0x0003A0, "Member 'UWB_ui_Brain_tutorial1_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_tutorial1_C, Default_none) == 0x0003A8, "Member 'UWB_ui_Brain_tutorial1_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_tutorial1_C, Default) == 0x0003B0, "Member 'UWB_ui_Brain_tutorial1_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_tutorial1_C, Button_icon_font_L) == 0x0003B8, "Member 'UWB_ui_Brain_tutorial1_C::Button_icon_font_L' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_tutorial1_C, Button_icon_font_r) == 0x0003C0, "Member 'UWB_ui_Brain_tutorial1_C::Button_icon_font_r' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_tutorial1_C, Button_Icon_L) == 0x0003C8, "Member 'UWB_ui_Brain_tutorial1_C::Button_Icon_L' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_tutorial1_C, Button_Icon_L_Base) == 0x0003D0, "Member 'UWB_ui_Brain_tutorial1_C::Button_Icon_L_Base' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_tutorial1_C, Button_Icon_r) == 0x0003D8, "Member 'UWB_ui_Brain_tutorial1_C::Button_Icon_r' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_tutorial1_C, Button_Icon_r_Base) == 0x0003E0, "Member 'UWB_ui_Brain_tutorial1_C::Button_Icon_r_Base' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_tutorial1_C, Button_l_eff) == 0x0003E8, "Member 'UWB_ui_Brain_tutorial1_C::Button_l_eff' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_tutorial1_C, Button_R) == 0x0003F0, "Member 'UWB_ui_Brain_tutorial1_C::Button_R' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_tutorial1_C, Eff01_L_add) == 0x0003F8, "Member 'UWB_ui_Brain_tutorial1_C::Eff01_L_add' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_tutorial1_C, Eff01_R_add) == 0x000400, "Member 'UWB_ui_Brain_tutorial1_C::Eff01_R_add' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_tutorial1_C, Eff_L) == 0x000408, "Member 'UWB_ui_Brain_tutorial1_C::Eff_L' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_tutorial1_C, Eff_R) == 0x000410, "Member 'UWB_ui_Brain_tutorial1_C::Eff_R' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_tutorial1_C, Noise_l) == 0x000418, "Member 'UWB_ui_Brain_tutorial1_C::Noise_l' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_tutorial1_C, Noise_R) == 0x000420, "Member 'UWB_ui_Brain_tutorial1_C::Noise_R' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_tutorial1_C, buttondecide) == 0x000428, "Member 'UWB_ui_Brain_tutorial1_C::buttondecide' has a wrong offset!");

}

