#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Choise_parts_1

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Choise_parts_1.WB_ui_Choise_parts_1_C.ExecuteUbergraph_WB_ui_Choise_parts_1
// 0x0044 (0x0044 - 0x0000)
struct WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E33[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E34[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E35[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E36[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E37[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1) == 0x000004, "Wrong alignment on WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1");
static_assert(sizeof(WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1) == 0x000044, "Wrong size on WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1");
static_assert(offsetof(WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1, EntryPoint) == 0x000000, "Member 'WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000011, "Member 'WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000018, "Member 'WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1, K2Node_Event_State) == 0x00001C, "Member 'WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1, K2Node_Event_SubState) == 0x000020, "Member 'WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000028, "Member 'WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x00002C, "Member 'WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1, K2Node_SwitchInteger_CmpSuccess) == 0x000030, "Member 'WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000031, "Member 'WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000034, "Member 'WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000038, "Member 'WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000039, "Member 'WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x00003C, "Member 'WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x000040, "Member 'WB_ui_Choise_parts_1_C_ExecuteUbergraph_WB_ui_Choise_parts_1::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");

// Function WB_ui_Choise_parts_1.WB_ui_Choise_parts_1_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Choise_parts_1_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Choise_parts_1_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Choise_parts_1_C_UpdateState");
static_assert(sizeof(WB_ui_Choise_parts_1_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Choise_parts_1_C_UpdateState");
static_assert(offsetof(WB_ui_Choise_parts_1_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Choise_parts_1_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Choise_parts_1_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Choise_parts_1_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Choise_parts_1.WB_ui_Choise_parts_1_C.StateNone
// 0x000C (0x000C - 0x0000)
struct WB_ui_Choise_parts_1_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E38[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Choise_parts_1_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_Choise_parts_1_C_StateNone");
static_assert(sizeof(WB_ui_Choise_parts_1_C_StateNone) == 0x00000C, "Wrong size on WB_ui_Choise_parts_1_C_StateNone");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_Choise_parts_1_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_Choise_parts_1_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000005, "Member 'WB_ui_Choise_parts_1_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Choise_parts_1_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function WB_ui_Choise_parts_1.WB_ui_Choise_parts_1_C.StateLoopUnFocus
// 0x0028 (0x0028 - 0x0000)
struct WB_ui_Choise_parts_1_C_StateLoopUnFocus final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _WorkSubState;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E39[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E3A[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E3B[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue;              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Choise_parts_1_C_StateLoopUnFocus) == 0x000004, "Wrong alignment on WB_ui_Choise_parts_1_C_StateLoopUnFocus");
static_assert(sizeof(WB_ui_Choise_parts_1_C_StateLoopUnFocus) == 0x000028, "Wrong size on WB_ui_Choise_parts_1_C_StateLoopUnFocus");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopUnFocus, SubState) == 0x000000, "Member 'WB_ui_Choise_parts_1_C_StateLoopUnFocus::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopUnFocus, _WorkSubState) == 0x000004, "Member 'WB_ui_Choise_parts_1_C_StateLoopUnFocus::_WorkSubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopUnFocus, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000008, "Member 'WB_ui_Choise_parts_1_C_StateLoopUnFocus::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopUnFocus, CallFunc_MakeLiteralByte_ReturnValue) == 0x000009, "Member 'WB_ui_Choise_parts_1_C_StateLoopUnFocus::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopUnFocus, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00000C, "Member 'WB_ui_Choise_parts_1_C_StateLoopUnFocus::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopUnFocus, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000010, "Member 'WB_ui_Choise_parts_1_C_StateLoopUnFocus::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopUnFocus, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000014, "Member 'WB_ui_Choise_parts_1_C_StateLoopUnFocus::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopUnFocus, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000018, "Member 'WB_ui_Choise_parts_1_C_StateLoopUnFocus::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopUnFocus, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000019, "Member 'WB_ui_Choise_parts_1_C_StateLoopUnFocus::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopUnFocus, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x00001C, "Member 'WB_ui_Choise_parts_1_C_StateLoopUnFocus::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopUnFocus, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000020, "Member 'WB_ui_Choise_parts_1_C_StateLoopUnFocus::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopUnFocus, K2Node_SwitchInteger_CmpSuccess) == 0x000024, "Member 'WB_ui_Choise_parts_1_C_StateLoopUnFocus::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopUnFocus, K2Node_SwitchInteger_CmpSuccess_1) == 0x000025, "Member 'WB_ui_Choise_parts_1_C_StateLoopUnFocus::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopUnFocus, CallFunc_GetPlatformType_ReturnValue) == 0x000026, "Member 'WB_ui_Choise_parts_1_C_StateLoopUnFocus::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopUnFocus, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000027, "Member 'WB_ui_Choise_parts_1_C_StateLoopUnFocus::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WB_ui_Choise_parts_1.WB_ui_Choise_parts_1_C.StateLoopFocus
// 0x0038 (0x0038 - 0x0000)
struct WB_ui_Choise_parts_1_C_StateLoopFocus final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E3C[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E3D[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E3E[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E3F[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E40[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E41[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_1;        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Choise_parts_1_C_StateLoopFocus) == 0x000004, "Wrong alignment on WB_ui_Choise_parts_1_C_StateLoopFocus");
static_assert(sizeof(WB_ui_Choise_parts_1_C_StateLoopFocus) == 0x000038, "Wrong size on WB_ui_Choise_parts_1_C_StateLoopFocus");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopFocus, SubState) == 0x000000, "Member 'WB_ui_Choise_parts_1_C_StateLoopFocus::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopFocus, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Choise_parts_1_C_StateLoopFocus::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopFocus, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Choise_parts_1_C_StateLoopFocus::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopFocus, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Choise_parts_1_C_StateLoopFocus::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopFocus, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Choise_parts_1_C_StateLoopFocus::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopFocus, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000010, "Member 'WB_ui_Choise_parts_1_C_StateLoopFocus::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopFocus, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000014, "Member 'WB_ui_Choise_parts_1_C_StateLoopFocus::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopFocus, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000015, "Member 'WB_ui_Choise_parts_1_C_StateLoopFocus::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopFocus, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000018, "Member 'WB_ui_Choise_parts_1_C_StateLoopFocus::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopFocus, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x00001C, "Member 'WB_ui_Choise_parts_1_C_StateLoopFocus::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopFocus, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000020, "Member 'WB_ui_Choise_parts_1_C_StateLoopFocus::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopFocus, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000024, "Member 'WB_ui_Choise_parts_1_C_StateLoopFocus::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopFocus, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000028, "Member 'WB_ui_Choise_parts_1_C_StateLoopFocus::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopFocus, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x00002C, "Member 'WB_ui_Choise_parts_1_C_StateLoopFocus::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopFocus, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000030, "Member 'WB_ui_Choise_parts_1_C_StateLoopFocus::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_StateLoopFocus, CallFunc_IsPlayUICurrentAnimation_isPlay_1) == 0x000034, "Member 'WB_ui_Choise_parts_1_C_StateLoopFocus::CallFunc_IsPlayUICurrentAnimation_isPlay_1' has a wrong offset!");

// Function WB_ui_Choise_parts_1.WB_ui_Choise_parts_1_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_Choise_parts_1_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WB_ui_Choise_parts_1_C_SetText) == 0x000008, "Wrong alignment on WB_ui_Choise_parts_1_C_SetText");
static_assert(sizeof(WB_ui_Choise_parts_1_C_SetText) == 0x000018, "Wrong size on WB_ui_Choise_parts_1_C_SetText");
static_assert(offsetof(WB_ui_Choise_parts_1_C_SetText, Text) == 0x000000, "Member 'WB_ui_Choise_parts_1_C_SetText::Text' has a wrong offset!");

// Function WB_ui_Choise_parts_1.WB_ui_Choise_parts_1_C.Set Choice Focus
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Choise_parts_1_C_Set_Choice_Focus final
{
public:
	bool                                          IsFocus;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Choise_parts_1_C_Set_Choice_Focus) == 0x000001, "Wrong alignment on WB_ui_Choise_parts_1_C_Set_Choice_Focus");
static_assert(sizeof(WB_ui_Choise_parts_1_C_Set_Choice_Focus) == 0x000001, "Wrong size on WB_ui_Choise_parts_1_C_Set_Choice_Focus");
static_assert(offsetof(WB_ui_Choise_parts_1_C_Set_Choice_Focus, IsFocus) == 0x000000, "Member 'WB_ui_Choise_parts_1_C_Set_Choice_Focus::IsFocus' has a wrong offset!");

// Function WB_ui_Choise_parts_1.WB_ui_Choise_parts_1_C.IsDecideAnimation
// 0x0002 (0x0002 - 0x0000)
struct WB_ui_Choise_parts_1_C_IsDecideAnimation final
{
public:
	bool                                          IsAnimation;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Choise_parts_1_C_IsDecideAnimation) == 0x000001, "Wrong alignment on WB_ui_Choise_parts_1_C_IsDecideAnimation");
static_assert(sizeof(WB_ui_Choise_parts_1_C_IsDecideAnimation) == 0x000002, "Wrong size on WB_ui_Choise_parts_1_C_IsDecideAnimation");
static_assert(offsetof(WB_ui_Choise_parts_1_C_IsDecideAnimation, IsAnimation) == 0x000000, "Member 'WB_ui_Choise_parts_1_C_IsDecideAnimation::IsAnimation' has a wrong offset!");
static_assert(offsetof(WB_ui_Choise_parts_1_C_IsDecideAnimation, CallFunc_BooleanOR_ReturnValue) == 0x000001, "Member 'WB_ui_Choise_parts_1_C_IsDecideAnimation::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

