#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_SasSkill_Popup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_SasSkill_Popup.WB_ui_SasSkill_Popup_C
// 0x0048 (0x03D0 - 0x0388)
class UWB_ui_SasSkill_Popup_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                All_Color;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               All_Set;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Black;                                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_SasLink_popup_1_C*               WB_ui_SasLink_popup_1;                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsEx1;                                             // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEx2;                                             // 0x03C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_ui_SasSkill_Popup(int32 EntryPoint);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void OnInitialized();
	void Construct();
	void StateNone(int32 SubState);
	void StateOpen(int32 SubState);
	void StateLoop(int32 SubState);
	void StateClose(int32 SubState);
	void SetCharacter(EPlayerID CharaID, bool IsEnableDLC1, bool IsEnableDLC2);
	void SetViewMode(bool Param_IsEx1, bool Param_IsEx2);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_SasSkill_Popup_C">();
	}
	static class UWB_ui_SasSkill_Popup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_SasSkill_Popup_C>();
	}
};
static_assert(alignof(UWB_ui_SasSkill_Popup_C) == 0x000008, "Wrong alignment on UWB_ui_SasSkill_Popup_C");
static_assert(sizeof(UWB_ui_SasSkill_Popup_C) == 0x0003D0, "Wrong size on UWB_ui_SasSkill_Popup_C");
static_assert(offsetof(UWB_ui_SasSkill_Popup_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_SasSkill_Popup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasSkill_Popup_C, Out) == 0x000390, "Member 'UWB_ui_SasSkill_Popup_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasSkill_Popup_C, In) == 0x000398, "Member 'UWB_ui_SasSkill_Popup_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasSkill_Popup_C, Default) == 0x0003A0, "Member 'UWB_ui_SasSkill_Popup_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasSkill_Popup_C, All_Color) == 0x0003A8, "Member 'UWB_ui_SasSkill_Popup_C::All_Color' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasSkill_Popup_C, All_Set) == 0x0003B0, "Member 'UWB_ui_SasSkill_Popup_C::All_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasSkill_Popup_C, BG_Black) == 0x0003B8, "Member 'UWB_ui_SasSkill_Popup_C::BG_Black' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasSkill_Popup_C, WB_ui_SasLink_popup_1) == 0x0003C0, "Member 'UWB_ui_SasSkill_Popup_C::WB_ui_SasLink_popup_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasSkill_Popup_C, IsEx1) == 0x0003C8, "Member 'UWB_ui_SasSkill_Popup_C::IsEx1' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasSkill_Popup_C, IsEx2) == 0x0003C9, "Member 'UWB_ui_SasSkill_Popup_C::IsEx2' has a wrong offset!");

}

