#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Help_Arrow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Help_Arrow.WB_ui_Help_Arrow_C
// 0x0030 (0x03D8 - 0x03A8)
class UWB_ui_Help_Arrow_C final : public UUIHelpParts
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default_none;                                      // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select;                                            // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow1;                                            // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Help_Arrow(int32 EntryPoint);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Help_Arrow_C">();
	}
	static class UWB_ui_Help_Arrow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Help_Arrow_C>();
	}
};
static_assert(alignof(UWB_ui_Help_Arrow_C) == 0x000008, "Wrong alignment on UWB_ui_Help_Arrow_C");
static_assert(sizeof(UWB_ui_Help_Arrow_C) == 0x0003D8, "Wrong size on UWB_ui_Help_Arrow_C");
static_assert(offsetof(UWB_ui_Help_Arrow_C, UberGraphFrame) == 0x0003A8, "Member 'UWB_ui_Help_Arrow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Help_Arrow_C, Default_none) == 0x0003B0, "Member 'UWB_ui_Help_Arrow_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Help_Arrow_C, Select) == 0x0003B8, "Member 'UWB_ui_Help_Arrow_C::Select' has a wrong offset!");
static_assert(offsetof(UWB_ui_Help_Arrow_C, Default) == 0x0003C0, "Member 'UWB_ui_Help_Arrow_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Help_Arrow_C, Arrow1) == 0x0003C8, "Member 'UWB_ui_Help_Arrow_C::Arrow1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Help_Arrow_C, Glow) == 0x0003D0, "Member 'UWB_ui_Help_Arrow_C::Glow' has a wrong offset!");

}

