#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Parts_minimap_icon_north_2

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_ui_Parts_minimap_icon_north_2.WB_ui_Parts_minimap_icon_north_2_C.ExecuteUbergraph_WB_ui_Parts_minimap_icon_north_2
// 0x0040 (0x0040 - 0x0000)
struct WB_ui_Parts_minimap_icon_north_2_C_ExecuteUbergraph_WB_ui_Parts_minimap_icon_north_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5793[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Parts_minimap_icon_north_2_C_ExecuteUbergraph_WB_ui_Parts_minimap_icon_north_2) == 0x000008, "Wrong alignment on WB_ui_Parts_minimap_icon_north_2_C_ExecuteUbergraph_WB_ui_Parts_minimap_icon_north_2");
static_assert(sizeof(WB_ui_Parts_minimap_icon_north_2_C_ExecuteUbergraph_WB_ui_Parts_minimap_icon_north_2) == 0x000040, "Wrong size on WB_ui_Parts_minimap_icon_north_2_C_ExecuteUbergraph_WB_ui_Parts_minimap_icon_north_2");
static_assert(offsetof(WB_ui_Parts_minimap_icon_north_2_C_ExecuteUbergraph_WB_ui_Parts_minimap_icon_north_2, EntryPoint) == 0x000000, "Member 'WB_ui_Parts_minimap_icon_north_2_C_ExecuteUbergraph_WB_ui_Parts_minimap_icon_north_2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Parts_minimap_icon_north_2_C_ExecuteUbergraph_WB_ui_Parts_minimap_icon_north_2, CallFunc_GetDataBaseManager_Manager) == 0x000008, "Member 'WB_ui_Parts_minimap_icon_north_2_C_ExecuteUbergraph_WB_ui_Parts_minimap_icon_north_2::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_Parts_minimap_icon_north_2_C_ExecuteUbergraph_WB_ui_Parts_minimap_icon_north_2, CallFunc_GetText_ReturnValue) == 0x000010, "Member 'WB_ui_Parts_minimap_icon_north_2_C_ExecuteUbergraph_WB_ui_Parts_minimap_icon_north_2::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Parts_minimap_icon_north_2_C_ExecuteUbergraph_WB_ui_Parts_minimap_icon_north_2, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'WB_ui_Parts_minimap_icon_north_2_C_ExecuteUbergraph_WB_ui_Parts_minimap_icon_north_2::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Parts_minimap_icon_north_2_C_ExecuteUbergraph_WB_ui_Parts_minimap_icon_north_2, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'WB_ui_Parts_minimap_icon_north_2_C_ExecuteUbergraph_WB_ui_Parts_minimap_icon_north_2::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

