#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Sas_button_03

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Sas_button_03.WB_ui_Sas_button_03_C
// 0x0070 (0x0410 - 0x03A0)
class UWB_ui_Sas_button_03_C final : public UUISASButton3
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Delete_decision_page;                              // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Delete_change_page_2;                              // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Delete_default_page;                               // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Delete_change_page_1;                              // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Delete_decision_cv;                                // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_cv_2;                                       // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_cv;                                        // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_cv_1;                                       // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Cv_button_1;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cv_icon_font_1;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Sas_button_03(int32 EntryPoint);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Sas_button_03_C">();
	}
	static class UWB_ui_Sas_button_03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Sas_button_03_C>();
	}
};
static_assert(alignof(UWB_ui_Sas_button_03_C) == 0x000008, "Wrong alignment on UWB_ui_Sas_button_03_C");
static_assert(sizeof(UWB_ui_Sas_button_03_C) == 0x000410, "Wrong size on UWB_ui_Sas_button_03_C");
static_assert(offsetof(UWB_ui_Sas_button_03_C, UberGraphFrame) == 0x0003A0, "Member 'UWB_ui_Sas_button_03_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_button_03_C, Delete_decision_page) == 0x0003A8, "Member 'UWB_ui_Sas_button_03_C::Delete_decision_page' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_button_03_C, Delete_change_page_2) == 0x0003B0, "Member 'UWB_ui_Sas_button_03_C::Delete_change_page_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_button_03_C, Delete_default_page) == 0x0003B8, "Member 'UWB_ui_Sas_button_03_C::Delete_default_page' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_button_03_C, Delete_change_page_1) == 0x0003C0, "Member 'UWB_ui_Sas_button_03_C::Delete_change_page_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_button_03_C, Delete_decision_cv) == 0x0003C8, "Member 'UWB_ui_Sas_button_03_C::Delete_decision_cv' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_button_03_C, Change_cv_2) == 0x0003D0, "Member 'UWB_ui_Sas_button_03_C::Change_cv_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_button_03_C, Default_cv) == 0x0003D8, "Member 'UWB_ui_Sas_button_03_C::Default_cv' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_button_03_C, Change_cv_1) == 0x0003E0, "Member 'UWB_ui_Sas_button_03_C::Change_cv_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_button_03_C, Out) == 0x0003E8, "Member 'UWB_ui_Sas_button_03_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_button_03_C, In) == 0x0003F0, "Member 'UWB_ui_Sas_button_03_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_button_03_C, Default) == 0x0003F8, "Member 'UWB_ui_Sas_button_03_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_button_03_C, Cv_button_1) == 0x000400, "Member 'UWB_ui_Sas_button_03_C::Cv_button_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_button_03_C, Cv_icon_font_1) == 0x000408, "Member 'UWB_ui_Sas_button_03_C::Cv_icon_font_1' has a wrong offset!");

}

