#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_PK_weight_gauge_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_PK_weight_gauge_1.WB_ui_PK_weight_gauge_1_C
// 0x00B0 (0x04F0 - 0x0440)
class UWB_ui_PK_weight_gauge_1_C final : public UUIPsychicWeightGauge
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default_4;                                         // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_4;                                              // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_3;                                         // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Decision_2;                                        // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Decision_1;                                        // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_2;                                          // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_1;                                          // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out_2;                                             // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_2;                                              // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_2;                                         // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out_1;                                             // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_1;                                              // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_1;                                         // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Bar_1;                                             // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bar_2;                                             // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bar_1_add;                                         // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_1;                                           // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_2;                                           // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Weight_button;                                     // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Weight_icon_font;                                  // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_PK_weight_gauge_1(int32 EntryPoint);
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	struct FVector GetPsychicObjectWeightGaugePos(class AActor* Param_Target);

	struct FLinearColor GetFontColorButton1() const;
	struct FLinearColor GetFontColorButton2() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_PK_weight_gauge_1_C">();
	}
	static class UWB_ui_PK_weight_gauge_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_PK_weight_gauge_1_C>();
	}
};
static_assert(alignof(UWB_ui_PK_weight_gauge_1_C) == 0x000008, "Wrong alignment on UWB_ui_PK_weight_gauge_1_C");
static_assert(sizeof(UWB_ui_PK_weight_gauge_1_C) == 0x0004F0, "Wrong size on UWB_ui_PK_weight_gauge_1_C");
static_assert(offsetof(UWB_ui_PK_weight_gauge_1_C, UberGraphFrame) == 0x000440, "Member 'UWB_ui_PK_weight_gauge_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_weight_gauge_1_C, Default_4) == 0x000448, "Member 'UWB_ui_PK_weight_gauge_1_C::Default_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_weight_gauge_1_C, In_4) == 0x000450, "Member 'UWB_ui_PK_weight_gauge_1_C::In_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_weight_gauge_1_C, Default_3) == 0x000458, "Member 'UWB_ui_PK_weight_gauge_1_C::Default_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_weight_gauge_1_C, Decision_2) == 0x000460, "Member 'UWB_ui_PK_weight_gauge_1_C::Decision_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_weight_gauge_1_C, Decision_1) == 0x000468, "Member 'UWB_ui_PK_weight_gauge_1_C::Decision_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_weight_gauge_1_C, Change_2) == 0x000470, "Member 'UWB_ui_PK_weight_gauge_1_C::Change_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_weight_gauge_1_C, Change_1) == 0x000478, "Member 'UWB_ui_PK_weight_gauge_1_C::Change_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_weight_gauge_1_C, Out_2) == 0x000480, "Member 'UWB_ui_PK_weight_gauge_1_C::Out_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_weight_gauge_1_C, In_2) == 0x000488, "Member 'UWB_ui_PK_weight_gauge_1_C::In_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_weight_gauge_1_C, Default_2) == 0x000490, "Member 'UWB_ui_PK_weight_gauge_1_C::Default_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_weight_gauge_1_C, Out_1) == 0x000498, "Member 'UWB_ui_PK_weight_gauge_1_C::Out_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_weight_gauge_1_C, In_1) == 0x0004A0, "Member 'UWB_ui_PK_weight_gauge_1_C::In_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_weight_gauge_1_C, Default_none) == 0x0004A8, "Member 'UWB_ui_PK_weight_gauge_1_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_weight_gauge_1_C, Default_1) == 0x0004B0, "Member 'UWB_ui_PK_weight_gauge_1_C::Default_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_weight_gauge_1_C, Bar_1) == 0x0004B8, "Member 'UWB_ui_PK_weight_gauge_1_C::Bar_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_weight_gauge_1_C, Bar_2) == 0x0004C0, "Member 'UWB_ui_PK_weight_gauge_1_C::Bar_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_weight_gauge_1_C, Bar_1_add) == 0x0004C8, "Member 'UWB_ui_PK_weight_gauge_1_C::Bar_1_add' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_weight_gauge_1_C, Frame_1) == 0x0004D0, "Member 'UWB_ui_PK_weight_gauge_1_C::Frame_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_weight_gauge_1_C, Frame_2) == 0x0004D8, "Member 'UWB_ui_PK_weight_gauge_1_C::Frame_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_weight_gauge_1_C, Weight_button) == 0x0004E0, "Member 'UWB_ui_PK_weight_gauge_1_C::Weight_button' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_weight_gauge_1_C, Weight_icon_font) == 0x0004E8, "Member 'UWB_ui_PK_weight_gauge_1_C::Weight_icon_font' has a wrong offset!");

}

