#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_WorldMap

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_WorldMap.WB_ui_WorldMap_C.ExecuteUbergraph_WB_ui_WorldMap
// 0x01B8 (0x01B8 - 0x0000)
struct WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_585F[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5860[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5861[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_index;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_pWidget_5;                      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5862[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_WorldMap_Parts_1_C*              K2Node_DynamicCast_AsWB_Ui_World_Map_Parts_1;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5863[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_pWidget_4;                      // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_WorldMap_Parts_1_C*              K2Node_DynamicCast_AsWB_Ui_World_Map_Parts_1_1;    // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5864[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_pWidget_3;                      // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_WorldMap_Parts_1_C*              K2Node_DynamicCast_AsWB_Ui_World_Map_Parts_1_2;    // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5865[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Cursor, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_UnlockFlag;                           // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5866[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 IsMouseScroll, int32 Cursor, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 IsMouseScroll, int32 Cursor, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5867[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_isMouseScroll_1;                // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_cursor_2;                       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5868[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_pWidget_2;                      // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_isMouseScroll;                  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_cursor_1;                       // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_pWidget_1;                      // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_WorldMap_Parts_1_C*              K2Node_DynamicCast_AsWB_Ui_World_Map_Parts_1_3;    // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5869[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_WorldMap_Parts_1_C*              K2Node_DynamicCast_AsWB_Ui_World_Map_Parts_1_4;    // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue;              // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_586A[0x6];                                     // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWorldmapOpenLCParam                   K2Node_MakeStruct_WorldmapOpenLCParam;             // 0x00F8(0x0020)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_586B[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue;                       // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_586C[0x2];                                     // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_586D[0x3];                                     // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_cursor;                         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_586E[0x4];                                     // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_pWidget;                        // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_WorldMap_Parts_1_C*              K2Node_DynamicCast_AsWB_Ui_World_Map_Parts_1_5;    // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_586F[0x1];                                     // 0x0153(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5870[0x3];                                     // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUserWidget* PWidget)>   K2Node_CreateDelegate_OutputDelegate_3;            // 0x015C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_8;             // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentState_State;                    // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentState_State_1;                  // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5871[0x3];                                     // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentState_State_2;                  // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5872[0x2];                                     // 0x0182(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_9;             // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5873[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue_1;                     // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* PWidget)>   K2Node_CreateDelegate_OutputDelegate_4;            // 0x0198(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 Index, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap) == 0x000008, "Wrong alignment on WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap");
static_assert(sizeof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap) == 0x0001B8, "Wrong size on WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, EntryPoint) == 0x000000, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_MakeLiteralByte_ReturnValue) == 0x000005, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00000C, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000010, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_Event_State) == 0x000014, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_Event_SubState) == 0x000018, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_SwitchInteger_CmpSuccess) == 0x000020, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000021, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_CustomEvent_index) == 0x000024, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_CustomEvent_index' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_CustomEvent_pWidget_5) == 0x000028, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_CustomEvent_pWidget_5' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000030, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_DynamicCast_AsWB_Ui_World_Map_Parts_1) == 0x000038, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_DynamicCast_AsWB_Ui_World_Map_Parts_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000041, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_CustomEvent_pWidget_4) == 0x000048, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_CustomEvent_pWidget_4' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_DynamicCast_AsWB_Ui_World_Map_Parts_1_1) == 0x000050, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_DynamicCast_AsWB_Ui_World_Map_Parts_1_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x00005C, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_CustomEvent_pWidget_3) == 0x000060, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_CustomEvent_pWidget_3' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_DynamicCast_AsWB_Ui_World_Map_Parts_1_2) == 0x000068, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_DynamicCast_AsWB_Ui_World_Map_Parts_1_2' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_CreateDelegate_OutputDelegate) == 0x000074, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_Event_UnlockFlag) == 0x000084, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_Event_UnlockFlag' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_CreateDelegate_OutputDelegate_1) == 0x000088, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_MakeLiteralInt_ReturnValue) == 0x000098, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_CreateDelegate_OutputDelegate_2) == 0x00009C, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x0000AC, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x0000B0, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_CustomEvent_isMouseScroll_1) == 0x0000B4, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_CustomEvent_isMouseScroll_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_CustomEvent_cursor_2) == 0x0000B8, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_CustomEvent_cursor_2' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_CustomEvent_pWidget_2) == 0x0000C0, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_CustomEvent_pWidget_2' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_CustomEvent_isMouseScroll) == 0x0000C8, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_CustomEvent_isMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_CustomEvent_cursor_1) == 0x0000CC, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_CustomEvent_cursor_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_CustomEvent_pWidget_1) == 0x0000D0, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_CustomEvent_pWidget_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_DynamicCast_AsWB_Ui_World_Map_Parts_1_3) == 0x0000D8, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_DynamicCast_AsWB_Ui_World_Map_Parts_1_3' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_DynamicCast_bSuccess_3) == 0x0000E0, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_DynamicCast_AsWB_Ui_World_Map_Parts_1_4) == 0x0000E8, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_DynamicCast_AsWB_Ui_World_Map_Parts_1_4' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_DynamicCast_bSuccess_4) == 0x0000F0, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_GetPlatformType_ReturnValue) == 0x0000F1, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_MakeStruct_WorldmapOpenLCParam) == 0x0000F8, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_MakeStruct_WorldmapOpenLCParam' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000118, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_PlaySE_ReturnValue) == 0x000120, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000128, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000129, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x00012C, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000130, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x000134, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_CustomEvent_cursor) == 0x000138, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_CustomEvent_cursor' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_CustomEvent_pWidget) == 0x000140, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_CustomEvent_pWidget' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_DynamicCast_AsWB_Ui_World_Map_Parts_1_5) == 0x000148, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_DynamicCast_AsWB_Ui_World_Map_Parts_1_5' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_DynamicCast_bSuccess_5) == 0x000150, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000151, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000152, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x000154, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x000158, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_CreateDelegate_OutputDelegate_3) == 0x00015C, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_Conv_ByteToInt_ReturnValue_8) == 0x00016C, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_Conv_ByteToInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_GetCurrentState_State) == 0x000170, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_GetCurrentState_State' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_GetCurrentState_State_1) == 0x000174, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_GetCurrentState_State_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000178, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_GetCurrentState_State_2) == 0x00017C, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_GetCurrentState_State_2' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000180, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_MakeLiteralByte_ReturnValue_9) == 0x000181, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_MakeLiteralByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_Conv_ByteToInt_ReturnValue_9) == 0x000184, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_Conv_ByteToInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x000188, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, CallFunc_PlaySE_ReturnValue_1) == 0x000190, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::CallFunc_PlaySE_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_CreateDelegate_OutputDelegate_4) == 0x000198, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001A8, "Member 'WB_ui_WorldMap_C_ExecuteUbergraph_WB_ui_WorldMap::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");

// Function WB_ui_WorldMap.WB_ui_WorldMap_C.Þ¦¹À¦ó
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_WorldMap_C_______ final
{
public:
	int32                                         Param_Cursor;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5874[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            PWidget;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_WorldMap_C_______) == 0x000008, "Wrong alignment on WB_ui_WorldMap_C_______");
static_assert(sizeof(WB_ui_WorldMap_C_______) == 0x000010, "Wrong size on WB_ui_WorldMap_C_______");
static_assert(offsetof(WB_ui_WorldMap_C_______, Param_Cursor) == 0x000000, "Member 'WB_ui_WorldMap_C_______::Param_Cursor' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_______, PWidget) == 0x000008, "Member 'WB_ui_WorldMap_C_______::PWidget' has a wrong offset!");

// Function WB_ui_WorldMap.WB_ui_WorldMap_C.Þ¦¹Õ©ü«¹
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_WorldMap_C_________ final
{
public:
	int32                                         IsMouseScroll;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Cursor;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            PWidget;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_WorldMap_C_________) == 0x000008, "Wrong alignment on WB_ui_WorldMap_C_________");
static_assert(sizeof(WB_ui_WorldMap_C_________) == 0x000010, "Wrong size on WB_ui_WorldMap_C_________");
static_assert(offsetof(WB_ui_WorldMap_C_________, IsMouseScroll) == 0x000000, "Member 'WB_ui_WorldMap_C_________::IsMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_________, Param_Cursor) == 0x000004, "Member 'WB_ui_WorldMap_C_________::Param_Cursor' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_________, PWidget) == 0x000008, "Member 'WB_ui_WorldMap_C_________::PWidget' has a wrong offset!");

// Function WB_ui_WorldMap.WB_ui_WorldMap_C.Þ¦¹¢óÕ©ü«¹
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_WorldMap_C___________ final
{
public:
	int32                                         IsMouseScroll;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Cursor;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            PWidget;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_WorldMap_C___________) == 0x000008, "Wrong alignment on WB_ui_WorldMap_C___________");
static_assert(sizeof(WB_ui_WorldMap_C___________) == 0x000010, "Wrong size on WB_ui_WorldMap_C___________");
static_assert(offsetof(WB_ui_WorldMap_C___________, IsMouseScroll) == 0x000000, "Member 'WB_ui_WorldMap_C___________::IsMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C___________, Param_Cursor) == 0x000004, "Member 'WB_ui_WorldMap_C___________::Param_Cursor' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C___________, PWidget) == 0x000008, "Member 'WB_ui_WorldMap_C___________::PWidget' has a wrong offset!");

// Function WB_ui_WorldMap.WB_ui_WorldMap_C.SetDebugUnlockFlag
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_WorldMap_C_SetDebugUnlockFlag final
{
public:
	bool                                          UnlockFlag;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_WorldMap_C_SetDebugUnlockFlag) == 0x000001, "Wrong alignment on WB_ui_WorldMap_C_SetDebugUnlockFlag");
static_assert(sizeof(WB_ui_WorldMap_C_SetDebugUnlockFlag) == 0x000001, "Wrong size on WB_ui_WorldMap_C_SetDebugUnlockFlag");
static_assert(offsetof(WB_ui_WorldMap_C_SetDebugUnlockFlag, UnlockFlag) == 0x000000, "Member 'WB_ui_WorldMap_C_SetDebugUnlockFlag::UnlockFlag' has a wrong offset!");

// Function WB_ui_WorldMap.WB_ui_WorldMap_C.Event_ListUnFocus
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_WorldMap_C_Event_ListUnFocus final
{
public:
	class UUserWidget*                            PWidget;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_WorldMap_C_Event_ListUnFocus) == 0x000008, "Wrong alignment on WB_ui_WorldMap_C_Event_ListUnFocus");
static_assert(sizeof(WB_ui_WorldMap_C_Event_ListUnFocus) == 0x000008, "Wrong size on WB_ui_WorldMap_C_Event_ListUnFocus");
static_assert(offsetof(WB_ui_WorldMap_C_Event_ListUnFocus, PWidget) == 0x000000, "Member 'WB_ui_WorldMap_C_Event_ListUnFocus::PWidget' has a wrong offset!");

// Function WB_ui_WorldMap.WB_ui_WorldMap_C.Event_ListFocus
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_WorldMap_C_Event_ListFocus final
{
public:
	class UUserWidget*                            PWidget;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_WorldMap_C_Event_ListFocus) == 0x000008, "Wrong alignment on WB_ui_WorldMap_C_Event_ListFocus");
static_assert(sizeof(WB_ui_WorldMap_C_Event_ListFocus) == 0x000008, "Wrong size on WB_ui_WorldMap_C_Event_ListFocus");
static_assert(offsetof(WB_ui_WorldMap_C_Event_ListFocus, PWidget) == 0x000000, "Member 'WB_ui_WorldMap_C_Event_ListFocus::PWidget' has a wrong offset!");

// Function WB_ui_WorldMap.WB_ui_WorldMap_C.Event_ListUpdateElement
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_WorldMap_C_Event_ListUpdateElement final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5875[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            PWidget;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_WorldMap_C_Event_ListUpdateElement) == 0x000008, "Wrong alignment on WB_ui_WorldMap_C_Event_ListUpdateElement");
static_assert(sizeof(WB_ui_WorldMap_C_Event_ListUpdateElement) == 0x000010, "Wrong size on WB_ui_WorldMap_C_Event_ListUpdateElement");
static_assert(offsetof(WB_ui_WorldMap_C_Event_ListUpdateElement, Param_Index) == 0x000000, "Member 'WB_ui_WorldMap_C_Event_ListUpdateElement::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_Event_ListUpdateElement, PWidget) == 0x000008, "Member 'WB_ui_WorldMap_C_Event_ListUpdateElement::PWidget' has a wrong offset!");

// Function WB_ui_WorldMap.WB_ui_WorldMap_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_WorldMap_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_WorldMap_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_WorldMap_C_UpdateState");
static_assert(sizeof(WB_ui_WorldMap_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_WorldMap_C_UpdateState");
static_assert(offsetof(WB_ui_WorldMap_C_UpdateState, State) == 0x000000, "Member 'WB_ui_WorldMap_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_WorldMap_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_WorldMap_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_WorldMap.WB_ui_WorldMap_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_WorldMap_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_WorldMap_C_PreConstruct) == 0x000001, "Wrong alignment on WB_ui_WorldMap_C_PreConstruct");
static_assert(sizeof(WB_ui_WorldMap_C_PreConstruct) == 0x000001, "Wrong size on WB_ui_WorldMap_C_PreConstruct");
static_assert(offsetof(WB_ui_WorldMap_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_ui_WorldMap_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_ui_WorldMap.WB_ui_WorldMap_C.StateNone
// 0x0060 (0x0060 - 0x0000)
struct WB_ui_WorldMap_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5876[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5877[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5878[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABattleSimulatorManager*                CallFunc_GetBattleSimulatorManager_BattleSimulatorManager; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentMissionTypeKillJewelPool_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5879[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LevelManager_C*                     CallFunc_GetLevelManager_LevelManager;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidCurrentSimulatorLevelInfosName_ReturnValue; // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_587A[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrainFieldManager_C*                CallFunc_GetBrainFieldManager_Manager;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InBranField_FromNative_ReturnValue;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_587B[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BattleManager_C*                    CallFunc_GetBattleManager_BattleManager;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBattleMode_ReturnValue;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_587C[0x5];                                     // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_WorldMap_C_StateNone) == 0x000008, "Wrong alignment on WB_ui_WorldMap_C_StateNone");
static_assert(sizeof(WB_ui_WorldMap_C_StateNone) == 0x000060, "Wrong size on WB_ui_WorldMap_C_StateNone");
static_assert(offsetof(WB_ui_WorldMap_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_WorldMap_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_WorldMap_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_WorldMap_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_WorldMap_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00000C, "Member 'WB_ui_WorldMap_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000010, "Member 'WB_ui_WorldMap_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_StateNone, CallFunc_GetBattleSimulatorManager_BattleSimulatorManager) == 0x000018, "Member 'WB_ui_WorldMap_C_StateNone::CallFunc_GetBattleSimulatorManager_BattleSimulatorManager' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_StateNone, CallFunc_IsCurrentMissionTypeKillJewelPool_ReturnValue) == 0x000020, "Member 'WB_ui_WorldMap_C_StateNone::CallFunc_IsCurrentMissionTypeKillJewelPool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_StateNone, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'WB_ui_WorldMap_C_StateNone::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_StateNone, CallFunc_GetLevelManager_LevelManager) == 0x000028, "Member 'WB_ui_WorldMap_C_StateNone::CallFunc_GetLevelManager_LevelManager' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_StateNone, CallFunc_Not_PreBool_ReturnValue_1) == 0x000030, "Member 'WB_ui_WorldMap_C_StateNone::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_StateNone, CallFunc_IsValidCurrentSimulatorLevelInfosName_ReturnValue) == 0x000031, "Member 'WB_ui_WorldMap_C_StateNone::CallFunc_IsValidCurrentSimulatorLevelInfosName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_StateNone, CallFunc_GetBrainFieldManager_Manager) == 0x000038, "Member 'WB_ui_WorldMap_C_StateNone::CallFunc_GetBrainFieldManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_StateNone, CallFunc_InBranField_FromNative_ReturnValue) == 0x000040, "Member 'WB_ui_WorldMap_C_StateNone::CallFunc_InBranField_FromNative_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_StateNone, CallFunc_GetBattleManager_BattleManager) == 0x000048, "Member 'WB_ui_WorldMap_C_StateNone::CallFunc_GetBattleManager_BattleManager' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_StateNone, CallFunc_BooleanAND_ReturnValue) == 0x000050, "Member 'WB_ui_WorldMap_C_StateNone::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_StateNone, CallFunc_IsBattleMode_ReturnValue) == 0x000051, "Member 'WB_ui_WorldMap_C_StateNone::CallFunc_IsBattleMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_StateNone, CallFunc_BooleanAND_ReturnValue_1) == 0x000052, "Member 'WB_ui_WorldMap_C_StateNone::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_C_StateNone, CallFunc_AddChild_ReturnValue) == 0x000058, "Member 'WB_ui_WorldMap_C_StateNone::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WB_ui_WorldMap.WB_ui_WorldMap_C.StateOpen
// 0x00A0 (0x00A0 - 0x0000)
struct WB_ui_WorldMap_C_StateOpen final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_587D[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_587E[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckInput_IsInput;                       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_587F[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5880[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5881[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5882[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5883[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckInput_IsInput_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5884[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame_1;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_isEndSystemMessage_ReturnValue;           // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
