#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_ObjectGuide

#include "Basic.hpp"

#include "Enum_ui_object_guide_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_ObjectGuide.WB_ui_ObjectGuide_C.ExecuteUbergraph_WB_ui_ObjectGuide
// 0x0028 (0x0028 - 0x0000)
struct WB_ui_ObjectGuide_C_ExecuteUbergraph_WB_ui_ObjectGuide final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWB_ui_ObjectGuide_Parts_1_C*>   K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_ObjectGuide_C_ExecuteUbergraph_WB_ui_ObjectGuide) == 0x000008, "Wrong alignment on WB_ui_ObjectGuide_C_ExecuteUbergraph_WB_ui_ObjectGuide");
static_assert(sizeof(WB_ui_ObjectGuide_C_ExecuteUbergraph_WB_ui_ObjectGuide) == 0x000028, "Wrong size on WB_ui_ObjectGuide_C_ExecuteUbergraph_WB_ui_ObjectGuide");
static_assert(offsetof(WB_ui_ObjectGuide_C_ExecuteUbergraph_WB_ui_ObjectGuide, EntryPoint) == 0x000000, "Member 'WB_ui_ObjectGuide_C_ExecuteUbergraph_WB_ui_ObjectGuide::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_ExecuteUbergraph_WB_ui_ObjectGuide, K2Node_Event_State) == 0x000004, "Member 'WB_ui_ObjectGuide_C_ExecuteUbergraph_WB_ui_ObjectGuide::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_ExecuteUbergraph_WB_ui_ObjectGuide, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_ObjectGuide_C_ExecuteUbergraph_WB_ui_ObjectGuide::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_ExecuteUbergraph_WB_ui_ObjectGuide, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_ObjectGuide_C_ExecuteUbergraph_WB_ui_ObjectGuide::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_ExecuteUbergraph_WB_ui_ObjectGuide, K2Node_MakeArray_Array) == 0x000010, "Member 'WB_ui_ObjectGuide_C_ExecuteUbergraph_WB_ui_ObjectGuide::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_ExecuteUbergraph_WB_ui_ObjectGuide, K2Node_SwitchInteger_CmpSuccess) == 0x000020, "Member 'WB_ui_ObjectGuide_C_ExecuteUbergraph_WB_ui_ObjectGuide::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_ui_ObjectGuide.WB_ui_ObjectGuide_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_ObjectGuide_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_ObjectGuide_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_ObjectGuide_C_UpdateState");
static_assert(sizeof(WB_ui_ObjectGuide_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_ObjectGuide_C_UpdateState");
static_assert(offsetof(WB_ui_ObjectGuide_C_UpdateState, State) == 0x000000, "Member 'WB_ui_ObjectGuide_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_ObjectGuide_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_ObjectGuide_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_ObjectGuide.WB_ui_ObjectGuide_C.StateNone
// 0x001C (0x001C - 0x0000)
struct WB_ui_ObjectGuide_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_546E[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_ObjectGuide_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_ObjectGuide_C_StateNone");
static_assert(sizeof(WB_ui_ObjectGuide_C_StateNone) == 0x00001C, "Wrong size on WB_ui_ObjectGuide_C_StateNone");
static_assert(offsetof(WB_ui_ObjectGuide_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_ObjectGuide_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_ObjectGuide_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_StateNone, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WB_ui_ObjectGuide_C_StateNone::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_StateNone, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WB_ui_ObjectGuide_C_StateNone::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_StateNone, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WB_ui_ObjectGuide_C_StateNone::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_StateNone, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'WB_ui_ObjectGuide_C_StateNone::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_StateNone, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WB_ui_ObjectGuide_C_StateNone::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_ui_ObjectGuide.WB_ui_ObjectGuide_C.StateLoop
// 0x0028 (0x0028 - 0x0000)
struct WB_ui_ObjectGuide_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_546F[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingCloseAnimation_IsPlaying;        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5470[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_ObjectGuide_Parts_1_C*           CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingOpenAnimation_IsPlaying;         // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_ObjectGuide_C_StateLoop) == 0x000008, "Wrong alignment on WB_ui_ObjectGuide_C_StateLoop");
static_assert(sizeof(WB_ui_ObjectGuide_C_StateLoop) == 0x000028, "Wrong size on WB_ui_ObjectGuide_C_StateLoop");
static_assert(offsetof(WB_ui_ObjectGuide_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_ObjectGuide_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_StateLoop, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WB_ui_ObjectGuide_C_StateLoop::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000008, "Member 'WB_ui_ObjectGuide_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_StateLoop, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WB_ui_ObjectGuide_C_StateLoop::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_StateLoop, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WB_ui_ObjectGuide_C_StateLoop::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_StateLoop, CallFunc_IsPlayingCloseAnimation_IsPlaying) == 0x000014, "Member 'WB_ui_ObjectGuide_C_StateLoop::CallFunc_IsPlayingCloseAnimation_IsPlaying' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_StateLoop, CallFunc_Array_Get_Item) == 0x000018, "Member 'WB_ui_ObjectGuide_C_StateLoop::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_StateLoop, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WB_ui_ObjectGuide_C_StateLoop::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_StateLoop, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'WB_ui_ObjectGuide_C_StateLoop::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_StateLoop, CallFunc_IsPlayingOpenAnimation_IsPlaying) == 0x000025, "Member 'WB_ui_ObjectGuide_C_StateLoop::CallFunc_IsPlayingOpenAnimation_IsPlaying' has a wrong offset!");

// Function WB_ui_ObjectGuide.WB_ui_ObjectGuide_C.SetupMessage
// 0x0090 (0x0090 - 0x0000)
struct WB_ui_ObjectGuide_C_SetupMessage final
{
public:
	class UDatabaseManager*                       _Manager;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _Base;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5471[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 _MessageNumList;                                   // 0x0010(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5472[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetMessageID_MessageID;                   // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5473[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5474[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_ObjectGuide_Parts_1_C*           CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_ObjectGuide_C_SetupMessage) == 0x000008, "Wrong alignment on WB_ui_ObjectGuide_C_SetupMessage");
static_assert(sizeof(WB_ui_ObjectGuide_C_SetupMessage) == 0x000090, "Wrong size on WB_ui_ObjectGuide_C_SetupMessage");
static_assert(offsetof(WB_ui_ObjectGuide_C_SetupMessage, _Manager) == 0x000000, "Member 'WB_ui_ObjectGuide_C_SetupMessage::_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_SetupMessage, _Base) == 0x000008, "Member 'WB_ui_ObjectGuide_C_SetupMessage::_Base' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_SetupMessage, _MessageNumList) == 0x000010, "Member 'WB_ui_ObjectGuide_C_SetupMessage::_MessageNumList' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_SetupMessage, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WB_ui_ObjectGuide_C_SetupMessage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_SetupMessage, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WB_ui_ObjectGuide_C_SetupMessage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_SetupMessage, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WB_ui_ObjectGuide_C_SetupMessage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_SetupMessage, CallFunc_GetDataBaseManager_Manager) == 0x000030, "Member 'WB_ui_ObjectGuide_C_SetupMessage::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_SetupMessage, CallFunc_GetMessageID_MessageID) == 0x000038, "Member 'WB_ui_ObjectGuide_C_SetupMessage::CallFunc_GetMessageID_MessageID' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_SetupMessage, CallFunc_Conv_StringToName_ReturnValue) == 0x000048, "Member 'WB_ui_ObjectGuide_C_SetupMessage::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_SetupMessage, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000050, "Member 'WB_ui_ObjectGuide_C_SetupMessage::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_SetupMessage, CallFunc_GetText_ReturnValue) == 0x000058, "Member 'WB_ui_ObjectGuide_C_SetupMessage::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_SetupMessage, K2Node_MakeArray_Array) == 0x000068, "Member 'WB_ui_ObjectGuide_C_SetupMessage::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_SetupMessage, CallFunc_Greater_IntInt_ReturnValue) == 0x000078, "Member 'WB_ui_ObjectGuide_C_SetupMessage::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_SetupMessage, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'WB_ui_ObjectGuide_C_SetupMessage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_SetupMessage, CallFunc_Array_Get_Item) == 0x000080, "Member 'WB_ui_ObjectGuide_C_SetupMessage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_SetupMessage, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'WB_ui_ObjectGuide_C_SetupMessage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_ui_ObjectGuide.WB_ui_ObjectGuide_C.GetMessageID
// 0x0090 (0x0090 - 0x0000)
struct WB_ui_ObjectGuide_C_GetMessageID final
{
public:
	Enum_ui_object_guide                          GuideID;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5475[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param_Index;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 MessageID;                                         // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         _MessageBaseList;                                  // 0x0018(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5476[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0040(0x0018)()
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5477[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_ObjectGuide_C_GetMessageID) == 0x000008, "Wrong alignment on WB_ui_ObjectGuide_C_GetMessageID");
static_assert(sizeof(WB_ui_ObjectGuide_C_GetMessageID) == 0x000090, "Wrong size on WB_ui_ObjectGuide_C_GetMessageID");
static_assert(offsetof(WB_ui_ObjectGuide_C_GetMessageID, GuideID) == 0x000000, "Member 'WB_ui_ObjectGuide_C_GetMessageID::GuideID' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_GetMessageID, Param_Index) == 0x000004, "Member 'WB_ui_ObjectGuide_C_GetMessageID::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_GetMessageID, MessageID) == 0x000008, "Member 'WB_ui_ObjectGuide_C_GetMessageID::MessageID' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_GetMessageID, _MessageBaseList) == 0x000018, "Member 'WB_ui_ObjectGuide_C_GetMessageID::_MessageBaseList' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_GetMessageID, K2Node_MakeArray_Array) == 0x000028, "Member 'WB_ui_ObjectGuide_C_GetMessageID::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_GetMessageID, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'WB_ui_ObjectGuide_C_GetMessageID::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_GetMessageID, CallFunc_Conv_IntToText_ReturnValue) == 0x000040, "Member 'WB_ui_ObjectGuide_C_GetMessageID::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_GetMessageID, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000058, "Member 'WB_ui_ObjectGuide_C_GetMessageID::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_GetMessageID, CallFunc_Conv_TextToString_ReturnValue) == 0x000060, "Member 'WB_ui_ObjectGuide_C_GetMessageID::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_GetMessageID, CallFunc_Concat_StrStr_ReturnValue) == 0x000070, "Member 'WB_ui_ObjectGuide_C_GetMessageID::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_ObjectGuide_C_GetMessageID, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000080, "Member 'WB_ui_ObjectGuide_C_GetMessageID::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");

// Function WB_ui_ObjectGuide.WB_ui_ObjectGuide_C.SetGuideID
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_ObjectGuide_C_SetGuideID final
{
public:
	Enum_ui_object_guide                          Param_ObjectID;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_ObjectGuide_C_SetGuideID) == 0x000001, "Wrong alignment on WB_ui_ObjectGuide_C_SetGuideID");
static_assert(sizeof(WB_ui_ObjectGuide_C_SetGuideID) == 0x000001, "Wrong size on WB_ui_ObjectGuide_C_SetGuideID");
static_assert(offsetof(WB_ui_ObjectGuide_C_SetGuideID, Param_ObjectID) == 0x000000, "Member 'WB_ui_ObjectGuide_C_SetGuideID::Param_ObjectID' has a wrong offset!");

}

