#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Quest_Parts_3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Quest_Parts_3.WB_ui_Quest_Parts_3_C
// 0x0058 (0x03F8 - 0x03A0)
class UWB_ui_Quest_Parts_3_C final : public UUIQuestNamePlate
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default_none;                                      // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Face_a_1;                                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Face_a_2;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_1;                                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_2;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               KasaneSet;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_quest_player_1;                               // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               YuitoSet;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Quest_Parts_3(int32 EntryPoint);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Quest_Parts_3_C">();
	}
	static class UWB_ui_Quest_Parts_3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Quest_Parts_3_C>();
	}
};
static_assert(alignof(UWB_ui_Quest_Parts_3_C) == 0x000008, "Wrong alignment on UWB_ui_Quest_Parts_3_C");
static_assert(sizeof(UWB_ui_Quest_Parts_3_C) == 0x0003F8, "Wrong size on UWB_ui_Quest_Parts_3_C");
static_assert(offsetof(UWB_ui_Quest_Parts_3_C, UberGraphFrame) == 0x0003A0, "Member 'UWB_ui_Quest_Parts_3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_3_C, Default_none) == 0x0003A8, "Member 'UWB_ui_Quest_Parts_3_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_3_C, Default) == 0x0003B0, "Member 'UWB_ui_Quest_Parts_3_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_3_C, Face_a_1) == 0x0003B8, "Member 'UWB_ui_Quest_Parts_3_C::Face_a_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_3_C, Face_a_2) == 0x0003C0, "Member 'UWB_ui_Quest_Parts_3_C::Face_a_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_3_C, Frame) == 0x0003C8, "Member 'UWB_ui_Quest_Parts_3_C::Frame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_3_C, Frame_1) == 0x0003D0, "Member 'UWB_ui_Quest_Parts_3_C::Frame_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_3_C, Frame_2) == 0x0003D8, "Member 'UWB_ui_Quest_Parts_3_C::Frame_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_3_C, KasaneSet) == 0x0003E0, "Member 'UWB_ui_Quest_Parts_3_C::KasaneSet' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_3_C, Text_quest_player_1) == 0x0003E8, "Member 'UWB_ui_Quest_Parts_3_C::Text_quest_player_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_3_C, YuitoSet) == 0x0003F0, "Member 'UWB_ui_Quest_Parts_3_C::YuitoSet' has a wrong offset!");

}

