#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Chara

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Chara.WB_ui_Chara_C
// 0x0080 (0x04F8 - 0x0478)
class UWB_ui_Chara_C final : public UUICharaBooks
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Present_out;                                       // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Present_in;                                        // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Present;                                           // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               All_Set;                                           // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_ViewRange;                             // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cover_Black;                                       // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Info_Set;                                          // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDScrollBox*                          RedScrollBox_CharaName;                            // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Chara_Info_Parts_1_C*            WB_ui_Chara_Info_Parts_1;                          // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Chara_Info_Parts_2_C*            WB_ui_Chara_Info_Parts_2;                          // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Enemy_List_Parts_1_C*            WB_ui_Enemy_List_Parts_1;                          // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Chara(int32 EntryPoint);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void ListUnFocusMouse(int32 IsMouseScroll, int32 Param_Index, class UUserWidget* Widget);
	void ListFocusMouse(int32 IsMouseScroll, int32 Param_Index, class UUserWidget* Widget);
	void ListUnFocus(class UUserWidget* Widget);
	void ListFocus(class UUserWidget* Widget);
	void ListUpdateElement(int32 Param_Index, class UUserWidget* Widget);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Chara_C">();
	}
	static class UWB_ui_Chara_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Chara_C>();
	}
};
static_assert(alignof(UWB_ui_Chara_C) == 0x000008, "Wrong alignment on UWB_ui_Chara_C");
static_assert(sizeof(UWB_ui_Chara_C) == 0x0004F8, "Wrong size on UWB_ui_Chara_C");
static_assert(offsetof(UWB_ui_Chara_C, UberGraphFrame) == 0x000478, "Member 'UWB_ui_Chara_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_C, Present_out) == 0x000480, "Member 'UWB_ui_Chara_C::Present_out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_C, Present_in) == 0x000488, "Member 'UWB_ui_Chara_C::Present_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_C, Present) == 0x000490, "Member 'UWB_ui_Chara_C::Present' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_C, Default_none) == 0x000498, "Member 'UWB_ui_Chara_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_C, Out) == 0x0004A0, "Member 'UWB_ui_Chara_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_C, In) == 0x0004A8, "Member 'UWB_ui_Chara_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_C, Default) == 0x0004B0, "Member 'UWB_ui_Chara_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_C, All_Set) == 0x0004B8, "Member 'UWB_ui_Chara_C::All_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_C, CanvasPanel_ViewRange) == 0x0004C0, "Member 'UWB_ui_Chara_C::CanvasPanel_ViewRange' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_C, Cover_Black) == 0x0004C8, "Member 'UWB_ui_Chara_C::Cover_Black' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_C, Info_Set) == 0x0004D0, "Member 'UWB_ui_Chara_C::Info_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_C, RedScrollBox_CharaName) == 0x0004D8, "Member 'UWB_ui_Chara_C::RedScrollBox_CharaName' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_C, WB_ui_Chara_Info_Parts_1) == 0x0004E0, "Member 'UWB_ui_Chara_C::WB_ui_Chara_Info_Parts_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_C, WB_ui_Chara_Info_Parts_2) == 0x0004E8, "Member 'UWB_ui_Chara_C::WB_ui_Chara_Info_Parts_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Chara_C, WB_ui_Enemy_List_Parts_1) == 0x0004F0, "Member 'UWB_ui_Chara_C::WB_ui_Enemy_List_Parts_1' has a wrong offset!");

}

