#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_operation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_operation.WB_ui_Operation_C
// 0x00E8 (0x0590 - 0x04A8)
class UWB_ui_Operation_C final : public UUITutoOperation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_1;                                            // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_2;                                            // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_3;                                            // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_4;                                            // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_5;                                            // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Blue;                                     // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Green;                                    // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Red;                                      // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDRetainerBox*                        CA_RetainerBox;                                    // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise_1;                                           // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise_2;                                           // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise_3;                                           // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise_4;                                           // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise_5;                                           // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Set_1;                                             // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Set_2;                                             // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Set_3;                                             // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Set_4;                                             // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Set_5;                                             // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Operation_List_Parts_1_C*        WB_ui_Operation_List_Parts_1_1;                    // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Operation_List_Parts_1_C*        WB_ui_Operation_List_Parts_1_2;                    // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Operation_List_Parts_1_C*        WB_ui_Operation_List_Parts_1_3;                    // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Operation_List_Parts_1_C*        WB_ui_Operation_List_Parts_1_4;                    // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Operation_List_Parts_1_C*        WB_ui_Operation_List_Parts_1_5;                    // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Operation(int32 EntryPoint);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Operation_C">();
	}
	static class UWB_ui_Operation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Operation_C>();
	}
};
static_assert(alignof(UWB_ui_Operation_C) == 0x000008, "Wrong alignment on UWB_ui_Operation_C");
static_assert(sizeof(UWB_ui_Operation_C) == 0x000590, "Wrong size on UWB_ui_Operation_C");
static_assert(offsetof(UWB_ui_Operation_C, UberGraphFrame) == 0x0004A8, "Member 'UWB_ui_Operation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, Out) == 0x0004B0, "Member 'UWB_ui_Operation_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, In) == 0x0004B8, "Member 'UWB_ui_Operation_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, Default_none) == 0x0004C0, "Member 'UWB_ui_Operation_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, Default) == 0x0004C8, "Member 'UWB_ui_Operation_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, Base_1) == 0x0004D0, "Member 'UWB_ui_Operation_C::Base_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, Base_2) == 0x0004D8, "Member 'UWB_ui_Operation_C::Base_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, Base_3) == 0x0004E0, "Member 'UWB_ui_Operation_C::Base_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, Base_4) == 0x0004E8, "Member 'UWB_ui_Operation_C::Base_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, Base_5) == 0x0004F0, "Member 'UWB_ui_Operation_C::Base_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, CA_Image_Blue) == 0x0004F8, "Member 'UWB_ui_Operation_C::CA_Image_Blue' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, CA_Image_Green) == 0x000500, "Member 'UWB_ui_Operation_C::CA_Image_Green' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, CA_Image_Red) == 0x000508, "Member 'UWB_ui_Operation_C::CA_Image_Red' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, CA_RetainerBox) == 0x000510, "Member 'UWB_ui_Operation_C::CA_RetainerBox' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, Noise_1) == 0x000518, "Member 'UWB_ui_Operation_C::Noise_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, Noise_2) == 0x000520, "Member 'UWB_ui_Operation_C::Noise_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, Noise_3) == 0x000528, "Member 'UWB_ui_Operation_C::Noise_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, Noise_4) == 0x000530, "Member 'UWB_ui_Operation_C::Noise_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, Noise_5) == 0x000538, "Member 'UWB_ui_Operation_C::Noise_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, Set_1) == 0x000540, "Member 'UWB_ui_Operation_C::Set_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, Set_2) == 0x000548, "Member 'UWB_ui_Operation_C::Set_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, Set_3) == 0x000550, "Member 'UWB_ui_Operation_C::Set_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, Set_4) == 0x000558, "Member 'UWB_ui_Operation_C::Set_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, Set_5) == 0x000560, "Member 'UWB_ui_Operation_C::Set_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, WB_ui_Operation_List_Parts_1_1) == 0x000568, "Member 'UWB_ui_Operation_C::WB_ui_Operation_List_Parts_1_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, WB_ui_Operation_List_Parts_1_2) == 0x000570, "Member 'UWB_ui_Operation_C::WB_ui_Operation_List_Parts_1_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, WB_ui_Operation_List_Parts_1_3) == 0x000578, "Member 'UWB_ui_Operation_C::WB_ui_Operation_List_Parts_1_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, WB_ui_Operation_List_Parts_1_4) == 0x000580, "Member 'UWB_ui_Operation_C::WB_ui_Operation_List_Parts_1_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Operation_C, WB_ui_Operation_List_Parts_1_5) == 0x000588, "Member 'UWB_ui_Operation_C::WB_ui_Operation_List_Parts_1_5' has a wrong offset!");

}

