#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Equip_Parts_3

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "Enum_ui_equip_parts_3_animation_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Equip_Parts_3.WB_ui_Equip_Parts_3_C.ExecuteUbergraph_WB_ui_Equip_Parts_3
// 0x0084 (0x0084 - 0x0000)
struct WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D46[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D47[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D48[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D49[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D4A[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D4B[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D4C[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_8;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_9;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_10;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D4D[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_10;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_11;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D4E[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_11;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_12;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D4F[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_State;                                // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_12;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_13;           // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D50[0x2];                                     // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_13;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_14;           // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D51[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_14;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_15;           // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D52[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_15;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3) == 0x000004, "Wrong alignment on WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3");
static_assert(sizeof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3) == 0x000084, "Wrong size on WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, EntryPoint) == 0x000000, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000011, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000018, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x00001C, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000020, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000024, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000028, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x00002C, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000030, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x000034, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x000038, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x00003C, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_MakeLiteralByte_ReturnValue_9) == 0x00003D, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_MakeLiteralByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue_8) == 0x000040, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue_9) == 0x000044, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_MakeLiteralByte_ReturnValue_10) == 0x000048, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_MakeLiteralByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue_10) == 0x00004C, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_MakeLiteralByte_ReturnValue_11) == 0x000050, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_MakeLiteralByte_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue_11) == 0x000054, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_MakeLiteralByte_ReturnValue_12) == 0x000058, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_MakeLiteralByte_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, K2Node_Event_State) == 0x00005C, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, K2Node_Event_SubState) == 0x000060, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, K2Node_Event_DeltaSeconds) == 0x000064, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue_12) == 0x000068, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, K2Node_SwitchInteger_CmpSuccess) == 0x00006C, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_MakeLiteralByte_ReturnValue_13) == 0x00006D, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_MakeLiteralByte_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue_13) == 0x000070, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_MakeLiteralByte_ReturnValue_14) == 0x000074, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_MakeLiteralByte_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue_14) == 0x000078, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_MakeLiteralByte_ReturnValue_15) == 0x00007C, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_MakeLiteralByte_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue_15) == 0x000080, "Member 'WB_ui_Equip_Parts_3_C_ExecuteUbergraph_WB_ui_Equip_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue_15' has a wrong offset!");

// Function WB_ui_Equip_Parts_3.WB_ui_Equip_Parts_3_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Equip_Parts_3_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_3_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Equip_Parts_3_C_UpdateState");
static_assert(sizeof(WB_ui_Equip_Parts_3_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Equip_Parts_3_C_UpdateState");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Equip_Parts_3_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Equip_Parts_3_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Equip_Parts_3_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Equip_Parts_3.WB_ui_Equip_Parts_3_C.StateNone
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Equip_Parts_3_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D53[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_3_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_Equip_Parts_3_C_StateNone");
static_assert(sizeof(WB_ui_Equip_Parts_3_C_StateNone) == 0x000010, "Wrong size on WB_ui_Equip_Parts_3_C_StateNone");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_Equip_Parts_3_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Equip_Parts_3_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Equip_Parts_3_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_Equip_Parts_3_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Equip_Parts_3_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Equip_Parts_3_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_Equip_Parts_3.WB_ui_Equip_Parts_3_C.StateOpen
// 0x0040 (0x0040 - 0x0000)
struct WB_ui_Equip_Parts_3_C_StateOpen final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D54[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_ui_equip_parts_3_animation>       _OpenAnimList;                                     // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D55[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetType_Type;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D56[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_ui_equip_parts_3_animation>       K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_3_C_StateOpen) == 0x000008, "Wrong alignment on WB_ui_Equip_Parts_3_C_StateOpen");
static_assert(sizeof(WB_ui_Equip_Parts_3_C_StateOpen) == 0x000040, "Wrong size on WB_ui_Equip_Parts_3_C_StateOpen");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateOpen, SubState) == 0x000000, "Member 'WB_ui_Equip_Parts_3_C_StateOpen::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateOpen, _OpenAnimList) == 0x000008, "Member 'WB_ui_Equip_Parts_3_C_StateOpen::_OpenAnimList' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue) == 0x000018, "Member 'WB_ui_Equip_Parts_3_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateOpen, K2Node_SwitchInteger_CmpSuccess) == 0x000019, "Member 'WB_ui_Equip_Parts_3_C_StateOpen::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00001C, "Member 'WB_ui_Equip_Parts_3_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateOpen, CallFunc_GetType_Type) == 0x000020, "Member 'WB_ui_Equip_Parts_3_C_StateOpen::CallFunc_GetType_Type' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000024, "Member 'WB_ui_Equip_Parts_3_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateOpen, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000028, "Member 'WB_ui_Equip_Parts_3_C_StateOpen::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateOpen, K2Node_MakeArray_Array) == 0x000030, "Member 'WB_ui_Equip_Parts_3_C_StateOpen::K2Node_MakeArray_Array' has a wrong offset!");

// Function WB_ui_Equip_Parts_3.WB_ui_Equip_Parts_3_C.StateLoop
// 0x0040 (0x0040 - 0x0000)
struct WB_ui_Equip_Parts_3_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D57[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_ui_equip_parts_3_animation>       _LoopAnimList;                                     // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D58[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetType_Type;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D59[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D5A[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_ui_equip_parts_3_animation>       K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_3_C_StateLoop) == 0x000008, "Wrong alignment on WB_ui_Equip_Parts_3_C_StateLoop");
static_assert(sizeof(WB_ui_Equip_Parts_3_C_StateLoop) == 0x000040, "Wrong size on WB_ui_Equip_Parts_3_C_StateLoop");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_Equip_Parts_3_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateLoop, _LoopAnimList) == 0x000008, "Member 'WB_ui_Equip_Parts_3_C_StateLoop::_LoopAnimList' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue) == 0x000018, "Member 'WB_ui_Equip_Parts_3_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000019, "Member 'WB_ui_Equip_Parts_3_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateLoop, CallFunc_GetType_Type) == 0x00001C, "Member 'WB_ui_Equip_Parts_3_C_StateLoop::CallFunc_GetType_Type' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000020, "Member 'WB_ui_Equip_Parts_3_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateLoop, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000024, "Member 'WB_ui_Equip_Parts_3_C_StateLoop::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000028, "Member 'WB_ui_Equip_Parts_3_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateLoop, K2Node_MakeArray_Array) == 0x000030, "Member 'WB_ui_Equip_Parts_3_C_StateLoop::K2Node_MakeArray_Array' has a wrong offset!");

// Function WB_ui_Equip_Parts_3.WB_ui_Equip_Parts_3_C.StateClose
// 0x0040 (0x0040 - 0x0000)
struct WB_ui_Equip_Parts_3_C_StateClose final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _Work;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<Enum_ui_equip_parts_3_animation>       _CloseAnimList;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D5B[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D5C[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<Enum_ui_equip_parts_3_animation>       K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_3_C_StateClose) == 0x000008, "Wrong alignment on WB_ui_Equip_Parts_3_C_StateClose");
static_assert(sizeof(WB_ui_Equip_Parts_3_C_StateClose) == 0x000040, "Wrong size on WB_ui_Equip_Parts_3_C_StateClose");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateClose, SubState) == 0x000000, "Member 'WB_ui_Equip_Parts_3_C_StateClose::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateClose, _Work) == 0x000004, "Member 'WB_ui_Equip_Parts_3_C_StateClose::_Work' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateClose, _CloseAnimList) == 0x000008, "Member 'WB_ui_Equip_Parts_3_C_StateClose::_CloseAnimList' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateClose, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'WB_ui_Equip_Parts_3_C_StateClose::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue) == 0x000019, "Member 'WB_ui_Equip_Parts_3_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00001C, "Member 'WB_ui_Equip_Parts_3_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateClose, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000020, "Member 'WB_ui_Equip_Parts_3_C_StateClose::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateClose, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WB_ui_Equip_Parts_3_C_StateClose::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateClose, K2Node_MakeArray_Array) == 0x000028, "Member 'WB_ui_Equip_Parts_3_C_StateClose::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000038, "Member 'WB_ui_Equip_Parts_3_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_Equip_Parts_3.WB_ui_Equip_Parts_3_C.SetWeapon
// 0x0070 (0x0070 - 0x0000)
struct WB_ui_Equip_Parts_3_C_SetWeapon final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumCurrent;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumMax;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSkin;                                            // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D5D[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         _WorkNowID;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _WorkID;                                           // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D5E[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemCategoryID_ReturnValue;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D5F[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Right_ReturnValue;                        // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_3_C_SetWeapon) == 0x000008, "Wrong alignment on WB_ui_Equip_Parts_3_C_SetWeapon");
static_assert(sizeof(WB_ui_Equip_Parts_3_C_SetWeapon) == 0x000070, "Wrong size on WB_ui_Equip_Parts_3_C_SetWeapon");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetWeapon, ID) == 0x000000, "Member 'WB_ui_Equip_Parts_3_C_SetWeapon::ID' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetWeapon, NumCurrent) == 0x000004, "Member 'WB_ui_Equip_Parts_3_C_SetWeapon::NumCurrent' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetWeapon, NumMax) == 0x000008, "Member 'WB_ui_Equip_Parts_3_C_SetWeapon::NumMax' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetWeapon, IsSkin) == 0x00000C, "Member 'WB_ui_Equip_Parts_3_C_SetWeapon::IsSkin' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetWeapon, _WorkNowID) == 0x000010, "Member 'WB_ui_Equip_Parts_3_C_SetWeapon::_WorkNowID' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetWeapon, _WorkID) == 0x000014, "Member 'WB_ui_Equip_Parts_3_C_SetWeapon::_WorkID' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetWeapon, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000018, "Member 'WB_ui_Equip_Parts_3_C_SetWeapon::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetWeapon, CallFunc_Conv_IntToString_ReturnValue) == 0x000020, "Member 'WB_ui_Equip_Parts_3_C_SetWeapon::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetWeapon, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'WB_ui_Equip_Parts_3_C_SetWeapon::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetWeapon, CallFunc_GetItemCategoryID_ReturnValue) == 0x000040, "Member 'WB_ui_Equip_Parts_3_C_SetWeapon::CallFunc_GetItemCategoryID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetWeapon, CallFunc_Right_ReturnValue) == 0x000048, "Member 'WB_ui_Equip_Parts_3_C_SetWeapon::CallFunc_Right_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetWeapon, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000058, "Member 'WB_ui_Equip_Parts_3_C_SetWeapon::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetWeapon, CallFunc_Conv_StringToName_ReturnValue) == 0x000068, "Member 'WB_ui_Equip_Parts_3_C_SetWeapon::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

// Function WB_ui_Equip_Parts_3.WB_ui_Equip_Parts_3_C.SetAccessory
// 0x0088 (0x0088 - 0x0000)
struct WB_ui_Equip_Parts_3_C_SetAccessory final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumCurrent;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumMax;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D60[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 _ItemCategoryList;                                 // 0x0010(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   _NameID;                                           // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D61[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Right_ReturnValue;                        // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_3_C_SetAccessory) == 0x000008, "Wrong alignment on WB_ui_Equip_Parts_3_C_SetAccessory");
static_assert(sizeof(WB_ui_Equip_Parts_3_C_SetAccessory) == 0x000088, "Wrong size on WB_ui_Equip_Parts_3_C_SetAccessory");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetAccessory, ID) == 0x000000, "Member 'WB_ui_Equip_Parts_3_C_SetAccessory::ID' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetAccessory, NumCurrent) == 0x000004, "Member 'WB_ui_Equip_Parts_3_C_SetAccessory::NumCurrent' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetAccessory, NumMax) == 0x000008, "Member 'WB_ui_Equip_Parts_3_C_SetAccessory::NumMax' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetAccessory, _ItemCategoryList) == 0x000010, "Member 'WB_ui_Equip_Parts_3_C_SetAccessory::_ItemCategoryList' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetAccessory, _NameID) == 0x000020, "Member 'WB_ui_Equip_Parts_3_C_SetAccessory::_NameID' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetAccessory, K2Node_MakeArray_Array) == 0x000028, "Member 'WB_ui_Equip_Parts_3_C_SetAccessory::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetAccessory, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000038, "Member 'WB_ui_Equip_Parts_3_C_SetAccessory::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetAccessory, CallFunc_Conv_IntToString_ReturnValue) == 0x000040, "Member 'WB_ui_Equip_Parts_3_C_SetAccessory::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetAccessory, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'WB_ui_Equip_Parts_3_C_SetAccessory::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetAccessory, CallFunc_Right_ReturnValue) == 0x000060, "Member 'WB_ui_Equip_Parts_3_C_SetAccessory::CallFunc_Right_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetAccessory, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000070, "Member 'WB_ui_Equip_Parts_3_C_SetAccessory::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetAccessory, CallFunc_Conv_StringToName_ReturnValue) == 0x000080, "Member 'WB_ui_Equip_Parts_3_C_SetAccessory::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

// Function WB_ui_Equip_Parts_3.WB_ui_Equip_Parts_3_C.SetItem
// 0x02B8 (0x02B8 - 0x0000)
struct WB_ui_Equip_Parts_3_C_SetItem final
{
public:
	class FName                                   ID;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumCurrent;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumMax;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEmpty;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D62[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NowID;                                             // 0x0014(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSkin;                                            // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D63[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         _index;                                            // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D64[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemDataCell                          _WorkItemDataCell;                                 // 0x0028(0x0080)(Edit, BlueprintVisible)
	EItemRarity                                   NewLocalVar_1;                                     // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemIcon                                     NewLocalVar_0;                                     // 0x00A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D65[0x2];                                     // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D66[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isSpoiler_ReturnValue;                    // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D67[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D68[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemData*                              CallFunc_GetItemData_ReturnValue;                  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D69[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemDataCell                          CallFunc_GetData_ItemData;                         // 0x00E8(0x0080)()
	bool                                          CallFunc_GetData_ReturnValue;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D6A[0x2];                                     // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager_1;             // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetCalcParamString_ParamString;           // 0x0178(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D6B[0x3];                                     // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D6C[0x6];                                     // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetText_ReturnValue_1;                    // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D6D[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x01C0(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x01D8(0x0018)()
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager_2;             // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue_2;                    // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager_3;             // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0210(0x0018)()
	class UItemData*                              CallFunc_GetItemData_ReturnValue_1;                // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemDataCell                          CallFunc_GetData_ItemData_1;                       // 0x0230(0x0080)()
	bool                                          CallFunc_GetData_ReturnValue_1;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Equip_Parts_3_C_SetItem) == 0x000008, "Wrong alignment on WB_ui_Equip_Parts_3_C_SetItem");
static_assert(sizeof(WB_ui_Equip_Parts_3_C_SetItem) == 0x0002B8, "Wrong size on WB_ui_Equip_Parts_3_C_SetItem");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetItem, ID) == 0x000000, "Member 'WB_ui_Equip_Parts_3_C_SetItem::ID' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetItem, NumCurrent) == 0x000008, "Member 'WB_ui_Equip_Parts_3_C_SetItem::NumCurrent' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetItem, NumMax) == 0x00000C, "Member 'WB_ui_Equip_Parts_3_C_SetItem::NumMax' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetItem, IsEmpty) == 0x000010, "Member 'WB_ui_Equip_Parts_3_C_SetItem::IsEmpty' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetItem, NowID) == 0x000014, "Member 'WB_ui_Equip_Parts_3_C_SetItem::NowID' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetItem, IsSkin) == 0x00001C, "Member 'WB_ui_Equip_Parts_3_C_SetItem::IsSkin' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetItem, _index) == 0x000020, "Member 'WB_ui_Equip_Parts_3_C_SetItem::_index' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetItem, _WorkItemDataCell) == 0x000028, "Member 'WB_ui_Equip_Parts_3_C_SetItem::_WorkItemDataCell' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetItem, NewLocalVar_1) == 0x0000A8, "Member 'WB_ui_Equip_Parts_3_C_SetItem::NewLocalVar_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetItem, NewLocalVar_0) == 0x0000A9, "Member 'WB_ui_Equip_Parts_3_C_SetItem::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetItem, Temp_int_Array_Index_Variable) == 0x0000AC, "Member 'WB_ui_Equip_Parts_3_C_SetItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetItem, Temp_int_Variable) == 0x0000B0, "Member 'WB_ui_Equip_Parts_3_C_SetItem::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_3_C_SetItem, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000B4, "Member 'WB_ui_Equip_Parts_3_C_SetItem::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
