#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_SaveLoadChoice_Parts_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_SaveLoadChoice_Parts_1.WB_ui_SaveLoadChoice_Parts_1_C
// 0x0088 (0x0508 - 0x0480)
class UWB_ui_SaveLoadChoice_Parts_1_C final : public UUISaveLoadChoice
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default_none;                                      // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_black;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Choise_Set;                                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_1;                                           // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Guide_Set;                                         // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font_1;                                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_1;                                            // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_2;                                            // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_3;                                            // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_save_choice_1;                                // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_save_choice_2;                                // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_SaveLoadChoice_Guide_1;                       // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_1;                                     // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Choise_parts_1_C*                WB_ui_Choise_parts_1_1;                            // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Choise_parts_1_C*                WB_ui_Choise_parts_1_2;                            // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_SaveLoadChoice_Parts_1(int32 EntryPoint);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_SaveLoadChoice_Parts_1_C">();
	}
	static class UWB_ui_SaveLoadChoice_Parts_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_SaveLoadChoice_Parts_1_C>();
	}
};
static_assert(alignof(UWB_ui_SaveLoadChoice_Parts_1_C) == 0x000008, "Wrong alignment on UWB_ui_SaveLoadChoice_Parts_1_C");
static_assert(sizeof(UWB_ui_SaveLoadChoice_Parts_1_C) == 0x000508, "Wrong size on UWB_ui_SaveLoadChoice_Parts_1_C");
static_assert(offsetof(UWB_ui_SaveLoadChoice_Parts_1_C, UberGraphFrame) == 0x000480, "Member 'UWB_ui_SaveLoadChoice_Parts_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_SaveLoadChoice_Parts_1_C, Default_none) == 0x000488, "Member 'UWB_ui_SaveLoadChoice_Parts_1_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_SaveLoadChoice_Parts_1_C, Default) == 0x000490, "Member 'UWB_ui_SaveLoadChoice_Parts_1_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_SaveLoadChoice_Parts_1_C, Base_black) == 0x000498, "Member 'UWB_ui_SaveLoadChoice_Parts_1_C::Base_black' has a wrong offset!");
static_assert(offsetof(UWB_ui_SaveLoadChoice_Parts_1_C, Choise_Set) == 0x0004A0, "Member 'UWB_ui_SaveLoadChoice_Parts_1_C::Choise_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_SaveLoadChoice_Parts_1_C, Frame_1) == 0x0004A8, "Member 'UWB_ui_SaveLoadChoice_Parts_1_C::Frame_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_SaveLoadChoice_Parts_1_C, Guide_Set) == 0x0004B0, "Member 'UWB_ui_SaveLoadChoice_Parts_1_C::Guide_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_SaveLoadChoice_Parts_1_C, Icon_font_1) == 0x0004B8, "Member 'UWB_ui_SaveLoadChoice_Parts_1_C::Icon_font_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_SaveLoadChoice_Parts_1_C, Line_1) == 0x0004C0, "Member 'UWB_ui_SaveLoadChoice_Parts_1_C::Line_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_SaveLoadChoice_Parts_1_C, Line_2) == 0x0004C8, "Member 'UWB_ui_SaveLoadChoice_Parts_1_C::Line_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_SaveLoadChoice_Parts_1_C, Line_3) == 0x0004D0, "Member 'UWB_ui_SaveLoadChoice_Parts_1_C::Line_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_SaveLoadChoice_Parts_1_C, Text_save_choice_1) == 0x0004D8, "Member 'UWB_ui_SaveLoadChoice_Parts_1_C::Text_save_choice_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_SaveLoadChoice_Parts_1_C, Text_save_choice_2) == 0x0004E0, "Member 'UWB_ui_SaveLoadChoice_Parts_1_C::Text_save_choice_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_SaveLoadChoice_Parts_1_C, Text_SaveLoadChoice_Guide_1) == 0x0004E8, "Member 'UWB_ui_SaveLoadChoice_Parts_1_C::Text_SaveLoadChoice_Guide_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_SaveLoadChoice_Parts_1_C, VerticalBox_1) == 0x0004F0, "Member 'UWB_ui_SaveLoadChoice_Parts_1_C::VerticalBox_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_SaveLoadChoice_Parts_1_C, WB_ui_Choise_parts_1_1) == 0x0004F8, "Member 'UWB_ui_SaveLoadChoice_Parts_1_C::WB_ui_Choise_parts_1_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_SaveLoadChoice_Parts_1_C, WB_ui_Choise_parts_1_2) == 0x000500, "Member 'UWB_ui_SaveLoadChoice_Parts_1_C::WB_ui_Choise_parts_1_2' has a wrong offset!");

}

