#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Vitality_pl_02_frame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Vitality_pl_02_frame.WB_ui_Vitality_pl_02_frame_C
// 0x0078 (0x04E0 - 0x0468)
class UWB_ui_Vitality_pl_02_frame_C final : public UUIVitalityPL02
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0468(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Gauge_frame;                                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Status01;                                     // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Status02;                                     // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Status03;                                     // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Status04;                                     // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Status05;                                     // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_party_vitality_pl_2_num1;                     // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_party_vitality_pl_2_num2;                     // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_party_vitality_pl_2_slash;                    // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_pl_02;                                        // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Vitality_pl_02_frame(int32 EntryPoint);
	void OnInitialized();
	void SetIcon2(class UImage* Icon, int32 Param_Index);
	void SetIcon1(class UImage* Icon, int32 Param_Index);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	bool IsUnlockPlayerChara(EPlayerID CharaID);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Vitality_pl_02_frame_C">();
	}
	static class UWB_ui_Vitality_pl_02_frame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Vitality_pl_02_frame_C>();
	}
};
static_assert(alignof(UWB_ui_Vitality_pl_02_frame_C) == 0x000008, "Wrong alignment on UWB_ui_Vitality_pl_02_frame_C");
static_assert(sizeof(UWB_ui_Vitality_pl_02_frame_C) == 0x0004E0, "Wrong size on UWB_ui_Vitality_pl_02_frame_C");
static_assert(offsetof(UWB_ui_Vitality_pl_02_frame_C, UberGraphFrame) == 0x000468, "Member 'UWB_ui_Vitality_pl_02_frame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_pl_02_frame_C, Out) == 0x000470, "Member 'UWB_ui_Vitality_pl_02_frame_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_pl_02_frame_C, In) == 0x000478, "Member 'UWB_ui_Vitality_pl_02_frame_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_pl_02_frame_C, Default_none) == 0x000480, "Member 'UWB_ui_Vitality_pl_02_frame_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_pl_02_frame_C, Default) == 0x000488, "Member 'UWB_ui_Vitality_pl_02_frame_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_pl_02_frame_C, Gauge_frame) == 0x000490, "Member 'UWB_ui_Vitality_pl_02_frame_C::Gauge_frame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_pl_02_frame_C, Icon_Status01) == 0x000498, "Member 'UWB_ui_Vitality_pl_02_frame_C::Icon_Status01' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_pl_02_frame_C, Icon_Status02) == 0x0004A0, "Member 'UWB_ui_Vitality_pl_02_frame_C::Icon_Status02' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_pl_02_frame_C, Icon_Status03) == 0x0004A8, "Member 'UWB_ui_Vitality_pl_02_frame_C::Icon_Status03' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_pl_02_frame_C, Icon_Status04) == 0x0004B0, "Member 'UWB_ui_Vitality_pl_02_frame_C::Icon_Status04' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_pl_02_frame_C, Icon_Status05) == 0x0004B8, "Member 'UWB_ui_Vitality_pl_02_frame_C::Icon_Status05' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_pl_02_frame_C, Text_party_vitality_pl_2_num1) == 0x0004C0, "Member 'UWB_ui_Vitality_pl_02_frame_C::Text_party_vitality_pl_2_num1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_pl_02_frame_C, Text_party_vitality_pl_2_num2) == 0x0004C8, "Member 'UWB_ui_Vitality_pl_02_frame_C::Text_party_vitality_pl_2_num2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_pl_02_frame_C, Text_party_vitality_pl_2_slash) == 0x0004D0, "Member 'UWB_ui_Vitality_pl_02_frame_C::Text_party_vitality_pl_2_slash' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_pl_02_frame_C, Text_pl_02) == 0x0004D8, "Member 'UWB_ui_Vitality_pl_02_frame_C::Text_pl_02' has a wrong offset!");

}

