#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Config

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Config.WB_ui_Config_C
// 0x0210 (0x0BC0 - 0x09B0)
class UWB_ui_Config_C final : public UUIConfigGame
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Info_window_out;                                   // 0x09B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Info_window_in;                                    // 0x09C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Info_window;                                       // 0x09C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x09D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x09D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x09E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_1;                                     // 0x09E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_ViewRange;                             // 0x09F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_1;                                            // 0x09F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_2;                                            // 0x0A00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_3;                                            // 0x0A08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_4;                                            // 0x0A10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_5;                                            // 0x0A18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        Menu_BackgroundBlur;                               // 0x0A20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Menu_Set;                                          // 0x0A28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_2;                                         // 0x0A30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_1_C*            Parts_1_dlc03;                                     // 0x0A38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_2_C*            Parts_2_AutoCamera;                                // 0x0A40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_2_C*            Parts_2_AutoLockOn;                                // 0x0A48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_2_C*            Parts_2_AutoSkip;                                  // 0x0A50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_2_C*            Parts_2_BrainCrashCutin;                           // 0x0A58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_2_C*            Parts_2_CameraAfterMoveType;                       // 0x0A60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_2_C*            Parts_2_CameraRotationPitch;                       // 0x0A68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_2_C*            Parts_2_CameraRotationYaw;                         // 0x0A70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_2_C*            Parts_2_ControllerVibration;                       // 0x0A78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_2_C*            Parts_2_DisplayEnemyDamage;                        // 0x0A80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_2_C*            Parts_2_dlc01;                                     // 0x0A88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_2_C*            Parts_2_dlc02;                                     // 0x0A90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_2_C*            Parts_2_dlc05;                                     // 0x0A98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_2_C*            Parts_2_dlc06;                                     // 0x0AA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_2_C*            Parts_2_MiniMapDisplay;                            // 0x0AA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_2_C*            Parts_2_MiniMapRotation;                           // 0x0AB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_2_C*            Parts_2_MiniMapScaling;                            // 0x0AB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_3_C*            Parts_3_VoiceLanguage;                             // 0x0AC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_4_C*            Parts_4_BGMVolume;                                 // 0x0AC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_4_C*            Parts_4_SEVolume;                                  // 0x0AD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_4_C*            Parts_4_VoiceVolume;                               // 0x0AD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_5_C*            Parts_5_CameraRotationSpeed;                       // 0x0AE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_5_C*            Parts_5_dlc04;                                     // 0x0AE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_5_C*            Parts_5_dlc07;                                     // 0x0AF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ConfigList_Parts_6_C*            Parts_6_difficulty;                                // 0x0AF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                PG_All_Color;                                      // 0x0B00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PG_Cover_Black;                                    // 0x0B08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDRetainerBox*                        REDRetainerBox_Menu;                               // 0x0B10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDScrollBoxSimple*                    REDScrollBoxSimple_0;                              // 0x0B18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Config_help_1;                                // 0x0B20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Option_1;                                     // 0x0B28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Support_ID;                                   // 0x0B30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Brightness_C*                    WB_ui_Brightness;                                  // 0x0B38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Controller_C*                    WB_ui_Controller;                                  // 0x0B40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Graphic_C*                       WB_ui_Graphic;                                     // 0x0B48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Guide_C*                         WB_ui_Guide;                                       // 0x0B50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Keyboard_C*                      WB_ui_Keyboard;                                    // 0x0B58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MainContents_Parts_4_C*          WB_ui_MainContents_Parts_4;                        // 0x0B60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MainContents_Parts_5_C*          WB_ui_MainContents_Parts_5;                        // 0x0B68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MainContents_Parts_6_C*          WB_ui_MainContents_Parts_6_1;                      // 0x0B70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MainContents_Parts_6_C*          WB_ui_MainContents_Parts_6_2;                      // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MainContents_Parts_6_C*          WB_ui_MainContents_Parts_6_3;                      // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MainContents_Parts_6_C*          WB_ui_MainContents_Parts_6_4;                      // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MainContents_Parts_6_C*          WB_ui_MainContents_Parts_6_5;                      // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MainContents_Parts_6_C*          WB_ui_MainContents_Parts_6_6;                      // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Other_TitleBack_C*               WB_ui_Other_TitleBack;                             // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_SystemChoice_Parts_1_C*          WB_ui_SystemChoice_Parts_1;                        // 0x0BA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWB_ui_MainContents_Parts_6_C*>  UIMainContentsPartsArray;                          // 0x0BB0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Config(int32 EntryPoint);
	void PlayVibrationS();
	void UnbindAnyKey();
	void bindAnyKey();
	void AnyKey(const struct FKey& KeyName);
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Config_C">();
	}
	static class UWB_ui_Config_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Config_C>();
	}
};
static_assert(alignof(UWB_ui_Config_C) == 0x000008, "Wrong alignment on UWB_ui_Config_C");
static_assert(sizeof(UWB_ui_Config_C) == 0x000BC0, "Wrong size on UWB_ui_Config_C");
static_assert(offsetof(UWB_ui_Config_C, UberGraphFrame) == 0x0009B0, "Member 'UWB_ui_Config_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Info_window_out) == 0x0009B8, "Member 'UWB_ui_Config_C::Info_window_out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Info_window_in) == 0x0009C0, "Member 'UWB_ui_Config_C::Info_window_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Info_window) == 0x0009C8, "Member 'UWB_ui_Config_C::Info_window' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Out) == 0x0009D0, "Member 'UWB_ui_Config_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, In) == 0x0009D8, "Member 'UWB_ui_Config_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Default) == 0x0009E0, "Member 'UWB_ui_Config_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, CanvasPanel_1) == 0x0009E8, "Member 'UWB_ui_Config_C::CanvasPanel_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, CanvasPanel_ViewRange) == 0x0009F0, "Member 'UWB_ui_Config_C::CanvasPanel_ViewRange' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Line_1) == 0x0009F8, "Member 'UWB_ui_Config_C::Line_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Line_2) == 0x000A00, "Member 'UWB_ui_Config_C::Line_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Line_3) == 0x000A08, "Member 'UWB_ui_Config_C::Line_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Line_4) == 0x000A10, "Member 'UWB_ui_Config_C::Line_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Line_5) == 0x000A18, "Member 'UWB_ui_Config_C::Line_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Menu_BackgroundBlur) == 0x000A20, "Member 'UWB_ui_Config_C::Menu_BackgroundBlur' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Menu_Set) == 0x000A28, "Member 'UWB_ui_Config_C::Menu_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Overlay_2) == 0x000A30, "Member 'UWB_ui_Config_C::Overlay_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_1_dlc03) == 0x000A38, "Member 'UWB_ui_Config_C::Parts_1_dlc03' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_2_AutoCamera) == 0x000A40, "Member 'UWB_ui_Config_C::Parts_2_AutoCamera' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_2_AutoLockOn) == 0x000A48, "Member 'UWB_ui_Config_C::Parts_2_AutoLockOn' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_2_AutoSkip) == 0x000A50, "Member 'UWB_ui_Config_C::Parts_2_AutoSkip' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_2_BrainCrashCutin) == 0x000A58, "Member 'UWB_ui_Config_C::Parts_2_BrainCrashCutin' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_2_CameraAfterMoveType) == 0x000A60, "Member 'UWB_ui_Config_C::Parts_2_CameraAfterMoveType' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_2_CameraRotationPitch) == 0x000A68, "Member 'UWB_ui_Config_C::Parts_2_CameraRotationPitch' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_2_CameraRotationYaw) == 0x000A70, "Member 'UWB_ui_Config_C::Parts_2_CameraRotationYaw' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_2_ControllerVibration) == 0x000A78, "Member 'UWB_ui_Config_C::Parts_2_ControllerVibration' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_2_DisplayEnemyDamage) == 0x000A80, "Member 'UWB_ui_Config_C::Parts_2_DisplayEnemyDamage' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_2_dlc01) == 0x000A88, "Member 'UWB_ui_Config_C::Parts_2_dlc01' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_2_dlc02) == 0x000A90, "Member 'UWB_ui_Config_C::Parts_2_dlc02' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_2_dlc05) == 0x000A98, "Member 'UWB_ui_Config_C::Parts_2_dlc05' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_2_dlc06) == 0x000AA0, "Member 'UWB_ui_Config_C::Parts_2_dlc06' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_2_MiniMapDisplay) == 0x000AA8, "Member 'UWB_ui_Config_C::Parts_2_MiniMapDisplay' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_2_MiniMapRotation) == 0x000AB0, "Member 'UWB_ui_Config_C::Parts_2_MiniMapRotation' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_2_MiniMapScaling) == 0x000AB8, "Member 'UWB_ui_Config_C::Parts_2_MiniMapScaling' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_3_VoiceLanguage) == 0x000AC0, "Member 'UWB_ui_Config_C::Parts_3_VoiceLanguage' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_4_BGMVolume) == 0x000AC8, "Member 'UWB_ui_Config_C::Parts_4_BGMVolume' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_4_SEVolume) == 0x000AD0, "Member 'UWB_ui_Config_C::Parts_4_SEVolume' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_4_VoiceVolume) == 0x000AD8, "Member 'UWB_ui_Config_C::Parts_4_VoiceVolume' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_5_CameraRotationSpeed) == 0x000AE0, "Member 'UWB_ui_Config_C::Parts_5_CameraRotationSpeed' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_5_dlc04) == 0x000AE8, "Member 'UWB_ui_Config_C::Parts_5_dlc04' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_5_dlc07) == 0x000AF0, "Member 'UWB_ui_Config_C::Parts_5_dlc07' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Parts_6_difficulty) == 0x000AF8, "Member 'UWB_ui_Config_C::Parts_6_difficulty' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, PG_All_Color) == 0x000B00, "Member 'UWB_ui_Config_C::PG_All_Color' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, PG_Cover_Black) == 0x000B08, "Member 'UWB_ui_Config_C::PG_Cover_Black' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, REDRetainerBox_Menu) == 0x000B10, "Member 'UWB_ui_Config_C::REDRetainerBox_Menu' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, REDScrollBoxSimple_0) == 0x000B18, "Member 'UWB_ui_Config_C::REDScrollBoxSimple_0' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Text_Config_help_1) == 0x000B20, "Member 'UWB_ui_Config_C::Text_Config_help_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Text_Option_1) == 0x000B28, "Member 'UWB_ui_Config_C::Text_Option_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, Text_Support_ID) == 0x000B30, "Member 'UWB_ui_Config_C::Text_Support_ID' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, WB_ui_Brightness) == 0x000B38, "Member 'UWB_ui_Config_C::WB_ui_Brightness' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, WB_ui_Controller) == 0x000B40, "Member 'UWB_ui_Config_C::WB_ui_Controller' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, WB_ui_Graphic) == 0x000B48, "Member 'UWB_ui_Config_C::WB_ui_Graphic' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, WB_ui_Guide) == 0x000B50, "Member 'UWB_ui_Config_C::WB_ui_Guide' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, WB_ui_Keyboard) == 0x000B58, "Member 'UWB_ui_Config_C::WB_ui_Keyboard' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, WB_ui_MainContents_Parts_4) == 0x000B60, "Member 'UWB_ui_Config_C::WB_ui_MainContents_Parts_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, WB_ui_MainContents_Parts_5) == 0x000B68, "Member 'UWB_ui_Config_C::WB_ui_MainContents_Parts_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, WB_ui_MainContents_Parts_6_1) == 0x000B70, "Member 'UWB_ui_Config_C::WB_ui_MainContents_Parts_6_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, WB_ui_MainContents_Parts_6_2) == 0x000B78, "Member 'UWB_ui_Config_C::WB_ui_MainContents_Parts_6_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, WB_ui_MainContents_Parts_6_3) == 0x000B80, "Member 'UWB_ui_Config_C::WB_ui_MainContents_Parts_6_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, WB_ui_MainContents_Parts_6_4) == 0x000B88, "Member 'UWB_ui_Config_C::WB_ui_MainContents_Parts_6_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, WB_ui_MainContents_Parts_6_5) == 0x000B90, "Member 'UWB_ui_Config_C::WB_ui_MainContents_Parts_6_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, WB_ui_MainContents_Parts_6_6) == 0x000B98, "Member 'UWB_ui_Config_C::WB_ui_MainContents_Parts_6_6' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, WB_ui_Other_TitleBack) == 0x000BA0, "Member 'UWB_ui_Config_C::WB_ui_Other_TitleBack' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, WB_ui_SystemChoice_Parts_1) == 0x000BA8, "Member 'UWB_ui_Config_C::WB_ui_SystemChoice_Parts_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Config_C, UIMainContentsPartsArray) == 0x000BB0, "Member 'UWB_ui_Config_C::UIMainContentsPartsArray' has a wrong offset!");

}

