#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Item_Menu_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Item_Menu_1.WB_ui_Item_Menu_1_C
// 0x01A0 (0x0528 - 0x0388)
class UWB_ui_Item_Menu_1_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Change_L_R;                                        // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out_2;                                             // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_2;                                              // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_2;                                         // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_all_2;                                      // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_all_1;                                      // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       R_decision_2;                                      // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       L_decision_2;                                      // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_l;                                          // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_r;                                          // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Delete_change_l_c_2;                               // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_l_c;                                        // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Delete_change_c_r_2;                               // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_c_r;                                        // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Full;                                              // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Full_in;                                           // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       R_decision;                                        // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       L_decision;                                        // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Decision;                                          // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Frame_center_base;                                 // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_center_cover;                                // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_item_base;                                   // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_add;                                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Item_center;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Item_center_change;                                // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Item_center_grow;                                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Item_left;                                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Item_left_change;                                  // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Item_right;                                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Item_right_change;                                 // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_1;                                            // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_2;                                            // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise_1;                                           // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise_2;                                           // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_item_name_1;                                  // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_item_number_center_1;                         // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_item_number_left_1;                           // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_item_number_right_1;                          // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          FlagEnable;                                        // 0x04E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          FlagDecide;                                        // 0x04E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C3D[0x2];                                     // 0x04E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_WB_ui_Item_Menu_1_C;                         // 0x04E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_Item_Menu_2_C*                   FrameObject;                                       // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShiftCount;                                        // 0x04F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentItemNum;                                    // 0x04F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlagItemEmpty;                                     // 0x04F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C3E[0x3];                                     // 0x04F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CurrentItemID;                                     // 0x04FC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemTypeNum;                                       // 0x0504(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemTypeNumOld;                                    // 0x0508(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentItemIdCenter;                               // 0x050C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentItemIdLeft;                                 // 0x0514(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentItemIdRight;                                // 0x051C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlagNoMotion;                                      // 0x0524(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ItemTypeChangeFlag;                                // 0x0525(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_ui_Item_Menu_1(int32 EntryPoint);
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void StateNone(int32 SubState);
	void StateOpen(int32 SubState);
	void State_Loop_Enable(int32 SubState);
	void StateClose(int32 SubState);
	void State_Add_Item(int32 SubState);
	void SetItem(bool FlagChangeLeft, bool FlagChangeRight);
	void Set_Item_Center(int32 CurrentIndex, int32 Nextindex);
	void SetItemLeft(int32 CurrentIndex, int32 Nextindex);
	void SetItemRight(int32 CurrentIndex, int32 Nextindex);
	void UseCurrentItem(bool* IsUse);
	void SetItemID(class UImage* Image, class FName ID);
	void SetItemNum(class UImage* Image_10, class UImage* Image_01, int32 Num);
	void SetItemText(class FName ItemId);
	void SetFrameObject(class UWB_ui_Item_Menu_2_C* Object);
	void PlayItemAnimation(int32 Param_Index, bool IsLoop);
	void StopItemCurrentAnimation();
	void StateLoopDisable(int32 SubState);
	void SetEnableUse(bool IsEnable);
	void SetRecastPercent(float Percent);
	void ShiftLeft();
	void ShiftRight();
	void SetFrameColor(class FName ItemId);
	void EmptyCurrentItem();
	void ItemSelect(bool* IsSelect);
	void CheckItemTypeNum(bool* IsChange);
	void UpdateCurrentItemID();
	void CorrectCurrentItemID();
	void GetCurrentItemID(class FName* ID);
	void SetNoMotionUse(bool IsNoMotion);
	void RestoreSelectedItem();
	void ItemCheck8297();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Item_Menu_1_C">();
	}
	static class UWB_ui_Item_Menu_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Item_Menu_1_C>();
	}
};
static_assert(alignof(UWB_ui_Item_Menu_1_C) == 0x000008, "Wrong alignment on UWB_ui_Item_Menu_1_C");
static_assert(sizeof(UWB_ui_Item_Menu_1_C) == 0x000528, "Wrong size on UWB_ui_Item_Menu_1_C");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_Item_Menu_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Change_L_R) == 0x000390, "Member 'UWB_ui_Item_Menu_1_C::Change_L_R' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Out_2) == 0x000398, "Member 'UWB_ui_Item_Menu_1_C::Out_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, In_2) == 0x0003A0, "Member 'UWB_ui_Item_Menu_1_C::In_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Default_2) == 0x0003A8, "Member 'UWB_ui_Item_Menu_1_C::Default_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Change_all_2) == 0x0003B0, "Member 'UWB_ui_Item_Menu_1_C::Change_all_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Change_all_1) == 0x0003B8, "Member 'UWB_ui_Item_Menu_1_C::Change_all_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, R_decision_2) == 0x0003C0, "Member 'UWB_ui_Item_Menu_1_C::R_decision_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, L_decision_2) == 0x0003C8, "Member 'UWB_ui_Item_Menu_1_C::L_decision_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Change_l) == 0x0003D0, "Member 'UWB_ui_Item_Menu_1_C::Change_l' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Change_r) == 0x0003D8, "Member 'UWB_ui_Item_Menu_1_C::Change_r' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Delete_change_l_c_2) == 0x0003E0, "Member 'UWB_ui_Item_Menu_1_C::Delete_change_l_c_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Change_l_c) == 0x0003E8, "Member 'UWB_ui_Item_Menu_1_C::Change_l_c' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Delete_change_c_r_2) == 0x0003F0, "Member 'UWB_ui_Item_Menu_1_C::Delete_change_c_r_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Change_c_r) == 0x0003F8, "Member 'UWB_ui_Item_Menu_1_C::Change_c_r' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Full) == 0x000400, "Member 'UWB_ui_Item_Menu_1_C::Full' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Full_in) == 0x000408, "Member 'UWB_ui_Item_Menu_1_C::Full_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, R_decision) == 0x000410, "Member 'UWB_ui_Item_Menu_1_C::R_decision' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, L_decision) == 0x000418, "Member 'UWB_ui_Item_Menu_1_C::L_decision' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Decision) == 0x000420, "Member 'UWB_ui_Item_Menu_1_C::Decision' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Out) == 0x000428, "Member 'UWB_ui_Item_Menu_1_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, In) == 0x000430, "Member 'UWB_ui_Item_Menu_1_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Default_none) == 0x000438, "Member 'UWB_ui_Item_Menu_1_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Default) == 0x000440, "Member 'UWB_ui_Item_Menu_1_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Frame_center_base) == 0x000448, "Member 'UWB_ui_Item_Menu_1_C::Frame_center_base' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Frame_center_cover) == 0x000450, "Member 'UWB_ui_Item_Menu_1_C::Frame_center_cover' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Frame_item_base) == 0x000458, "Member 'UWB_ui_Item_Menu_1_C::Frame_item_base' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Icon_add) == 0x000460, "Member 'UWB_ui_Item_Menu_1_C::Icon_add' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Item_center) == 0x000468, "Member 'UWB_ui_Item_Menu_1_C::Item_center' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Item_center_change) == 0x000470, "Member 'UWB_ui_Item_Menu_1_C::Item_center_change' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Item_center_grow) == 0x000478, "Member 'UWB_ui_Item_Menu_1_C::Item_center_grow' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Item_left) == 0x000480, "Member 'UWB_ui_Item_Menu_1_C::Item_left' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Item_left_change) == 0x000488, "Member 'UWB_ui_Item_Menu_1_C::Item_left_change' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Item_right) == 0x000490, "Member 'UWB_ui_Item_Menu_1_C::Item_right' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Item_right_change) == 0x000498, "Member 'UWB_ui_Item_Menu_1_C::Item_right_change' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Line_1) == 0x0004A0, "Member 'UWB_ui_Item_Menu_1_C::Line_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Line_2) == 0x0004A8, "Member 'UWB_ui_Item_Menu_1_C::Line_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Noise_1) == 0x0004B0, "Member 'UWB_ui_Item_Menu_1_C::Noise_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Noise_2) == 0x0004B8, "Member 'UWB_ui_Item_Menu_1_C::Noise_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Text_item_name_1) == 0x0004C0, "Member 'UWB_ui_Item_Menu_1_C::Text_item_name_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Text_item_number_center_1) == 0x0004C8, "Member 'UWB_ui_Item_Menu_1_C::Text_item_number_center_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Text_item_number_left_1) == 0x0004D0, "Member 'UWB_ui_Item_Menu_1_C::Text_item_number_left_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Text_item_number_right_1) == 0x0004D8, "Member 'UWB_ui_Item_Menu_1_C::Text_item_number_right_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, FlagEnable) == 0x0004E0, "Member 'UWB_ui_Item_Menu_1_C::FlagEnable' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, FlagDecide) == 0x0004E1, "Member 'UWB_ui_Item_Menu_1_C::FlagDecide' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, Index_WB_ui_Item_Menu_1_C) == 0x0004E4, "Member 'UWB_ui_Item_Menu_1_C::Index_WB_ui_Item_Menu_1_C' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, FrameObject) == 0x0004E8, "Member 'UWB_ui_Item_Menu_1_C::FrameObject' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, ShiftCount) == 0x0004F0, "Member 'UWB_ui_Item_Menu_1_C::ShiftCount' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, CurrentItemNum) == 0x0004F4, "Member 'UWB_ui_Item_Menu_1_C::CurrentItemNum' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, FlagItemEmpty) == 0x0004F8, "Member 'UWB_ui_Item_Menu_1_C::FlagItemEmpty' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, CurrentItemID) == 0x0004FC, "Member 'UWB_ui_Item_Menu_1_C::CurrentItemID' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, ItemTypeNum) == 0x000504, "Member 'UWB_ui_Item_Menu_1_C::ItemTypeNum' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, ItemTypeNumOld) == 0x000508, "Member 'UWB_ui_Item_Menu_1_C::ItemTypeNumOld' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, CurrentItemIdCenter) == 0x00050C, "Member 'UWB_ui_Item_Menu_1_C::CurrentItemIdCenter' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, CurrentItemIdLeft) == 0x000514, "Member 'UWB_ui_Item_Menu_1_C::CurrentItemIdLeft' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, CurrentItemIdRight) == 0x00051C, "Member 'UWB_ui_Item_Menu_1_C::CurrentItemIdRight' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, FlagNoMotion) == 0x000524, "Member 'UWB_ui_Item_Menu_1_C::FlagNoMotion' has a wrong offset!");
static_assert(offsetof(UWB_ui_Item_Menu_1_C, ItemTypeChangeFlag) == 0x000525, "Member 'UWB_ui_Item_Menu_1_C::ItemTypeChangeFlag' has a wrong offset!");

}

