#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Tips

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Tips.WB_ui_Tips_C
// 0x00B0 (0x04F8 - 0x0448)
class UWB_ui_Tips_C final : public UUITips
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0448(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Blue;                                     // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Green;                                    // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Red;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDRetainerBox*                        CA_RetainerBox;                                    // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Base;                                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Grow;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_pattern;                                     // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise;                                             // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OP_Scale_All_Set;                                  // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OP_Scale_Arrow;                                    // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PG_Cover_Black;                                    // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Guide_C*                         WB_ui_Guide_0;                                     // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Help_Arrow_C*                    WB_ui_Help_Arrow_1;                                // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Help_Arrow_C*                    WB_ui_Help_Arrow_2;                                // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_TutoTips_Parts_1_C*              WB_ui_Tutorial_Parts_1;                            // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              MessageSizeNormal;                                 // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MessageSizeExpansion;                              // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Tips(int32 EntryPoint);
	void OnInitialized();
	void Destruct();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	bool SetupTextSize();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Tips_C">();
	}
	static class UWB_ui_Tips_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Tips_C>();
	}
};
static_assert(alignof(UWB_ui_Tips_C) == 0x000008, "Wrong alignment on UWB_ui_Tips_C");
static_assert(sizeof(UWB_ui_Tips_C) == 0x0004F8, "Wrong size on UWB_ui_Tips_C");
static_assert(offsetof(UWB_ui_Tips_C, UberGraphFrame) == 0x000448, "Member 'UWB_ui_Tips_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Tips_C, Out) == 0x000450, "Member 'UWB_ui_Tips_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Tips_C, In) == 0x000458, "Member 'UWB_ui_Tips_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Tips_C, Default_none) == 0x000460, "Member 'UWB_ui_Tips_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Tips_C, Default) == 0x000468, "Member 'UWB_ui_Tips_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Tips_C, CA_Image_Blue) == 0x000470, "Member 'UWB_ui_Tips_C::CA_Image_Blue' has a wrong offset!");
static_assert(offsetof(UWB_ui_Tips_C, CA_Image_Green) == 0x000478, "Member 'UWB_ui_Tips_C::CA_Image_Green' has a wrong offset!");
static_assert(offsetof(UWB_ui_Tips_C, CA_Image_Red) == 0x000480, "Member 'UWB_ui_Tips_C::CA_Image_Red' has a wrong offset!");
static_assert(offsetof(UWB_ui_Tips_C, CA_RetainerBox) == 0x000488, "Member 'UWB_ui_Tips_C::CA_RetainerBox' has a wrong offset!");
static_assert(offsetof(UWB_ui_Tips_C, Frame_Base) == 0x000490, "Member 'UWB_ui_Tips_C::Frame_Base' has a wrong offset!");
static_assert(offsetof(UWB_ui_Tips_C, Frame_Grow) == 0x000498, "Member 'UWB_ui_Tips_C::Frame_Grow' has a wrong offset!");
static_assert(offsetof(UWB_ui_Tips_C, Frame_pattern) == 0x0004A0, "Member 'UWB_ui_Tips_C::Frame_pattern' has a wrong offset!");
static_assert(offsetof(UWB_ui_Tips_C, Noise) == 0x0004A8, "Member 'UWB_ui_Tips_C::Noise' has a wrong offset!");
static_assert(offsetof(UWB_ui_Tips_C, OP_Scale_All_Set) == 0x0004B0, "Member 'UWB_ui_Tips_C::OP_Scale_All_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Tips_C, OP_Scale_Arrow) == 0x0004B8, "Member 'UWB_ui_Tips_C::OP_Scale_Arrow' has a wrong offset!");
static_assert(offsetof(UWB_ui_Tips_C, PG_Cover_Black) == 0x0004C0, "Member 'UWB_ui_Tips_C::PG_Cover_Black' has a wrong offset!");
static_assert(offsetof(UWB_ui_Tips_C, WB_ui_Guide_0) == 0x0004C8, "Member 'UWB_ui_Tips_C::WB_ui_Guide_0' has a wrong offset!");
static_assert(offsetof(UWB_ui_Tips_C, WB_ui_Help_Arrow_1) == 0x0004D0, "Member 'UWB_ui_Tips_C::WB_ui_Help_Arrow_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Tips_C, WB_ui_Help_Arrow_2) == 0x0004D8, "Member 'UWB_ui_Tips_C::WB_ui_Help_Arrow_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Tips_C, WB_ui_Tutorial_Parts_1) == 0x0004E0, "Member 'UWB_ui_Tips_C::WB_ui_Tutorial_Parts_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Tips_C, MessageSizeNormal) == 0x0004E8, "Member 'UWB_ui_Tips_C::MessageSizeNormal' has a wrong offset!");
static_assert(offsetof(UWB_ui_Tips_C, MessageSizeExpansion) == 0x0004F0, "Member 'UWB_ui_Tips_C::MessageSizeExpansion' has a wrong offset!");

}

