#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_MainContents

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_MainContents.WB_ui_MainContents_C.ExecuteUbergraph_WB_ui_MainContents
// 0x0430 (0x0430 - 0x0000)
struct WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30AB[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 CharaID, class UImage* Image, bool IsNoiseReset)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30AC[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 CharaID, class UImage* Image, bool IsNoiseReset)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30AD[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30AE[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_State;                                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30AF[0x2];                                     // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_GetChangeTargetTexture_RenderTarget;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_GetChangeTargetTexture_RenderTargetAlpha; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EUIMain3DCharacterSceneID SceneID)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30B0[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_CharaID_2;                      // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 K2Node_CustomEvent_Image_2;                        // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsNoiseReset_1;                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30B1[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CharaID_1;                      // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30B2[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 K2Node_CustomEvent_Image_1;                        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsNoiseReset;                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30B3[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUIMain3DCharacterSceneID                     K2Node_CustomEvent_SceneID;                        // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30B4[0x1];                                     // 0x00B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 CharaID, class UImage* Image)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00B4(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EUIMain3DEquipSelectID Select, int32 AttachmentIndex)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30B5[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSelectNoiseRate_NoiseRate;             // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30B6[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetChangeTargetNoiseRate_NoiseRate;       // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     Temp_byte_Variable;                                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30B7[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_GetSelectTexture_RenderTarget;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_GetSelectTexture_RenderTargetAlpha;       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSelectNoiseRate_NoiseRate_1;           // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30B8[0x3];                                     // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetChangeTargetNoiseRate_NoiseRate_1;     // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30B9[0x1];                                     // 0x010F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30BA[0x2];                                     // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_CharaID;                        // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30BB[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 K2Node_CustomEvent_Image;                          // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30BC[0x3];                                     // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool IsPopup)>                 K2Node_CreateDelegate_OutputDelegate_5;            // 0x0134(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_30BD[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_GetSelectTexture_RenderTarget_1;          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_GetSelectTexture_RenderTargetAlpha_1;     // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsPopup)>                 K2Node_CreateDelegate_OutputDelegate_6;            // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool IsPopup)>                 K2Node_CreateDelegate_OutputDelegate_7;            // 0x0168(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 Attachment0, int32 Attachment1, int32 Attachment2, int32 CameraIndex)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUIMain3DEquipSelectID                        K2Node_CustomEvent_Select;                         // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30BE[0x2];                                     // 0x018A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_AttachmentIndex;                // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30BF[0x3];                                     // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsPopup)>                 K2Node_CreateDelegate_OutputDelegate_9;            // 0x0198(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C0[0x3];                                     // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsPopup)>                 K2Node_CreateDelegate_OutputDelegate_10;           // 0x01B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_CharaMoveFlag;                  // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x01C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30C1[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Path;                           // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FRedMouseArgument                      K2Node_CustomEvent_argument_2;                     // 0x01D8(0x000C)(NoDestructor)
	uint8                                         Pad_30C2[0x4];                                     // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_pWidget_2;                      // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetChangeMainMenuTab_ReturnValue;         // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C3[0x2];                                     // 0x01F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x01FC(0x0010)(ZeroConstructor, NoDestructor)
	struct FRedMouseArgument                      K2Node_CustomEvent_argument_1;                     // 0x020C(0x000C)(NoDestructor)
	class UUserWidget*                            K2Node_CustomEvent_pWidget_1;                      // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C4[0x3];                                     // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool IsCostumeAttachment, int32 CursorCategory, int32 SelectID)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x0224(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_8;             // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C5[0x3];                                     // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRedMouseArgument                      K2Node_CustomEvent_argument;                       // 0x023C(0x000C)(NoDestructor)
	class UUserWidget*                            K2Node_CustomEvent_pWidget;                        // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_9;             // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue;                       // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue_1;                     // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue_2;                     // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetChangeMainMenuTabL_ReturnValue;        // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetChangeMainMenuTabR_ReturnValue;        // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_10;           // 0x0273(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_10;            // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isLockTabChange_ReturnValue;              // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_isLockTabChange_ReturnValue_1;            // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_isLockTabChange_ReturnValue_2;            // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_11;           // 0x027B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30C6[0x3];                                     // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_11;            // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_12;           // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C7[0x3];                                     // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FRedMouseArgument& Argument, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_13;           // 0x0288(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_12;            // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentState_State;                    // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FRedMouseArgument& Argument, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_14;           // 0x02A0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FRedMouseArgument& Argument, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_15;           // 0x02B0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& Path)>    K2Node_CreateDelegate_OutputDelegate_16;           // 0x02C0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTabEnable_ReturnValue;                  // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTabEnable_ReturnValue_1;                // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30C8[0x2];                                     // 0x02DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool CharaMoveFlag)>           K2Node_CreateDelegate_OutputDelegate_17;           // 0x02E0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsCostumeAttachment;            // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30C9[0x3];                                     // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_CursorCategory;                 // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectID;                       // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30CA[0x3];                                     // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_18;           // 0x0304(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_13;           // 0x0315(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30CB[0x2];                                     // 0x0316(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_13;            // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30CC[0x3];                                     // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0324(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_14;           // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0365(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30CD[0x2];                                     // 0x0366(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_14;            // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsPopup_4;                      // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30CE[0x2];                                     // 0x0372(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_19;           // 0x0374(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsPopup_3;                      // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30CF[0x3];                                     // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30D0[0x3];                                     // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Attachment0;                    // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Attachment1;                    // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Attachment2;                    // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CameraIndex;                    // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_18;                   // 0x03A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsPopup_2;                      // 0x03A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsPopup_1;                      // 0x03A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsPopup;                        // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_15;           // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D1[0x2];                                     // 0x03AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_15;            // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserParamManager*                      CallFunc_GetUserParamManager_UserParamManager;     // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMoney_ReturnValue;                     // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D2[0x4];                                     // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x03C0(0x0018)()
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerSkillPoint_skill_point;          // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D3[0x4];                                     // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue;                    // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x03F0(0x0018)()
	TScriptInterface<class IPlayerInterface>      K2Node_DynamicCast_AsPlayer_Interface;             // 0x0408(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue;                  // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D4[0x2];                                     // 0x041A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_20;           // 0x041C(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents) == 0x000008, "Wrong alignment on WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents");
static_assert(sizeof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents) == 0x000430, "Wrong size on WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, EntryPoint) == 0x000000, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_MakeLiteralByte_ReturnValue) == 0x000018, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00002C, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000030, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000034, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000038, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_Event_State) == 0x00003C, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_Event_SubState) == 0x000040, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_Event_DeltaSeconds) == 0x000044, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000048, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_SwitchInteger_CmpSuccess) == 0x00004C, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_IsValid_ReturnValue_1) == 0x00004D, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_GetChangeTargetTexture_RenderTarget) == 0x000050, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_GetChangeTargetTexture_RenderTarget' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_GetChangeTargetTexture_RenderTargetAlpha) == 0x000058, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_GetChangeTargetTexture_RenderTargetAlpha' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CreateDelegate_OutputDelegate_2) == 0x000060, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_IsValid_ReturnValue_2) == 0x000070, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CustomEvent_CharaID_2) == 0x000074, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CustomEvent_CharaID_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CustomEvent_Image_2) == 0x000078, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CustomEvent_Image_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CustomEvent_IsNoiseReset_1) == 0x000080, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CustomEvent_IsNoiseReset_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000088, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CustomEvent_CharaID_1) == 0x000090, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CustomEvent_CharaID_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CustomEvent_Image_1) == 0x000098, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CustomEvent_Image_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CustomEvent_IsNoiseReset) == 0x0000A0, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CustomEvent_IsNoiseReset' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0000A8, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_IsValid_ReturnValue_3) == 0x0000B0, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CustomEvent_SceneID) == 0x0000B1, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CustomEvent_SceneID' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x0000B2, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000B4, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x0000C4, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000C8, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_IsValid_ReturnValue_4) == 0x0000D8, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_GetSelectNoiseRate_NoiseRate) == 0x0000DC, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_GetSelectNoiseRate_NoiseRate' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_IsValid_ReturnValue_5) == 0x0000E0, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_GetChangeTargetNoiseRate_NoiseRate) == 0x0000E4, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_GetChangeTargetNoiseRate_NoiseRate' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, Temp_byte_Variable) == 0x0000E8, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_GetSelectTexture_RenderTarget) == 0x0000F0, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_GetSelectTexture_RenderTarget' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_GetSelectTexture_RenderTargetAlpha) == 0x0000F8, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_GetSelectTexture_RenderTargetAlpha' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_GetSelectNoiseRate_NoiseRate_1) == 0x000100, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_GetSelectNoiseRate_NoiseRate_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_IsValid_ReturnValue_6) == 0x000104, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_GetChangeTargetNoiseRate_NoiseRate_1) == 0x000108, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_GetChangeTargetNoiseRate_NoiseRate_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_IsValid_ReturnValue_7) == 0x00010C, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x00010D, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_BooleanAND_ReturnValue) == 0x00010E, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000110, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_IsValid_ReturnValue_8) == 0x000114, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_BooleanAND_ReturnValue_1) == 0x000115, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CustomEvent_CharaID) == 0x000118, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CustomEvent_CharaID' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CustomEvent_Image) == 0x000120, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CustomEvent_Image' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000128, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_IsValid_ReturnValue_9) == 0x000130, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CreateDelegate_OutputDelegate_5) == 0x000134, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_GetSelectTexture_RenderTarget_1) == 0x000148, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_GetSelectTexture_RenderTarget_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_GetSelectTexture_RenderTargetAlpha_1) == 0x000150, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_GetSelectTexture_RenderTargetAlpha_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CreateDelegate_OutputDelegate_6) == 0x000158, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CreateDelegate_OutputDelegate_7) == 0x000168, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CreateDelegate_OutputDelegate_8) == 0x000178, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_IsValid_ReturnValue_10) == 0x000188, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CustomEvent_Select) == 0x000189, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CustomEvent_Select' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CustomEvent_AttachmentIndex) == 0x00018C, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CustomEvent_AttachmentIndex' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000190, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000194, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CreateDelegate_OutputDelegate_9) == 0x000198, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x0001A8, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x0001AC, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CreateDelegate_OutputDelegate_10) == 0x0001B0, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_IsValid_ReturnValue_11) == 0x0001C0, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CustomEvent_CharaMoveFlag) == 0x0001C1, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CustomEvent_CharaMoveFlag' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_IsValid_ReturnValue_12) == 0x0001C2, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_IsValid_ReturnValue_13) == 0x0001C3, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CustomEvent_Path) == 0x0001C8, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CustomEvent_Path' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CustomEvent_argument_2) == 0x0001D8, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CustomEvent_argument_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CustomEvent_pWidget_2) == 0x0001E8, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CustomEvent_pWidget_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_Array_Length_ReturnValue) == 0x0001F0, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_SetChangeMainMenuTab_ReturnValue) == 0x0001F4, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_SetChangeMainMenuTab_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x0001F5, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x0001F8, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CreateDelegate_OutputDelegate_11) == 0x0001FC, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CustomEvent_argument_1) == 0x00020C, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CustomEvent_argument_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CustomEvent_pWidget_1) == 0x000218, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CustomEvent_pWidget_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x000220, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CreateDelegate_OutputDelegate_12) == 0x000224, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_Conv_ByteToInt_ReturnValue_8) == 0x000234, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_Conv_ByteToInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_MakeLiteralByte_ReturnValue_9) == 0x000238, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_MakeLiteralByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CustomEvent_argument) == 0x00023C, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CustomEvent_argument' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, K2Node_CustomEvent_pWidget) == 0x000248, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::K2Node_CustomEvent_pWidget' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_Conv_ByteToInt_ReturnValue_9) == 0x000250, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_Conv_ByteToInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, Temp_int_Loop_Num_Variable) == 0x000254, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_PlaySE_ReturnValue) == 0x000258, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_PlaySE_ReturnValue_1) == 0x000260, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_PlaySE_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents, CallFunc_PlaySE_ReturnValue_2) == 0x000268, "Member 'WB_ui_MainContents_C_ExecuteUbergraph_WB_ui_MainContents::CallFunc_PlaySE_ReturnValue_2' has a wrong offset!");
