#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_MissionStartEnd

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_ui_MissionStartEnd.WB_ui_MissionStartEnd_C.ExecuteUbergraph_WB_ui_MissionStartEnd
// 0x0028 (0x0028 - 0x0000)
struct WB_ui_MissionStartEnd_C_ExecuteUbergraph_WB_ui_MissionStartEnd final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTextBlock*>                     K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_MissionStartEnd_C_ExecuteUbergraph_WB_ui_MissionStartEnd) == 0x000008, "Wrong alignment on WB_ui_MissionStartEnd_C_ExecuteUbergraph_WB_ui_MissionStartEnd");
static_assert(sizeof(WB_ui_MissionStartEnd_C_ExecuteUbergraph_WB_ui_MissionStartEnd) == 0x000028, "Wrong size on WB_ui_MissionStartEnd_C_ExecuteUbergraph_WB_ui_MissionStartEnd");
static_assert(offsetof(WB_ui_MissionStartEnd_C_ExecuteUbergraph_WB_ui_MissionStartEnd, EntryPoint) == 0x000000, "Member 'WB_ui_MissionStartEnd_C_ExecuteUbergraph_WB_ui_MissionStartEnd::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionStartEnd_C_ExecuteUbergraph_WB_ui_MissionStartEnd, K2Node_Event_State) == 0x000004, "Member 'WB_ui_MissionStartEnd_C_ExecuteUbergraph_WB_ui_MissionStartEnd::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionStartEnd_C_ExecuteUbergraph_WB_ui_MissionStartEnd, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_MissionStartEnd_C_ExecuteUbergraph_WB_ui_MissionStartEnd::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionStartEnd_C_ExecuteUbergraph_WB_ui_MissionStartEnd, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_MissionStartEnd_C_ExecuteUbergraph_WB_ui_MissionStartEnd::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionStartEnd_C_ExecuteUbergraph_WB_ui_MissionStartEnd, K2Node_MakeArray_Array) == 0x000010, "Member 'WB_ui_MissionStartEnd_C_ExecuteUbergraph_WB_ui_MissionStartEnd::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionStartEnd_C_ExecuteUbergraph_WB_ui_MissionStartEnd, CallFunc_PlayAnimationTimeRange_ReturnValue) == 0x000020, "Member 'WB_ui_MissionStartEnd_C_ExecuteUbergraph_WB_ui_MissionStartEnd::CallFunc_PlayAnimationTimeRange_ReturnValue' has a wrong offset!");

// Function WB_ui_MissionStartEnd.WB_ui_MissionStartEnd_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_MissionStartEnd_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_MissionStartEnd_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_MissionStartEnd_C_UpdateState");
static_assert(sizeof(WB_ui_MissionStartEnd_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_MissionStartEnd_C_UpdateState");
static_assert(offsetof(WB_ui_MissionStartEnd_C_UpdateState, State) == 0x000000, "Member 'WB_ui_MissionStartEnd_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionStartEnd_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_MissionStartEnd_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionStartEnd_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_MissionStartEnd_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_MissionStartEnd.WB_ui_MissionStartEnd_C.MissionStartSoundTrigger
// 0x0028 (0x0028 - 0x0000)
struct WB_ui_MissionStartEnd_C_MissionStartSoundTrigger final
{
public:
	class URSGameInstance*                        CallFunc_GetRSGameInstance_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSSoundManager*                        CallFunc_GetSoundManager_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SoundTrigger_C>   K2Node_DynamicCast_AsBPI_Sound_Trigger;            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_MissionStartEnd_C_MissionStartSoundTrigger) == 0x000008, "Wrong alignment on WB_ui_MissionStartEnd_C_MissionStartSoundTrigger");
static_assert(sizeof(WB_ui_MissionStartEnd_C_MissionStartSoundTrigger) == 0x000028, "Wrong size on WB_ui_MissionStartEnd_C_MissionStartSoundTrigger");
static_assert(offsetof(WB_ui_MissionStartEnd_C_MissionStartSoundTrigger, CallFunc_GetRSGameInstance_ReturnValue) == 0x000000, "Member 'WB_ui_MissionStartEnd_C_MissionStartSoundTrigger::CallFunc_GetRSGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionStartEnd_C_MissionStartSoundTrigger, CallFunc_GetSoundManager_ReturnValue) == 0x000008, "Member 'WB_ui_MissionStartEnd_C_MissionStartSoundTrigger::CallFunc_GetSoundManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionStartEnd_C_MissionStartSoundTrigger, K2Node_DynamicCast_AsBPI_Sound_Trigger) == 0x000010, "Member 'WB_ui_MissionStartEnd_C_MissionStartSoundTrigger::K2Node_DynamicCast_AsBPI_Sound_Trigger' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionStartEnd_C_MissionStartSoundTrigger, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WB_ui_MissionStartEnd_C_MissionStartSoundTrigger::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WB_ui_MissionStartEnd.WB_ui_MissionStartEnd_C.MissionCompleteLogoSoundTrigger
// 0x0028 (0x0028 - 0x0000)
struct WB_ui_MissionStartEnd_C_MissionCompleteLogoSoundTrigger final
{
public:
	class URSGameInstance*                        CallFunc_GetRSGameInstance_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSSoundManager*                        CallFunc_GetSoundManager_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SoundTrigger_C>   K2Node_DynamicCast_AsBPI_Sound_Trigger;            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_MissionStartEnd_C_MissionCompleteLogoSoundTrigger) == 0x000008, "Wrong alignment on WB_ui_MissionStartEnd_C_MissionCompleteLogoSoundTrigger");
static_assert(sizeof(WB_ui_MissionStartEnd_C_MissionCompleteLogoSoundTrigger) == 0x000028, "Wrong size on WB_ui_MissionStartEnd_C_MissionCompleteLogoSoundTrigger");
static_assert(offsetof(WB_ui_MissionStartEnd_C_MissionCompleteLogoSoundTrigger, CallFunc_GetRSGameInstance_ReturnValue) == 0x000000, "Member 'WB_ui_MissionStartEnd_C_MissionCompleteLogoSoundTrigger::CallFunc_GetRSGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionStartEnd_C_MissionCompleteLogoSoundTrigger, CallFunc_GetSoundManager_ReturnValue) == 0x000008, "Member 'WB_ui_MissionStartEnd_C_MissionCompleteLogoSoundTrigger::CallFunc_GetSoundManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionStartEnd_C_MissionCompleteLogoSoundTrigger, K2Node_DynamicCast_AsBPI_Sound_Trigger) == 0x000010, "Member 'WB_ui_MissionStartEnd_C_MissionCompleteLogoSoundTrigger::K2Node_DynamicCast_AsBPI_Sound_Trigger' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionStartEnd_C_MissionCompleteLogoSoundTrigger, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WB_ui_MissionStartEnd_C_MissionCompleteLogoSoundTrigger::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WB_ui_MissionStartEnd.WB_ui_MissionStartEnd_C.MissionStartEndBarSoundTrigger
// 0x0028 (0x0028 - 0x0000)
struct WB_ui_MissionStartEnd_C_MissionStartEndBarSoundTrigger final
{
public:
	class URSGameInstance*                        CallFunc_GetRSGameInstance_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSSoundManager*                        CallFunc_GetSoundManager_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SoundTrigger_C>   K2Node_DynamicCast_AsBPI_Sound_Trigger;            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_MissionStartEnd_C_MissionStartEndBarSoundTrigger) == 0x000008, "Wrong alignment on WB_ui_MissionStartEnd_C_MissionStartEndBarSoundTrigger");
static_assert(sizeof(WB_ui_MissionStartEnd_C_MissionStartEndBarSoundTrigger) == 0x000028, "Wrong size on WB_ui_MissionStartEnd_C_MissionStartEndBarSoundTrigger");
static_assert(offsetof(WB_ui_MissionStartEnd_C_MissionStartEndBarSoundTrigger, CallFunc_GetRSGameInstance_ReturnValue) == 0x000000, "Member 'WB_ui_MissionStartEnd_C_MissionStartEndBarSoundTrigger::CallFunc_GetRSGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionStartEnd_C_MissionStartEndBarSoundTrigger, CallFunc_GetSoundManager_ReturnValue) == 0x000008, "Member 'WB_ui_MissionStartEnd_C_MissionStartEndBarSoundTrigger::CallFunc_GetSoundManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionStartEnd_C_MissionStartEndBarSoundTrigger, K2Node_DynamicCast_AsBPI_Sound_Trigger) == 0x000010, "Member 'WB_ui_MissionStartEnd_C_MissionStartEndBarSoundTrigger::K2Node_DynamicCast_AsBPI_Sound_Trigger' has a wrong offset!");
static_assert(offsetof(WB_ui_MissionStartEnd_C_MissionStartEndBarSoundTrigger, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WB_ui_MissionStartEnd_C_MissionStartEndBarSoundTrigger::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

