#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_ShopIteminfo_Parts_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_ShopIteminfo_Parts_1.WB_ui_ShopIteminfo_Parts_1_C
// 0x0088 (0x0480 - 0x03F8)
class UWB_ui_ShopIteminfo_Parts_1_C final : public UUIShopItemDetails
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default_notset;                                    // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_max;                                       // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                All_Color;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font;                                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_item;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_new;                                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_rarity;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Item_icon_frame_1;                                 // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_shop_iteminfo_1;                              // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_shop_iteminfo_2;                              // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_shop_iteminfo_3;                              // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_shop_iteminfo_4;                              // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_shop_iteminfo_1_num;                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_shop_iteminfo_2_num;                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_shop_iteminfo_slash_1;                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_ShopIteminfo_Parts_1(int32 EntryPoint);
	void Construct();
	void OnInitialized();
	void ClearItemInfo();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	bool SetItemInfo(const class FName& ItemId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_ShopIteminfo_Parts_1_C">();
	}
	static class UWB_ui_ShopIteminfo_Parts_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_ShopIteminfo_Parts_1_C>();
	}
};
static_assert(alignof(UWB_ui_ShopIteminfo_Parts_1_C) == 0x000008, "Wrong alignment on UWB_ui_ShopIteminfo_Parts_1_C");
static_assert(sizeof(UWB_ui_ShopIteminfo_Parts_1_C) == 0x000480, "Wrong size on UWB_ui_ShopIteminfo_Parts_1_C");
static_assert(offsetof(UWB_ui_ShopIteminfo_Parts_1_C, UberGraphFrame) == 0x0003F8, "Member 'UWB_ui_ShopIteminfo_Parts_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopIteminfo_Parts_1_C, Default_notset) == 0x000400, "Member 'UWB_ui_ShopIteminfo_Parts_1_C::Default_notset' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopIteminfo_Parts_1_C, Default_max) == 0x000408, "Member 'UWB_ui_ShopIteminfo_Parts_1_C::Default_max' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopIteminfo_Parts_1_C, Default) == 0x000410, "Member 'UWB_ui_ShopIteminfo_Parts_1_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopIteminfo_Parts_1_C, All_Color) == 0x000418, "Member 'UWB_ui_ShopIteminfo_Parts_1_C::All_Color' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopIteminfo_Parts_1_C, Icon_font) == 0x000420, "Member 'UWB_ui_ShopIteminfo_Parts_1_C::Icon_font' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopIteminfo_Parts_1_C, Icon_item) == 0x000428, "Member 'UWB_ui_ShopIteminfo_Parts_1_C::Icon_item' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopIteminfo_Parts_1_C, Icon_new) == 0x000430, "Member 'UWB_ui_ShopIteminfo_Parts_1_C::Icon_new' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopIteminfo_Parts_1_C, Icon_rarity) == 0x000438, "Member 'UWB_ui_ShopIteminfo_Parts_1_C::Icon_rarity' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopIteminfo_Parts_1_C, Item_icon_frame_1) == 0x000440, "Member 'UWB_ui_ShopIteminfo_Parts_1_C::Item_icon_frame_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopIteminfo_Parts_1_C, Text_shop_iteminfo_1) == 0x000448, "Member 'UWB_ui_ShopIteminfo_Parts_1_C::Text_shop_iteminfo_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopIteminfo_Parts_1_C, Text_shop_iteminfo_2) == 0x000450, "Member 'UWB_ui_ShopIteminfo_Parts_1_C::Text_shop_iteminfo_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopIteminfo_Parts_1_C, Text_shop_iteminfo_3) == 0x000458, "Member 'UWB_ui_ShopIteminfo_Parts_1_C::Text_shop_iteminfo_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopIteminfo_Parts_1_C, Text_shop_iteminfo_4) == 0x000460, "Member 'UWB_ui_ShopIteminfo_Parts_1_C::Text_shop_iteminfo_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopIteminfo_Parts_1_C, Text_shop_iteminfo_1_num) == 0x000468, "Member 'UWB_ui_ShopIteminfo_Parts_1_C::Text_shop_iteminfo_1_num' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopIteminfo_Parts_1_C, Text_shop_iteminfo_2_num) == 0x000470, "Member 'UWB_ui_ShopIteminfo_Parts_1_C::Text_shop_iteminfo_2_num' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopIteminfo_Parts_1_C, Text_shop_iteminfo_slash_1) == 0x000478, "Member 'UWB_ui_ShopIteminfo_Parts_1_C::Text_shop_iteminfo_slash_1' has a wrong offset!");

}

