#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Brightness

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Brightness.WB_ui_Brightness_C
// 0x00D8 (0x0500 - 0x0428)
class UWB_ui_Brightness_C final : public UUIConfigBrightness
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0428(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default_none;                                      // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base;                                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_L;                                            // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_R;                                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_L;                                           // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_R;                                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Gradation_1;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Gradation_Base;                                    // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Guage_1;                                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDOverlay*                            Guage_Set;                                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Mark_L;                                            // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Mark_R;                                            // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDHorizonFlipbookWidget*              PF_Arrow_L;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDHorizonFlipbookWidget*              PF_Arrow_R;                                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Slider_1;                                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Brightness_instruct_1;                        // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWB_ui_ShopContents_Parts_1_C*>  ChildBuySell;                                      // 0x04B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UWB_ui_ShopContents_Parts_6_C*>  ChildItemCategory;                                 // 0x04C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	class UPaperFlipbook*                         DefaultPF;                                         // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperFlipbook*                         SelectPF;                                          // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperFlipbook*                         SelectInPF;                                        // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperFlipbook*                         SelectOutPF;                                       // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperFlipbook*                         DecisionPF;                                        // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Brightness(int32 EntryPoint);
	void ApplyBrightness(float FValue);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Brightness_C">();
	}
	static class UWB_ui_Brightness_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Brightness_C>();
	}
};
static_assert(alignof(UWB_ui_Brightness_C) == 0x000008, "Wrong alignment on UWB_ui_Brightness_C");
static_assert(sizeof(UWB_ui_Brightness_C) == 0x000500, "Wrong size on UWB_ui_Brightness_C");
static_assert(offsetof(UWB_ui_Brightness_C, UberGraphFrame) == 0x000428, "Member 'UWB_ui_Brightness_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brightness_C, Default_none) == 0x000430, "Member 'UWB_ui_Brightness_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brightness_C, Default) == 0x000438, "Member 'UWB_ui_Brightness_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brightness_C, Base) == 0x000440, "Member 'UWB_ui_Brightness_C::Base' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brightness_C, Base_L) == 0x000448, "Member 'UWB_ui_Brightness_C::Base_L' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brightness_C, Base_R) == 0x000450, "Member 'UWB_ui_Brightness_C::Base_R' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brightness_C, Frame_L) == 0x000458, "Member 'UWB_ui_Brightness_C::Frame_L' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brightness_C, Frame_R) == 0x000460, "Member 'UWB_ui_Brightness_C::Frame_R' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brightness_C, Gradation_1) == 0x000468, "Member 'UWB_ui_Brightness_C::Gradation_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brightness_C, Gradation_Base) == 0x000470, "Member 'UWB_ui_Brightness_C::Gradation_Base' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brightness_C, Guage_1) == 0x000478, "Member 'UWB_ui_Brightness_C::Guage_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brightness_C, Guage_Set) == 0x000480, "Member 'UWB_ui_Brightness_C::Guage_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brightness_C, Mark_L) == 0x000488, "Member 'UWB_ui_Brightness_C::Mark_L' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brightness_C, Mark_R) == 0x000490, "Member 'UWB_ui_Brightness_C::Mark_R' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brightness_C, PF_Arrow_L) == 0x000498, "Member 'UWB_ui_Brightness_C::PF_Arrow_L' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brightness_C, PF_Arrow_R) == 0x0004A0, "Member 'UWB_ui_Brightness_C::PF_Arrow_R' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brightness_C, Slider_1) == 0x0004A8, "Member 'UWB_ui_Brightness_C::Slider_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brightness_C, Text_Brightness_instruct_1) == 0x0004B0, "Member 'UWB_ui_Brightness_C::Text_Brightness_instruct_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brightness_C, ChildBuySell) == 0x0004B8, "Member 'UWB_ui_Brightness_C::ChildBuySell' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brightness_C, ChildItemCategory) == 0x0004C8, "Member 'UWB_ui_Brightness_C::ChildItemCategory' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brightness_C, DefaultPF) == 0x0004D8, "Member 'UWB_ui_Brightness_C::DefaultPF' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brightness_C, SelectPF) == 0x0004E0, "Member 'UWB_ui_Brightness_C::SelectPF' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brightness_C, SelectInPF) == 0x0004E8, "Member 'UWB_ui_Brightness_C::SelectInPF' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brightness_C, SelectOutPF) == 0x0004F0, "Member 'UWB_ui_Brightness_C::SelectOutPF' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brightness_C, DecisionPF) == 0x0004F8, "Member 'UWB_ui_Brightness_C::DecisionPF' has a wrong offset!");

}

