#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Brain_bonus1

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_ui_Brain_bonus1.WB_ui_Brain_bonus1_C.ExecuteUbergraph_WB_ui_Brain_bonus1
// 0x003C (0x003C - 0x0000)
struct WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5726[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5727[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5728[0x1];                                     // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5729[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1) == 0x000004, "Wrong alignment on WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1");
static_assert(sizeof(WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1) == 0x00003C, "Wrong size on WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1");
static_assert(offsetof(WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1, EntryPoint) == 0x000000, "Member 'WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000011, "Member 'WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000018, "Member 'WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1, K2Node_Event_State) == 0x00001C, "Member 'WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1, K2Node_Event_SubState) == 0x000020, "Member 'WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1, K2Node_SwitchInteger_CmpSuccess) == 0x000028, "Member 'WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000029, "Member 'WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x00002A, "Member 'WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x00002C, "Member 'WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000030, "Member 'WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000034, "Member 'WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x000038, "Member 'WB_ui_Brain_bonus1_C_ExecuteUbergraph_WB_ui_Brain_bonus1::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");

// Function WB_ui_Brain_bonus1.WB_ui_Brain_bonus1_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Brain_bonus1_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brain_bonus1_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Brain_bonus1_C_UpdateState");
static_assert(sizeof(WB_ui_Brain_bonus1_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Brain_bonus1_C_UpdateState");
static_assert(offsetof(WB_ui_Brain_bonus1_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Brain_bonus1_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Brain_bonus1_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Brain_bonus1_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Brain_bonus1.WB_ui_Brain_bonus1_C.StateNone
// 0x000C (0x000C - 0x0000)
struct WB_ui_Brain_bonus1_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_572A[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brain_bonus1_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_Brain_bonus1_C_StateNone");
static_assert(sizeof(WB_ui_Brain_bonus1_C_StateNone) == 0x00000C, "Wrong size on WB_ui_Brain_bonus1_C_StateNone");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_Brain_bonus1_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_Brain_bonus1_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000005, "Member 'WB_ui_Brain_bonus1_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Brain_bonus1_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function WB_ui_Brain_bonus1.WB_ui_Brain_bonus1_C.StateOpen
// 0x0014 (0x0014 - 0x0000)
struct WB_ui_Brain_bonus1_C_StateOpen final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_572B[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Brain_bonus1_C_StateOpen) == 0x000004, "Wrong alignment on WB_ui_Brain_bonus1_C_StateOpen");
static_assert(sizeof(WB_ui_Brain_bonus1_C_StateOpen) == 0x000014, "Wrong size on WB_ui_Brain_bonus1_C_StateOpen");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateOpen, SubState) == 0x000000, "Member 'WB_ui_Brain_bonus1_C_StateOpen::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Brain_bonus1_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateOpen, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Brain_bonus1_C_StateOpen::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_Brain_bonus1_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Brain_bonus1_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Brain_bonus1_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateOpen, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000010, "Member 'WB_ui_Brain_bonus1_C_StateOpen::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");

// Function WB_ui_Brain_bonus1.WB_ui_Brain_bonus1_C.StateLoop
// 0x001C (0x001C - 0x0000)
struct WB_ui_Brain_bonus1_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_572C[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_572D[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_572E[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brain_bonus1_C_StateLoop) == 0x000004, "Wrong alignment on WB_ui_Brain_bonus1_C_StateLoop");
static_assert(sizeof(WB_ui_Brain_bonus1_C_StateLoop) == 0x00001C, "Wrong size on WB_ui_Brain_bonus1_C_StateLoop");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_Brain_bonus1_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Brain_bonus1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Brain_bonus1_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Brain_bonus1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateLoop, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x00000C, "Member 'WB_ui_Brain_bonus1_C_StateLoop::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00000D, "Member 'WB_ui_Brain_bonus1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000010, "Member 'WB_ui_Brain_bonus1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000014, "Member 'WB_ui_Brain_bonus1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000018, "Member 'WB_ui_Brain_bonus1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");

// Function WB_ui_Brain_bonus1.WB_ui_Brain_bonus1_C.StateClose
// 0x0014 (0x0014 - 0x0000)
struct WB_ui_Brain_bonus1_C_StateClose final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_572F[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Brain_bonus1_C_StateClose) == 0x000004, "Wrong alignment on WB_ui_Brain_bonus1_C_StateClose");
static_assert(sizeof(WB_ui_Brain_bonus1_C_StateClose) == 0x000014, "Wrong size on WB_ui_Brain_bonus1_C_StateClose");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateClose, SubState) == 0x000000, "Member 'WB_ui_Brain_bonus1_C_StateClose::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Brain_bonus1_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateClose, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Brain_bonus1_C_StateClose::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_Brain_bonus1_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Brain_bonus1_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Brain_bonus1_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_StateClose, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000010, "Member 'WB_ui_Brain_bonus1_C_StateClose::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");

// Function WB_ui_Brain_bonus1.WB_ui_Brain_bonus1_C.setBonus
// 0x0004 (0x0004 - 0x0000)
struct WB_ui_Brain_bonus1_C_SetBonus final
{
public:
	float                                         Param_bonus;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brain_bonus1_C_SetBonus) == 0x000004, "Wrong alignment on WB_ui_Brain_bonus1_C_SetBonus");
static_assert(sizeof(WB_ui_Brain_bonus1_C_SetBonus) == 0x000004, "Wrong size on WB_ui_Brain_bonus1_C_SetBonus");
static_assert(offsetof(WB_ui_Brain_bonus1_C_SetBonus, Param_bonus) == 0x000000, "Member 'WB_ui_Brain_bonus1_C_SetBonus::Param_bonus' has a wrong offset!");

// Function WB_ui_Brain_bonus1.WB_ui_Brain_bonus1_C.UpdateBonus
// 0x0048 (0x0048 - 0x0000)
struct WB_ui_Brain_bonus1_C_UpdateBonus final
{
public:
	int32                                         _Work;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0030(0x0018)()
};
static_assert(alignof(WB_ui_Brain_bonus1_C_UpdateBonus) == 0x000008, "Wrong alignment on WB_ui_Brain_bonus1_C_UpdateBonus");
static_assert(sizeof(WB_ui_Brain_bonus1_C_UpdateBonus) == 0x000048, "Wrong size on WB_ui_Brain_bonus1_C_UpdateBonus");
static_assert(offsetof(WB_ui_Brain_bonus1_C_UpdateBonus, _Work) == 0x000000, "Member 'WB_ui_Brain_bonus1_C_UpdateBonus::_Work' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_UpdateBonus, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'WB_ui_Brain_bonus1_C_UpdateBonus::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_UpdateBonus, CallFunc_Add_FloatFloat_ReturnValue) == 0x000008, "Member 'WB_ui_Brain_bonus1_C_UpdateBonus::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_UpdateBonus, CallFunc_FTrunc_ReturnValue) == 0x00000C, "Member 'WB_ui_Brain_bonus1_C_UpdateBonus::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_UpdateBonus, CallFunc_FTrunc_ReturnValue_1) == 0x000010, "Member 'WB_ui_Brain_bonus1_C_UpdateBonus::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_UpdateBonus, CallFunc_Percent_IntInt_ReturnValue) == 0x000014, "Member 'WB_ui_Brain_bonus1_C_UpdateBonus::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_UpdateBonus, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'WB_ui_Brain_bonus1_C_UpdateBonus::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_UpdateBonus, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000030, "Member 'WB_ui_Brain_bonus1_C_UpdateBonus::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");

// Function WB_ui_Brain_bonus1.WB_ui_Brain_bonus1_C.SetDefaultMessage
// 0x0060 (0x0060 - 0x0000)
struct WB_ui_Brain_bonus1_C_SetDefaultMessage final
{
public:
	class UDatabaseManager*                       _Manager;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
	class FString                                 CallFunc_GetText_ReturnValue_1;                    // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0040(0x0018)()
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brain_bonus1_C_SetDefaultMessage) == 0x000008, "Wrong alignment on WB_ui_Brain_bonus1_C_SetDefaultMessage");
static_assert(sizeof(WB_ui_Brain_bonus1_C_SetDefaultMessage) == 0x000060, "Wrong size on WB_ui_Brain_bonus1_C_SetDefaultMessage");
static_assert(offsetof(WB_ui_Brain_bonus1_C_SetDefaultMessage, _Manager) == 0x000000, "Member 'WB_ui_Brain_bonus1_C_SetDefaultMessage::_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_SetDefaultMessage, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'WB_ui_Brain_bonus1_C_SetDefaultMessage::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_bonus1_C_SetDefaultMessage, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WB_ui_Brain_bonus1_C_SetDefaultMessage::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
