#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_MiniMes

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_MiniMes.WB_ui_MiniMes_C.ExecuteUbergraph_WB_ui_MiniMes
// 0x0030 (0x0030 - 0x0000)
struct WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649C[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649D[0x1];                                     // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649E[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes) == 0x000004, "Wrong alignment on WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes");
static_assert(sizeof(WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes) == 0x000030, "Wrong size on WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes");
static_assert(offsetof(WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes, EntryPoint) == 0x000000, "Member 'WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes, K2Node_Event_State) == 0x000010, "Member 'WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes, K2Node_Event_SubState) == 0x000014, "Member 'WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes, K2Node_SwitchInteger_CmpSuccess) == 0x00001C, "Member 'WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00001D, "Member 'WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x00001E, "Member 'WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000020, "Member 'WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000024, "Member 'WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000028, "Member 'WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x00002C, "Member 'WB_ui_MiniMes_C_ExecuteUbergraph_WB_ui_MiniMes::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");

// Function WB_ui_MiniMes.WB_ui_MiniMes_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_MiniMes_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_MiniMes_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_MiniMes_C_UpdateState");
static_assert(sizeof(WB_ui_MiniMes_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_MiniMes_C_UpdateState");
static_assert(offsetof(WB_ui_MiniMes_C_UpdateState, State) == 0x000000, "Member 'WB_ui_MiniMes_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_MiniMes_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_MiniMes_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_MiniMes.WB_ui_MiniMes_C.StateNone
// 0x000C (0x000C - 0x0000)
struct WB_ui_MiniMes_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649F[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_MiniMes_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_MiniMes_C_StateNone");
static_assert(sizeof(WB_ui_MiniMes_C_StateNone) == 0x00000C, "Wrong size on WB_ui_MiniMes_C_StateNone");
static_assert(offsetof(WB_ui_MiniMes_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_MiniMes_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_MiniMes_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000005, "Member 'WB_ui_MiniMes_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_MiniMes_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function WB_ui_MiniMes.WB_ui_MiniMes_C.StateOpen
// 0x0020 (0x0020 - 0x0000)
struct WB_ui_MiniMes_C_StateOpen final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64A0[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MiniTipsSetString_DisplayHelpMenu;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64A1[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64A2[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_MiniMes_C_StateOpen) == 0x000008, "Wrong alignment on WB_ui_MiniMes_C_StateOpen");
static_assert(sizeof(WB_ui_MiniMes_C_StateOpen) == 0x000020, "Wrong size on WB_ui_MiniMes_C_StateOpen");
static_assert(offsetof(WB_ui_MiniMes_C_StateOpen, SubState) == 0x000000, "Member 'WB_ui_MiniMes_C_StateOpen::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_MiniMes_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateOpen, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_MiniMes_C_StateOpen::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_MiniMes_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateOpen, CallFunc_MiniTipsSetString_DisplayHelpMenu) == 0x00000C, "Member 'WB_ui_MiniMes_C_StateOpen::CallFunc_MiniTipsSetString_DisplayHelpMenu' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateOpen, CallFunc_PlaySE_ReturnValue) == 0x000010, "Member 'WB_ui_MiniMes_C_StateOpen::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000018, "Member 'WB_ui_MiniMes_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateOpen, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000019, "Member 'WB_ui_MiniMes_C_StateOpen::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00001C, "Member 'WB_ui_MiniMes_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_MiniMes.WB_ui_MiniMes_C.StateLoop
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_MiniMes_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64A3[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_MiniMes_C_StateLoop) == 0x000004, "Wrong alignment on WB_ui_MiniMes_C_StateLoop");
static_assert(sizeof(WB_ui_MiniMes_C_StateLoop) == 0x000010, "Wrong size on WB_ui_MiniMes_C_StateLoop");
static_assert(offsetof(WB_ui_MiniMes_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_MiniMes_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_MiniMes_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_MiniMes_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_MiniMes_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_MiniMes_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_MiniMes_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_MiniMes.WB_ui_MiniMes_C.StateClose
// 0x0028 (0x0028 - 0x0000)
struct WB_ui_MiniMes_C_StateClose final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64A4[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFadeAnimation_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFade_ReturnValue;                       // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64A5[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64A6[0x1];                                     // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_MiniMes_C_StateClose) == 0x000008, "Wrong alignment on WB_ui_MiniMes_C_StateClose");
static_assert(sizeof(WB_ui_MiniMes_C_StateClose) == 0x000028, "Wrong size on WB_ui_MiniMes_C_StateClose");
static_assert(offsetof(WB_ui_MiniMes_C_StateClose, SubState) == 0x000000, "Member 'WB_ui_MiniMes_C_StateClose::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_MiniMes_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateClose, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_MiniMes_C_StateClose::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateClose, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000008, "Member 'WB_ui_MiniMes_C_StateClose::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000010, "Member 'WB_ui_MiniMes_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateClose, CallFunc_IsFadeAnimation_ReturnValue) == 0x000014, "Member 'WB_ui_MiniMes_C_StateClose::CallFunc_IsFadeAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateClose, CallFunc_IsFade_ReturnValue) == 0x000015, "Member 'WB_ui_MiniMes_C_StateClose::CallFunc_IsFade_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateClose, CallFunc_PlaySE_ReturnValue) == 0x000018, "Member 'WB_ui_MiniMes_C_StateClose::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateClose, CallFunc_BooleanOR_ReturnValue) == 0x000020, "Member 'WB_ui_MiniMes_C_StateClose::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000021, "Member 'WB_ui_MiniMes_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateClose, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000022, "Member 'WB_ui_MiniMes_C_StateClose::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000024, "Member 'WB_ui_MiniMes_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_MiniMes.WB_ui_MiniMes_C.SetTipsIndex
// 0x0070 (0x0070 - 0x0000)
struct WB_ui_MiniMes_C_SetTipsIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64A7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_MiniMes_C_SetTipsIndex) == 0x000008, "Wrong alignment on WB_ui_MiniMes_C_SetTipsIndex");
static_assert(sizeof(WB_ui_MiniMes_C_SetTipsIndex) == 0x000070, "Wrong size on WB_ui_MiniMes_C_SetTipsIndex");
static_assert(offsetof(WB_ui_MiniMes_C_SetTipsIndex, Param_Index) == 0x000000, "Member 'WB_ui_MiniMes_C_SetTipsIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_SetTipsIndex, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WB_ui_MiniMes_C_SetTipsIndex::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_SetTipsIndex, CallFunc_GetDataBaseManager_Manager) == 0x000020, "Member 'WB_ui_MiniMes_C_SetTipsIndex::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_SetTipsIndex, CallFunc_Conv_TextToString_ReturnValue) == 0x000028, "Member 'WB_ui_MiniMes_C_SetTipsIndex::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_SetTipsIndex, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'WB_ui_MiniMes_C_SetTipsIndex::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_SetTipsIndex, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000048, "Member 'WB_ui_MiniMes_C_SetTipsIndex::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_SetTipsIndex, CallFunc_Conv_StringToName_ReturnValue) == 0x000058, "Member 'WB_ui_MiniMes_C_SetTipsIndex::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_SetTipsIndex, CallFunc_GetText_ReturnValue) == 0x000060, "Member 'WB_ui_MiniMes_C_SetTipsIndex::CallFunc_GetText_ReturnValue' has a wrong offset!");

// Function WB_ui_MiniMes.WB_ui_MiniMes_C.SetTipsTitle
// 0x0030 (0x0030 - 0x0000)
struct WB_ui_MiniMes_C_SetTipsTitle final
{
public:
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
};
static_assert(alignof(WB_ui_MiniMes_C_SetTipsTitle) == 0x000008, "Wrong alignment on WB_ui_MiniMes_C_SetTipsTitle");
static_assert(sizeof(WB_ui_MiniMes_C_SetTipsTitle) == 0x000030, "Wrong size on WB_ui_MiniMes_C_SetTipsTitle");
static_assert(offsetof(WB_ui_MiniMes_C_SetTipsTitle, CallFunc_GetDataBaseManager_Manager) == 0x000000, "Member 'WB_ui_MiniMes_C_SetTipsTitle::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_SetTipsTitle, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'WB_ui_MiniMes_C_SetTipsTitle::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_SetTipsTitle, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WB_ui_MiniMes_C_SetTipsTitle::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WB_ui_MiniMes.WB_ui_MiniMes_C.SetTipsID
// 0x0002 (0x0002 - 0x0000)
struct WB_ui_MiniMes_C_SetTipsID final
{
public:
	EHelpTutorial                                 ID;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MiniTipsSetString_DisplayHelpMenu;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_MiniMes_C_SetTipsID) == 0x000001, "Wrong alignment on WB_ui_MiniMes_C_SetTipsID");
static_assert(sizeof(WB_ui_MiniMes_C_SetTipsID) == 0x000002, "Wrong size on WB_ui_MiniMes_C_SetTipsID");
static_assert(offsetof(WB_ui_MiniMes_C_SetTipsID, ID) == 0x000000, "Member 'WB_ui_MiniMes_C_SetTipsID::ID' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_SetTipsID, CallFunc_MiniTipsSetString_DisplayHelpMenu) == 0x000001, "Member 'WB_ui_MiniMes_C_SetTipsID::CallFunc_MiniTipsSetString_DisplayHelpMenu' has a wrong offset!");

// Function WB_ui_MiniMes.WB_ui_MiniMes_C.UpdateSpacer
// 0x0020 (0x0020 - 0x0000)
struct WB_ui_MiniMes_C_UpdateSpacer final
{
public:
	struct FVector4                               CallFunc_getTextRect_rect;                         // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_MiniMes_C_UpdateSpacer) == 0x000010, "Wrong alignment on WB_ui_MiniMes_C_UpdateSpacer");
static_assert(sizeof(WB_ui_MiniMes_C_UpdateSpacer) == 0x000020, "Wrong size on WB_ui_MiniMes_C_UpdateSpacer");
static_assert(offsetof(WB_ui_MiniMes_C_UpdateSpacer, CallFunc_getTextRect_rect) == 0x000000, "Member 'WB_ui_MiniMes_C_UpdateSpacer::CallFunc_getTextRect_rect' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_UpdateSpacer, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'WB_ui_MiniMes_C_UpdateSpacer::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_UpdateSpacer, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000014, "Member 'WB_ui_MiniMes_C_UpdateSpacer::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_UpdateSpacer, CallFunc_MakeVector2D_ReturnValue) == 0x000018, "Member 'WB_ui_MiniMes_C_UpdateSpacer::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WB_ui_MiniMes.WB_ui_MiniMes_C.MiniTipsSetString
// 0x00A0 (0x00A0 - 0x0000)
struct WB_ui_MiniMes_C_MiniTipsSetString final
{
public:
	EHelpTutorial                                 Key;                                               // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisplayHelpMenu;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64A8[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHelpTutorialData*                      CallFunc_GetHelpTutorialData_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EHelpTutorial, struct FMiniHelpRowDataCell> CallFunc_GetMiniHelpDataAsset_returnMiniHelpMap;   // 0x0018(0x0050)()
	struct FMiniHelpRowDataCell                   CallFunc_Map_Find_Value;                           // 0x0068(0x0020)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64A9[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_MiniMes_C_MiniTipsSetString) == 0x000008, "Wrong alignment on WB_ui_MiniMes_C_MiniTipsSetString");
static_assert(sizeof(WB_ui_MiniMes_C_MiniTipsSetString) == 0x0000A0, "Wrong size on WB_ui_MiniMes_C_MiniTipsSetString");
static_assert(offsetof(WB_ui_MiniMes_C_MiniTipsSetString, Key) == 0x000000, "Member 'WB_ui_MiniMes_C_MiniTipsSetString::Key' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_MiniTipsSetString, DisplayHelpMenu) == 0x000001, "Member 'WB_ui_MiniMes_C_MiniTipsSetString::DisplayHelpMenu' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_MiniTipsSetString, CallFunc_GetDataBaseManager_Manager) == 0x000008, "Member 'WB_ui_MiniMes_C_MiniTipsSetString::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_MiniTipsSetString, CallFunc_GetHelpTutorialData_ReturnValue) == 0x000010, "Member 'WB_ui_MiniMes_C_MiniTipsSetString::CallFunc_GetHelpTutorialData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_MiniTipsSetString, CallFunc_GetMiniHelpDataAsset_returnMiniHelpMap) == 0x000018, "Member 'WB_ui_MiniMes_C_MiniTipsSetString::CallFunc_GetMiniHelpDataAsset_returnMiniHelpMap' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_MiniTipsSetString, CallFunc_Map_Find_Value) == 0x000068, "Member 'WB_ui_MiniMes_C_MiniTipsSetString::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_MiniTipsSetString, CallFunc_Map_Find_ReturnValue) == 0x000088, "Member 'WB_ui_MiniMes_C_MiniTipsSetString::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_MiniTipsSetString, CallFunc_GetText_ReturnValue) == 0x000090, "Member 'WB_ui_MiniMes_C_MiniTipsSetString::CallFunc_GetText_ReturnValue' has a wrong offset!");

// Function WB_ui_MiniMes.WB_ui_MiniMes_C.SetupTextSize
// 0x0020 (0x0020 - 0x0000)
struct WB_ui_MiniMes_C_SetupTextSize final
{
public:
	class URSGameInstance*                        CallFunc_GetRSGameInstance_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveLoadParamClassManager*             CallFunc_GetSaveLoadParamClassManager_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveLoadExSystemParamManager*          CallFunc_GetSaveLoadExSystemParamManager_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELetterSize                                   CallFunc_GetLetterSize_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_MiniMes_C_SetupTextSize) == 0x000008, "Wrong alignment on WB_ui_MiniMes_C_SetupTextSize");
static_assert(sizeof(WB_ui_MiniMes_C_SetupTextSize) == 0x000020, "Wrong size on WB_ui_MiniMes_C_SetupTextSize");
static_assert(offsetof(WB_ui_MiniMes_C_SetupTextSize, CallFunc_GetRSGameInstance_ReturnValue) == 0x000000, "Member 'WB_ui_MiniMes_C_SetupTextSize::CallFunc_GetRSGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_SetupTextSize, CallFunc_GetSaveLoadParamClassManager_ReturnValue) == 0x000008, "Member 'WB_ui_MiniMes_C_SetupTextSize::CallFunc_GetSaveLoadParamClassManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MiniMes_C_SetupTextSize, CallFunc_GetSaveLoadExSystemParamManager_ReturnValue) == 0x000010, "Member 'WB_ui_MiniMes_C_SetupTextSize::CallFunc_GetSaveLoadExSystemParamManager_ReturnValue' has a wrong offset!");
