#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Sas_menu_control

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Sas_menu_control.WB_ui_Sas_menu_control_C.ExecuteUbergraph_WB_ui_Sas_menu_control
// 0x0068 (0x0068 - 0x0000)
struct WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98DD[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98DE[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98DF[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98E0[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98E1[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_8;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98E2[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_9;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_10;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98E3[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_10;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isChangedIconDeviceType_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_11;           // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98E4[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_11;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control) == 0x000008, "Wrong alignment on WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control");
static_assert(sizeof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control) == 0x000068, "Wrong size on WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, EntryPoint) == 0x000000, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000011, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000018, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, K2Node_Event_State) == 0x00001C, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, K2Node_Event_SubState) == 0x000020, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, K2Node_SwitchInteger_CmpSuccess) == 0x000028, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000029, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x00002C, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000030, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000031, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000034, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x000038, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x00003C, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x00003D, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x000040, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_Conv_ByteToInt_ReturnValue_8) == 0x000044, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_Conv_ByteToInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_MakeLiteralByte_ReturnValue_9) == 0x000048, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_MakeLiteralByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_Conv_ByteToInt_ReturnValue_9) == 0x00004C, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_Conv_ByteToInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_MakeLiteralByte_ReturnValue_10) == 0x000050, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_MakeLiteralByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_Conv_ByteToInt_ReturnValue_10) == 0x000054, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_Conv_ByteToInt_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000058, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_isChangedIconDeviceType_ReturnValue) == 0x000060, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_isChangedIconDeviceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_MakeLiteralByte_ReturnValue_11) == 0x000061, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_MakeLiteralByte_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control, CallFunc_Conv_ByteToInt_ReturnValue_11) == 0x000064, "Member 'WB_ui_Sas_menu_control_C_ExecuteUbergraph_WB_ui_Sas_menu_control::CallFunc_Conv_ByteToInt_ReturnValue_11' has a wrong offset!");

// Function WB_ui_Sas_menu_control.WB_ui_Sas_menu_control_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Sas_menu_control_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Sas_menu_control_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Sas_menu_control_C_UpdateState");
static_assert(sizeof(WB_ui_Sas_menu_control_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Sas_menu_control_C_UpdateState");
static_assert(offsetof(WB_ui_Sas_menu_control_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Sas_menu_control_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Sas_menu_control_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Sas_menu_control_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Sas_menu_control.WB_ui_Sas_menu_control_C.StateNone
// 0x0048 (0x0048 - 0x0000)
struct WB_ui_Sas_menu_control_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98E5[0x1];                                     // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_98E6[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_IsPlaying;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DebugIsPlay_IsPlay;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98E7[0x1];                                     // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98E8[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_98E9[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Sas_menu_control_C_StateNone) == 0x000008, "Wrong alignment on WB_ui_Sas_menu_control_C_StateNone");
static_assert(sizeof(WB_ui_Sas_menu_control_C_StateNone) == 0x000048, "Wrong size on WB_ui_Sas_menu_control_C_StateNone");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_Sas_menu_control_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateNone, Temp_int_Loop_Num_Variable) == 0x000004, "Member 'WB_ui_Sas_menu_control_C_StateNone::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000008, "Member 'WB_ui_Sas_menu_control_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000009, "Member 'WB_ui_Sas_menu_control_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00000A, "Member 'WB_ui_Sas_menu_control_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00000C, "Member 'WB_ui_Sas_menu_control_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000010, "Member 'WB_ui_Sas_menu_control_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateNone, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WB_ui_Sas_menu_control_C_StateNone::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateNone, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WB_ui_Sas_menu_control_C_StateNone::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateNone, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WB_ui_Sas_menu_control_C_StateNone::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateNone, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WB_ui_Sas_menu_control_C_StateNone::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateNone, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'WB_ui_Sas_menu_control_C_StateNone::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateNone, CallFunc_IsPlaying_IsPlaying) == 0x000028, "Member 'WB_ui_Sas_menu_control_C_StateNone::CallFunc_IsPlaying_IsPlaying' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateNone, CallFunc_DebugIsPlay_IsPlay) == 0x000029, "Member 'WB_ui_Sas_menu_control_C_StateNone::CallFunc_DebugIsPlay_IsPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00002A, "Member 'WB_ui_Sas_menu_control_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateNone, Temp_int_Variable) == 0x00002C, "Member 'WB_ui_Sas_menu_control_C_StateNone::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000030, "Member 'WB_ui_Sas_menu_control_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateNone, CallFunc_Array_Get_Item) == 0x000038, "Member 'WB_ui_Sas_menu_control_C_StateNone::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateNone, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000040, "Member 'WB_ui_Sas_menu_control_C_StateNone::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateNone, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'WB_ui_Sas_menu_control_C_StateNone::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_Sas_menu_control.WB_ui_Sas_menu_control_C.StateOpen
// 0x002C (0x002C - 0x0000)
struct WB_ui_Sas_menu_control_C_StateOpen final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98EA[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_98EB[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_98EC[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Sas_menu_control_C_StateOpen) == 0x000004, "Wrong alignment on WB_ui_Sas_menu_control_C_StateOpen");
static_assert(sizeof(WB_ui_Sas_menu_control_C_StateOpen) == 0x00002C, "Wrong size on WB_ui_Sas_menu_control_C_StateOpen");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateOpen, SubState) == 0x000000, "Member 'WB_ui_Sas_menu_control_C_StateOpen::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateOpen, Temp_int_Loop_Num_Variable) == 0x000004, "Member 'WB_ui_Sas_menu_control_C_StateOpen::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateOpen, K2Node_SwitchInteger_CmpSuccess) == 0x000008, "Member 'WB_ui_Sas_menu_control_C_StateOpen::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue) == 0x000009, "Member 'WB_ui_Sas_menu_control_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateOpen, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WB_ui_Sas_menu_control_C_StateOpen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000010, "Member 'WB_ui_Sas_menu_control_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateOpen, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000014, "Member 'WB_ui_Sas_menu_control_C_StateOpen::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateOpen, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WB_ui_Sas_menu_control_C_StateOpen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00001C, "Member 'WB_ui_Sas_menu_control_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateOpen, CallFunc_Less_IntInt_ReturnValue) == 0x00001D, "Member 'WB_ui_Sas_menu_control_C_StateOpen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000020, "Member 'WB_ui_Sas_menu_control_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateOpen, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WB_ui_Sas_menu_control_C_StateOpen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateOpen, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WB_ui_Sas_menu_control_C_StateOpen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function WB_ui_Sas_menu_control.WB_ui_Sas_menu_control_C.StateLoop
// 0x00C0 (0x00C0 - 0x0000)
struct WB_ui_Sas_menu_control_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _WorkSubState;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98ED[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DebugIsPlay_IsPlay;                       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98EE[0x1];                                     // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SoundManager_C*                     CallFunc_GetSoundManager_SoundManager;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_98EF[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0034(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98F0[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SoundManager_C*                     CallFunc_GetSoundManager_SoundManager_1;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_98F1[0x1];                                     // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98F2[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98F3[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SoundManager_C*                     CallFunc_GetSoundManager_SoundManager_2;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98F4[0x2];                                     // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_1;        // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_98F5[0x2];                                     // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_98F6[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_98F7[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DebugIsPlay_IsPlay_1;                     // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_2;        // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_98F8[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x00A4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_3;        // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_98F9[0x2];                                     // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00B0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98FA[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Sas_menu_control_C_StateLoop) == 0x000008, "Wrong alignment on WB_ui_Sas_menu_control_C_StateLoop");
static_assert(sizeof(WB_ui_Sas_menu_control_C_StateLoop) == 0x0000C0, "Wrong size on WB_ui_Sas_menu_control_C_StateLoop");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_Sas_menu_control_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, _WorkSubState) == 0x000004, "Member 'WB_ui_Sas_menu_control_C_StateLoop::_WorkSubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue) == 0x000008, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00000C, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_Not_PreBool_ReturnValue) == 0x000014, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000015, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000016, "Member 'WB_ui_Sas_menu_control_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000017, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, K2Node_SwitchInteger_CmpSuccess_1) == 0x000018, "Member 'WB_ui_Sas_menu_control_C_StateLoop::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_DebugIsPlay_IsPlay) == 0x000019, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_DebugIsPlay_IsPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00001A, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00001C, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WB_ui_Sas_menu_control_C_StateLoop::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_GetSoundManager_SoundManager) == 0x000028, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_GetSoundManager_SoundManager' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, Temp_int_Variable) == 0x000034, "Member 'WB_ui_Sas_menu_control_C_StateLoop::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_Array_Length_ReturnValue_1) == 0x000038, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_GetSoundManager_SoundManager_1) == 0x000040, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_GetSoundManager_SoundManager_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000049, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_BooleanOR_ReturnValue) == 0x00004A, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x00004C, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000050, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000051, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000054, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000058, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x00005C, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, Temp_int_Array_Index_Variable) == 0x000060, "Member 'WB_ui_Sas_menu_control_C_StateLoop::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, Temp_int_Array_Index_Variable_1) == 0x000064, "Member 'WB_ui_Sas_menu_control_C_StateLoop::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_GetSoundManager_SoundManager_2) == 0x000068, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_GetSoundManager_SoundManager_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_IsValid_ReturnValue_2) == 0x000070, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000071, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000074, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_Array_Length_ReturnValue_2) == 0x000078, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_IsPlayUICurrentAnimation_isPlay_1) == 0x00007D, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_IsPlayUICurrentAnimation_isPlay_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, Temp_int_Loop_Counter_Variable_1) == 0x000080, "Member 'WB_ui_Sas_menu_control_C_StateLoop::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_Less_IntInt_ReturnValue_1) == 0x000084, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_Add_IntInt_ReturnValue_1) == 0x000088, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, Temp_int_Loop_Counter_Variable_2) == 0x00008C, "Member 'WB_ui_Sas_menu_control_C_StateLoop::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, Temp_int_Array_Index_Variable_2) == 0x000090, "Member 'WB_ui_Sas_menu_control_C_StateLoop::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_Less_IntInt_ReturnValue_2) == 0x000094, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_Add_IntInt_ReturnValue_2) == 0x000098, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_BooleanOR_ReturnValue_1) == 0x00009C, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_BooleanOR_ReturnValue_2) == 0x00009D, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_DebugIsPlay_IsPlay_1) == 0x00009E, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_DebugIsPlay_IsPlay_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_BooleanAND_ReturnValue) == 0x00009F, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_IsPlayUICurrentAnimation_isPlay_2) == 0x0000A0, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_IsPlayUICurrentAnimation_isPlay_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, Temp_int_Variable_1) == 0x0000A4, "Member 'WB_ui_Sas_menu_control_C_StateLoop::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x0000A8, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_IsPlayUICurrentAnimation_isPlay_3) == 0x0000A9, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_IsPlayUICurrentAnimation_isPlay_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x0000AC, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, Temp_int_Variable_2) == 0x0000B0, "Member 'WB_ui_Sas_menu_control_C_StateLoop::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x0000B4, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_menu_control_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x0000B8, "Member 'WB_ui_Sas_menu_control_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");

// Function WB_ui_Sas_menu_control.WB_ui_Sas_menu_control_C.StateClose
// 0x0070 (0x0070 - 0x0000)
struct WB_ui_Sas_menu_control_C_StateClose final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _FlagEnd;                                          // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_98FB[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_98FC[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
