#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Wish

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Wish.WB_ui_Wish_C.ExecuteUbergraph_WB_ui_Wish
// 0x0128 (0x0128 - 0x0000)
struct WB_ui_Wish_C_ExecuteUbergraph_WB_ui_Wish final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0010(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0098(0x0088)()
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue;              // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Wish_C_ExecuteUbergraph_WB_ui_Wish) == 0x000008, "Wrong alignment on WB_ui_Wish_C_ExecuteUbergraph_WB_ui_Wish");
static_assert(sizeof(WB_ui_Wish_C_ExecuteUbergraph_WB_ui_Wish) == 0x000128, "Wrong size on WB_ui_Wish_C_ExecuteUbergraph_WB_ui_Wish");
static_assert(offsetof(WB_ui_Wish_C_ExecuteUbergraph_WB_ui_Wish, EntryPoint) == 0x000000, "Member 'WB_ui_Wish_C_ExecuteUbergraph_WB_ui_Wish::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Wish_C_ExecuteUbergraph_WB_ui_Wish, K2Node_Event_State) == 0x000004, "Member 'WB_ui_Wish_C_ExecuteUbergraph_WB_ui_Wish::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Wish_C_ExecuteUbergraph_WB_ui_Wish, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_Wish_C_ExecuteUbergraph_WB_ui_Wish::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Wish_C_ExecuteUbergraph_WB_ui_Wish, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_Wish_C_ExecuteUbergraph_WB_ui_Wish::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Wish_C_ExecuteUbergraph_WB_ui_Wish, K2Node_MakeStruct_SlateBrush) == 0x000010, "Member 'WB_ui_Wish_C_ExecuteUbergraph_WB_ui_Wish::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WB_ui_Wish_C_ExecuteUbergraph_WB_ui_Wish, K2Node_MakeStruct_SlateBrush_1) == 0x000098, "Member 'WB_ui_Wish_C_ExecuteUbergraph_WB_ui_Wish::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Wish_C_ExecuteUbergraph_WB_ui_Wish, CallFunc_GetPlatformType_ReturnValue) == 0x000120, "Member 'WB_ui_Wish_C_ExecuteUbergraph_WB_ui_Wish::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Wish_C_ExecuteUbergraph_WB_ui_Wish, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000121, "Member 'WB_ui_Wish_C_ExecuteUbergraph_WB_ui_Wish::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WB_ui_Wish.WB_ui_Wish_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Wish_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Wish_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Wish_C_UpdateState");
static_assert(sizeof(WB_ui_Wish_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Wish_C_UpdateState");
static_assert(offsetof(WB_ui_Wish_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Wish_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Wish_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Wish_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Wish_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Wish_C_UpdateState::DeltaSeconds' has a wrong offset!");

}

