#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_BrainMap_Info_Parts_3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_BrainMap_Info_Parts_3.WB_ui_BrainMap_Info_Parts_3_C
// 0x0060 (0x03E8 - 0x0388)
class UWB_ui_BrainMap_Info_Parts_3_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default_none;                                      // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_3;                                         // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_2;                                         // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_1;                                         // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Ghost_BrainMap_OutlineColor1;                      // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Bmap_info_1_num;                              // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Bmap_info_2_num;                              // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Bmap_info_Complete;                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Bmap_info_skill_3;                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Bmap_info_slash_1;                            // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          FlagAlreadyLearn;                                  // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          FlagEnableLearn;                                   // 0x03E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_ui_BrainMap_Info_Parts_3(int32 EntryPoint);
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void UpdateBrainMapFontOutlineMaterial();
	void SetBP(int32 BpCurrent, int32 BpSkill);
	void SetBaseText();
	void SetAlreadyLearn(bool IsAlreadyLearn);
	void SetEnableLearn(bool IsEnableLearn);
	void StateNone(int32 SubState);
	void StateLoop(int32 SubState);
	void SetCurrentAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_BrainMap_Info_Parts_3_C">();
	}
	static class UWB_ui_BrainMap_Info_Parts_3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_BrainMap_Info_Parts_3_C>();
	}
};
static_assert(alignof(UWB_ui_BrainMap_Info_Parts_3_C) == 0x000008, "Wrong alignment on UWB_ui_BrainMap_Info_Parts_3_C");
static_assert(sizeof(UWB_ui_BrainMap_Info_Parts_3_C) == 0x0003E8, "Wrong size on UWB_ui_BrainMap_Info_Parts_3_C");
static_assert(offsetof(UWB_ui_BrainMap_Info_Parts_3_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_BrainMap_Info_Parts_3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_Info_Parts_3_C, Default_none) == 0x000390, "Member 'UWB_ui_BrainMap_Info_Parts_3_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_Info_Parts_3_C, Default_3) == 0x000398, "Member 'UWB_ui_BrainMap_Info_Parts_3_C::Default_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_Info_Parts_3_C, Default_2) == 0x0003A0, "Member 'UWB_ui_BrainMap_Info_Parts_3_C::Default_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_Info_Parts_3_C, Default_1) == 0x0003A8, "Member 'UWB_ui_BrainMap_Info_Parts_3_C::Default_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_Info_Parts_3_C, Ghost_BrainMap_OutlineColor1) == 0x0003B0, "Member 'UWB_ui_BrainMap_Info_Parts_3_C::Ghost_BrainMap_OutlineColor1' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_Info_Parts_3_C, Text_Bmap_info_1_num) == 0x0003B8, "Member 'UWB_ui_BrainMap_Info_Parts_3_C::Text_Bmap_info_1_num' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_Info_Parts_3_C, Text_Bmap_info_2_num) == 0x0003C0, "Member 'UWB_ui_BrainMap_Info_Parts_3_C::Text_Bmap_info_2_num' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_Info_Parts_3_C, Text_Bmap_info_Complete) == 0x0003C8, "Member 'UWB_ui_BrainMap_Info_Parts_3_C::Text_Bmap_info_Complete' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_Info_Parts_3_C, Text_Bmap_info_skill_3) == 0x0003D0, "Member 'UWB_ui_BrainMap_Info_Parts_3_C::Text_Bmap_info_skill_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_Info_Parts_3_C, Text_Bmap_info_slash_1) == 0x0003D8, "Member 'UWB_ui_BrainMap_Info_Parts_3_C::Text_Bmap_info_slash_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_Info_Parts_3_C, FlagAlreadyLearn) == 0x0003E0, "Member 'UWB_ui_BrainMap_Info_Parts_3_C::FlagAlreadyLearn' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_Info_Parts_3_C, FlagEnableLearn) == 0x0003E1, "Member 'UWB_ui_BrainMap_Info_Parts_3_C::FlagEnableLearn' has a wrong offset!");

}

