#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Brain_bonus1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Brain_bonus1.WB_ui_Brain_bonus1_C
// 0x0078 (0x0400 - 0x0388)
class UWB_ui_Brain_bonus1_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Decision;                                          // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 base1;                                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 base2;                                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 base3;                                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Set;                                               // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_drive_bonus_1;                                // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_drive_bonus_dot;                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_drive_bonus_num1;                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_drive_bonus_num2;                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          FlagUpdate;                                        // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5725[0x3];                                     // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bonus;                                             // 0x03FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Brain_bonus1(int32 EntryPoint);
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void StateNone(int32 SubState);
	void StateOpen(int32 SubState);
	void StateLoop(int32 SubState);
	void StateClose(int32 SubState);
	void SetBonus(float Param_bonus);
	void UpdateBonus();
	void SetDefaultMessage();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Brain_bonus1_C">();
	}
	static class UWB_ui_Brain_bonus1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Brain_bonus1_C>();
	}
};
static_assert(alignof(UWB_ui_Brain_bonus1_C) == 0x000008, "Wrong alignment on UWB_ui_Brain_bonus1_C");
static_assert(sizeof(UWB_ui_Brain_bonus1_C) == 0x000400, "Wrong size on UWB_ui_Brain_bonus1_C");
static_assert(offsetof(UWB_ui_Brain_bonus1_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_Brain_bonus1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_bonus1_C, Decision) == 0x000390, "Member 'UWB_ui_Brain_bonus1_C::Decision' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_bonus1_C, Out) == 0x000398, "Member 'UWB_ui_Brain_bonus1_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_bonus1_C, In) == 0x0003A0, "Member 'UWB_ui_Brain_bonus1_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_bonus1_C, Default_none) == 0x0003A8, "Member 'UWB_ui_Brain_bonus1_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_bonus1_C, Default) == 0x0003B0, "Member 'UWB_ui_Brain_bonus1_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_bonus1_C, base1) == 0x0003B8, "Member 'UWB_ui_Brain_bonus1_C::base1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_bonus1_C, base2) == 0x0003C0, "Member 'UWB_ui_Brain_bonus1_C::base2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_bonus1_C, base3) == 0x0003C8, "Member 'UWB_ui_Brain_bonus1_C::base3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_bonus1_C, Set) == 0x0003D0, "Member 'UWB_ui_Brain_bonus1_C::Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_bonus1_C, Text_drive_bonus_1) == 0x0003D8, "Member 'UWB_ui_Brain_bonus1_C::Text_drive_bonus_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_bonus1_C, Text_drive_bonus_dot) == 0x0003E0, "Member 'UWB_ui_Brain_bonus1_C::Text_drive_bonus_dot' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_bonus1_C, Text_drive_bonus_num1) == 0x0003E8, "Member 'UWB_ui_Brain_bonus1_C::Text_drive_bonus_num1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_bonus1_C, Text_drive_bonus_num2) == 0x0003F0, "Member 'UWB_ui_Brain_bonus1_C::Text_drive_bonus_num2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_bonus1_C, FlagUpdate) == 0x0003F8, "Member 'UWB_ui_Brain_bonus1_C::FlagUpdate' has a wrong offset!");
static_assert(offsetof(UWB_ui_Brain_bonus1_C, bonus) == 0x0003FC, "Member 'UWB_ui_Brain_bonus1_C::bonus' has a wrong offset!");

}

