#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Quest_Achievement_Parts_1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Quest_Achievement_Parts_1.WB_ui_Quest_Achievement_Parts_1_C.ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1
// 0x0148 (0x0148 - 0x0000)
struct WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EClearGetterType Value)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UImage*                                 K2Node_Event_imageRarity;                          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemRarity                                   K2Node_Event_rarity;                               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8976[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_UI_GetArrayColor_Shop_Frame_1_UI_ColorArray_Shop_Frame_1; // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 IsMouseScroll, int32 Cursor, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_8977[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 IsMouseScroll, int32 Cursor, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class UImage*                                 K2Node_Event_imageCategory;                        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemIcon                                     K2Node_Event_category;                             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8978[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue;              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8979[0x2];                                     // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUserWidget* PWidget)>   K2Node_CreateDelegate_OutputDelegate_3;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_897A[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_eventBPFilePath;                      // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_SpawnActorFromBPFilePath_ReturnValue;     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MakeEventActorBase_C*               K2Node_DynamicCast_AsBP_Make_Event_Actor_Base;     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_897B[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_index_2;                              // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget_4;                             // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget_3;                             // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget_2;                             // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_isMouseScroll_1;                      // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index_1;                              // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget_1;                             // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_isMouseScroll;                        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget;                               // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* PWidget)>   K2Node_CreateDelegate_OutputDelegate_4;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 Index, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_Event_exp;                                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_897C[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddExp_OutMainPlayerExp;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EClearGetterType                              K2Node_Event_Type;                                 // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_897D[0x3];                                     // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance;         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClearGetterManager*                    CallFunc_GetClearGetterManager_ReturnValue;        // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance_1;       // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClearGetterManager*                    CallFunc_GetClearGetterManager_ReturnValue_1;      // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1) == 0x000008, "Wrong alignment on WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1");
static_assert(sizeof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1) == 0x000148, "Wrong size on WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, EntryPoint) == 0x000000, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_Event_State) == 0x000004, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_Event_imageRarity) == 0x000020, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_Event_imageRarity' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_Event_rarity) == 0x000028, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_Event_rarity' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, CallFunc_UI_GetArrayColor_Shop_Frame_1_UI_ColorArray_Shop_Frame_1) == 0x00002C, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::CallFunc_UI_GetArrayColor_Shop_Frame_1_UI_ColorArray_Shop_Frame_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000050, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_CreateDelegate_OutputDelegate_2) == 0x000058, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_Event_imageCategory) == 0x000068, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_Event_imageCategory' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_Event_category) == 0x000070, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_Event_category' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000074, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, CallFunc_GetPlatformType_ReturnValue) == 0x000078, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000079, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_CreateDelegate_OutputDelegate_3) == 0x00007C, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_Event_eventBPFilePath) == 0x000090, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_Event_eventBPFilePath' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, CallFunc_SpawnActorFromBPFilePath_ReturnValue) == 0x0000A0, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::CallFunc_SpawnActorFromBPFilePath_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_DynamicCast_AsBP_Make_Event_Actor_Base) == 0x0000A8, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_DynamicCast_AsBP_Make_Event_Actor_Base' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_Event_index_2) == 0x0000B4, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_Event_index_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_Event_Widget_4) == 0x0000B8, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_Event_Widget_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_Event_Widget_3) == 0x0000C0, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_Event_Widget_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_Event_Widget_2) == 0x0000C8, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_Event_Widget_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_Event_isMouseScroll_1) == 0x0000D0, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_Event_isMouseScroll_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_Event_index_1) == 0x0000D4, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_Event_index_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_Event_Widget_1) == 0x0000D8, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_Event_Widget_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_Event_isMouseScroll) == 0x0000E0, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_Event_isMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_Event_index) == 0x0000E4, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_Event_Widget) == 0x0000E8, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_Event_Widget' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000F0, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_CreateDelegate_OutputDelegate_5) == 0x000100, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_Event_exp) == 0x000110, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_Event_exp' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, CallFunc_GetPlayerManager_PlayerManager) == 0x000118, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::CallFunc_GetPlayerManager_PlayerManager' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, CallFunc_AddExp_OutMainPlayerExp) == 0x000120, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::CallFunc_AddExp_OutMainPlayerExp' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, K2Node_Event_Type) == 0x000124, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::K2Node_Event_Type' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, CallFunc_GetRSGameInstance_RSGameInstance) == 0x000128, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::CallFunc_GetRSGameInstance_RSGameInstance' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, CallFunc_GetClearGetterManager_ReturnValue) == 0x000130, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::CallFunc_GetClearGetterManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, CallFunc_GetRSGameInstance_RSGameInstance_1) == 0x000138, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::CallFunc_GetRSGameInstance_RSGameInstance_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1, CallFunc_GetClearGetterManager_ReturnValue_1) == 0x000140, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Achievement_Parts_1::CallFunc_GetClearGetterManager_ReturnValue_1' has a wrong offset!");

// Function WB_ui_Quest_Achievement_Parts_1.WB_ui_Quest_Achievement_Parts_1_C.OnClearMission
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Quest_Achievement_Parts_1_C_OnClearMission final
{
public:
	EClearGetterType                              Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Quest_Achievement_Parts_1_C_OnClearMission) == 0x000001, "Wrong alignment on WB_ui_Quest_Achievement_Parts_1_C_OnClearMission");
static_assert(sizeof(WB_ui_Quest_Achievement_Parts_1_C_OnClearMission) == 0x000001, "Wrong size on WB_ui_Quest_Achievement_Parts_1_C_OnClearMission");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_OnClearMission, Type) == 0x000000, "Member 'WB_ui_Quest_Achievement_Parts_1_C_OnClearMission::Type' has a wrong offset!");

// Function WB_ui_Quest_Achievement_Parts_1.WB_ui_Quest_Achievement_Parts_1_C.AddExp
// 0x0004 (0x0004 - 0x0000)
struct WB_ui_Quest_Achievement_Parts_1_C_AddExp final
{
public:
	int32                                         Exp;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Quest_Achievement_Parts_1_C_AddExp) == 0x000004, "Wrong alignment on WB_ui_Quest_Achievement_Parts_1_C_AddExp");
static_assert(sizeof(WB_ui_Quest_Achievement_Parts_1_C_AddExp) == 0x000004, "Wrong size on WB_ui_Quest_Achievement_Parts_1_C_AddExp");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_AddExp, Exp) == 0x000000, "Member 'WB_ui_Quest_Achievement_Parts_1_C_AddExp::Exp' has a wrong offset!");

// Function WB_ui_Quest_Achievement_Parts_1.WB_ui_Quest_Achievement_Parts_1_C.ListUnFocusMouse
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Quest_Achievement_Parts_1_C_ListUnFocusMouse final
{
public:
	int32                                         IsMouseScroll;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Quest_Achievement_Parts_1_C_ListUnFocusMouse) == 0x000008, "Wrong alignment on WB_ui_Quest_Achievement_Parts_1_C_ListUnFocusMouse");
static_assert(sizeof(WB_ui_Quest_Achievement_Parts_1_C_ListUnFocusMouse) == 0x000010, "Wrong size on WB_ui_Quest_Achievement_Parts_1_C_ListUnFocusMouse");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ListUnFocusMouse, IsMouseScroll) == 0x000000, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ListUnFocusMouse::IsMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ListUnFocusMouse, Param_Index) == 0x000004, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ListUnFocusMouse::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ListUnFocusMouse, Widget) == 0x000008, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ListUnFocusMouse::Widget' has a wrong offset!");

// Function WB_ui_Quest_Achievement_Parts_1.WB_ui_Quest_Achievement_Parts_1_C.ListFocusMouse
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Quest_Achievement_Parts_1_C_ListFocusMouse final
{
public:
	int32                                         IsMouseScroll;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Quest_Achievement_Parts_1_C_ListFocusMouse) == 0x000008, "Wrong alignment on WB_ui_Quest_Achievement_Parts_1_C_ListFocusMouse");
static_assert(sizeof(WB_ui_Quest_Achievement_Parts_1_C_ListFocusMouse) == 0x000010, "Wrong size on WB_ui_Quest_Achievement_Parts_1_C_ListFocusMouse");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ListFocusMouse, IsMouseScroll) == 0x000000, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ListFocusMouse::IsMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ListFocusMouse, Param_Index) == 0x000004, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ListFocusMouse::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ListFocusMouse, Widget) == 0x000008, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ListFocusMouse::Widget' has a wrong offset!");

// Function WB_ui_Quest_Achievement_Parts_1.WB_ui_Quest_Achievement_Parts_1_C.ListUnFocus
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_Quest_Achievement_Parts_1_C_ListUnFocus final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Quest_Achievement_Parts_1_C_ListUnFocus) == 0x000008, "Wrong alignment on WB_ui_Quest_Achievement_Parts_1_C_ListUnFocus");
static_assert(sizeof(WB_ui_Quest_Achievement_Parts_1_C_ListUnFocus) == 0x000008, "Wrong size on WB_ui_Quest_Achievement_Parts_1_C_ListUnFocus");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ListUnFocus, Widget) == 0x000000, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ListUnFocus::Widget' has a wrong offset!");

// Function WB_ui_Quest_Achievement_Parts_1.WB_ui_Quest_Achievement_Parts_1_C.ListFocus
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_Quest_Achievement_Parts_1_C_ListFocus final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Quest_Achievement_Parts_1_C_ListFocus) == 0x000008, "Wrong alignment on WB_ui_Quest_Achievement_Parts_1_C_ListFocus");
static_assert(sizeof(WB_ui_Quest_Achievement_Parts_1_C_ListFocus) == 0x000008, "Wrong size on WB_ui_Quest_Achievement_Parts_1_C_ListFocus");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ListFocus, Widget) == 0x000000, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ListFocus::Widget' has a wrong offset!");

// Function WB_ui_Quest_Achievement_Parts_1.WB_ui_Quest_Achievement_Parts_1_C.ListUpdateElement
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Quest_Achievement_Parts_1_C_ListUpdateElement final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_897E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Quest_Achievement_Parts_1_C_ListUpdateElement) == 0x000008, "Wrong alignment on WB_ui_Quest_Achievement_Parts_1_C_ListUpdateElement");
static_assert(sizeof(WB_ui_Quest_Achievement_Parts_1_C_ListUpdateElement) == 0x000010, "Wrong size on WB_ui_Quest_Achievement_Parts_1_C_ListUpdateElement");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ListUpdateElement, Param_Index) == 0x000000, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ListUpdateElement::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_ListUpdateElement, Widget) == 0x000008, "Member 'WB_ui_Quest_Achievement_Parts_1_C_ListUpdateElement::Widget' has a wrong offset!");

// Function WB_ui_Quest_Achievement_Parts_1.WB_ui_Quest_Achievement_Parts_1_C.CallEvent
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Quest_Achievement_Parts_1_C_CallEvent final
{
public:
	class FString                                 EventBPFilePath;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Quest_Achievement_Parts_1_C_CallEvent) == 0x000008, "Wrong alignment on WB_ui_Quest_Achievement_Parts_1_C_CallEvent");
static_assert(sizeof(WB_ui_Quest_Achievement_Parts_1_C_CallEvent) == 0x000010, "Wrong size on WB_ui_Quest_Achievement_Parts_1_C_CallEvent");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_CallEvent, EventBPFilePath) == 0x000000, "Member 'WB_ui_Quest_Achievement_Parts_1_C_CallEvent::EventBPFilePath' has a wrong offset!");

// Function WB_ui_Quest_Achievement_Parts_1.WB_ui_Quest_Achievement_Parts_1_C.SetItemIcon
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Quest_Achievement_Parts_1_C_SetItemIcon final
{
public:
	class UImage*                                 ImageCategory;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemIcon                                     Category;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Quest_Achievement_Parts_1_C_SetItemIcon) == 0x000008, "Wrong alignment on WB_ui_Quest_Achievement_Parts_1_C_SetItemIcon");
static_assert(sizeof(WB_ui_Quest_Achievement_Parts_1_C_SetItemIcon) == 0x000010, "Wrong size on WB_ui_Quest_Achievement_Parts_1_C_SetItemIcon");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_SetItemIcon, ImageCategory) == 0x000000, "Member 'WB_ui_Quest_Achievement_Parts_1_C_SetItemIcon::ImageCategory' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_SetItemIcon, Category) == 0x000008, "Member 'WB_ui_Quest_Achievement_Parts_1_C_SetItemIcon::Category' has a wrong offset!");

// Function WB_ui_Quest_Achievement_Parts_1.WB_ui_Quest_Achievement_Parts_1_C.SetItemRarity
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Quest_Achievement_Parts_1_C_SetItemRarity final
{
public:
	class UImage*                                 ImageRarity;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemRarity                                   Rarity;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Quest_Achievement_Parts_1_C_SetItemRarity) == 0x000008, "Wrong alignment on WB_ui_Quest_Achievement_Parts_1_C_SetItemRarity");
static_assert(sizeof(WB_ui_Quest_Achievement_Parts_1_C_SetItemRarity) == 0x000010, "Wrong size on WB_ui_Quest_Achievement_Parts_1_C_SetItemRarity");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_SetItemRarity, ImageRarity) == 0x000000, "Member 'WB_ui_Quest_Achievement_Parts_1_C_SetItemRarity::ImageRarity' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_SetItemRarity, Rarity) == 0x000008, "Member 'WB_ui_Quest_Achievement_Parts_1_C_SetItemRarity::Rarity' has a wrong offset!");

// Function WB_ui_Quest_Achievement_Parts_1.WB_ui_Quest_Achievement_Parts_1_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Quest_Achievement_Parts_1_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Quest_Achievement_Parts_1_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Quest_Achievement_Parts_1_C_UpdateState");
static_assert(sizeof(WB_ui_Quest_Achievement_Parts_1_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Quest_Achievement_Parts_1_C_UpdateState");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Quest_Achievement_Parts_1_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Quest_Achievement_Parts_1_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Achievement_Parts_1_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Quest_Achievement_Parts_1_C_UpdateState::DeltaSeconds' has a wrong offset!");

}

