#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Present

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Present.WB_ui_Present_C
// 0x01E8 (0x0590 - 0x03A8)
class UWB_ui_Present_C final : public UUIPresent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default_none;                                      // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                All_Color;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               All_Set;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Info;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bond_Base;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_ViewRange;                             // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Face_a2;                                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Face_Noise;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_1;                                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_2_under;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_2_up;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Item_1;                                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Item_2;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_base;                                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_done;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_E;                                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_item;                                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_new;                                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_rarity;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Item_icon_frame_1;                                 // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_2;                                         // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDRetainerBox*                        REDRetainerBox_Menu_2;                             // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDScrollBox*                          ScrollBoxPresentlist;                              // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Text_color_bond_1num;                              // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Text_color_iteminfo_1_num;                         // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Present_contents_1;                           // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Present_info_bond_1num;                       // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Present_iteminfo_1;                           // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Present_iteminfo_2;                           // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Present_iteminfo_3;                           // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Present_iteminfo_4;                           // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Present_iteminfo_1_num;                       // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Present_iteminfo_2_num;                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Present_iteminfo_slash_1;                     // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Present_Name_1;                               // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thubnail_Present_BG;                               // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thubnail_Shade;                                    // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thumbnail_Frame;                                   // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thumbnail_Noise;                                   // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thumbnail_Present;                                 // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Guide_C*                         WB_ui_Guide;                                       // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Item_EStatus_Parts_1_C*          WB_ui_Item_EStatus_Parts_1;                        // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CursorPos;                                         // 0x0540(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E7C[0x4];                                     // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  ItemNewFlagList;                                   // 0x0548(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FPresentInfoData>               ItemInfoList;                                      // 0x0558(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsMouseDecide;                                     // 0x0568(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E7D[0x3];                                     // 0x0569(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ColorMax;                                          // 0x056C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorNormal;                                       // 0x057C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Present(int32 EntryPoint);
	void OnInitialized();
	void Event_MouseDown(int32 Param_Cursor, class UUserWidget* PWidget);
	void Event_MouseUnFocus(int32 IsMouseScroll, int32 Param_Cursor, class UUserWidget* PWidget);
	void Event_MouseFocus(int32 IsMouseScroll, int32 Param_Cursor, class UUserWidget* PWidget);
	void Event_List_UnFocus(class UUserWidget* PWidget);
	void Event_List_Focus(class UUserWidget* PWidget);
	void Event_List_UpdateElement(int32 Param_Index, class UUserWidget* PWidget);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void StateNone(int32 SubState);
	void StateOpen(int32 SubState);
	void StateLoop(int32 SubState);
	void StateClose(int32 SubState);
	void SetTargetCharacter(EPlayerID TargetID);
	void UpdateTargetCharacter();
	void CreateList();
	void IsSelect(bool* SelectFlag);
	void GetResult(class FName* PresentItem);
	void UpdateCursor();
	void UpdateItemInfo();
	void SetDefaultInfo();
	void SetupInfoWindow();
	void CheckAccessoryExtend(class FName ItemId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Present_C">();
	}
	static class UWB_ui_Present_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Present_C>();
	}
};
static_assert(alignof(UWB_ui_Present_C) == 0x000008, "Wrong alignment on UWB_ui_Present_C");
static_assert(sizeof(UWB_ui_Present_C) == 0x000590, "Wrong size on UWB_ui_Present_C");
static_assert(offsetof(UWB_ui_Present_C, UberGraphFrame) == 0x0003A8, "Member 'UWB_ui_Present_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Default_none) == 0x0003B0, "Member 'UWB_ui_Present_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Out) == 0x0003B8, "Member 'UWB_ui_Present_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, In) == 0x0003C0, "Member 'UWB_ui_Present_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Default) == 0x0003C8, "Member 'UWB_ui_Present_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, All_Color) == 0x0003D0, "Member 'UWB_ui_Present_C::All_Color' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, All_Set) == 0x0003D8, "Member 'UWB_ui_Present_C::All_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Base_Info) == 0x0003E0, "Member 'UWB_ui_Present_C::Base_Info' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Bond_Base) == 0x0003E8, "Member 'UWB_ui_Present_C::Bond_Base' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, CanvasPanel_0) == 0x0003F0, "Member 'UWB_ui_Present_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, CanvasPanel_ViewRange) == 0x0003F8, "Member 'UWB_ui_Present_C::CanvasPanel_ViewRange' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Face_a2) == 0x000400, "Member 'UWB_ui_Present_C::Face_a2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Face_Noise) == 0x000408, "Member 'UWB_ui_Present_C::Face_Noise' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Frame) == 0x000410, "Member 'UWB_ui_Present_C::Frame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Frame_1) == 0x000418, "Member 'UWB_ui_Present_C::Frame_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Frame_2_under) == 0x000420, "Member 'UWB_ui_Present_C::Frame_2_under' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Frame_2_up) == 0x000428, "Member 'UWB_ui_Present_C::Frame_2_up' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Frame_Item_1) == 0x000430, "Member 'UWB_ui_Present_C::Frame_Item_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Frame_Item_2) == 0x000438, "Member 'UWB_ui_Present_C::Frame_Item_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Icon_base) == 0x000440, "Member 'UWB_ui_Present_C::Icon_base' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Icon_done) == 0x000448, "Member 'UWB_ui_Present_C::Icon_done' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Icon_E) == 0x000450, "Member 'UWB_ui_Present_C::Icon_E' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Icon_font) == 0x000458, "Member 'UWB_ui_Present_C::Icon_font' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Icon_item) == 0x000460, "Member 'UWB_ui_Present_C::Icon_item' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Icon_new) == 0x000468, "Member 'UWB_ui_Present_C::Icon_new' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Icon_rarity) == 0x000470, "Member 'UWB_ui_Present_C::Icon_rarity' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Image_0) == 0x000478, "Member 'UWB_ui_Present_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Item_icon_frame_1) == 0x000480, "Member 'UWB_ui_Present_C::Item_icon_frame_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Overlay_1) == 0x000488, "Member 'UWB_ui_Present_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Overlay_2) == 0x000490, "Member 'UWB_ui_Present_C::Overlay_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, REDRetainerBox_Menu_2) == 0x000498, "Member 'UWB_ui_Present_C::REDRetainerBox_Menu_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, ScrollBoxPresentlist) == 0x0004A0, "Member 'UWB_ui_Present_C::ScrollBoxPresentlist' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Text_color_bond_1num) == 0x0004A8, "Member 'UWB_ui_Present_C::Text_color_bond_1num' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Text_color_iteminfo_1_num) == 0x0004B0, "Member 'UWB_ui_Present_C::Text_color_iteminfo_1_num' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Text_Present_contents_1) == 0x0004B8, "Member 'UWB_ui_Present_C::Text_Present_contents_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Text_Present_info_bond_1num) == 0x0004C0, "Member 'UWB_ui_Present_C::Text_Present_info_bond_1num' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Text_Present_iteminfo_1) == 0x0004C8, "Member 'UWB_ui_Present_C::Text_Present_iteminfo_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Text_Present_iteminfo_2) == 0x0004D0, "Member 'UWB_ui_Present_C::Text_Present_iteminfo_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Text_Present_iteminfo_3) == 0x0004D8, "Member 'UWB_ui_Present_C::Text_Present_iteminfo_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Text_Present_iteminfo_4) == 0x0004E0, "Member 'UWB_ui_Present_C::Text_Present_iteminfo_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Text_Present_iteminfo_1_num) == 0x0004E8, "Member 'UWB_ui_Present_C::Text_Present_iteminfo_1_num' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Text_Present_iteminfo_2_num) == 0x0004F0, "Member 'UWB_ui_Present_C::Text_Present_iteminfo_2_num' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Text_Present_iteminfo_slash_1) == 0x0004F8, "Member 'UWB_ui_Present_C::Text_Present_iteminfo_slash_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Text_Present_Name_1) == 0x000500, "Member 'UWB_ui_Present_C::Text_Present_Name_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Thubnail_Present_BG) == 0x000508, "Member 'UWB_ui_Present_C::Thubnail_Present_BG' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Thubnail_Shade) == 0x000510, "Member 'UWB_ui_Present_C::Thubnail_Shade' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Thumbnail_Frame) == 0x000518, "Member 'UWB_ui_Present_C::Thumbnail_Frame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Thumbnail_Noise) == 0x000520, "Member 'UWB_ui_Present_C::Thumbnail_Noise' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, Thumbnail_Present) == 0x000528, "Member 'UWB_ui_Present_C::Thumbnail_Present' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, WB_ui_Guide) == 0x000530, "Member 'UWB_ui_Present_C::WB_ui_Guide' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, WB_ui_Item_EStatus_Parts_1) == 0x000538, "Member 'UWB_ui_Present_C::WB_ui_Item_EStatus_Parts_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, CursorPos) == 0x000540, "Member 'UWB_ui_Present_C::CursorPos' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, ItemNewFlagList) == 0x000548, "Member 'UWB_ui_Present_C::ItemNewFlagList' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, ItemInfoList) == 0x000558, "Member 'UWB_ui_Present_C::ItemInfoList' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, IsMouseDecide) == 0x000568, "Member 'UWB_ui_Present_C::IsMouseDecide' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, ColorMax) == 0x00056C, "Member 'UWB_ui_Present_C::ColorMax' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_C, ColorNormal) == 0x00057C, "Member 'UWB_ui_Present_C::ColorNormal' has a wrong offset!");

}

