#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Vitality_en_02

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Vitality_en_02.WB_ui_Vitality_en_02_C.ExecuteUbergraph_WB_ui_Vitality_en_02
// 0x00A0 (0x00A0 - 0x0000)
struct WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 K2Node_Event_icon_1;                               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index_1;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B5E[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 K2Node_Event_icon;                                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B5F[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	int32                                         K2Node_Event_Level;                                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B60[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0068(0x0018)()
	class UWB_ui_BrainCrash_gauge_C*              CallFunc_Create_ReturnValue;                       // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Name;                                 // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02) == 0x000008, "Wrong alignment on WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02");
static_assert(sizeof(WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02) == 0x0000A0, "Wrong size on WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02");
static_assert(offsetof(WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02, EntryPoint) == 0x000000, "Member 'WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02, K2Node_Event_State) == 0x000004, "Member 'WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02, K2Node_Event_icon_1) == 0x000010, "Member 'WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02::K2Node_Event_icon_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02, K2Node_Event_index_1) == 0x000018, "Member 'WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02::K2Node_Event_index_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02, K2Node_Event_icon) == 0x000020, "Member 'WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02::K2Node_Event_icon' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02, K2Node_Event_index) == 0x000028, "Member 'WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02, CallFunc_GetDataBaseManager_Manager) == 0x000030, "Member 'WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02, CallFunc_GetText_ReturnValue) == 0x000038, "Member 'WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02, K2Node_Event_Level) == 0x000060, "Member 'WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02::K2Node_Event_Level' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02, CallFunc_Conv_IntToText_ReturnValue) == 0x000068, "Member 'WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02, CallFunc_Create_ReturnValue) == 0x000080, "Member 'WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02, K2Node_Event_Name) == 0x000088, "Member 'WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02::K2Node_Event_Name' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02, CallFunc_Conv_NameToString_ReturnValue) == 0x000090, "Member 'WB_ui_Vitality_en_02_C_ExecuteUbergraph_WB_ui_Vitality_en_02::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");

// Function WB_ui_Vitality_en_02.WB_ui_Vitality_en_02_C.SetSubQuestTarget
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_Vitality_en_02_C_SetSubQuestTarget final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Vitality_en_02_C_SetSubQuestTarget) == 0x000004, "Wrong alignment on WB_ui_Vitality_en_02_C_SetSubQuestTarget");
static_assert(sizeof(WB_ui_Vitality_en_02_C_SetSubQuestTarget) == 0x000008, "Wrong size on WB_ui_Vitality_en_02_C_SetSubQuestTarget");
static_assert(offsetof(WB_ui_Vitality_en_02_C_SetSubQuestTarget, Param_Name) == 0x000000, "Member 'WB_ui_Vitality_en_02_C_SetSubQuestTarget::Param_Name' has a wrong offset!");

// Function WB_ui_Vitality_en_02.WB_ui_Vitality_en_02_C.SetLevel
// 0x0004 (0x0004 - 0x0000)
struct WB_ui_Vitality_en_02_C_SetLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Vitality_en_02_C_SetLevel) == 0x000004, "Wrong alignment on WB_ui_Vitality_en_02_C_SetLevel");
static_assert(sizeof(WB_ui_Vitality_en_02_C_SetLevel) == 0x000004, "Wrong size on WB_ui_Vitality_en_02_C_SetLevel");
static_assert(offsetof(WB_ui_Vitality_en_02_C_SetLevel, Level) == 0x000000, "Member 'WB_ui_Vitality_en_02_C_SetLevel::Level' has a wrong offset!");

// Function WB_ui_Vitality_en_02.WB_ui_Vitality_en_02_C.SetIcon2
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Vitality_en_02_C_SetIcon2 final
{
public:
	class UImage*                                 Icon;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Vitality_en_02_C_SetIcon2) == 0x000008, "Wrong alignment on WB_ui_Vitality_en_02_C_SetIcon2");
static_assert(sizeof(WB_ui_Vitality_en_02_C_SetIcon2) == 0x000010, "Wrong size on WB_ui_Vitality_en_02_C_SetIcon2");
static_assert(offsetof(WB_ui_Vitality_en_02_C_SetIcon2, Icon) == 0x000000, "Member 'WB_ui_Vitality_en_02_C_SetIcon2::Icon' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_SetIcon2, Param_Index) == 0x000008, "Member 'WB_ui_Vitality_en_02_C_SetIcon2::Param_Index' has a wrong offset!");

// Function WB_ui_Vitality_en_02.WB_ui_Vitality_en_02_C.SetIcon1
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Vitality_en_02_C_SetIcon1 final
{
public:
	class UImage*                                 Icon;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Vitality_en_02_C_SetIcon1) == 0x000008, "Wrong alignment on WB_ui_Vitality_en_02_C_SetIcon1");
static_assert(sizeof(WB_ui_Vitality_en_02_C_SetIcon1) == 0x000010, "Wrong size on WB_ui_Vitality_en_02_C_SetIcon1");
static_assert(offsetof(WB_ui_Vitality_en_02_C_SetIcon1, Icon) == 0x000000, "Member 'WB_ui_Vitality_en_02_C_SetIcon1::Icon' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_SetIcon1, Param_Index) == 0x000008, "Member 'WB_ui_Vitality_en_02_C_SetIcon1::Param_Index' has a wrong offset!");

// Function WB_ui_Vitality_en_02.WB_ui_Vitality_en_02_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Vitality_en_02_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Vitality_en_02_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Vitality_en_02_C_UpdateState");
static_assert(sizeof(WB_ui_Vitality_en_02_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Vitality_en_02_C_UpdateState");
static_assert(offsetof(WB_ui_Vitality_en_02_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Vitality_en_02_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Vitality_en_02_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Vitality_en_02_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Vitality_en_02.WB_ui_Vitality_en_02_C.UpdateSubQuestTargetIcon
// 0x0028 (0x0028 - 0x0000)
struct WB_ui_Vitality_en_02_C_UpdateSubQuestTargetIcon final
{
public:
	bool                                          _IsDraw;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B61[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserParamManager*                      CallFunc_GetUserParamManager_UserParamManager;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuestParamManager*                     CallFunc_GetQuestParamManager_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTargetEnemyForActiveSubQuest_ReturnValue; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B62[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveSubQuestNumber_ReturnValue;      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EQuestProgressState                           CallFunc_GetSubQuestState_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Vitality_en_02_C_UpdateSubQuestTargetIcon) == 0x000008, "Wrong alignment on WB_ui_Vitality_en_02_C_UpdateSubQuestTargetIcon");
static_assert(sizeof(WB_ui_Vitality_en_02_C_UpdateSubQuestTargetIcon) == 0x000028, "Wrong size on WB_ui_Vitality_en_02_C_UpdateSubQuestTargetIcon");
static_assert(offsetof(WB_ui_Vitality_en_02_C_UpdateSubQuestTargetIcon, _IsDraw) == 0x000000, "Member 'WB_ui_Vitality_en_02_C_UpdateSubQuestTargetIcon::_IsDraw' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_UpdateSubQuestTargetIcon, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'WB_ui_Vitality_en_02_C_UpdateSubQuestTargetIcon::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_UpdateSubQuestTargetIcon, CallFunc_GetUserParamManager_UserParamManager) == 0x000008, "Member 'WB_ui_Vitality_en_02_C_UpdateSubQuestTargetIcon::CallFunc_GetUserParamManager_UserParamManager' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_UpdateSubQuestTargetIcon, CallFunc_GetQuestParamManager_ReturnValue) == 0x000010, "Member 'WB_ui_Vitality_en_02_C_UpdateSubQuestTargetIcon::CallFunc_GetQuestParamManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_UpdateSubQuestTargetIcon, CallFunc_IsTargetEnemyForActiveSubQuest_ReturnValue) == 0x000018, "Member 'WB_ui_Vitality_en_02_C_UpdateSubQuestTargetIcon::CallFunc_IsTargetEnemyForActiveSubQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_UpdateSubQuestTargetIcon, CallFunc_GetActiveSubQuestNumber_ReturnValue) == 0x00001C, "Member 'WB_ui_Vitality_en_02_C_UpdateSubQuestTargetIcon::CallFunc_GetActiveSubQuestNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_UpdateSubQuestTargetIcon, CallFunc_GetSubQuestState_ReturnValue) == 0x000020, "Member 'WB_ui_Vitality_en_02_C_UpdateSubQuestTargetIcon::CallFunc_GetSubQuestState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_UpdateSubQuestTargetIcon, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'WB_ui_Vitality_en_02_C_UpdateSubQuestTargetIcon::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_en_02_C_UpdateSubQuestTargetIcon, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'WB_ui_Vitality_en_02_C_UpdateSubQuestTargetIcon::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

