#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_ControllerListParts_2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_ControllerListParts_2.WB_ui_ControllerListParts_2_C
// 0x0048 (0x0410 - 0x03C8)
class UWB_ui_ControllerListParts_2_C final : public UUIConfigControllerSelect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Select_out;                                        // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_in;                                         // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select;                                            // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Icon_font;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer;                                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text;                                              // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_controller_list_2;                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_ControllerListParts_2(int32 EntryPoint);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_ControllerListParts_2_C">();
	}
	static class UWB_ui_ControllerListParts_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_ControllerListParts_2_C>();
	}
};
static_assert(alignof(UWB_ui_ControllerListParts_2_C) == 0x000008, "Wrong alignment on UWB_ui_ControllerListParts_2_C");
static_assert(sizeof(UWB_ui_ControllerListParts_2_C) == 0x000410, "Wrong size on UWB_ui_ControllerListParts_2_C");
static_assert(offsetof(UWB_ui_ControllerListParts_2_C, UberGraphFrame) == 0x0003C8, "Member 'UWB_ui_ControllerListParts_2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_ControllerListParts_2_C, Select_out) == 0x0003D0, "Member 'UWB_ui_ControllerListParts_2_C::Select_out' has a wrong offset!");
static_assert(offsetof(UWB_ui_ControllerListParts_2_C, Select_in) == 0x0003D8, "Member 'UWB_ui_ControllerListParts_2_C::Select_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_ControllerListParts_2_C, Select) == 0x0003E0, "Member 'UWB_ui_ControllerListParts_2_C::Select' has a wrong offset!");
static_assert(offsetof(UWB_ui_ControllerListParts_2_C, Default) == 0x0003E8, "Member 'UWB_ui_ControllerListParts_2_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_ControllerListParts_2_C, Icon_font) == 0x0003F0, "Member 'UWB_ui_ControllerListParts_2_C::Icon_font' has a wrong offset!");
static_assert(offsetof(UWB_ui_ControllerListParts_2_C, Spacer) == 0x0003F8, "Member 'UWB_ui_ControllerListParts_2_C::Spacer' has a wrong offset!");
static_assert(offsetof(UWB_ui_ControllerListParts_2_C, Text) == 0x000400, "Member 'UWB_ui_ControllerListParts_2_C::Text' has a wrong offset!");
static_assert(offsetof(UWB_ui_ControllerListParts_2_C, Text_controller_list_2) == 0x000408, "Member 'UWB_ui_ControllerListParts_2_C::Text_controller_list_2' has a wrong offset!");

}

