#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_DetailMap_Parts_2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_ui_detail_map_parts_2_animation_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_2_C
// 0x0060 (0x03E8 - 0x0388)
class UWB_ui_DetailMap_Parts_2_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default_icon_none;                                 // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                All_Color;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_font;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Iconinfo_Line;                                     // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               IconInfo_Set;                                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_DetailMap_IconInfo_1;                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_DetailMap_IconInfo_2;                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	Enum_ui_detail_map_parts_2_animation          Defaultanime;                                      // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_DetailMap_Parts_2(int32 EntryPoint);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void StateNone(int32 SubState);
	void StateUpdate(int32 SubState);
	void Setup(bool IsDraw, bool IsCheck, const class FString& MessageIcon, const class FString& Message);
	void SetAnime(Enum_ui_detail_map_parts_2_animation Anime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_DetailMap_Parts_2_C">();
	}
	static class UWB_ui_DetailMap_Parts_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_DetailMap_Parts_2_C>();
	}
};
static_assert(alignof(UWB_ui_DetailMap_Parts_2_C) == 0x000008, "Wrong alignment on UWB_ui_DetailMap_Parts_2_C");
static_assert(sizeof(UWB_ui_DetailMap_Parts_2_C) == 0x0003E8, "Wrong size on UWB_ui_DetailMap_Parts_2_C");
static_assert(offsetof(UWB_ui_DetailMap_Parts_2_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_DetailMap_Parts_2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_DetailMap_Parts_2_C, Default_icon_none) == 0x000390, "Member 'UWB_ui_DetailMap_Parts_2_C::Default_icon_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_DetailMap_Parts_2_C, Default_none) == 0x000398, "Member 'UWB_ui_DetailMap_Parts_2_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_DetailMap_Parts_2_C, Default) == 0x0003A0, "Member 'UWB_ui_DetailMap_Parts_2_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_DetailMap_Parts_2_C, All_Color) == 0x0003A8, "Member 'UWB_ui_DetailMap_Parts_2_C::All_Color' has a wrong offset!");
static_assert(offsetof(UWB_ui_DetailMap_Parts_2_C, Icon_font) == 0x0003B0, "Member 'UWB_ui_DetailMap_Parts_2_C::Icon_font' has a wrong offset!");
static_assert(offsetof(UWB_ui_DetailMap_Parts_2_C, Iconinfo_Line) == 0x0003B8, "Member 'UWB_ui_DetailMap_Parts_2_C::Iconinfo_Line' has a wrong offset!");
static_assert(offsetof(UWB_ui_DetailMap_Parts_2_C, IconInfo_Set) == 0x0003C0, "Member 'UWB_ui_DetailMap_Parts_2_C::IconInfo_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_DetailMap_Parts_2_C, InvalidationBox_0) == 0x0003C8, "Member 'UWB_ui_DetailMap_Parts_2_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWB_ui_DetailMap_Parts_2_C, Text_DetailMap_IconInfo_1) == 0x0003D0, "Member 'UWB_ui_DetailMap_Parts_2_C::Text_DetailMap_IconInfo_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_DetailMap_Parts_2_C, Text_DetailMap_IconInfo_2) == 0x0003D8, "Member 'UWB_ui_DetailMap_Parts_2_C::Text_DetailMap_IconInfo_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_DetailMap_Parts_2_C, Defaultanime) == 0x0003E0, "Member 'UWB_ui_DetailMap_Parts_2_C::Defaultanime' has a wrong offset!");

}

