#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Controller

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Controller.WB_ui_Controller_C
// 0x0170 (0x0678 - 0x0508)
class UWB_ui_Controller_C final : public UUIConfigController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default;                                           // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                All_Color;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_ViewRange;                             // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_1_C*         ListParts_1_1;                                     // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_1_C*         ListParts_1_2;                                     // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_1_C*         ListParts_1_3;                                     // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_1_C*         ListParts_1_4;                                     // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_1_C*         ListParts_1_5;                                     // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_1_C*         ListParts_1_6;                                     // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_1_C*         ListParts_1_7;                                     // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_1_C*         ListParts_1_8;                                     // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_1_C*         ListParts_1_9;                                     // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_1_C*         ListParts_1_10;                                    // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_1;                                     // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_2;                                     // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_3;                                     // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_4;                                     // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_5;                                     // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_6;                                     // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_7;                                     // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_8;                                     // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_9;                                     // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_10;                                    // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_11;                                    // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_12;                                    // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_13;                                    // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_14;                                    // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_15;                                    // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_16;                                    // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_17;                                    // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_18;                                    // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_19;                                    // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_20;                                    // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_21;                                    // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_22;                                    // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_23;                                    // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_24;                                    // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_25;                                    // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_26;                                    // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_27;                                    // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_28;                                    // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_29;                                    // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_30;                                    // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_ControllerListParts_2_C*         ListParts_2_31;                                    // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDScrollBoxSimple*                    REDScrollBoxSimple_0;                              // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Controller(int32 EntryPoint);
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Controller_C">();
	}
	static class UWB_ui_Controller_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Controller_C>();
	}
};
static_assert(alignof(UWB_ui_Controller_C) == 0x000008, "Wrong alignment on UWB_ui_Controller_C");
static_assert(sizeof(UWB_ui_Controller_C) == 0x000678, "Wrong size on UWB_ui_Controller_C");
static_assert(offsetof(UWB_ui_Controller_C, UberGraphFrame) == 0x000508, "Member 'UWB_ui_Controller_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, Default) == 0x000510, "Member 'UWB_ui_Controller_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, All_Color) == 0x000518, "Member 'UWB_ui_Controller_C::All_Color' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, CanvasPanel_ViewRange) == 0x000520, "Member 'UWB_ui_Controller_C::CanvasPanel_ViewRange' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_1_1) == 0x000528, "Member 'UWB_ui_Controller_C::ListParts_1_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_1_2) == 0x000530, "Member 'UWB_ui_Controller_C::ListParts_1_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_1_3) == 0x000538, "Member 'UWB_ui_Controller_C::ListParts_1_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_1_4) == 0x000540, "Member 'UWB_ui_Controller_C::ListParts_1_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_1_5) == 0x000548, "Member 'UWB_ui_Controller_C::ListParts_1_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_1_6) == 0x000550, "Member 'UWB_ui_Controller_C::ListParts_1_6' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_1_7) == 0x000558, "Member 'UWB_ui_Controller_C::ListParts_1_7' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_1_8) == 0x000560, "Member 'UWB_ui_Controller_C::ListParts_1_8' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_1_9) == 0x000568, "Member 'UWB_ui_Controller_C::ListParts_1_9' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_1_10) == 0x000570, "Member 'UWB_ui_Controller_C::ListParts_1_10' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_1) == 0x000578, "Member 'UWB_ui_Controller_C::ListParts_2_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_2) == 0x000580, "Member 'UWB_ui_Controller_C::ListParts_2_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_3) == 0x000588, "Member 'UWB_ui_Controller_C::ListParts_2_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_4) == 0x000590, "Member 'UWB_ui_Controller_C::ListParts_2_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_5) == 0x000598, "Member 'UWB_ui_Controller_C::ListParts_2_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_6) == 0x0005A0, "Member 'UWB_ui_Controller_C::ListParts_2_6' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_7) == 0x0005A8, "Member 'UWB_ui_Controller_C::ListParts_2_7' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_8) == 0x0005B0, "Member 'UWB_ui_Controller_C::ListParts_2_8' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_9) == 0x0005B8, "Member 'UWB_ui_Controller_C::ListParts_2_9' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_10) == 0x0005C0, "Member 'UWB_ui_Controller_C::ListParts_2_10' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_11) == 0x0005C8, "Member 'UWB_ui_Controller_C::ListParts_2_11' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_12) == 0x0005D0, "Member 'UWB_ui_Controller_C::ListParts_2_12' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_13) == 0x0005D8, "Member 'UWB_ui_Controller_C::ListParts_2_13' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_14) == 0x0005E0, "Member 'UWB_ui_Controller_C::ListParts_2_14' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_15) == 0x0005E8, "Member 'UWB_ui_Controller_C::ListParts_2_15' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_16) == 0x0005F0, "Member 'UWB_ui_Controller_C::ListParts_2_16' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_17) == 0x0005F8, "Member 'UWB_ui_Controller_C::ListParts_2_17' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_18) == 0x000600, "Member 'UWB_ui_Controller_C::ListParts_2_18' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_19) == 0x000608, "Member 'UWB_ui_Controller_C::ListParts_2_19' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_20) == 0x000610, "Member 'UWB_ui_Controller_C::ListParts_2_20' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_21) == 0x000618, "Member 'UWB_ui_Controller_C::ListParts_2_21' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_22) == 0x000620, "Member 'UWB_ui_Controller_C::ListParts_2_22' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_23) == 0x000628, "Member 'UWB_ui_Controller_C::ListParts_2_23' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_24) == 0x000630, "Member 'UWB_ui_Controller_C::ListParts_2_24' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_25) == 0x000638, "Member 'UWB_ui_Controller_C::ListParts_2_25' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_26) == 0x000640, "Member 'UWB_ui_Controller_C::ListParts_2_26' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_27) == 0x000648, "Member 'UWB_ui_Controller_C::ListParts_2_27' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_28) == 0x000650, "Member 'UWB_ui_Controller_C::ListParts_2_28' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_29) == 0x000658, "Member 'UWB_ui_Controller_C::ListParts_2_29' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_30) == 0x000660, "Member 'UWB_ui_Controller_C::ListParts_2_30' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, ListParts_2_31) == 0x000668, "Member 'UWB_ui_Controller_C::ListParts_2_31' has a wrong offset!");
static_assert(offsetof(UWB_ui_Controller_C, REDScrollBoxSimple_0) == 0x000670, "Member 'UWB_ui_Controller_C::REDScrollBoxSimple_0' has a wrong offset!");

}

