#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_BrainMes_Parts_3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_BrainMes_Parts_3.WB_ui_BrainMes_Parts_3_C
// 0x0078 (0x0400 - 0x0388)
class UWB_ui_BrainMes_Parts_3_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Select;                                            // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_out;                                        // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_in;                                         // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Decision;                                          // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Frame_1;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_2;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_add_2;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_add_3;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_1;                                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_2;                                            // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_BrainMes_Reply_1;                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsSelect;                                          // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsDecide;                                          // 0x03F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_ui_BrainMes_Parts_3(int32 EntryPoint);
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void StateNone(int32 SubState);
	void StateOpen(int32 SubState);
	void StateLoop(int32 SubState);
	void StateClose(int32 SubState);
	void SetSelect(bool Param_IsSelect);
	void Decide();
	void StateLoopSelect(int32 SubState);
	void SetDefaultMessage();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_BrainMes_Parts_3_C">();
	}
	static class UWB_ui_BrainMes_Parts_3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_BrainMes_Parts_3_C>();
	}
};
static_assert(alignof(UWB_ui_BrainMes_Parts_3_C) == 0x000008, "Wrong alignment on UWB_ui_BrainMes_Parts_3_C");
static_assert(sizeof(UWB_ui_BrainMes_Parts_3_C) == 0x000400, "Wrong size on UWB_ui_BrainMes_Parts_3_C");
static_assert(offsetof(UWB_ui_BrainMes_Parts_3_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_BrainMes_Parts_3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMes_Parts_3_C, Select) == 0x000390, "Member 'UWB_ui_BrainMes_Parts_3_C::Select' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMes_Parts_3_C, Select_out) == 0x000398, "Member 'UWB_ui_BrainMes_Parts_3_C::Select_out' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMes_Parts_3_C, Select_in) == 0x0003A0, "Member 'UWB_ui_BrainMes_Parts_3_C::Select_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMes_Parts_3_C, Decision) == 0x0003A8, "Member 'UWB_ui_BrainMes_Parts_3_C::Decision' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMes_Parts_3_C, Default) == 0x0003B0, "Member 'UWB_ui_BrainMes_Parts_3_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMes_Parts_3_C, Default_none) == 0x0003B8, "Member 'UWB_ui_BrainMes_Parts_3_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMes_Parts_3_C, Frame_1) == 0x0003C0, "Member 'UWB_ui_BrainMes_Parts_3_C::Frame_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMes_Parts_3_C, Frame_2) == 0x0003C8, "Member 'UWB_ui_BrainMes_Parts_3_C::Frame_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMes_Parts_3_C, Frame_add_2) == 0x0003D0, "Member 'UWB_ui_BrainMes_Parts_3_C::Frame_add_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMes_Parts_3_C, Frame_add_3) == 0x0003D8, "Member 'UWB_ui_BrainMes_Parts_3_C::Frame_add_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMes_Parts_3_C, Icon_1) == 0x0003E0, "Member 'UWB_ui_BrainMes_Parts_3_C::Icon_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMes_Parts_3_C, Icon_2) == 0x0003E8, "Member 'UWB_ui_BrainMes_Parts_3_C::Icon_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMes_Parts_3_C, Text_BrainMes_Reply_1) == 0x0003F0, "Member 'UWB_ui_BrainMes_Parts_3_C::Text_BrainMes_Reply_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMes_Parts_3_C, IsSelect) == 0x0003F8, "Member 'UWB_ui_BrainMes_Parts_3_C::IsSelect' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMes_Parts_3_C, IsDecide) == 0x0003F9, "Member 'UWB_ui_BrainMes_Parts_3_C::IsDecide' has a wrong offset!");

}

