#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Loading_chara_1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Loading_chara_1.WB_ui_Loading_chara_1_C.ExecuteUbergraph_WB_ui_Loading_chara_1
// 0x0048 (0x0048 - 0x0000)
struct WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6648[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6649[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_664A[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_664B[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_664C[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_664D[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1) == 0x000004, "Wrong alignment on WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1");
static_assert(sizeof(WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1) == 0x000048, "Wrong size on WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1");
static_assert(offsetof(WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1, EntryPoint) == 0x000000, "Member 'WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000011, "Member 'WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000018, "Member 'WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x00001C, "Member 'WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000020, "Member 'WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000024, "Member 'WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000028, "Member 'WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1, K2Node_Event_State) == 0x00002C, "Member 'WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1, K2Node_Event_SubState) == 0x000030, "Member 'WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1, K2Node_Event_DeltaSeconds) == 0x000034, "Member 'WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000038, "Member 'WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x00003C, "Member 'WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1, K2Node_SwitchInteger_CmpSuccess) == 0x000040, "Member 'WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1, CallFunc_Add_FloatFloat_ReturnValue) == 0x000044, "Member 'WB_ui_Loading_chara_1_C_ExecuteUbergraph_WB_ui_Loading_chara_1::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function WB_ui_Loading_chara_1.WB_ui_Loading_chara_1_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Loading_chara_1_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Loading_chara_1_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Loading_chara_1_C_UpdateState");
static_assert(sizeof(WB_ui_Loading_chara_1_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Loading_chara_1_C_UpdateState");
static_assert(offsetof(WB_ui_Loading_chara_1_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Loading_chara_1_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Loading_chara_1_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Loading_chara_1_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Loading_chara_1.WB_ui_Loading_chara_1_C.StateNone
// 0x0014 (0x0014 - 0x0000)
struct WB_ui_Loading_chara_1_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_664E[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFinishCreateScene_FinishCreate;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_664F[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Loading_chara_1_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_Loading_chara_1_C_StateNone");
static_assert(sizeof(WB_ui_Loading_chara_1_C_StateNone) == 0x000014, "Wrong size on WB_ui_Loading_chara_1_C_StateNone");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_Loading_chara_1_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Loading_chara_1_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Loading_chara_1_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Loading_chara_1_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateNone, CallFunc_IsFinishCreateScene_FinishCreate) == 0x00000C, "Member 'WB_ui_Loading_chara_1_C_StateNone::CallFunc_IsFinishCreateScene_FinishCreate' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00000D, "Member 'WB_ui_Loading_chara_1_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000010, "Member 'WB_ui_Loading_chara_1_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_Loading_chara_1.WB_ui_Loading_chara_1_C.StateOpen
// 0x0020 (0x0020 - 0x0000)
struct WB_ui_Loading_chara_1_C_StateOpen final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6650[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SoundManager_C*                     CallFunc_GetSoundManager_SoundManager;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ChangeSoundState_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Loading_chara_1_C_StateOpen) == 0x000008, "Wrong alignment on WB_ui_Loading_chara_1_C_StateOpen");
static_assert(sizeof(WB_ui_Loading_chara_1_C_StateOpen) == 0x000020, "Wrong size on WB_ui_Loading_chara_1_C_StateOpen");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateOpen, SubState) == 0x000000, "Member 'WB_ui_Loading_chara_1_C_StateOpen::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Loading_chara_1_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateOpen, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Loading_chara_1_C_StateOpen::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_Loading_chara_1_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Loading_chara_1_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Loading_chara_1_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateOpen, CallFunc_GetSoundManager_SoundManager) == 0x000010, "Member 'WB_ui_Loading_chara_1_C_StateOpen::CallFunc_GetSoundManager_SoundManager' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateOpen, CallFunc_ChangeSoundState_ReturnValue) == 0x000018, "Member 'WB_ui_Loading_chara_1_C_StateOpen::CallFunc_ChangeSoundState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateOpen, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000019, "Member 'WB_ui_Loading_chara_1_C_StateOpen::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");

// Function WB_ui_Loading_chara_1.WB_ui_Loading_chara_1_C.StateLoop
// 0x0020 (0x0020 - 0x0000)
struct WB_ui_Loading_chara_1_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6651[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNextTips_ReturnValue;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6652[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Loading_chara_1_C_StateLoop) == 0x000004, "Wrong alignment on WB_ui_Loading_chara_1_C_StateLoop");
static_assert(sizeof(WB_ui_Loading_chara_1_C_StateLoop) == 0x000020, "Wrong size on WB_ui_Loading_chara_1_C_StateLoop");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_Loading_chara_1_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_Loading_chara_1_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateLoop, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'WB_ui_Loading_chara_1_C_StateLoop::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateLoop, CallFunc_Less_FloatFloat_ReturnValue) == 0x000006, "Member 'WB_ui_Loading_chara_1_C_StateLoop::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue) == 0x000007, "Member 'WB_ui_Loading_chara_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Loading_chara_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateLoop, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'WB_ui_Loading_chara_1_C_StateLoop::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateLoop, CallFunc_BooleanAND_ReturnValue) == 0x00000D, "Member 'WB_ui_Loading_chara_1_C_StateLoop::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateLoop, CallFunc_GetNextTips_ReturnValue) == 0x000010, "Member 'WB_ui_Loading_chara_1_C_StateLoop::CallFunc_GetNextTips_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000014, "Member 'WB_ui_Loading_chara_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000018, "Member 'WB_ui_Loading_chara_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateLoop, CallFunc_BooleanOR_ReturnValue) == 0x00001C, "Member 'WB_ui_Loading_chara_1_C_StateLoop::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WB_ui_Loading_chara_1.WB_ui_Loading_chara_1_C.StateClose
// 0x0020 (0x0020 - 0x0000)
struct WB_ui_Loading_chara_1_C_StateClose final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6653[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SoundManager_C*                     CallFunc_GetSoundManager_SoundManager;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ChangeSoundState_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Loading_chara_1_C_StateClose) == 0x000008, "Wrong alignment on WB_ui_Loading_chara_1_C_StateClose");
static_assert(sizeof(WB_ui_Loading_chara_1_C_StateClose) == 0x000020, "Wrong size on WB_ui_Loading_chara_1_C_StateClose");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateClose, SubState) == 0x000000, "Member 'WB_ui_Loading_chara_1_C_StateClose::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Loading_chara_1_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateClose, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Loading_chara_1_C_StateClose::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_Loading_chara_1_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Loading_chara_1_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Loading_chara_1_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateClose, CallFunc_GetSoundManager_SoundManager) == 0x000010, "Member 'WB_ui_Loading_chara_1_C_StateClose::CallFunc_GetSoundManager_SoundManager' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateClose, CallFunc_ChangeSoundState_ReturnValue) == 0x000018, "Member 'WB_ui_Loading_chara_1_C_StateClose::CallFunc_ChangeSoundState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_StateClose, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000019, "Member 'WB_ui_Loading_chara_1_C_StateClose::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");

// Function WB_ui_Loading_chara_1.WB_ui_Loading_chara_1_C.SetId
// 0x00C0 (0x00C0 - 0x0000)
struct WB_ui_Loading_chara_1_C_SetId final
{
public:
	int32                                         Param_ID;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6654[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDatabaseManager*                       _Manager;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_IntToString_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_IntToString_ReturnValue_1;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue_1;                    // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A8(0x0018)()
};
static_assert(alignof(WB_ui_Loading_chara_1_C_SetId) == 0x000008, "Wrong alignment on WB_ui_Loading_chara_1_C_SetId");
static_assert(sizeof(WB_ui_Loading_chara_1_C_SetId) == 0x0000C0, "Wrong size on WB_ui_Loading_chara_1_C_SetId");
static_assert(offsetof(WB_ui_Loading_chara_1_C_SetId, Param_ID) == 0x000000, "Member 'WB_ui_Loading_chara_1_C_SetId::Param_ID' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_SetId, _Manager) == 0x000008, "Member 'WB_ui_Loading_chara_1_C_SetId::_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_SetId, CallFunc_IntToString_ReturnValue) == 0x000010, "Member 'WB_ui_Loading_chara_1_C_SetId::CallFunc_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_SetId, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'WB_ui_Loading_chara_1_C_SetId::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_SetId, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000030, "Member 'WB_ui_Loading_chara_1_C_SetId::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_SetId, CallFunc_Conv_StringToName_ReturnValue) == 0x000040, "Member 'WB_ui_Loading_chara_1_C_SetId::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_SetId, CallFunc_IntToString_ReturnValue_1) == 0x000048, "Member 'WB_ui_Loading_chara_1_C_SetId::CallFunc_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_SetId, CallFunc_GetText_ReturnValue) == 0x000058, "Member 'WB_ui_Loading_chara_1_C_SetId::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_SetId, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000068, "Member 'WB_ui_Loading_chara_1_C_SetId::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_SetId, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000078, "Member 'WB_ui_Loading_chara_1_C_SetId::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_SetId, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000088, "Member 'WB_ui_Loading_chara_1_C_SetId::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_SetId, CallFunc_GetText_ReturnValue_1) == 0x000090, "Member 'WB_ui_Loading_chara_1_C_SetId::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_SetId, CallFunc_GetDataBaseManager_Manager) == 0x0000A0, "Member 'WB_ui_Loading_chara_1_C_SetId::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_SetId, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A8, "Member 'WB_ui_Loading_chara_1_C_SetId::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WB_ui_Loading_chara_1.WB_ui_Loading_chara_1_C.Create3DScene
// 0x00E0 (0x00E0 - 0x0000)
struct WB_ui_Loading_chara_1_C_Create3DScene final
{
public:
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_UILoading3D_C*                      CallFunc_FinishSpawningActor_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_GetTexture_Texture;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0048(0x0088)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Loading_chara_1_C_Create3DScene) == 0x000010, "Wrong alignment on WB_ui_Loading_chara_1_C_Create3DScene");
static_assert(sizeof(WB_ui_Loading_chara_1_C_Create3DScene) == 0x0000E0, "Wrong size on WB_ui_Loading_chara_1_C_Create3DScene");
static_assert(offsetof(WB_ui_Loading_chara_1_C_Create3DScene, CallFunc_MakeTransform_ReturnValue) == 0x000000, "Member 'WB_ui_Loading_chara_1_C_Create3DScene::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_Create3DScene, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000030, "Member 'WB_ui_Loading_chara_1_C_Create3DScene::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_Create3DScene, CallFunc_FinishSpawningActor_ReturnValue) == 0x000038, "Member 'WB_ui_Loading_chara_1_C_Create3DScene::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_Create3DScene, CallFunc_GetTexture_Texture) == 0x000040, "Member 'WB_ui_Loading_chara_1_C_Create3DScene::CallFunc_GetTexture_Texture' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_Create3DScene, K2Node_MakeStruct_SlateBrush) == 0x000048, "Member 'WB_ui_Loading_chara_1_C_Create3DScene::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WB_ui_Loading_chara_1_C_Create3DScene, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'WB_ui_Loading_chara_1_C_Create3DScene::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WB_ui_Loading_chara_1.WB_ui_Loading_chara_1_C.Release3DScene
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Loading_chara_1_C_Release3DScene final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Loading_chara_1_C_Release3DScene) == 0x000001, "Wrong alignment on WB_ui_Loading_chara_1_C_Release3DScene");
static_assert(sizeof(WB_ui_Loading_chara_1_C_Release3DScene) == 0x000001, "Wrong size on WB_ui_Loading_chara_1_C_Release3DScene");
static_assert(offsetof(WB_ui_Loading_chara_1_C_Release3DScene, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WB_ui_Loading_chara_1_C_Release3DScene::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WB_ui_Loading_chara_1.WB_ui_Loading_chara_1_C.SetTest
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Loading_chara_1_C_SetTest final
{
public:
	bool                                          IsTest;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Loading_chara_1_C_SetTest) == 0x000001, "Wrong alignment on WB_ui_Loading_chara_1_C_SetTest");
static_assert(sizeof(WB_ui_Loading_chara_1_C_SetTest) == 0x000001, "Wrong size on WB_ui_Loading_chara_1_C_SetTest");
static_assert(offsetof(WB_ui_Loading_chara_1_C_SetTest, IsTest) == 0x000000, "Member 'WB_ui_Loading_chara_1_C_SetTest::IsTest' has a wrong offset!");

}

