#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Parts_minimap_icon_goal_2

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_ui_Parts_minimap_icon_goal_2.WB_ui_Parts_minimap_icon_goal_2_C.ExecuteUbergraph_WB_ui_Parts_minimap_icon_goal_2
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Parts_minimap_icon_goal_2_C_ExecuteUbergraph_WB_ui_Parts_minimap_icon_goal_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12DC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Parts_minimap_icon_goal_2_C_ExecuteUbergraph_WB_ui_Parts_minimap_icon_goal_2) == 0x000008, "Wrong alignment on WB_ui_Parts_minimap_icon_goal_2_C_ExecuteUbergraph_WB_ui_Parts_minimap_icon_goal_2");
static_assert(sizeof(WB_ui_Parts_minimap_icon_goal_2_C_ExecuteUbergraph_WB_ui_Parts_minimap_icon_goal_2) == 0x000010, "Wrong size on WB_ui_Parts_minimap_icon_goal_2_C_ExecuteUbergraph_WB_ui_Parts_minimap_icon_goal_2");
static_assert(offsetof(WB_ui_Parts_minimap_icon_goal_2_C_ExecuteUbergraph_WB_ui_Parts_minimap_icon_goal_2, EntryPoint) == 0x000000, "Member 'WB_ui_Parts_minimap_icon_goal_2_C_ExecuteUbergraph_WB_ui_Parts_minimap_icon_goal_2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Parts_minimap_icon_goal_2_C_ExecuteUbergraph_WB_ui_Parts_minimap_icon_goal_2, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WB_ui_Parts_minimap_icon_goal_2_C_ExecuteUbergraph_WB_ui_Parts_minimap_icon_goal_2::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WB_ui_Parts_minimap_icon_goal_2.WB_ui_Parts_minimap_icon_goal_2_C.SetSubquestCompActive
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Parts_minimap_icon_goal_2_C_SetSubquestCompActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetSubquestCompActive_ReturnValue;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12DD[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Parts_minimap_icon_goal_2_C_SetSubquestCompActive) == 0x000008, "Wrong alignment on WB_ui_Parts_minimap_icon_goal_2_C_SetSubquestCompActive");
static_assert(sizeof(WB_ui_Parts_minimap_icon_goal_2_C_SetSubquestCompActive) == 0x000010, "Wrong size on WB_ui_Parts_minimap_icon_goal_2_C_SetSubquestCompActive");
static_assert(offsetof(WB_ui_Parts_minimap_icon_goal_2_C_SetSubquestCompActive, ReturnValue) == 0x000000, "Member 'WB_ui_Parts_minimap_icon_goal_2_C_SetSubquestCompActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Parts_minimap_icon_goal_2_C_SetSubquestCompActive, CallFunc_SetSubquestCompActive_ReturnValue) == 0x000001, "Member 'WB_ui_Parts_minimap_icon_goal_2_C_SetSubquestCompActive::CallFunc_SetSubquestCompActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Parts_minimap_icon_goal_2_C_SetSubquestCompActive, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WB_ui_Parts_minimap_icon_goal_2_C_SetSubquestCompActive::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WB_ui_Parts_minimap_icon_goal_2.WB_ui_Parts_minimap_icon_goal_2_C.SetSubquestActive
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Parts_minimap_icon_goal_2_C_SetSubquestActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetSubquestActive_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12DE[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Parts_minimap_icon_goal_2_C_SetSubquestActive) == 0x000008, "Wrong alignment on WB_ui_Parts_minimap_icon_goal_2_C_SetSubquestActive");
static_assert(sizeof(WB_ui_Parts_minimap_icon_goal_2_C_SetSubquestActive) == 0x000010, "Wrong size on WB_ui_Parts_minimap_icon_goal_2_C_SetSubquestActive");
static_assert(offsetof(WB_ui_Parts_minimap_icon_goal_2_C_SetSubquestActive, ReturnValue) == 0x000000, "Member 'WB_ui_Parts_minimap_icon_goal_2_C_SetSubquestActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Parts_minimap_icon_goal_2_C_SetSubquestActive, CallFunc_SetSubquestActive_ReturnValue) == 0x000001, "Member 'WB_ui_Parts_minimap_icon_goal_2_C_SetSubquestActive::CallFunc_SetSubquestActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Parts_minimap_icon_goal_2_C_SetSubquestActive, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WB_ui_Parts_minimap_icon_goal_2_C_SetSubquestActive::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

