#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Quest_Main_Parts_1

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Quest_Main_Parts_1.WB_ui_Quest_Main_Parts_1_C.ExecuteUbergraph_WB_ui_Quest_Main_Parts_1
// 0x0048 (0x0048 - 0x0000)
struct WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_progressIndex;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B80[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B81[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B82[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTextBlock*>                     K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B83[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1) == 0x000008, "Wrong alignment on WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1");
static_assert(sizeof(WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1) == 0x000048, "Wrong size on WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1");
static_assert(offsetof(WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1, EntryPoint) == 0x000000, "Member 'WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1, Temp_int_Loop_Num_Variable) == 0x000008, "Member 'WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1, K2Node_Event_State) == 0x00000C, "Member 'WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1, K2Node_Event_SubState) == 0x000010, "Member 'WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1, K2Node_Event_progressIndex) == 0x000018, "Member 'WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1::K2Node_Event_progressIndex' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1, K2Node_SwitchInteger_CmpSuccess) == 0x00001C, "Member 'WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1, K2Node_Event_IsDesignTime) == 0x00002C, "Member 'WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1, K2Node_MakeArray_Array) == 0x000030, "Member 'WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1, CallFunc_GetPlatformType_ReturnValue) == 0x000040, "Member 'WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000041, "Member 'WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'WB_ui_Quest_Main_Parts_1_C_ExecuteUbergraph_WB_ui_Quest_Main_Parts_1::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function WB_ui_Quest_Main_Parts_1.WB_ui_Quest_Main_Parts_1_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Quest_Main_Parts_1_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Quest_Main_Parts_1_C_PreConstruct) == 0x000001, "Wrong alignment on WB_ui_Quest_Main_Parts_1_C_PreConstruct");
static_assert(sizeof(WB_ui_Quest_Main_Parts_1_C_PreConstruct) == 0x000001, "Wrong size on WB_ui_Quest_Main_Parts_1_C_PreConstruct");
static_assert(offsetof(WB_ui_Quest_Main_Parts_1_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_ui_Quest_Main_Parts_1_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_ui_Quest_Main_Parts_1.WB_ui_Quest_Main_Parts_1_C.SetProgressIcon
// 0x0004 (0x0004 - 0x0000)
struct WB_ui_Quest_Main_Parts_1_C_SetProgressIcon final
{
public:
	int32                                         ProgressIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Quest_Main_Parts_1_C_SetProgressIcon) == 0x000004, "Wrong alignment on WB_ui_Quest_Main_Parts_1_C_SetProgressIcon");
static_assert(sizeof(WB_ui_Quest_Main_Parts_1_C_SetProgressIcon) == 0x000004, "Wrong size on WB_ui_Quest_Main_Parts_1_C_SetProgressIcon");
static_assert(offsetof(WB_ui_Quest_Main_Parts_1_C_SetProgressIcon, ProgressIndex) == 0x000000, "Member 'WB_ui_Quest_Main_Parts_1_C_SetProgressIcon::ProgressIndex' has a wrong offset!");

// Function WB_ui_Quest_Main_Parts_1.WB_ui_Quest_Main_Parts_1_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Quest_Main_Parts_1_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Quest_Main_Parts_1_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Quest_Main_Parts_1_C_UpdateState");
static_assert(sizeof(WB_ui_Quest_Main_Parts_1_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Quest_Main_Parts_1_C_UpdateState");
static_assert(offsetof(WB_ui_Quest_Main_Parts_1_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Quest_Main_Parts_1_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Main_Parts_1_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Quest_Main_Parts_1_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Quest_Main_Parts_1_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Quest_Main_Parts_1_C_UpdateState::DeltaSeconds' has a wrong offset!");

}

