#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_EndCredits

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_EndCredits.WB_ui_EndCredits_C
// 0x0160 (0x3EF0 - 0x3D90)
class UWB_ui_EndCredits_C final : public UUICredit
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x3D90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default;                                           // 0x3D98(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               CorporateNamePlusOfficial;                         // 0x3DA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_logo_1;                                        // 0x3DA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Logo;                                              // 0x3DB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OfficialStar2PlusStaffNameStar2;                   // 0x3DB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OfficialPlusStaffName;                             // 0x3DC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OfficialPlusStaffNameStar2;                        // 0x3DC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_2;                                         // 0x3DD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SpacePlusStaffName;                                // 0x3DD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SpacePlusStaffNameStar2;                           // 0x3DE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer;                                            // 0x3DE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_1;                                          // 0x3DF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_2;                                          // 0x3DF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_3;                                          // 0x3E00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_4;                                          // 0x3E08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_5;                                          // 0x3E10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_6;                                          // 0x3E18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_8;                                          // 0x3E20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_9;                                          // 0x3E28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_125;                                        // 0x3E30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               StaffName;                                         // 0x3E38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               StaffNameStar2;                                    // 0x3E40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               StaffNameStar4;                                    // 0x3E48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_EndCredits_1;                                 // 0x3E50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_EndCredits_2;                                 // 0x3E58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_EndCredits_3;                                 // 0x3E60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_EndCredits_4;                                 // 0x3E68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_EndCredits_5;                                 // 0x3E70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_EndCredits_6;                                 // 0x3E78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_EndCredits_7;                                 // 0x3E80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_EndCredits_8;                                 // 0x3E88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_EndCredits_9;                                 // 0x3E90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_EndCredits_10;                                // 0x3E98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_EndCredits_11;                                // 0x3EA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_EndCredits_12;                                // 0x3EA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_EndCredits_13;                                // 0x3EB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_EndCredits_14;                                // 0x3EB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_EndCredits_15;                                // 0x3EC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_EndCredits_16;                                // 0x3EC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_EndCredits_17;                                // 0x3ED0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_EndCredits_18;                                // 0x3ED8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_EndCredits_19;                                // 0x3EE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_EndCredits_20;                                // 0x3EE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_EndCredits(int32 EntryPoint);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_EndCredits_C">();
	}
	static class UWB_ui_EndCredits_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_EndCredits_C>();
	}
};
static_assert(alignof(UWB_ui_EndCredits_C) == 0x000008, "Wrong alignment on UWB_ui_EndCredits_C");
static_assert(sizeof(UWB_ui_EndCredits_C) == 0x003EF0, "Wrong size on UWB_ui_EndCredits_C");
static_assert(offsetof(UWB_ui_EndCredits_C, UberGraphFrame) == 0x003D90, "Member 'UWB_ui_EndCredits_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Default) == 0x003D98, "Member 'UWB_ui_EndCredits_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, CorporateNamePlusOfficial) == 0x003DA0, "Member 'UWB_ui_EndCredits_C::CorporateNamePlusOfficial' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Img_logo_1) == 0x003DA8, "Member 'UWB_ui_EndCredits_C::Img_logo_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Logo) == 0x003DB0, "Member 'UWB_ui_EndCredits_C::Logo' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, OfficialStar2PlusStaffNameStar2) == 0x003DB8, "Member 'UWB_ui_EndCredits_C::OfficialStar2PlusStaffNameStar2' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, OfficialPlusStaffName) == 0x003DC0, "Member 'UWB_ui_EndCredits_C::OfficialPlusStaffName' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, OfficialPlusStaffNameStar2) == 0x003DC8, "Member 'UWB_ui_EndCredits_C::OfficialPlusStaffNameStar2' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Overlay_2) == 0x003DD0, "Member 'UWB_ui_EndCredits_C::Overlay_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, SpacePlusStaffName) == 0x003DD8, "Member 'UWB_ui_EndCredits_C::SpacePlusStaffName' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, SpacePlusStaffNameStar2) == 0x003DE0, "Member 'UWB_ui_EndCredits_C::SpacePlusStaffNameStar2' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Spacer) == 0x003DE8, "Member 'UWB_ui_EndCredits_C::Spacer' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Spacer_1) == 0x003DF0, "Member 'UWB_ui_EndCredits_C::Spacer_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Spacer_2) == 0x003DF8, "Member 'UWB_ui_EndCredits_C::Spacer_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Spacer_3) == 0x003E00, "Member 'UWB_ui_EndCredits_C::Spacer_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Spacer_4) == 0x003E08, "Member 'UWB_ui_EndCredits_C::Spacer_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Spacer_5) == 0x003E10, "Member 'UWB_ui_EndCredits_C::Spacer_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Spacer_6) == 0x003E18, "Member 'UWB_ui_EndCredits_C::Spacer_6' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Spacer_8) == 0x003E20, "Member 'UWB_ui_EndCredits_C::Spacer_8' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Spacer_9) == 0x003E28, "Member 'UWB_ui_EndCredits_C::Spacer_9' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Spacer_125) == 0x003E30, "Member 'UWB_ui_EndCredits_C::Spacer_125' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, StaffName) == 0x003E38, "Member 'UWB_ui_EndCredits_C::StaffName' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, StaffNameStar2) == 0x003E40, "Member 'UWB_ui_EndCredits_C::StaffNameStar2' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, StaffNameStar4) == 0x003E48, "Member 'UWB_ui_EndCredits_C::StaffNameStar4' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Text_EndCredits_1) == 0x003E50, "Member 'UWB_ui_EndCredits_C::Text_EndCredits_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Text_EndCredits_2) == 0x003E58, "Member 'UWB_ui_EndCredits_C::Text_EndCredits_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Text_EndCredits_3) == 0x003E60, "Member 'UWB_ui_EndCredits_C::Text_EndCredits_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Text_EndCredits_4) == 0x003E68, "Member 'UWB_ui_EndCredits_C::Text_EndCredits_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Text_EndCredits_5) == 0x003E70, "Member 'UWB_ui_EndCredits_C::Text_EndCredits_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Text_EndCredits_6) == 0x003E78, "Member 'UWB_ui_EndCredits_C::Text_EndCredits_6' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Text_EndCredits_7) == 0x003E80, "Member 'UWB_ui_EndCredits_C::Text_EndCredits_7' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Text_EndCredits_8) == 0x003E88, "Member 'UWB_ui_EndCredits_C::Text_EndCredits_8' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Text_EndCredits_9) == 0x003E90, "Member 'UWB_ui_EndCredits_C::Text_EndCredits_9' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Text_EndCredits_10) == 0x003E98, "Member 'UWB_ui_EndCredits_C::Text_EndCredits_10' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Text_EndCredits_11) == 0x003EA0, "Member 'UWB_ui_EndCredits_C::Text_EndCredits_11' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Text_EndCredits_12) == 0x003EA8, "Member 'UWB_ui_EndCredits_C::Text_EndCredits_12' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Text_EndCredits_13) == 0x003EB0, "Member 'UWB_ui_EndCredits_C::Text_EndCredits_13' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Text_EndCredits_14) == 0x003EB8, "Member 'UWB_ui_EndCredits_C::Text_EndCredits_14' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Text_EndCredits_15) == 0x003EC0, "Member 'UWB_ui_EndCredits_C::Text_EndCredits_15' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Text_EndCredits_16) == 0x003EC8, "Member 'UWB_ui_EndCredits_C::Text_EndCredits_16' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Text_EndCredits_17) == 0x003ED0, "Member 'UWB_ui_EndCredits_C::Text_EndCredits_17' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Text_EndCredits_18) == 0x003ED8, "Member 'UWB_ui_EndCredits_C::Text_EndCredits_18' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Text_EndCredits_19) == 0x003EE0, "Member 'UWB_ui_EndCredits_C::Text_EndCredits_19' has a wrong offset!");
static_assert(offsetof(UWB_ui_EndCredits_C, Text_EndCredits_20) == 0x003EE8, "Member 'UWB_ui_EndCredits_C::Text_EndCredits_20' has a wrong offset!");

}

