#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_PK_object_timer_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_PK_object_timer_1.WB_ui_PK_object_timer_1_C
// 0x0038 (0x0400 - 0x03C8)
class UWB_ui_PK_object_timer_1_C final : public UUIPkObjectTimer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Bar_1;                                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bar_1_add;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Bmap_icon_bp_1_num;                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_PK_object_timer_1(int32 EntryPoint);
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_PK_object_timer_1_C">();
	}
	static class UWB_ui_PK_object_timer_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_PK_object_timer_1_C>();
	}
};
static_assert(alignof(UWB_ui_PK_object_timer_1_C) == 0x000008, "Wrong alignment on UWB_ui_PK_object_timer_1_C");
static_assert(sizeof(UWB_ui_PK_object_timer_1_C) == 0x000400, "Wrong size on UWB_ui_PK_object_timer_1_C");
static_assert(offsetof(UWB_ui_PK_object_timer_1_C, UberGraphFrame) == 0x0003C8, "Member 'UWB_ui_PK_object_timer_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_object_timer_1_C, Out) == 0x0003D0, "Member 'UWB_ui_PK_object_timer_1_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_object_timer_1_C, In) == 0x0003D8, "Member 'UWB_ui_PK_object_timer_1_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_object_timer_1_C, Default) == 0x0003E0, "Member 'UWB_ui_PK_object_timer_1_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_object_timer_1_C, Bar_1) == 0x0003E8, "Member 'UWB_ui_PK_object_timer_1_C::Bar_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_object_timer_1_C, Bar_1_add) == 0x0003F0, "Member 'UWB_ui_PK_object_timer_1_C::Bar_1_add' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_object_timer_1_C, Text_Bmap_icon_bp_1_num) == 0x0003F8, "Member 'UWB_ui_PK_object_timer_1_C::Text_Bmap_icon_bp_1_num' has a wrong offset!");

}

