#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Quest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Quest.WB_ui_Quest_C
// 0x00D8 (0x12B8 - 0x11E0)
class UWB_ui_Quest_C final : public UUIQuestMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x11E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Info_window_out;                                   // 0x11E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Info_window_in;                                    // 0x11F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Info_window;                                       // 0x11F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x1200(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x1208(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x1210(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_1;                                     // 0x1218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_ViewRange;                             // 0x1220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               List_Set;                                          // 0x1228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_2;                                         // 0x1230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                PG_All_Color;                                      // 0x1238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PG_Cover_Black;                                    // 0x1240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Quest_List_Color;                                  // 0x1248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDRetainerBox*                        REDRetainerBox_Menu;                               // 0x1250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDScrollBox*                          ScrollBox_ShopList;                                // 0x1258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MainChoice_Parts_1_C*            WB_ui_MainChoice_Parts_1;                          // 0x1260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MainContents_Parts_4_C*          WB_ui_MainContents_Parts_4;                        // 0x1268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MainContents_Parts_5_C*          WB_ui_MainContents_Parts_5;                        // 0x1270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MainContents_Parts_6_C*          WB_ui_MainContents_Parts_6_1;                      // 0x1278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MainContents_Parts_6_C*          WB_ui_MainContents_Parts_6_2;                      // 0x1280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MainContents_Parts_6_C*          WB_ui_MainContents_Parts_6_3;                      // 0x1288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Quest_Bond_Parts_1_C*            WB_ui_Quest_Bond_Parts_1;                          // 0x1290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Quest_Main_Parts_1_C*            WB_ui_Quest_Main_Parts_1;                          // 0x1298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Quest_Parts_1_C*                 WB_ui_Quest_Parts_1_1;                             // 0x12A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Quest_PopUp_1_C*                 WB_ui_Quest_PopUp_1;                               // 0x12A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Quest_Sub_Parts_1_C*             WB_ui_Quest_Sub_Parts_1;                           // 0x12B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Quest(int32 EntryPoint);
	void ListUnFocusMouse(int32 IsMouseScroll, int32 Param_Index, class UUserWidget* Widget);
	void ListFocusMouse(int32 IsMouseScroll, int32 Param_Index, class UUserWidget* Widget);
	void OnInitialized();
	void ListFocus(class UUserWidget* Widget);
	void ListUnFocus(class UUserWidget* Widget);
	void ListUpdateElement(int32 Param_Index, class UUserWidget* Widget);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	bool IsEndErrorPopup();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Quest_C">();
	}
	static class UWB_ui_Quest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Quest_C>();
	}
};
static_assert(alignof(UWB_ui_Quest_C) == 0x000008, "Wrong alignment on UWB_ui_Quest_C");
static_assert(sizeof(UWB_ui_Quest_C) == 0x0012B8, "Wrong size on UWB_ui_Quest_C");
static_assert(offsetof(UWB_ui_Quest_C, UberGraphFrame) == 0x0011E0, "Member 'UWB_ui_Quest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, Info_window_out) == 0x0011E8, "Member 'UWB_ui_Quest_C::Info_window_out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, Info_window_in) == 0x0011F0, "Member 'UWB_ui_Quest_C::Info_window_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, Info_window) == 0x0011F8, "Member 'UWB_ui_Quest_C::Info_window' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, Out) == 0x001200, "Member 'UWB_ui_Quest_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, In) == 0x001208, "Member 'UWB_ui_Quest_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, Default) == 0x001210, "Member 'UWB_ui_Quest_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, CanvasPanel_1) == 0x001218, "Member 'UWB_ui_Quest_C::CanvasPanel_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, CanvasPanel_ViewRange) == 0x001220, "Member 'UWB_ui_Quest_C::CanvasPanel_ViewRange' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, List_Set) == 0x001228, "Member 'UWB_ui_Quest_C::List_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, Overlay_2) == 0x001230, "Member 'UWB_ui_Quest_C::Overlay_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, PG_All_Color) == 0x001238, "Member 'UWB_ui_Quest_C::PG_All_Color' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, PG_Cover_Black) == 0x001240, "Member 'UWB_ui_Quest_C::PG_Cover_Black' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, Quest_List_Color) == 0x001248, "Member 'UWB_ui_Quest_C::Quest_List_Color' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, REDRetainerBox_Menu) == 0x001250, "Member 'UWB_ui_Quest_C::REDRetainerBox_Menu' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, ScrollBox_ShopList) == 0x001258, "Member 'UWB_ui_Quest_C::ScrollBox_ShopList' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, WB_ui_MainChoice_Parts_1) == 0x001260, "Member 'UWB_ui_Quest_C::WB_ui_MainChoice_Parts_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, WB_ui_MainContents_Parts_4) == 0x001268, "Member 'UWB_ui_Quest_C::WB_ui_MainContents_Parts_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, WB_ui_MainContents_Parts_5) == 0x001270, "Member 'UWB_ui_Quest_C::WB_ui_MainContents_Parts_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, WB_ui_MainContents_Parts_6_1) == 0x001278, "Member 'UWB_ui_Quest_C::WB_ui_MainContents_Parts_6_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, WB_ui_MainContents_Parts_6_2) == 0x001280, "Member 'UWB_ui_Quest_C::WB_ui_MainContents_Parts_6_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, WB_ui_MainContents_Parts_6_3) == 0x001288, "Member 'UWB_ui_Quest_C::WB_ui_MainContents_Parts_6_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, WB_ui_Quest_Bond_Parts_1) == 0x001290, "Member 'UWB_ui_Quest_C::WB_ui_Quest_Bond_Parts_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, WB_ui_Quest_Main_Parts_1) == 0x001298, "Member 'UWB_ui_Quest_C::WB_ui_Quest_Main_Parts_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, WB_ui_Quest_Parts_1_1) == 0x0012A0, "Member 'UWB_ui_Quest_C::WB_ui_Quest_Parts_1_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, WB_ui_Quest_PopUp_1) == 0x0012A8, "Member 'UWB_ui_Quest_C::WB_ui_Quest_PopUp_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_C, WB_ui_Quest_Sub_Parts_1) == 0x0012B0, "Member 'UWB_ui_Quest_C::WB_ui_Quest_Sub_Parts_1' has a wrong offset!");

}

