#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_PhotoMode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_PhotoMode.WB_ui_PhotoMode_C
// 0x0180 (0x06A8 - 0x0528)
class UWB_ui_PhotoMode_C final : public UUIPhotoMode
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out_2;                                             // 0x0530(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_2_1;                                        // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_1_2;                                        // 0x0540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_2;                                         // 0x0548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out_1;                                             // 0x0550(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_1;                                              // 0x0558(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_1;                                         // 0x0560(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font_Menu_1;                                  // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font_Operation_1;                             // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font_Operation_2;                             // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font_Operation_3;                             // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font_Operation_4;                             // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font_Operation_5;                             // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font_Operation_6;                             // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font_UI_1;                                    // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Menu_Base;                                         // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Menu_Frame_1;                                      // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Menu_Guide_Set;                                    // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Menu_Set;                                          // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer;                                            // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_130;                                        // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_MenuGuide_1;                                  // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_OperationGuide_1;                             // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_OperationGuide_2;                             // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_OperationGuide_3;                             // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_OperationGuide_4;                             // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_OperationGuide_5;                             // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_OperationGuide_6;                             // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Text_OperationGuide_Set_1;                         // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Text_OperationGuide_Set_2;                         // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Text_OperationGuide_Set_3;                         // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Text_OperationGuide_Set_4;                         // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Text_OperationGuide_Set_5;                         // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Text_OperationGuide_Set_6;                         // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_UIGuide_1;                                    // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                UI_Guide_Set;                                      // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_OperationGuide;                        // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_PhotoMode_Parts_1_C*             WB_ui_PhotoMode_Parts_1;                           // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_PhotoMode_Parts_2_C*             WB_ui_PhotoMode_Parts_2_1;                         // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_PhotoMode_Parts_2_C*             WB_ui_PhotoMode_Parts_2_2;                         // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_PhotoMode_Parts_2_C*             WB_ui_PhotoMode_Parts_2_3;                         // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_PhotoMode_Parts_2_C*             WB_ui_PhotoMode_Parts_2_4;                         // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_PhotoMode_Parts_2_C*             WB_ui_PhotoMode_Parts_2_5;                         // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_PhotoMode_Parts_2_C*             WB_ui_PhotoMode_Parts_2_6;                         // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_PhotoMode_Parts_2_C*             WB_ui_PhotoMode_Parts_2_7;                         // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_PhotoMode_Parts_3_C*             WB_ui_PhotoMode_Parts_3_1;                         // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_PhotoMode_Parts_3_C*             WB_ui_PhotoMode_Parts_3_2;                         // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_PhotoMode(int32 EntryPoint);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_PhotoMode_C">();
	}
	static class UWB_ui_PhotoMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_PhotoMode_C>();
	}
};
static_assert(alignof(UWB_ui_PhotoMode_C) == 0x000008, "Wrong alignment on UWB_ui_PhotoMode_C");
static_assert(sizeof(UWB_ui_PhotoMode_C) == 0x0006A8, "Wrong size on UWB_ui_PhotoMode_C");
static_assert(offsetof(UWB_ui_PhotoMode_C, UberGraphFrame) == 0x000528, "Member 'UWB_ui_PhotoMode_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Out_2) == 0x000530, "Member 'UWB_ui_PhotoMode_C::Out_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Change_2_1) == 0x000538, "Member 'UWB_ui_PhotoMode_C::Change_2_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Change_1_2) == 0x000540, "Member 'UWB_ui_PhotoMode_C::Change_1_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Default_2) == 0x000548, "Member 'UWB_ui_PhotoMode_C::Default_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Out_1) == 0x000550, "Member 'UWB_ui_PhotoMode_C::Out_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, In_1) == 0x000558, "Member 'UWB_ui_PhotoMode_C::In_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Default_1) == 0x000560, "Member 'UWB_ui_PhotoMode_C::Default_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Icon_font_Menu_1) == 0x000568, "Member 'UWB_ui_PhotoMode_C::Icon_font_Menu_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Icon_font_Operation_1) == 0x000570, "Member 'UWB_ui_PhotoMode_C::Icon_font_Operation_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Icon_font_Operation_2) == 0x000578, "Member 'UWB_ui_PhotoMode_C::Icon_font_Operation_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Icon_font_Operation_3) == 0x000580, "Member 'UWB_ui_PhotoMode_C::Icon_font_Operation_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Icon_font_Operation_4) == 0x000588, "Member 'UWB_ui_PhotoMode_C::Icon_font_Operation_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Icon_font_Operation_5) == 0x000590, "Member 'UWB_ui_PhotoMode_C::Icon_font_Operation_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Icon_font_Operation_6) == 0x000598, "Member 'UWB_ui_PhotoMode_C::Icon_font_Operation_6' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Icon_font_UI_1) == 0x0005A0, "Member 'UWB_ui_PhotoMode_C::Icon_font_UI_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Menu_Base) == 0x0005A8, "Member 'UWB_ui_PhotoMode_C::Menu_Base' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Menu_Frame_1) == 0x0005B0, "Member 'UWB_ui_PhotoMode_C::Menu_Frame_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Menu_Guide_Set) == 0x0005B8, "Member 'UWB_ui_PhotoMode_C::Menu_Guide_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Menu_Set) == 0x0005C0, "Member 'UWB_ui_PhotoMode_C::Menu_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Spacer) == 0x0005C8, "Member 'UWB_ui_PhotoMode_C::Spacer' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Spacer_130) == 0x0005D0, "Member 'UWB_ui_PhotoMode_C::Spacer_130' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Text_MenuGuide_1) == 0x0005D8, "Member 'UWB_ui_PhotoMode_C::Text_MenuGuide_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Text_OperationGuide_1) == 0x0005E0, "Member 'UWB_ui_PhotoMode_C::Text_OperationGuide_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Text_OperationGuide_2) == 0x0005E8, "Member 'UWB_ui_PhotoMode_C::Text_OperationGuide_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Text_OperationGuide_3) == 0x0005F0, "Member 'UWB_ui_PhotoMode_C::Text_OperationGuide_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Text_OperationGuide_4) == 0x0005F8, "Member 'UWB_ui_PhotoMode_C::Text_OperationGuide_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Text_OperationGuide_5) == 0x000600, "Member 'UWB_ui_PhotoMode_C::Text_OperationGuide_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Text_OperationGuide_6) == 0x000608, "Member 'UWB_ui_PhotoMode_C::Text_OperationGuide_6' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Text_OperationGuide_Set_1) == 0x000610, "Member 'UWB_ui_PhotoMode_C::Text_OperationGuide_Set_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Text_OperationGuide_Set_2) == 0x000618, "Member 'UWB_ui_PhotoMode_C::Text_OperationGuide_Set_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Text_OperationGuide_Set_3) == 0x000620, "Member 'UWB_ui_PhotoMode_C::Text_OperationGuide_Set_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Text_OperationGuide_Set_4) == 0x000628, "Member 'UWB_ui_PhotoMode_C::Text_OperationGuide_Set_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Text_OperationGuide_Set_5) == 0x000630, "Member 'UWB_ui_PhotoMode_C::Text_OperationGuide_Set_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Text_OperationGuide_Set_6) == 0x000638, "Member 'UWB_ui_PhotoMode_C::Text_OperationGuide_Set_6' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, Text_UIGuide_1) == 0x000640, "Member 'UWB_ui_PhotoMode_C::Text_UIGuide_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, UI_Guide_Set) == 0x000648, "Member 'UWB_ui_PhotoMode_C::UI_Guide_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, VerticalBox_OperationGuide) == 0x000650, "Member 'UWB_ui_PhotoMode_C::VerticalBox_OperationGuide' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, WB_ui_PhotoMode_Parts_1) == 0x000658, "Member 'UWB_ui_PhotoMode_C::WB_ui_PhotoMode_Parts_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, WB_ui_PhotoMode_Parts_2_1) == 0x000660, "Member 'UWB_ui_PhotoMode_C::WB_ui_PhotoMode_Parts_2_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, WB_ui_PhotoMode_Parts_2_2) == 0x000668, "Member 'UWB_ui_PhotoMode_C::WB_ui_PhotoMode_Parts_2_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, WB_ui_PhotoMode_Parts_2_3) == 0x000670, "Member 'UWB_ui_PhotoMode_C::WB_ui_PhotoMode_Parts_2_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, WB_ui_PhotoMode_Parts_2_4) == 0x000678, "Member 'UWB_ui_PhotoMode_C::WB_ui_PhotoMode_Parts_2_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, WB_ui_PhotoMode_Parts_2_5) == 0x000680, "Member 'UWB_ui_PhotoMode_C::WB_ui_PhotoMode_Parts_2_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, WB_ui_PhotoMode_Parts_2_6) == 0x000688, "Member 'UWB_ui_PhotoMode_C::WB_ui_PhotoMode_Parts_2_6' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, WB_ui_PhotoMode_Parts_2_7) == 0x000690, "Member 'UWB_ui_PhotoMode_C::WB_ui_PhotoMode_Parts_2_7' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, WB_ui_PhotoMode_Parts_3_1) == 0x000698, "Member 'UWB_ui_PhotoMode_C::WB_ui_PhotoMode_Parts_3_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_PhotoMode_C, WB_ui_PhotoMode_Parts_3_2) == 0x0006A0, "Member 'UWB_ui_PhotoMode_C::WB_ui_PhotoMode_Parts_3_2' has a wrong offset!");

}

