#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_MapGuide

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_MapGuide.WB_ui_MapGuide_C
// 0x0038 (0x03C0 - 0x0388)
class UWB_ui_MapGuide_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               All;                                               // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MapGuide_Parts_1_C*              WB_ui_MapGuide_Parts_1;                            // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MapGuide_Parts_1_C*              WB_ui_MapGuide_Parts_2;                            // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MapGuide_Parts_1_C*              WB_ui_MapGuide_Parts_3;                            // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWB_ui_MapGuide_Parts_1_C*>      PartsList;                                         // 0x03B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_MapGuide(int32 EntryPoint);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void OnInitialized();
	void StateNone(int32 SubState);
	void StateLoop(int32 SubState);
	void SetupGuide();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_MapGuide_C">();
	}
	static class UWB_ui_MapGuide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_MapGuide_C>();
	}
};
static_assert(alignof(UWB_ui_MapGuide_C) == 0x000008, "Wrong alignment on UWB_ui_MapGuide_C");
static_assert(sizeof(UWB_ui_MapGuide_C) == 0x0003C0, "Wrong size on UWB_ui_MapGuide_C");
static_assert(offsetof(UWB_ui_MapGuide_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_MapGuide_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_MapGuide_C, All) == 0x000390, "Member 'UWB_ui_MapGuide_C::All' has a wrong offset!");
static_assert(offsetof(UWB_ui_MapGuide_C, WB_ui_MapGuide_Parts_1) == 0x000398, "Member 'UWB_ui_MapGuide_C::WB_ui_MapGuide_Parts_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_MapGuide_C, WB_ui_MapGuide_Parts_2) == 0x0003A0, "Member 'UWB_ui_MapGuide_C::WB_ui_MapGuide_Parts_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_MapGuide_C, WB_ui_MapGuide_Parts_3) == 0x0003A8, "Member 'UWB_ui_MapGuide_C::WB_ui_MapGuide_Parts_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_MapGuide_C, PartsList) == 0x0003B0, "Member 'UWB_ui_MapGuide_C::PartsList' has a wrong offset!");

}

