#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Parts_minimap_icon_north_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Parts_minimap_icon_north_1.WB_ui_Parts_minimap_icon_north_1_C
// 0x0020 (0x0250 - 0x0230)
class UWB_ui_Parts_minimap_icon_north_1_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default;                                           // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Icon_north;                                        // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_north_add;                                    // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Parts_minimap_icon_north_1(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Parts_minimap_icon_north_1_C">();
	}
	static class UWB_ui_Parts_minimap_icon_north_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Parts_minimap_icon_north_1_C>();
	}
};
static_assert(alignof(UWB_ui_Parts_minimap_icon_north_1_C) == 0x000008, "Wrong alignment on UWB_ui_Parts_minimap_icon_north_1_C");
static_assert(sizeof(UWB_ui_Parts_minimap_icon_north_1_C) == 0x000250, "Wrong size on UWB_ui_Parts_minimap_icon_north_1_C");
static_assert(offsetof(UWB_ui_Parts_minimap_icon_north_1_C, UberGraphFrame) == 0x000230, "Member 'UWB_ui_Parts_minimap_icon_north_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Parts_minimap_icon_north_1_C, Default) == 0x000238, "Member 'UWB_ui_Parts_minimap_icon_north_1_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Parts_minimap_icon_north_1_C, Icon_north) == 0x000240, "Member 'UWB_ui_Parts_minimap_icon_north_1_C::Icon_north' has a wrong offset!");
static_assert(offsetof(UWB_ui_Parts_minimap_icon_north_1_C, Icon_north_add) == 0x000248, "Member 'UWB_ui_Parts_minimap_icon_north_1_C::Icon_north_add' has a wrong offset!");

}

