#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Enemy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Enemy.WB_ui_Enemy_C
// 0x0058 (0x04A8 - 0x0450)
class UWB_ui_Enemy_C final : public UUIEnemyBooks
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DefaultNone;                                       // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               All_Set;                                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_ViewRange;                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Info_Set;                                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDScrollBox*                          RedScrollBox_EnemyName;                            // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Enemy_Info_Parts_1_C*            WB_ui_Enemy_Info_Parts_1;                          // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Enemy_List_Parts_1_C*            WB_ui_Enemy_List_Parts_1;                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Enemy(int32 EntryPoint);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void ListUnFocusMouse(int32 IsMouseScroll, int32 Param_Index, class UUserWidget* Widget);
	void ListFocusMouse(int32 IsMouseScroll, int32 Param_Index, class UUserWidget* Widget);
	void Destruct();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void ListUnFocus(class UUserWidget* Widget);
	void ListFocus(class UUserWidget* Widget);
	void ListUpdateElement(int32 Param_Index, class UUserWidget* Widget);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Enemy_C">();
	}
	static class UWB_ui_Enemy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Enemy_C>();
	}
};
static_assert(alignof(UWB_ui_Enemy_C) == 0x000008, "Wrong alignment on UWB_ui_Enemy_C");
static_assert(sizeof(UWB_ui_Enemy_C) == 0x0004A8, "Wrong size on UWB_ui_Enemy_C");
static_assert(offsetof(UWB_ui_Enemy_C, UberGraphFrame) == 0x000450, "Member 'UWB_ui_Enemy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_C, DefaultNone) == 0x000458, "Member 'UWB_ui_Enemy_C::DefaultNone' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_C, Out) == 0x000460, "Member 'UWB_ui_Enemy_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_C, In) == 0x000468, "Member 'UWB_ui_Enemy_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_C, Default) == 0x000470, "Member 'UWB_ui_Enemy_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_C, All_Set) == 0x000478, "Member 'UWB_ui_Enemy_C::All_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_C, CanvasPanel_ViewRange) == 0x000480, "Member 'UWB_ui_Enemy_C::CanvasPanel_ViewRange' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_C, Info_Set) == 0x000488, "Member 'UWB_ui_Enemy_C::Info_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_C, RedScrollBox_EnemyName) == 0x000490, "Member 'UWB_ui_Enemy_C::RedScrollBox_EnemyName' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_C, WB_ui_Enemy_Info_Parts_1) == 0x000498, "Member 'UWB_ui_Enemy_C::WB_ui_Enemy_Info_Parts_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_C, WB_ui_Enemy_List_Parts_1) == 0x0004A0, "Member 'UWB_ui_Enemy_C::WB_ui_Enemy_List_Parts_1' has a wrong offset!");

}

