#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_SasLink_skill_parts_1

#include "Basic.hpp"

#include "E_SASKind_structs.hpp"
#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_SasLink_skill_parts_1.WB_ui_SasLink_skill_parts_1_C
// 0x0038 (0x03C0 - 0x0388)
class UWB_ui_SasLink_skill_parts_1_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Unselect;                                          // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 base_bond;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_saslink_bond_2_num;                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_saslink_sasname_2;                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          FlagUnSelect;                                      // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          FlagCurrentUnSelect;                               // 0x03B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_ui_SasLink_skill_parts_1(int32 EntryPoint);
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void StateNone(int32 SubState);
	void StateLoop(int32 SubState);
	void SetUnSelect(bool IsUnSelect);
	void SetChara(E_SASKind SkillID, int32 LV, bool IsKasane, bool IsEnableDLC1, bool IsEnableDLC2);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_SasLink_skill_parts_1_C">();
	}
	static class UWB_ui_SasLink_skill_parts_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_SasLink_skill_parts_1_C>();
	}
};
static_assert(alignof(UWB_ui_SasLink_skill_parts_1_C) == 0x000008, "Wrong alignment on UWB_ui_SasLink_skill_parts_1_C");
static_assert(sizeof(UWB_ui_SasLink_skill_parts_1_C) == 0x0003C0, "Wrong size on UWB_ui_SasLink_skill_parts_1_C");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_1_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_SasLink_skill_parts_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_1_C, Unselect) == 0x000390, "Member 'UWB_ui_SasLink_skill_parts_1_C::Unselect' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_1_C, Default) == 0x000398, "Member 'UWB_ui_SasLink_skill_parts_1_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_1_C, base_bond) == 0x0003A0, "Member 'UWB_ui_SasLink_skill_parts_1_C::base_bond' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_1_C, Text_saslink_bond_2_num) == 0x0003A8, "Member 'UWB_ui_SasLink_skill_parts_1_C::Text_saslink_bond_2_num' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_1_C, Text_saslink_sasname_2) == 0x0003B0, "Member 'UWB_ui_SasLink_skill_parts_1_C::Text_saslink_sasname_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_1_C, FlagUnSelect) == 0x0003B8, "Member 'UWB_ui_SasLink_skill_parts_1_C::FlagUnSelect' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_1_C, FlagCurrentUnSelect) == 0x0003B9, "Member 'UWB_ui_SasLink_skill_parts_1_C::FlagCurrentUnSelect' has a wrong offset!");

}

