#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_CrossSave_Updating

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_CrossSave_Updating.WB_ui_CrossSave_Updating_C
// 0x00B8 (0x0470 - 0x03B8)
class UWB_ui_CrossSave_Updating_C final : public UUITitleCrossSave_UpdatingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Ghost;                                             // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_1;                                            // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_2;                                            // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_3;                                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Mark_1;                                            // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Mark_2;                                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Mark_3;                                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Mark_4;                                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Mark_7;                                            // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Mark_8;                                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Mark_9;                                            // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Mark_5_1;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Mark_5_2;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Mark_6_1;                                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Mark_6_2;                                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_1;                                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UImage*>                         ImageList;                                         // 0x0460(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_CrossSave_Updating(int32 EntryPoint);
	void UpdateLoadingMaterial();
	void SetLoadingColor(const struct FLinearColor& Color);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_CrossSave_Updating_C">();
	}
	static class UWB_ui_CrossSave_Updating_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_CrossSave_Updating_C>();
	}
};
static_assert(alignof(UWB_ui_CrossSave_Updating_C) == 0x000008, "Wrong alignment on UWB_ui_CrossSave_Updating_C");
static_assert(sizeof(UWB_ui_CrossSave_Updating_C) == 0x000470, "Wrong size on UWB_ui_CrossSave_Updating_C");
static_assert(offsetof(UWB_ui_CrossSave_Updating_C, UberGraphFrame) == 0x0003B8, "Member 'UWB_ui_CrossSave_Updating_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_CrossSave_Updating_C, Out) == 0x0003C0, "Member 'UWB_ui_CrossSave_Updating_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_CrossSave_Updating_C, In) == 0x0003C8, "Member 'UWB_ui_CrossSave_Updating_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_CrossSave_Updating_C, Default_none) == 0x0003D0, "Member 'UWB_ui_CrossSave_Updating_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_CrossSave_Updating_C, Default) == 0x0003D8, "Member 'UWB_ui_CrossSave_Updating_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_CrossSave_Updating_C, Ghost) == 0x0003E0, "Member 'UWB_ui_CrossSave_Updating_C::Ghost' has a wrong offset!");
static_assert(offsetof(UWB_ui_CrossSave_Updating_C, Line_1) == 0x0003E8, "Member 'UWB_ui_CrossSave_Updating_C::Line_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_CrossSave_Updating_C, Line_2) == 0x0003F0, "Member 'UWB_ui_CrossSave_Updating_C::Line_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_CrossSave_Updating_C, Line_3) == 0x0003F8, "Member 'UWB_ui_CrossSave_Updating_C::Line_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_CrossSave_Updating_C, Mark_1) == 0x000400, "Member 'UWB_ui_CrossSave_Updating_C::Mark_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_CrossSave_Updating_C, Mark_2) == 0x000408, "Member 'UWB_ui_CrossSave_Updating_C::Mark_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_CrossSave_Updating_C, Mark_3) == 0x000410, "Member 'UWB_ui_CrossSave_Updating_C::Mark_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_CrossSave_Updating_C, Mark_4) == 0x000418, "Member 'UWB_ui_CrossSave_Updating_C::Mark_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_CrossSave_Updating_C, Mark_7) == 0x000420, "Member 'UWB_ui_CrossSave_Updating_C::Mark_7' has a wrong offset!");
static_assert(offsetof(UWB_ui_CrossSave_Updating_C, Mark_8) == 0x000428, "Member 'UWB_ui_CrossSave_Updating_C::Mark_8' has a wrong offset!");
static_assert(offsetof(UWB_ui_CrossSave_Updating_C, Mark_9) == 0x000430, "Member 'UWB_ui_CrossSave_Updating_C::Mark_9' has a wrong offset!");
static_assert(offsetof(UWB_ui_CrossSave_Updating_C, Mark_5_1) == 0x000438, "Member 'UWB_ui_CrossSave_Updating_C::Mark_5_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_CrossSave_Updating_C, Mark_5_2) == 0x000440, "Member 'UWB_ui_CrossSave_Updating_C::Mark_5_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_CrossSave_Updating_C, Mark_6_1) == 0x000448, "Member 'UWB_ui_CrossSave_Updating_C::Mark_6_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_CrossSave_Updating_C, Mark_6_2) == 0x000450, "Member 'UWB_ui_CrossSave_Updating_C::Mark_6_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_CrossSave_Updating_C, RetainerBox_1) == 0x000458, "Member 'UWB_ui_CrossSave_Updating_C::RetainerBox_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_CrossSave_Updating_C, ImageList) == 0x000460, "Member 'UWB_ui_CrossSave_Updating_C::ImageList' has a wrong offset!");

}

