#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Action_Sas

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Action_Sas.WB_ui_Action_Sas_C
// 0x0060 (0x0438 - 0x03D8)
class UWB_ui_Action_Sas_C final : public UUISASActionIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out_2;                                             // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_2;                                              // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select;                                            // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Frame_1;                                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_2;                                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_3;                                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_6_add;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_1;                                            // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise;                                             // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ESASActionIconType                            IconColor;                                         // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESASActionIconType                            Icontype;                                          // 0x0431(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Action_Sas(int32 EntryPoint);
	void SetUsable(bool Param_IsUsable);
	void SetIconType(ESASActionIconType Param_Icontype, bool Param_IsUsable);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void SetIconMaterial(ESASActionIconType Param_Icontype, bool Param_IsUsable);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Action_Sas_C">();
	}
	static class UWB_ui_Action_Sas_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Action_Sas_C>();
	}
};
static_assert(alignof(UWB_ui_Action_Sas_C) == 0x000008, "Wrong alignment on UWB_ui_Action_Sas_C");
static_assert(sizeof(UWB_ui_Action_Sas_C) == 0x000438, "Wrong size on UWB_ui_Action_Sas_C");
static_assert(offsetof(UWB_ui_Action_Sas_C, UberGraphFrame) == 0x0003D8, "Member 'UWB_ui_Action_Sas_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Action_Sas_C, Out_2) == 0x0003E0, "Member 'UWB_ui_Action_Sas_C::Out_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Action_Sas_C, In_2) == 0x0003E8, "Member 'UWB_ui_Action_Sas_C::In_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Action_Sas_C, Select) == 0x0003F0, "Member 'UWB_ui_Action_Sas_C::Select' has a wrong offset!");
static_assert(offsetof(UWB_ui_Action_Sas_C, Default_none) == 0x0003F8, "Member 'UWB_ui_Action_Sas_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Action_Sas_C, Frame_1) == 0x000400, "Member 'UWB_ui_Action_Sas_C::Frame_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Action_Sas_C, Frame_2) == 0x000408, "Member 'UWB_ui_Action_Sas_C::Frame_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Action_Sas_C, Frame_3) == 0x000410, "Member 'UWB_ui_Action_Sas_C::Frame_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Action_Sas_C, Frame_6_add) == 0x000418, "Member 'UWB_ui_Action_Sas_C::Frame_6_add' has a wrong offset!");
static_assert(offsetof(UWB_ui_Action_Sas_C, Icon_1) == 0x000420, "Member 'UWB_ui_Action_Sas_C::Icon_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Action_Sas_C, Noise) == 0x000428, "Member 'UWB_ui_Action_Sas_C::Noise' has a wrong offset!");
static_assert(offsetof(UWB_ui_Action_Sas_C, IconColor) == 0x000430, "Member 'UWB_ui_Action_Sas_C::IconColor' has a wrong offset!");
static_assert(offsetof(UWB_ui_Action_Sas_C, Icontype) == 0x000431, "Member 'UWB_ui_Action_Sas_C::Icontype' has a wrong offset!");

}

