#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Vitality_en_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Vitality_en_01.WB_ui_Vitality_en_01_C
// 0x0040 (0x0458 - 0x0418)
class UWB_ui_Vitality_en_01_C final : public UUIVitalityEN01
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default_none;                                      // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Gauge_Bar_damage;                                  // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Gauge_Bar_nomal;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Gauge_Bar_nomal_add;                               // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Vitality_en_01(int32 EntryPoint);
	void SetIcon2(class UImage* Icon, int32 Param_Index);
	void SetIcon1(class UImage* Icon, int32 Param_Index);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Vitality_en_01_C">();
	}
	static class UWB_ui_Vitality_en_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Vitality_en_01_C>();
	}
};
static_assert(alignof(UWB_ui_Vitality_en_01_C) == 0x000008, "Wrong alignment on UWB_ui_Vitality_en_01_C");
static_assert(sizeof(UWB_ui_Vitality_en_01_C) == 0x000458, "Wrong size on UWB_ui_Vitality_en_01_C");
static_assert(offsetof(UWB_ui_Vitality_en_01_C, UberGraphFrame) == 0x000418, "Member 'UWB_ui_Vitality_en_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_en_01_C, Default_none) == 0x000420, "Member 'UWB_ui_Vitality_en_01_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_en_01_C, Out) == 0x000428, "Member 'UWB_ui_Vitality_en_01_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_en_01_C, In) == 0x000430, "Member 'UWB_ui_Vitality_en_01_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_en_01_C, Default) == 0x000438, "Member 'UWB_ui_Vitality_en_01_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_en_01_C, Gauge_Bar_damage) == 0x000440, "Member 'UWB_ui_Vitality_en_01_C::Gauge_Bar_damage' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_en_01_C, Gauge_Bar_nomal) == 0x000448, "Member 'UWB_ui_Vitality_en_01_C::Gauge_Bar_nomal' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_en_01_C, Gauge_Bar_nomal_add) == 0x000450, "Member 'UWB_ui_Vitality_en_01_C::Gauge_Bar_nomal_add' has a wrong offset!");

}

