#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_NexusDrive_Jack

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_ui_NexusDrive_Jack.WB_ui_NexusDrive_Jack_C.ExecuteUbergraph_WB_ui_NexusDrive_Jack
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_NexusDrive_Jack_C_ExecuteUbergraph_WB_ui_NexusDrive_Jack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5733[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_NexusDrive_Jack_C_ExecuteUbergraph_WB_ui_NexusDrive_Jack) == 0x000004, "Wrong alignment on WB_ui_NexusDrive_Jack_C_ExecuteUbergraph_WB_ui_NexusDrive_Jack");
static_assert(sizeof(WB_ui_NexusDrive_Jack_C_ExecuteUbergraph_WB_ui_NexusDrive_Jack) == 0x000018, "Wrong size on WB_ui_NexusDrive_Jack_C_ExecuteUbergraph_WB_ui_NexusDrive_Jack");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_ExecuteUbergraph_WB_ui_NexusDrive_Jack, EntryPoint) == 0x000000, "Member 'WB_ui_NexusDrive_Jack_C_ExecuteUbergraph_WB_ui_NexusDrive_Jack::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_ExecuteUbergraph_WB_ui_NexusDrive_Jack, K2Node_Event_State) == 0x000004, "Member 'WB_ui_NexusDrive_Jack_C_ExecuteUbergraph_WB_ui_NexusDrive_Jack::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_ExecuteUbergraph_WB_ui_NexusDrive_Jack, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_NexusDrive_Jack_C_ExecuteUbergraph_WB_ui_NexusDrive_Jack::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_ExecuteUbergraph_WB_ui_NexusDrive_Jack, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_NexusDrive_Jack_C_ExecuteUbergraph_WB_ui_NexusDrive_Jack::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_ExecuteUbergraph_WB_ui_NexusDrive_Jack, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'WB_ui_NexusDrive_Jack_C_ExecuteUbergraph_WB_ui_NexusDrive_Jack::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_ExecuteUbergraph_WB_ui_NexusDrive_Jack, CallFunc_Greater_IntInt_ReturnValue) == 0x000011, "Member 'WB_ui_NexusDrive_Jack_C_ExecuteUbergraph_WB_ui_NexusDrive_Jack::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_ExecuteUbergraph_WB_ui_NexusDrive_Jack, CallFunc_Add_FloatFloat_ReturnValue) == 0x000014, "Member 'WB_ui_NexusDrive_Jack_C_ExecuteUbergraph_WB_ui_NexusDrive_Jack::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function WB_ui_NexusDrive_Jack.WB_ui_NexusDrive_Jack_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_NexusDrive_Jack_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_NexusDrive_Jack_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_NexusDrive_Jack_C_UpdateState");
static_assert(sizeof(WB_ui_NexusDrive_Jack_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_NexusDrive_Jack_C_UpdateState");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_UpdateState, State) == 0x000000, "Member 'WB_ui_NexusDrive_Jack_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_NexusDrive_Jack_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_NexusDrive_Jack_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_NexusDrive_Jack.WB_ui_NexusDrive_Jack_C.StateNone
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_NexusDrive_Jack_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_NexusDrive_Jack_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_NexusDrive_Jack_C_StateNone");
static_assert(sizeof(WB_ui_NexusDrive_Jack_C_StateNone) == 0x000008, "Wrong size on WB_ui_NexusDrive_Jack_C_StateNone");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_NexusDrive_Jack_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_NexusDrive_Jack_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_ui_NexusDrive_Jack.WB_ui_NexusDrive_Jack_C.StateOpen
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_NexusDrive_Jack_C_StateOpen final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_NexusDrive_Jack_C_StateOpen) == 0x000004, "Wrong alignment on WB_ui_NexusDrive_Jack_C_StateOpen");
static_assert(sizeof(WB_ui_NexusDrive_Jack_C_StateOpen) == 0x000008, "Wrong size on WB_ui_NexusDrive_Jack_C_StateOpen");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_StateOpen, SubState) == 0x000000, "Member 'WB_ui_NexusDrive_Jack_C_StateOpen::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_StateOpen, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_NexusDrive_Jack_C_StateOpen::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_StateOpen, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000005, "Member 'WB_ui_NexusDrive_Jack_C_StateOpen::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");

// Function WB_ui_NexusDrive_Jack.WB_ui_NexusDrive_Jack_C.StateLoop
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_NexusDrive_Jack_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_NexusDrive_Jack_C_StateLoop) == 0x000004, "Wrong alignment on WB_ui_NexusDrive_Jack_C_StateLoop");
static_assert(sizeof(WB_ui_NexusDrive_Jack_C_StateLoop) == 0x000008, "Wrong size on WB_ui_NexusDrive_Jack_C_StateLoop");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_NexusDrive_Jack_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_NexusDrive_Jack_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_StateLoop, CallFunc_Less_FloatFloat_ReturnValue) == 0x000005, "Member 'WB_ui_NexusDrive_Jack_C_StateLoop::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function WB_ui_NexusDrive_Jack.WB_ui_NexusDrive_Jack_C.StateClose
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_NexusDrive_Jack_C_StateClose final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_NexusDrive_Jack_C_StateClose) == 0x000004, "Wrong alignment on WB_ui_NexusDrive_Jack_C_StateClose");
static_assert(sizeof(WB_ui_NexusDrive_Jack_C_StateClose) == 0x000008, "Wrong size on WB_ui_NexusDrive_Jack_C_StateClose");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_StateClose, SubState) == 0x000000, "Member 'WB_ui_NexusDrive_Jack_C_StateClose::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_StateClose, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_NexusDrive_Jack_C_StateClose::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_StateClose, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000005, "Member 'WB_ui_NexusDrive_Jack_C_StateClose::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");

// Function WB_ui_NexusDrive_Jack.WB_ui_NexusDrive_Jack_C.SetupText
// 0x0030 (0x0030 - 0x0000)
struct WB_ui_NexusDrive_Jack_C_SetupText final
{
public:
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
};
static_assert(alignof(WB_ui_NexusDrive_Jack_C_SetupText) == 0x000008, "Wrong alignment on WB_ui_NexusDrive_Jack_C_SetupText");
static_assert(sizeof(WB_ui_NexusDrive_Jack_C_SetupText) == 0x000030, "Wrong size on WB_ui_NexusDrive_Jack_C_SetupText");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_SetupText, CallFunc_GetDataBaseManager_Manager) == 0x000000, "Member 'WB_ui_NexusDrive_Jack_C_SetupText::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_SetupText, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'WB_ui_NexusDrive_Jack_C_SetupText::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_SetupText, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WB_ui_NexusDrive_Jack_C_SetupText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WB_ui_NexusDrive_Jack.WB_ui_NexusDrive_Jack_C.SetDrawBonus
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_NexusDrive_Jack_C_SetDrawBonus final
{
public:
	bool                                          IsDraw;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_NexusDrive_Jack_C_SetDrawBonus) == 0x000001, "Wrong alignment on WB_ui_NexusDrive_Jack_C_SetDrawBonus");
static_assert(sizeof(WB_ui_NexusDrive_Jack_C_SetDrawBonus) == 0x000001, "Wrong size on WB_ui_NexusDrive_Jack_C_SetDrawBonus");
static_assert(offsetof(WB_ui_NexusDrive_Jack_C_SetDrawBonus, IsDraw) == 0x000000, "Member 'WB_ui_NexusDrive_Jack_C_SetDrawBonus::IsDraw' has a wrong offset!");

}

