#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Intercept_1

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Intercept_1.WB_ui_Intercept_1_C.ExecuteUbergraph_WB_ui_Intercept_1
// 0x0070 (0x0070 - 0x0000)
struct WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F73[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F74[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F75[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isChangedIconDeviceType_ReturnValue;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F76[0x1];                                     // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F77[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
};
static_assert(alignof(WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1) == 0x000008, "Wrong alignment on WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1");
static_assert(sizeof(WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1) == 0x000070, "Wrong size on WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1");
static_assert(offsetof(WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1, EntryPoint) == 0x000000, "Member 'WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1, K2Node_Event_State) == 0x000010, "Member 'WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1, K2Node_Event_SubState) == 0x000014, "Member 'WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00001C, "Member 'WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000020, "Member 'WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1, K2Node_SwitchInteger_CmpSuccess) == 0x000024, "Member 'WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000028, "Member 'WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1, CallFunc_isChangedIconDeviceType_ReturnValue) == 0x000030, "Member 'WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1::CallFunc_isChangedIconDeviceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000031, "Member 'WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000032, "Member 'WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000034, "Member 'WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000038, "Member 'WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1, CallFunc_GetDataBaseManager_Manager) == 0x000040, "Member 'WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1, CallFunc_GetText_ReturnValue) == 0x000048, "Member 'WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'WB_ui_Intercept_1_C_ExecuteUbergraph_WB_ui_Intercept_1::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WB_ui_Intercept_1.WB_ui_Intercept_1_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Intercept_1_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Intercept_1_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Intercept_1_C_UpdateState");
static_assert(sizeof(WB_ui_Intercept_1_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Intercept_1_C_UpdateState");
static_assert(offsetof(WB_ui_Intercept_1_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Intercept_1_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Intercept_1_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Intercept_1_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Intercept_1.WB_ui_Intercept_1_C.StateNone
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Intercept_1_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F78[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Intercept_1_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_Intercept_1_C_StateNone");
static_assert(sizeof(WB_ui_Intercept_1_C_StateNone) == 0x000010, "Wrong size on WB_ui_Intercept_1_C_StateNone");
static_assert(offsetof(WB_ui_Intercept_1_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_Intercept_1_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Intercept_1_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Intercept_1_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_Intercept_1_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Intercept_1_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Intercept_1_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_Intercept_1.WB_ui_Intercept_1_C.StateLoop
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Intercept_1_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F79[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Intercept_1_C_StateLoop) == 0x000004, "Wrong alignment on WB_ui_Intercept_1_C_StateLoop");
static_assert(sizeof(WB_ui_Intercept_1_C_StateLoop) == 0x000010, "Wrong size on WB_ui_Intercept_1_C_StateLoop");
static_assert(offsetof(WB_ui_Intercept_1_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_Intercept_1_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Intercept_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Intercept_1_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_Intercept_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Intercept_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Intercept_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_Intercept_1.WB_ui_Intercept_1_C.SetButton
// 0x0030 (0x0030 - 0x0000)
struct WB_ui_Intercept_1_C_SetButton final
{
public:
	EPsychicObjectUniqueInputButton               Param_Button;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F7A[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         _HardIndex;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           _TextList;                                         // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         _Work;                                             // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F7B[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Intercept_1_C_SetButton) == 0x000008, "Wrong alignment on WB_ui_Intercept_1_C_SetButton");
static_assert(sizeof(WB_ui_Intercept_1_C_SetButton) == 0x000030, "Wrong size on WB_ui_Intercept_1_C_SetButton");
static_assert(offsetof(WB_ui_Intercept_1_C_SetButton, Param_Button) == 0x000000, "Member 'WB_ui_Intercept_1_C_SetButton::Param_Button' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_SetButton, _HardIndex) == 0x000004, "Member 'WB_ui_Intercept_1_C_SetButton::_HardIndex' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_SetButton, _TextList) == 0x000008, "Member 'WB_ui_Intercept_1_C_SetButton::_TextList' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_SetButton, _Work) == 0x000018, "Member 'WB_ui_Intercept_1_C_SetButton::_Work' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_SetButton, K2Node_MakeArray_Array) == 0x000020, "Member 'WB_ui_Intercept_1_C_SetButton::K2Node_MakeArray_Array' has a wrong offset!");

// Function WB_ui_Intercept_1.WB_ui_Intercept_1_C.UpdateButton
// 0x0040 (0x0040 - 0x0000)
struct WB_ui_Intercept_1_C_UpdateButton final
{
public:
	int32                                         _HardIndex;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F7C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserParamManager*                      CallFunc_GetUserParamManager_UserParamManager;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOptionParam*                           CallFunc_GetOptionParam_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERSGamepadInputName                           CallFunc_GetControllerParamValue_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F7D[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EInputDeviceType                              CallFunc_getIconDeviceType_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Intercept_1_C_UpdateButton) == 0x000008, "Wrong alignment on WB_ui_Intercept_1_C_UpdateButton");
static_assert(sizeof(WB_ui_Intercept_1_C_UpdateButton) == 0x000040, "Wrong size on WB_ui_Intercept_1_C_UpdateButton");
static_assert(offsetof(WB_ui_Intercept_1_C_UpdateButton, _HardIndex) == 0x000000, "Member 'WB_ui_Intercept_1_C_UpdateButton::_HardIndex' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_UpdateButton, CallFunc_GetUserParamManager_UserParamManager) == 0x000008, "Member 'WB_ui_Intercept_1_C_UpdateButton::CallFunc_GetUserParamManager_UserParamManager' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_UpdateButton, CallFunc_GetOptionParam_ReturnValue) == 0x000010, "Member 'WB_ui_Intercept_1_C_UpdateButton::CallFunc_GetOptionParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_UpdateButton, CallFunc_GetControllerParamValue_ReturnValue) == 0x000018, "Member 'WB_ui_Intercept_1_C_UpdateButton::CallFunc_GetControllerParamValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_UpdateButton, K2Node_SwitchInteger_CmpSuccess) == 0x000019, "Member 'WB_ui_Intercept_1_C_UpdateButton::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_UpdateButton, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000020, "Member 'WB_ui_Intercept_1_C_UpdateButton::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_UpdateButton, CallFunc_GetPlatformName_ReturnValue) == 0x000028, "Member 'WB_ui_Intercept_1_C_UpdateButton::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_UpdateButton, CallFunc_getIconDeviceType_ReturnValue) == 0x000038, "Member 'WB_ui_Intercept_1_C_UpdateButton::CallFunc_getIconDeviceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_UpdateButton, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000039, "Member 'WB_ui_Intercept_1_C_UpdateButton::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_UpdateButton, K2Node_SwitchEnum_CmpSuccess) == 0x00003A, "Member 'WB_ui_Intercept_1_C_UpdateButton::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_UpdateButton, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x00003B, "Member 'WB_ui_Intercept_1_C_UpdateButton::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Intercept_1_C_UpdateButton, CallFunc_BooleanOR_ReturnValue) == 0x00003C, "Member 'WB_ui_Intercept_1_C_UpdateButton::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

