#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_NexusDrive_Sas

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_ui_NexusDrive_Sas.WB_ui_NexusDrive_Sas_C.ExecuteUbergraph_WB_ui_NexusDrive_Sas
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_NexusDrive_Sas_C_ExecuteUbergraph_WB_ui_NexusDrive_Sas final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_NexusDrive_Sas_C_ExecuteUbergraph_WB_ui_NexusDrive_Sas) == 0x000004, "Wrong alignment on WB_ui_NexusDrive_Sas_C_ExecuteUbergraph_WB_ui_NexusDrive_Sas");
static_assert(sizeof(WB_ui_NexusDrive_Sas_C_ExecuteUbergraph_WB_ui_NexusDrive_Sas) == 0x000010, "Wrong size on WB_ui_NexusDrive_Sas_C_ExecuteUbergraph_WB_ui_NexusDrive_Sas");
static_assert(offsetof(WB_ui_NexusDrive_Sas_C_ExecuteUbergraph_WB_ui_NexusDrive_Sas, EntryPoint) == 0x000000, "Member 'WB_ui_NexusDrive_Sas_C_ExecuteUbergraph_WB_ui_NexusDrive_Sas::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Sas_C_ExecuteUbergraph_WB_ui_NexusDrive_Sas, K2Node_Event_State) == 0x000004, "Member 'WB_ui_NexusDrive_Sas_C_ExecuteUbergraph_WB_ui_NexusDrive_Sas::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Sas_C_ExecuteUbergraph_WB_ui_NexusDrive_Sas, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_NexusDrive_Sas_C_ExecuteUbergraph_WB_ui_NexusDrive_Sas::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Sas_C_ExecuteUbergraph_WB_ui_NexusDrive_Sas, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_NexusDrive_Sas_C_ExecuteUbergraph_WB_ui_NexusDrive_Sas::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function WB_ui_NexusDrive_Sas.WB_ui_NexusDrive_Sas_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_NexusDrive_Sas_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_NexusDrive_Sas_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_NexusDrive_Sas_C_UpdateState");
static_assert(sizeof(WB_ui_NexusDrive_Sas_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_NexusDrive_Sas_C_UpdateState");
static_assert(offsetof(WB_ui_NexusDrive_Sas_C_UpdateState, State) == 0x000000, "Member 'WB_ui_NexusDrive_Sas_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Sas_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_NexusDrive_Sas_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Sas_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_NexusDrive_Sas_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_NexusDrive_Sas.WB_ui_NexusDrive_Sas_C.SetNeonColor
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_NexusDrive_Sas_C_SetNeonColor final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_NexusDrive_Sas_C_SetNeonColor) == 0x000004, "Wrong alignment on WB_ui_NexusDrive_Sas_C_SetNeonColor");
static_assert(sizeof(WB_ui_NexusDrive_Sas_C_SetNeonColor) == 0x000008, "Wrong size on WB_ui_NexusDrive_Sas_C_SetNeonColor");
static_assert(offsetof(WB_ui_NexusDrive_Sas_C_SetNeonColor, ID) == 0x000000, "Member 'WB_ui_NexusDrive_Sas_C_SetNeonColor::ID' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Sas_C_SetNeonColor, ReturnValue) == 0x000004, "Member 'WB_ui_NexusDrive_Sas_C_SetNeonColor::ReturnValue' has a wrong offset!");

// Function WB_ui_NexusDrive_Sas.WB_ui_NexusDrive_Sas_C.GetUsingStartTime
// 0x0020 (0x0020 - 0x0000)
struct WB_ui_NexusDrive_Sas_C_GetUsingStartTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E6E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUi_menu_battle_control_C*              K2Node_DynamicCast_AsUi_Menu_Battle_Control;       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E6F[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetNexusDriveUsingAnimTime_Time;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_NexusDrive_Sas_C_GetUsingStartTime) == 0x000008, "Wrong alignment on WB_ui_NexusDrive_Sas_C_GetUsingStartTime");
static_assert(sizeof(WB_ui_NexusDrive_Sas_C_GetUsingStartTime) == 0x000020, "Wrong size on WB_ui_NexusDrive_Sas_C_GetUsingStartTime");
static_assert(offsetof(WB_ui_NexusDrive_Sas_C_GetUsingStartTime, ReturnValue) == 0x000000, "Member 'WB_ui_NexusDrive_Sas_C_GetUsingStartTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Sas_C_GetUsingStartTime, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000008, "Member 'WB_ui_NexusDrive_Sas_C_GetUsingStartTime::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Sas_C_GetUsingStartTime, K2Node_DynamicCast_AsUi_Menu_Battle_Control) == 0x000010, "Member 'WB_ui_NexusDrive_Sas_C_GetUsingStartTime::K2Node_DynamicCast_AsUi_Menu_Battle_Control' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Sas_C_GetUsingStartTime, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WB_ui_NexusDrive_Sas_C_GetUsingStartTime::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Sas_C_GetUsingStartTime, CallFunc_GetNexusDriveUsingAnimTime_Time) == 0x00001C, "Member 'WB_ui_NexusDrive_Sas_C_GetUsingStartTime::CallFunc_GetNexusDriveUsingAnimTime_Time' has a wrong offset!");

// Function WB_ui_NexusDrive_Sas.WB_ui_NexusDrive_Sas_C.GetDefaultStartTime
// 0x0020 (0x0020 - 0x0000)
struct WB_ui_NexusDrive_Sas_C_GetDefaultStartTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E70[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUi_menu_battle_control_C*              K2Node_DynamicCast_AsUi_Menu_Battle_Control;       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E71[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetNexusDriveDefaultAnimTime_Time;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_NexusDrive_Sas_C_GetDefaultStartTime) == 0x000008, "Wrong alignment on WB_ui_NexusDrive_Sas_C_GetDefaultStartTime");
static_assert(sizeof(WB_ui_NexusDrive_Sas_C_GetDefaultStartTime) == 0x000020, "Wrong size on WB_ui_NexusDrive_Sas_C_GetDefaultStartTime");
static_assert(offsetof(WB_ui_NexusDrive_Sas_C_GetDefaultStartTime, ReturnValue) == 0x000000, "Member 'WB_ui_NexusDrive_Sas_C_GetDefaultStartTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Sas_C_GetDefaultStartTime, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000008, "Member 'WB_ui_NexusDrive_Sas_C_GetDefaultStartTime::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Sas_C_GetDefaultStartTime, K2Node_DynamicCast_AsUi_Menu_Battle_Control) == 0x000010, "Member 'WB_ui_NexusDrive_Sas_C_GetDefaultStartTime::K2Node_DynamicCast_AsUi_Menu_Battle_Control' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Sas_C_GetDefaultStartTime, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WB_ui_NexusDrive_Sas_C_GetDefaultStartTime::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_NexusDrive_Sas_C_GetDefaultStartTime, CallFunc_GetNexusDriveDefaultAnimTime_Time) == 0x00001C, "Member 'WB_ui_NexusDrive_Sas_C_GetDefaultStartTime::CallFunc_GetNexusDriveDefaultAnimTime_Time' has a wrong offset!");

}

