#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_BrainMes_Parts_2

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_ui_BrainMes_Parts_2.WB_ui_BrainMes_Parts_2_C.ExecuteUbergraph_WB_ui_BrainMes_Parts_2
// 0x0048 (0x0048 - 0x0000)
struct WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CAF[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CB0[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CB1[0x1];                                     // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CB2[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetViewportScale_ReturnValue;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2) == 0x000008, "Wrong alignment on WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2");
static_assert(sizeof(WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2) == 0x000048, "Wrong size on WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2, EntryPoint) == 0x000000, "Member 'WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2, K2Node_Event_State) == 0x000018, "Member 'WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2, K2Node_Event_SubState) == 0x00001C, "Member 'WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2, K2Node_SwitchInteger_CmpSuccess) == 0x000024, "Member 'WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000025, "Member 'WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000026, "Member 'WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000028, "Member 'WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x00002C, "Member 'WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000030, "Member 'WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000034, "Member 'WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2, CallFunc_AddChild_ReturnValue) == 0x000038, "Member 'WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2, CallFunc_GetViewportScale_ReturnValue) == 0x000040, "Member 'WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2::CallFunc_GetViewportScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000044, "Member 'WB_ui_BrainMes_Parts_2_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_2::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function WB_ui_BrainMes_Parts_2.WB_ui_BrainMes_Parts_2_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_BrainMes_Parts_2_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_Parts_2_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_BrainMes_Parts_2_C_UpdateState");
static_assert(sizeof(WB_ui_BrainMes_Parts_2_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_BrainMes_Parts_2_C_UpdateState");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_UpdateState, State) == 0x000000, "Member 'WB_ui_BrainMes_Parts_2_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_BrainMes_Parts_2_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_BrainMes_Parts_2_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_BrainMes_Parts_2.WB_ui_BrainMes_Parts_2_C.StateNone
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_BrainMes_Parts_2_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CB3[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_Parts_2_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_BrainMes_Parts_2_C_StateNone");
static_assert(sizeof(WB_ui_BrainMes_Parts_2_C_StateNone) == 0x000010, "Wrong size on WB_ui_BrainMes_Parts_2_C_StateNone");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_BrainMes_Parts_2_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_BrainMes_Parts_2_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_BrainMes_Parts_2_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_BrainMes_Parts_2_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_BrainMes_Parts_2_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_BrainMes_Parts_2_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_BrainMes_Parts_2.WB_ui_BrainMes_Parts_2_C.StateLoopMessage
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_BrainMes_Parts_2_C_StateLoopMessage final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CB4[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CB5[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_Parts_2_C_StateLoopMessage) == 0x000004, "Wrong alignment on WB_ui_BrainMes_Parts_2_C_StateLoopMessage");
static_assert(sizeof(WB_ui_BrainMes_Parts_2_C_StateLoopMessage) == 0x000018, "Wrong size on WB_ui_BrainMes_Parts_2_C_StateLoopMessage");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_StateLoopMessage, SubState) == 0x000000, "Member 'WB_ui_BrainMes_Parts_2_C_StateLoopMessage::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_StateLoopMessage, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_BrainMes_Parts_2_C_StateLoopMessage::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_StateLoopMessage, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_BrainMes_Parts_2_C_StateLoopMessage::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_StateLoopMessage, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_BrainMes_Parts_2_C_StateLoopMessage::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_StateLoopMessage, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_BrainMes_Parts_2_C_StateLoopMessage::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_StateLoopMessage, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_BrainMes_Parts_2_C_StateLoopMessage::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_StateLoopMessage, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_BrainMes_Parts_2_C_StateLoopMessage::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_StateLoopMessage, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_BrainMes_Parts_2_C_StateLoopMessage::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");

// Function WB_ui_BrainMes_Parts_2.WB_ui_BrainMes_Parts_2_C.SetSelect
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_BrainMes_Parts_2_C_SetSelect final
{
public:
	bool                                          Param_IsSelect;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_BrainMes_Parts_2_C_SetSelect) == 0x000001, "Wrong alignment on WB_ui_BrainMes_Parts_2_C_SetSelect");
static_assert(sizeof(WB_ui_BrainMes_Parts_2_C_SetSelect) == 0x000001, "Wrong size on WB_ui_BrainMes_Parts_2_C_SetSelect");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_SetSelect, Param_IsSelect) == 0x000000, "Member 'WB_ui_BrainMes_Parts_2_C_SetSelect::Param_IsSelect' has a wrong offset!");

// Function WB_ui_BrainMes_Parts_2.WB_ui_BrainMes_Parts_2_C.SetParameter
// 0x00B0 (0x00B0 - 0x0000)
struct WB_ui_BrainMes_Parts_2_C_SetParameter final
{
public:
	bool                                          IsSelf;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsReply;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsNew;                                             // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8CB6[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Talker;                                            // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Text;                                              // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CB7[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager_1;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue_1;                    // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0060(0x0018)()
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager_2;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue_2;                    // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0090(0x0018)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CB8[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_Parts_2_C_SetParameter) == 0x000008, "Wrong alignment on WB_ui_BrainMes_Parts_2_C_SetParameter");
static_assert(sizeof(WB_ui_BrainMes_Parts_2_C_SetParameter) == 0x0000B0, "Wrong size on WB_ui_BrainMes_Parts_2_C_SetParameter");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_SetParameter, IsSelf) == 0x000000, "Member 'WB_ui_BrainMes_Parts_2_C_SetParameter::IsSelf' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_SetParameter, IsReply) == 0x000001, "Member 'WB_ui_BrainMes_Parts_2_C_SetParameter::IsReply' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_SetParameter, IsNew) == 0x000002, "Member 'WB_ui_BrainMes_Parts_2_C_SetParameter::IsNew' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_SetParameter, Talker) == 0x000004, "Member 'WB_ui_BrainMes_Parts_2_C_SetParameter::Talker' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_SetParameter, Text) == 0x00000C, "Member 'WB_ui_BrainMes_Parts_2_C_SetParameter::Text' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_SetParameter, CallFunc_GetDataBaseManager_Manager) == 0x000018, "Member 'WB_ui_BrainMes_Parts_2_C_SetParameter::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_SetParameter, CallFunc_GetText_ReturnValue) == 0x000020, "Member 'WB_ui_BrainMes_Parts_2_C_SetParameter::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_SetParameter, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'WB_ui_BrainMes_Parts_2_C_SetParameter::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_SetParameter, CallFunc_GetDataBaseManager_Manager_1) == 0x000048, "Member 'WB_ui_BrainMes_Parts_2_C_SetParameter::CallFunc_GetDataBaseManager_Manager_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_SetParameter, CallFunc_GetText_ReturnValue_1) == 0x000050, "Member 'WB_ui_BrainMes_Parts_2_C_SetParameter::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_SetParameter, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000060, "Member 'WB_ui_BrainMes_Parts_2_C_SetParameter::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_SetParameter, CallFunc_GetDataBaseManager_Manager_2) == 0x000078, "Member 'WB_ui_BrainMes_Parts_2_C_SetParameter::CallFunc_GetDataBaseManager_Manager_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_SetParameter, CallFunc_GetText_ReturnValue_2) == 0x000080, "Member 'WB_ui_BrainMes_Parts_2_C_SetParameter::CallFunc_GetText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_SetParameter, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000090, "Member 'WB_ui_BrainMes_Parts_2_C_SetParameter::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_SetParameter, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000A8, "Member 'WB_ui_BrainMes_Parts_2_C_SetParameter::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_SetParameter, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000AC, "Member 'WB_ui_BrainMes_Parts_2_C_SetParameter::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function WB_ui_BrainMes_Parts_2.WB_ui_BrainMes_Parts_2_C.SetFace
// 0x0068 (0x0068 - 0x0000)
struct WB_ui_BrainMes_Parts_2_C_SetFace final
{
public:
	class FName                                   CharaID;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture*>                       _TextureList;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         _index;                                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CB9[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTexture*>                       K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Right_ReturnValue;                        // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_Parts_2_C_SetFace) == 0x000008, "Wrong alignment on WB_ui_BrainMes_Parts_2_C_SetFace");
static_assert(sizeof(WB_ui_BrainMes_Parts_2_C_SetFace) == 0x000068, "Wrong size on WB_ui_BrainMes_Parts_2_C_SetFace");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_SetFace, CharaID) == 0x000000, "Member 'WB_ui_BrainMes_Parts_2_C_SetFace::CharaID' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_SetFace, _TextureList) == 0x000008, "Member 'WB_ui_BrainMes_Parts_2_C_SetFace::_TextureList' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_SetFace, _index) == 0x000018, "Member 'WB_ui_BrainMes_Parts_2_C_SetFace::_index' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_2_C_SetFace, K2Node_MakeArray_Array) == 0x000020, "Member 'WB_ui_BrainMes_Parts_2_C_SetFace::K2Node_MakeArray_Array' has a wrong offset!");
