#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_MiniMes

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_MiniMes.WB_ui_MiniMes_C
// 0x00B0 (0x0438 - 0x0388)
class UWB_ui_MiniMes_C final : public UUIMiniTips
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Blue;                                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Green;                                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Red;                                      // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDRetainerBox*                        CA_RetainerBox;                                    // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Base;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Grow;                                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_pattern;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise;                                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OP_Scale_All_Set;                                  // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Scale_Max_Test;                                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_310;                                        // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_mini_tips_1;                                  // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_mini_tips_title;                              // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Title_base;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EHelpTutorial                                 DispID;                                            // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649B[0x3];                                     // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              MessageSizeNormal;                                 // 0x0424(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MessageSizeExpansion;                              // 0x042C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_MiniMes(int32 EntryPoint);
	void UpdateSpacerMiniTips();
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void StateNone(int32 SubState);
	void StateOpen(int32 SubState);
	void StateLoop(int32 SubState);
	void StateClose(int32 SubState);
	void SetTipsIndex(int32 Param_Index);
	void SetTipsTitle();
	void SetTipsID(EHelpTutorial ID);
	void UpdateSpacer();
	void MiniTipsSetString(const EHelpTutorial& Key, bool* DisplayHelpMenu);
	void SetupTextSize();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_MiniMes_C">();
	}
	static class UWB_ui_MiniMes_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_MiniMes_C>();
	}
};
static_assert(alignof(UWB_ui_MiniMes_C) == 0x000008, "Wrong alignment on UWB_ui_MiniMes_C");
static_assert(sizeof(UWB_ui_MiniMes_C) == 0x000438, "Wrong size on UWB_ui_MiniMes_C");
static_assert(offsetof(UWB_ui_MiniMes_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_MiniMes_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_MiniMes_C, Out) == 0x000390, "Member 'UWB_ui_MiniMes_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_MiniMes_C, In) == 0x000398, "Member 'UWB_ui_MiniMes_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_MiniMes_C, Default) == 0x0003A0, "Member 'UWB_ui_MiniMes_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_MiniMes_C, CA_Image_Blue) == 0x0003A8, "Member 'UWB_ui_MiniMes_C::CA_Image_Blue' has a wrong offset!");
static_assert(offsetof(UWB_ui_MiniMes_C, CA_Image_Green) == 0x0003B0, "Member 'UWB_ui_MiniMes_C::CA_Image_Green' has a wrong offset!");
static_assert(offsetof(UWB_ui_MiniMes_C, CA_Image_Red) == 0x0003B8, "Member 'UWB_ui_MiniMes_C::CA_Image_Red' has a wrong offset!");
static_assert(offsetof(UWB_ui_MiniMes_C, CA_RetainerBox) == 0x0003C0, "Member 'UWB_ui_MiniMes_C::CA_RetainerBox' has a wrong offset!");
static_assert(offsetof(UWB_ui_MiniMes_C, Frame_Base) == 0x0003C8, "Member 'UWB_ui_MiniMes_C::Frame_Base' has a wrong offset!");
static_assert(offsetof(UWB_ui_MiniMes_C, Frame_Grow) == 0x0003D0, "Member 'UWB_ui_MiniMes_C::Frame_Grow' has a wrong offset!");
static_assert(offsetof(UWB_ui_MiniMes_C, Frame_pattern) == 0x0003D8, "Member 'UWB_ui_MiniMes_C::Frame_pattern' has a wrong offset!");
static_assert(offsetof(UWB_ui_MiniMes_C, Icon_font) == 0x0003E0, "Member 'UWB_ui_MiniMes_C::Icon_font' has a wrong offset!");
static_assert(offsetof(UWB_ui_MiniMes_C, Noise) == 0x0003E8, "Member 'UWB_ui_MiniMes_C::Noise' has a wrong offset!");
static_assert(offsetof(UWB_ui_MiniMes_C, OP_Scale_All_Set) == 0x0003F0, "Member 'UWB_ui_MiniMes_C::OP_Scale_All_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_MiniMes_C, Scale_Max_Test) == 0x0003F8, "Member 'UWB_ui_MiniMes_C::Scale_Max_Test' has a wrong offset!");
static_assert(offsetof(UWB_ui_MiniMes_C, Spacer_310) == 0x000400, "Member 'UWB_ui_MiniMes_C::Spacer_310' has a wrong offset!");
static_assert(offsetof(UWB_ui_MiniMes_C, Text_mini_tips_1) == 0x000408, "Member 'UWB_ui_MiniMes_C::Text_mini_tips_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_MiniMes_C, Text_mini_tips_title) == 0x000410, "Member 'UWB_ui_MiniMes_C::Text_mini_tips_title' has a wrong offset!");
static_assert(offsetof(UWB_ui_MiniMes_C, Title_base) == 0x000418, "Member 'UWB_ui_MiniMes_C::Title_base' has a wrong offset!");
static_assert(offsetof(UWB_ui_MiniMes_C, DispID) == 0x000420, "Member 'UWB_ui_MiniMes_C::DispID' has a wrong offset!");
static_assert(offsetof(UWB_ui_MiniMes_C, MessageSizeNormal) == 0x000424, "Member 'UWB_ui_MiniMes_C::MessageSizeNormal' has a wrong offset!");
static_assert(offsetof(UWB_ui_MiniMes_C, MessageSizeExpansion) == 0x00042C, "Member 'UWB_ui_MiniMes_C::MessageSizeExpansion' has a wrong offset!");

}

