#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_SasLink_skill_parts_2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_SasLink_skill_parts_2.WB_ui_SasLink_skill_parts_2_C
// 0x0068 (0x03F0 - 0x0388)
class UWB_ui_SasLink_skill_parts_2_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Select_2_in;                                       // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_2;                                          // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_in;                                         // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select;                                            // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Unselect;                                          // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 base_bond;                                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Skill_List_Frame_1;                                // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Skill_List_Frame_base_1;                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_saslink_bond_5_num;                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_saslink_sasname_5;                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsSelect;                                          // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsDisable;                                         // 0x03E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsCurrentDisable;                                  // 0x03EA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsStart;                                           // 0x03EB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsResetSelect;                                     // 0x03EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_ui_SasLink_skill_parts_2(int32 EntryPoint);
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void StateNone(int32 SubState);
	void StateLoop(int32 SubState);
	void StateLoopSelect(int32 SubState);
	void SetText(int32 LV, const class FText& Text);
	void SetSelect(bool Param_IsSelect);
	void SetDisable(bool Param_IsDisable);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_SasLink_skill_parts_2_C">();
	}
	static class UWB_ui_SasLink_skill_parts_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_SasLink_skill_parts_2_C>();
	}
};
static_assert(alignof(UWB_ui_SasLink_skill_parts_2_C) == 0x000008, "Wrong alignment on UWB_ui_SasLink_skill_parts_2_C");
static_assert(sizeof(UWB_ui_SasLink_skill_parts_2_C) == 0x0003F0, "Wrong size on UWB_ui_SasLink_skill_parts_2_C");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_2_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_SasLink_skill_parts_2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_2_C, Select_2_in) == 0x000390, "Member 'UWB_ui_SasLink_skill_parts_2_C::Select_2_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_2_C, Select_2) == 0x000398, "Member 'UWB_ui_SasLink_skill_parts_2_C::Select_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_2_C, Select_in) == 0x0003A0, "Member 'UWB_ui_SasLink_skill_parts_2_C::Select_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_2_C, Select) == 0x0003A8, "Member 'UWB_ui_SasLink_skill_parts_2_C::Select' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_2_C, Unselect) == 0x0003B0, "Member 'UWB_ui_SasLink_skill_parts_2_C::Unselect' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_2_C, Default) == 0x0003B8, "Member 'UWB_ui_SasLink_skill_parts_2_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_2_C, base_bond) == 0x0003C0, "Member 'UWB_ui_SasLink_skill_parts_2_C::base_bond' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_2_C, Skill_List_Frame_1) == 0x0003C8, "Member 'UWB_ui_SasLink_skill_parts_2_C::Skill_List_Frame_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_2_C, Skill_List_Frame_base_1) == 0x0003D0, "Member 'UWB_ui_SasLink_skill_parts_2_C::Skill_List_Frame_base_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_2_C, Text_saslink_bond_5_num) == 0x0003D8, "Member 'UWB_ui_SasLink_skill_parts_2_C::Text_saslink_bond_5_num' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_2_C, Text_saslink_sasname_5) == 0x0003E0, "Member 'UWB_ui_SasLink_skill_parts_2_C::Text_saslink_sasname_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_2_C, IsSelect) == 0x0003E8, "Member 'UWB_ui_SasLink_skill_parts_2_C::IsSelect' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_2_C, IsDisable) == 0x0003E9, "Member 'UWB_ui_SasLink_skill_parts_2_C::IsDisable' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_2_C, IsCurrentDisable) == 0x0003EA, "Member 'UWB_ui_SasLink_skill_parts_2_C::IsCurrentDisable' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_2_C, IsStart) == 0x0003EB, "Member 'UWB_ui_SasLink_skill_parts_2_C::IsStart' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_skill_parts_2_C, IsResetSelect) == 0x0003EC, "Member 'UWB_ui_SasLink_skill_parts_2_C::IsResetSelect' has a wrong offset!");

}

