#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Trade_List_Parts_2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Trade_List_Parts_2.WB_ui_Trade_List_Parts_2_C.ExecuteUbergraph_WB_ui_Trade_List_Parts_2
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Trade_List_Parts_2_C_ExecuteUbergraph_WB_ui_Trade_List_Parts_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Trade_List_Parts_2_C_ExecuteUbergraph_WB_ui_Trade_List_Parts_2) == 0x000004, "Wrong alignment on WB_ui_Trade_List_Parts_2_C_ExecuteUbergraph_WB_ui_Trade_List_Parts_2");
static_assert(sizeof(WB_ui_Trade_List_Parts_2_C_ExecuteUbergraph_WB_ui_Trade_List_Parts_2) == 0x000010, "Wrong size on WB_ui_Trade_List_Parts_2_C_ExecuteUbergraph_WB_ui_Trade_List_Parts_2");
static_assert(offsetof(WB_ui_Trade_List_Parts_2_C_ExecuteUbergraph_WB_ui_Trade_List_Parts_2, EntryPoint) == 0x000000, "Member 'WB_ui_Trade_List_Parts_2_C_ExecuteUbergraph_WB_ui_Trade_List_Parts_2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Trade_List_Parts_2_C_ExecuteUbergraph_WB_ui_Trade_List_Parts_2, K2Node_Event_State) == 0x000004, "Member 'WB_ui_Trade_List_Parts_2_C_ExecuteUbergraph_WB_ui_Trade_List_Parts_2::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Trade_List_Parts_2_C_ExecuteUbergraph_WB_ui_Trade_List_Parts_2, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_Trade_List_Parts_2_C_ExecuteUbergraph_WB_ui_Trade_List_Parts_2::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Trade_List_Parts_2_C_ExecuteUbergraph_WB_ui_Trade_List_Parts_2, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_Trade_List_Parts_2_C_ExecuteUbergraph_WB_ui_Trade_List_Parts_2::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function WB_ui_Trade_List_Parts_2.WB_ui_Trade_List_Parts_2_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Trade_List_Parts_2_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Trade_List_Parts_2_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Trade_List_Parts_2_C_UpdateState");
static_assert(sizeof(WB_ui_Trade_List_Parts_2_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Trade_List_Parts_2_C_UpdateState");
static_assert(offsetof(WB_ui_Trade_List_Parts_2_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Trade_List_Parts_2_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Trade_List_Parts_2_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Trade_List_Parts_2_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Trade_List_Parts_2_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Trade_List_Parts_2_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Trade_List_Parts_2.WB_ui_Trade_List_Parts_2_C.SetItemInfo
// 0x00B0 (0x00B0 - 0x0000)
struct WB_ui_Trade_List_Parts_2_C_SetItemInfo final
{
public:
	class FName                                   ItemId;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NeedNum;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLackMaterial;                                    // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x000D(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetItemInfo_ReturnValue;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5814[0x1];                                     // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemDataCell                          CallFunc_GetItemDataCell_ItemData;                 // 0x0018(0x0080)()
	bool                                          CallFunc_GetItemDataCell_ReturnValue;              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5815[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_UI_GetArrayColor_Shop_Frame_1_UI_ColorArray_Shop_Frame_1; // 0x009C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Trade_List_Parts_2_C_SetItemInfo) == 0x000008, "Wrong alignment on WB_ui_Trade_List_Parts_2_C_SetItemInfo");
static_assert(sizeof(WB_ui_Trade_List_Parts_2_C_SetItemInfo) == 0x0000B0, "Wrong size on WB_ui_Trade_List_Parts_2_C_SetItemInfo");
static_assert(offsetof(WB_ui_Trade_List_Parts_2_C_SetItemInfo, ItemId) == 0x000000, "Member 'WB_ui_Trade_List_Parts_2_C_SetItemInfo::ItemId' has a wrong offset!");
static_assert(offsetof(WB_ui_Trade_List_Parts_2_C_SetItemInfo, NeedNum) == 0x000008, "Member 'WB_ui_Trade_List_Parts_2_C_SetItemInfo::NeedNum' has a wrong offset!");
static_assert(offsetof(WB_ui_Trade_List_Parts_2_C_SetItemInfo, IsLackMaterial) == 0x00000C, "Member 'WB_ui_Trade_List_Parts_2_C_SetItemInfo::IsLackMaterial' has a wrong offset!");
static_assert(offsetof(WB_ui_Trade_List_Parts_2_C_SetItemInfo, ReturnValue) == 0x00000D, "Member 'WB_ui_Trade_List_Parts_2_C_SetItemInfo::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Trade_List_Parts_2_C_SetItemInfo, CallFunc_SetItemInfo_ReturnValue) == 0x00000E, "Member 'WB_ui_Trade_List_Parts_2_C_SetItemInfo::CallFunc_SetItemInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Trade_List_Parts_2_C_SetItemInfo, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WB_ui_Trade_List_Parts_2_C_SetItemInfo::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Trade_List_Parts_2_C_SetItemInfo, CallFunc_GetItemDataCell_ItemData) == 0x000018, "Member 'WB_ui_Trade_List_Parts_2_C_SetItemInfo::CallFunc_GetItemDataCell_ItemData' has a wrong offset!");
static_assert(offsetof(WB_ui_Trade_List_Parts_2_C_SetItemInfo, CallFunc_GetItemDataCell_ReturnValue) == 0x000098, "Member 'WB_ui_Trade_List_Parts_2_C_SetItemInfo::CallFunc_GetItemDataCell_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Trade_List_Parts_2_C_SetItemInfo, CallFunc_UI_GetArrayColor_Shop_Frame_1_UI_ColorArray_Shop_Frame_1) == 0x00009C, "Member 'WB_ui_Trade_List_Parts_2_C_SetItemInfo::CallFunc_UI_GetArrayColor_Shop_Frame_1_UI_ColorArray_Shop_Frame_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Trade_List_Parts_2_C_SetItemInfo, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000AC, "Member 'WB_ui_Trade_List_Parts_2_C_SetItemInfo::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

}

