#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_DetailMap_Parts_2

#include "Basic.hpp"

#include "Enum_ui_detail_map_parts_2_animation_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_2_C.ExecuteUbergraph_WB_ui_DetailMap_Parts_2
// 0x0034 (0x0034 - 0x0000)
struct WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5734[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5735[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5736[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5737[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2) == 0x000004, "Wrong alignment on WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2");
static_assert(sizeof(WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2) == 0x000034, "Wrong size on WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2, EntryPoint) == 0x000000, "Member 'WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2, K2Node_Event_State) == 0x000010, "Member 'WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2, K2Node_Event_SubState) == 0x000014, "Member 'WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00001C, "Member 'WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000020, "Member 'WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2, K2Node_SwitchInteger_CmpSuccess) == 0x000024, "Member 'WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2, CallFunc_MakeLiteralInt_ReturnValue) == 0x000028, "Member 'WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x00002C, "Member 'WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000030, "Member 'WB_ui_DetailMap_Parts_2_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");

// Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_2_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_DetailMap_Parts_2_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_DetailMap_Parts_2_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_DetailMap_Parts_2_C_UpdateState");
static_assert(sizeof(WB_ui_DetailMap_Parts_2_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_DetailMap_Parts_2_C_UpdateState");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_UpdateState, State) == 0x000000, "Member 'WB_ui_DetailMap_Parts_2_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_DetailMap_Parts_2_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_DetailMap_Parts_2_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_2_C.StateNone
// 0x000C (0x000C - 0x0000)
struct WB_ui_DetailMap_Parts_2_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5738[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_DetailMap_Parts_2_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_DetailMap_Parts_2_C_StateNone");
static_assert(sizeof(WB_ui_DetailMap_Parts_2_C_StateNone) == 0x00000C, "Wrong size on WB_ui_DetailMap_Parts_2_C_StateNone");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_DetailMap_Parts_2_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_DetailMap_Parts_2_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000005, "Member 'WB_ui_DetailMap_Parts_2_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_DetailMap_Parts_2_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_2_C.StateUpdate
// 0x0014 (0x0014 - 0x0000)
struct WB_ui_DetailMap_Parts_2_C_StateUpdate final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5739[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_573A[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_DetailMap_Parts_2_C_StateUpdate) == 0x000004, "Wrong alignment on WB_ui_DetailMap_Parts_2_C_StateUpdate");
static_assert(sizeof(WB_ui_DetailMap_Parts_2_C_StateUpdate) == 0x000014, "Wrong size on WB_ui_DetailMap_Parts_2_C_StateUpdate");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_StateUpdate, SubState) == 0x000000, "Member 'WB_ui_DetailMap_Parts_2_C_StateUpdate::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_StateUpdate, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_DetailMap_Parts_2_C_StateUpdate::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_StateUpdate, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_DetailMap_Parts_2_C_StateUpdate::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_StateUpdate, CallFunc_MakeLiteralByte_ReturnValue) == 0x00000C, "Member 'WB_ui_DetailMap_Parts_2_C_StateUpdate::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_StateUpdate, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000010, "Member 'WB_ui_DetailMap_Parts_2_C_StateUpdate::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_2_C.Setup
// 0x0040 (0x0040 - 0x0000)
struct WB_ui_DetailMap_Parts_2_C_Setup final
{
public:
	bool                                          IsDraw;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsCheck;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_573B[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MessageIcon;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Message;                                           // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
};
static_assert(alignof(WB_ui_DetailMap_Parts_2_C_Setup) == 0x000008, "Wrong alignment on WB_ui_DetailMap_Parts_2_C_Setup");
static_assert(sizeof(WB_ui_DetailMap_Parts_2_C_Setup) == 0x000040, "Wrong size on WB_ui_DetailMap_Parts_2_C_Setup");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_Setup, IsDraw) == 0x000000, "Member 'WB_ui_DetailMap_Parts_2_C_Setup::IsDraw' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_Setup, IsCheck) == 0x000001, "Member 'WB_ui_DetailMap_Parts_2_C_Setup::IsCheck' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_Setup, MessageIcon) == 0x000008, "Member 'WB_ui_DetailMap_Parts_2_C_Setup::MessageIcon' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_Setup, Message) == 0x000018, "Member 'WB_ui_DetailMap_Parts_2_C_Setup::Message' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_Setup, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'WB_ui_DetailMap_Parts_2_C_Setup::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_2_C.SetAnime
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_DetailMap_Parts_2_C_SetAnime final
{
public:
	Enum_ui_detail_map_parts_2_animation          Anime;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_DetailMap_Parts_2_C_SetAnime) == 0x000001, "Wrong alignment on WB_ui_DetailMap_Parts_2_C_SetAnime");
static_assert(sizeof(WB_ui_DetailMap_Parts_2_C_SetAnime) == 0x000001, "Wrong size on WB_ui_DetailMap_Parts_2_C_SetAnime");
static_assert(offsetof(WB_ui_DetailMap_Parts_2_C_SetAnime, Anime) == 0x000000, "Member 'WB_ui_DetailMap_Parts_2_C_SetAnime::Anime' has a wrong offset!");

}

