#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Vitality_pl_01

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Vitality_pl_01.WB_ui_Vitality_pl_01_C.ExecuteUbergraph_WB_ui_Vitality_pl_01
// 0x0030 (0x0030 - 0x0000)
struct WB_ui_Vitality_pl_01_C_ExecuteUbergraph_WB_ui_Vitality_pl_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 K2Node_Event_icon_1;                               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index_1;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_665D[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 K2Node_Event_icon;                                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Vitality_pl_01_C_ExecuteUbergraph_WB_ui_Vitality_pl_01) == 0x000008, "Wrong alignment on WB_ui_Vitality_pl_01_C_ExecuteUbergraph_WB_ui_Vitality_pl_01");
static_assert(sizeof(WB_ui_Vitality_pl_01_C_ExecuteUbergraph_WB_ui_Vitality_pl_01) == 0x000030, "Wrong size on WB_ui_Vitality_pl_01_C_ExecuteUbergraph_WB_ui_Vitality_pl_01");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_ExecuteUbergraph_WB_ui_Vitality_pl_01, EntryPoint) == 0x000000, "Member 'WB_ui_Vitality_pl_01_C_ExecuteUbergraph_WB_ui_Vitality_pl_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_ExecuteUbergraph_WB_ui_Vitality_pl_01, K2Node_Event_State) == 0x000004, "Member 'WB_ui_Vitality_pl_01_C_ExecuteUbergraph_WB_ui_Vitality_pl_01::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_ExecuteUbergraph_WB_ui_Vitality_pl_01, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_Vitality_pl_01_C_ExecuteUbergraph_WB_ui_Vitality_pl_01::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_ExecuteUbergraph_WB_ui_Vitality_pl_01, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_Vitality_pl_01_C_ExecuteUbergraph_WB_ui_Vitality_pl_01::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_ExecuteUbergraph_WB_ui_Vitality_pl_01, K2Node_Event_icon_1) == 0x000010, "Member 'WB_ui_Vitality_pl_01_C_ExecuteUbergraph_WB_ui_Vitality_pl_01::K2Node_Event_icon_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_ExecuteUbergraph_WB_ui_Vitality_pl_01, K2Node_Event_index_1) == 0x000018, "Member 'WB_ui_Vitality_pl_01_C_ExecuteUbergraph_WB_ui_Vitality_pl_01::K2Node_Event_index_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_ExecuteUbergraph_WB_ui_Vitality_pl_01, K2Node_Event_icon) == 0x000020, "Member 'WB_ui_Vitality_pl_01_C_ExecuteUbergraph_WB_ui_Vitality_pl_01::K2Node_Event_icon' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_ExecuteUbergraph_WB_ui_Vitality_pl_01, K2Node_Event_index) == 0x000028, "Member 'WB_ui_Vitality_pl_01_C_ExecuteUbergraph_WB_ui_Vitality_pl_01::K2Node_Event_index' has a wrong offset!");

// Function WB_ui_Vitality_pl_01.WB_ui_Vitality_pl_01_C.SetIcon2
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Vitality_pl_01_C_SetIcon2 final
{
public:
	class UImage*                                 Icon;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Vitality_pl_01_C_SetIcon2) == 0x000008, "Wrong alignment on WB_ui_Vitality_pl_01_C_SetIcon2");
static_assert(sizeof(WB_ui_Vitality_pl_01_C_SetIcon2) == 0x000010, "Wrong size on WB_ui_Vitality_pl_01_C_SetIcon2");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_SetIcon2, Icon) == 0x000000, "Member 'WB_ui_Vitality_pl_01_C_SetIcon2::Icon' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_SetIcon2, Param_Index) == 0x000008, "Member 'WB_ui_Vitality_pl_01_C_SetIcon2::Param_Index' has a wrong offset!");

// Function WB_ui_Vitality_pl_01.WB_ui_Vitality_pl_01_C.SetIcon1
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Vitality_pl_01_C_SetIcon1 final
{
public:
	class UImage*                                 Icon;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Vitality_pl_01_C_SetIcon1) == 0x000008, "Wrong alignment on WB_ui_Vitality_pl_01_C_SetIcon1");
static_assert(sizeof(WB_ui_Vitality_pl_01_C_SetIcon1) == 0x000010, "Wrong size on WB_ui_Vitality_pl_01_C_SetIcon1");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_SetIcon1, Icon) == 0x000000, "Member 'WB_ui_Vitality_pl_01_C_SetIcon1::Icon' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_SetIcon1, Param_Index) == 0x000008, "Member 'WB_ui_Vitality_pl_01_C_SetIcon1::Param_Index' has a wrong offset!");

// Function WB_ui_Vitality_pl_01.WB_ui_Vitality_pl_01_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Vitality_pl_01_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Vitality_pl_01_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Vitality_pl_01_C_UpdateState");
static_assert(sizeof(WB_ui_Vitality_pl_01_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Vitality_pl_01_C_UpdateState");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Vitality_pl_01_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Vitality_pl_01_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Vitality_pl_01_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Vitality_pl_01.WB_ui_Vitality_pl_01_C.GetWavePower
// 0x0048 (0x0048 - 0x0000)
struct WB_ui_Vitality_pl_01_C_GetWavePower final
{
public:
	float                                         PowerAddTime;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WavePowerMax;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewParam;                                          // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_665E[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 WavePowerList;                                     // 0x0010(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_665F[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Vitality_pl_01_C_GetWavePower) == 0x000008, "Wrong alignment on WB_ui_Vitality_pl_01_C_GetWavePower");
static_assert(sizeof(WB_ui_Vitality_pl_01_C_GetWavePower) == 0x000048, "Wrong size on WB_ui_Vitality_pl_01_C_GetWavePower");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_GetWavePower, PowerAddTime) == 0x000000, "Member 'WB_ui_Vitality_pl_01_C_GetWavePower::PowerAddTime' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_GetWavePower, WavePowerMax) == 0x000004, "Member 'WB_ui_Vitality_pl_01_C_GetWavePower::WavePowerMax' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_GetWavePower, NewParam) == 0x000008, "Member 'WB_ui_Vitality_pl_01_C_GetWavePower::NewParam' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_GetWavePower, WavePowerList) == 0x000010, "Member 'WB_ui_Vitality_pl_01_C_GetWavePower::WavePowerList' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_GetWavePower, K2Node_MakeArray_Array) == 0x000020, "Member 'WB_ui_Vitality_pl_01_C_GetWavePower::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_GetWavePower, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WB_ui_Vitality_pl_01_C_GetWavePower::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_GetWavePower, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000034, "Member 'WB_ui_Vitality_pl_01_C_GetWavePower::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_GetWavePower, CallFunc_FTrunc_ReturnValue) == 0x000038, "Member 'WB_ui_Vitality_pl_01_C_GetWavePower::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_GetWavePower, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'WB_ui_Vitality_pl_01_C_GetWavePower::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_GetWavePower, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WB_ui_Vitality_pl_01_C_GetWavePower::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_GetWavePower, CallFunc_Greater_IntInt_ReturnValue) == 0x000041, "Member 'WB_ui_Vitality_pl_01_C_GetWavePower::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WB_ui_Vitality_pl_01.WB_ui_Vitality_pl_01_C.CreateDynamicGaugeMaterial
// 0x0040 (0x0040 - 0x0000)
struct WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6660[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6661[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6662[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6663[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial) == 0x000008, "Wrong alignment on WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial");
static_assert(sizeof(WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial) == 0x000040, "Wrong size on WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial, ReturnValue) == 0x000000, "Member 'WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000018, "Member 'WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial, CallFunc_Array_Add_ReturnValue) == 0x000024, "Member 'WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial, CallFunc_Array_Add_ReturnValue_1) == 0x000028, "Member 'WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000030, "Member 'WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial, CallFunc_Array_Add_ReturnValue_2) == 0x000038, "Member 'WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial, CallFunc_IsValid_ReturnValue_2) == 0x00003C, "Member 'WB_ui_Vitality_pl_01_C_CreateDynamicGaugeMaterial::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WB_ui_Vitality_pl_01.WB_ui_Vitality_pl_01_C.IsUnlockPlayerChara
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_Vitality_pl_01_C_IsUnlockPlayerChara final
{
public:
	EPlayerID                                     CharaID;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6664[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisibleCharaNameForProgressID_ReturnValue; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Vitality_pl_01_C_IsUnlockPlayerChara) == 0x000008, "Wrong alignment on WB_ui_Vitality_pl_01_C_IsUnlockPlayerChara");
static_assert(sizeof(WB_ui_Vitality_pl_01_C_IsUnlockPlayerChara) == 0x000018, "Wrong size on WB_ui_Vitality_pl_01_C_IsUnlockPlayerChara");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_IsUnlockPlayerChara, CharaID) == 0x000000, "Member 'WB_ui_Vitality_pl_01_C_IsUnlockPlayerChara::CharaID' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_IsUnlockPlayerChara, ReturnValue) == 0x000001, "Member 'WB_ui_Vitality_pl_01_C_IsUnlockPlayerChara::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_IsUnlockPlayerChara, CallFunc_GetEventManager_EventManager) == 0x000008, "Member 'WB_ui_Vitality_pl_01_C_IsUnlockPlayerChara::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(WB_ui_Vitality_pl_01_C_IsUnlockPlayerChara, CallFunc_IsVisibleCharaNameForProgressID_ReturnValue) == 0x000010, "Member 'WB_ui_Vitality_pl_01_C_IsUnlockPlayerChara::CallFunc_IsVisibleCharaNameForProgressID_ReturnValue' has a wrong offset!");

}

