#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Action_Sas

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Action_Sas.WB_ui_Action_Sas_C.ExecuteUbergraph_WB_ui_Action_Sas
// 0x0014 (0x0014 - 0x0000)
struct WB_ui_Action_Sas_C_ExecuteUbergraph_WB_ui_Action_Sas final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESASActionIconType                            K2Node_Event_iconType;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isUsable_1;                           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_isUsable;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Action_Sas_C_ExecuteUbergraph_WB_ui_Action_Sas) == 0x000004, "Wrong alignment on WB_ui_Action_Sas_C_ExecuteUbergraph_WB_ui_Action_Sas");
static_assert(sizeof(WB_ui_Action_Sas_C_ExecuteUbergraph_WB_ui_Action_Sas) == 0x000014, "Wrong size on WB_ui_Action_Sas_C_ExecuteUbergraph_WB_ui_Action_Sas");
static_assert(offsetof(WB_ui_Action_Sas_C_ExecuteUbergraph_WB_ui_Action_Sas, EntryPoint) == 0x000000, "Member 'WB_ui_Action_Sas_C_ExecuteUbergraph_WB_ui_Action_Sas::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Action_Sas_C_ExecuteUbergraph_WB_ui_Action_Sas, K2Node_Event_State) == 0x000004, "Member 'WB_ui_Action_Sas_C_ExecuteUbergraph_WB_ui_Action_Sas::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Action_Sas_C_ExecuteUbergraph_WB_ui_Action_Sas, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_Action_Sas_C_ExecuteUbergraph_WB_ui_Action_Sas::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Action_Sas_C_ExecuteUbergraph_WB_ui_Action_Sas, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_Action_Sas_C_ExecuteUbergraph_WB_ui_Action_Sas::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Action_Sas_C_ExecuteUbergraph_WB_ui_Action_Sas, K2Node_Event_iconType) == 0x000010, "Member 'WB_ui_Action_Sas_C_ExecuteUbergraph_WB_ui_Action_Sas::K2Node_Event_iconType' has a wrong offset!");
static_assert(offsetof(WB_ui_Action_Sas_C_ExecuteUbergraph_WB_ui_Action_Sas, K2Node_Event_isUsable_1) == 0x000011, "Member 'WB_ui_Action_Sas_C_ExecuteUbergraph_WB_ui_Action_Sas::K2Node_Event_isUsable_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Action_Sas_C_ExecuteUbergraph_WB_ui_Action_Sas, K2Node_Event_isUsable) == 0x000012, "Member 'WB_ui_Action_Sas_C_ExecuteUbergraph_WB_ui_Action_Sas::K2Node_Event_isUsable' has a wrong offset!");
static_assert(offsetof(WB_ui_Action_Sas_C_ExecuteUbergraph_WB_ui_Action_Sas, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000013, "Member 'WB_ui_Action_Sas_C_ExecuteUbergraph_WB_ui_Action_Sas::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function WB_ui_Action_Sas.WB_ui_Action_Sas_C.setUsable
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Action_Sas_C_SetUsable final
{
public:
	bool                                          Param_IsUsable;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Action_Sas_C_SetUsable) == 0x000001, "Wrong alignment on WB_ui_Action_Sas_C_SetUsable");
static_assert(sizeof(WB_ui_Action_Sas_C_SetUsable) == 0x000001, "Wrong size on WB_ui_Action_Sas_C_SetUsable");
static_assert(offsetof(WB_ui_Action_Sas_C_SetUsable, Param_IsUsable) == 0x000000, "Member 'WB_ui_Action_Sas_C_SetUsable::Param_IsUsable' has a wrong offset!");

// Function WB_ui_Action_Sas.WB_ui_Action_Sas_C.setIconType
// 0x0002 (0x0002 - 0x0000)
struct WB_ui_Action_Sas_C_SetIconType final
{
public:
	ESASActionIconType                            Param_Icontype;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_IsUsable;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Action_Sas_C_SetIconType) == 0x000001, "Wrong alignment on WB_ui_Action_Sas_C_SetIconType");
static_assert(sizeof(WB_ui_Action_Sas_C_SetIconType) == 0x000002, "Wrong size on WB_ui_Action_Sas_C_SetIconType");
static_assert(offsetof(WB_ui_Action_Sas_C_SetIconType, Param_Icontype) == 0x000000, "Member 'WB_ui_Action_Sas_C_SetIconType::Param_Icontype' has a wrong offset!");
static_assert(offsetof(WB_ui_Action_Sas_C_SetIconType, Param_IsUsable) == 0x000001, "Member 'WB_ui_Action_Sas_C_SetIconType::Param_IsUsable' has a wrong offset!");

// Function WB_ui_Action_Sas.WB_ui_Action_Sas_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Action_Sas_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Action_Sas_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Action_Sas_C_UpdateState");
static_assert(sizeof(WB_ui_Action_Sas_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Action_Sas_C_UpdateState");
static_assert(offsetof(WB_ui_Action_Sas_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Action_Sas_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Action_Sas_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Action_Sas_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Action_Sas_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Action_Sas_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Action_Sas.WB_ui_Action_Sas_C.SetIconMaterial
// 0x0002 (0x0002 - 0x0000)
struct WB_ui_Action_Sas_C_SetIconMaterial final
{
public:
	ESASActionIconType                            Param_Icontype;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_IsUsable;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Action_Sas_C_SetIconMaterial) == 0x000001, "Wrong alignment on WB_ui_Action_Sas_C_SetIconMaterial");
static_assert(sizeof(WB_ui_Action_Sas_C_SetIconMaterial) == 0x000002, "Wrong size on WB_ui_Action_Sas_C_SetIconMaterial");
static_assert(offsetof(WB_ui_Action_Sas_C_SetIconMaterial, Param_Icontype) == 0x000000, "Member 'WB_ui_Action_Sas_C_SetIconMaterial::Param_Icontype' has a wrong offset!");
static_assert(offsetof(WB_ui_Action_Sas_C_SetIconMaterial, Param_IsUsable) == 0x000001, "Member 'WB_ui_Action_Sas_C_SetIconMaterial::Param_IsUsable' has a wrong offset!");

}

