#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_ShopList_Parts_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_ShopList_Parts_1.WB_ui_ShopList_Parts_1_C
// 0x00B8 (0x0528 - 0x0470)
class UWB_ui_ShopList_Parts_1_C final : public UUIShopListIndex
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Select_in;                                         // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select;                                            // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_black;                                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_select;                                       // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_1;                                           // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDOverlay*                            Frame_set;                                         // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ghost_frame;                                       // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_category;                                     // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_new;                                          // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Item_icon_frame_2;                                 // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDHorizonFlipbookWidget*              PF_Arrow_L;                                        // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDHorizonFlipbookWidget*              PF_Arrow_R;                                        // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_shop_list_1;                                  // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_shop_list_1_num;                              // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_shop_list_2_num;                              // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_shop_list_3_num;                              // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPaperFlipbook*                         DefaultPF;                                         // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperFlipbook*                         SelectPF;                                          // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperFlipbook*                         SelectInPF;                                        // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperFlipbook*                         SelectOutPF;                                       // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperFlipbook*                         DecisionPF;                                        // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_ShopList_Parts_1(int32 EntryPoint);
	void OnInitialized();
	void Construct();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	bool SetItemInfo(const class FName& ItemId, int32 ItemIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_ShopList_Parts_1_C">();
	}
	static class UWB_ui_ShopList_Parts_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_ShopList_Parts_1_C>();
	}
};
static_assert(alignof(UWB_ui_ShopList_Parts_1_C) == 0x000008, "Wrong alignment on UWB_ui_ShopList_Parts_1_C");
static_assert(sizeof(UWB_ui_ShopList_Parts_1_C) == 0x000528, "Wrong size on UWB_ui_ShopList_Parts_1_C");
static_assert(offsetof(UWB_ui_ShopList_Parts_1_C, UberGraphFrame) == 0x000470, "Member 'UWB_ui_ShopList_Parts_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopList_Parts_1_C, Select_in) == 0x000478, "Member 'UWB_ui_ShopList_Parts_1_C::Select_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopList_Parts_1_C, Select) == 0x000480, "Member 'UWB_ui_ShopList_Parts_1_C::Select' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopList_Parts_1_C, Default) == 0x000488, "Member 'UWB_ui_ShopList_Parts_1_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopList_Parts_1_C, Base_black) == 0x000490, "Member 'UWB_ui_ShopList_Parts_1_C::Base_black' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopList_Parts_1_C, Base_select) == 0x000498, "Member 'UWB_ui_ShopList_Parts_1_C::Base_select' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopList_Parts_1_C, Frame_1) == 0x0004A0, "Member 'UWB_ui_ShopList_Parts_1_C::Frame_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopList_Parts_1_C, Frame_set) == 0x0004A8, "Member 'UWB_ui_ShopList_Parts_1_C::Frame_set' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopList_Parts_1_C, Ghost_frame) == 0x0004B0, "Member 'UWB_ui_ShopList_Parts_1_C::Ghost_frame' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopList_Parts_1_C, Icon_category) == 0x0004B8, "Member 'UWB_ui_ShopList_Parts_1_C::Icon_category' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopList_Parts_1_C, Icon_new) == 0x0004C0, "Member 'UWB_ui_ShopList_Parts_1_C::Icon_new' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopList_Parts_1_C, Item_icon_frame_2) == 0x0004C8, "Member 'UWB_ui_ShopList_Parts_1_C::Item_icon_frame_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopList_Parts_1_C, PF_Arrow_L) == 0x0004D0, "Member 'UWB_ui_ShopList_Parts_1_C::PF_Arrow_L' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopList_Parts_1_C, PF_Arrow_R) == 0x0004D8, "Member 'UWB_ui_ShopList_Parts_1_C::PF_Arrow_R' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopList_Parts_1_C, Text_shop_list_1) == 0x0004E0, "Member 'UWB_ui_ShopList_Parts_1_C::Text_shop_list_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopList_Parts_1_C, Text_shop_list_1_num) == 0x0004E8, "Member 'UWB_ui_ShopList_Parts_1_C::Text_shop_list_1_num' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopList_Parts_1_C, Text_shop_list_2_num) == 0x0004F0, "Member 'UWB_ui_ShopList_Parts_1_C::Text_shop_list_2_num' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopList_Parts_1_C, Text_shop_list_3_num) == 0x0004F8, "Member 'UWB_ui_ShopList_Parts_1_C::Text_shop_list_3_num' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopList_Parts_1_C, DefaultPF) == 0x000500, "Member 'UWB_ui_ShopList_Parts_1_C::DefaultPF' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopList_Parts_1_C, SelectPF) == 0x000508, "Member 'UWB_ui_ShopList_Parts_1_C::SelectPF' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopList_Parts_1_C, SelectInPF) == 0x000510, "Member 'UWB_ui_ShopList_Parts_1_C::SelectInPF' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopList_Parts_1_C, SelectOutPF) == 0x000518, "Member 'UWB_ui_ShopList_Parts_1_C::SelectOutPF' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopList_Parts_1_C, DecisionPF) == 0x000520, "Member 'UWB_ui_ShopList_Parts_1_C::DecisionPF' has a wrong offset!");

}

