#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Books

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Books.WB_ui_Books_C
// 0x0150 (0x0810 - 0x06C0)
class UWB_ui_Books_C final : public UUIBooksTop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Info_window_out;                                   // 0x06C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Info_window_in;                                    // 0x06D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Info_window;                                       // 0x06D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Chanege_default;                                   // 0x06E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_view;                                       // 0x06E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_view;                                      // 0x06F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Contents_out;                                      // 0x06F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Contents_in;                                       // 0x0700(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0708(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0710(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0718(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_1;                                     // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_1;                                            // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_2;                                            // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_3;                                            // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_4;                                            // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_5;                                            // 0x0748(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x0750(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_2;                                         // 0x0758(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                PG_All_Color;                                      // 0x0760(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PG_Cover_Black;                                    // 0x0768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PG_Ghost_Viewer;                                   // 0x0770(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                PG_Picture_set;                                    // 0x0778(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDRetainerBox*                        PG_REDRetainerBox_Menu;                            // 0x0780(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PG_viewer_noise;                                   // 0x0788(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Picture;                                           // 0x0790(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_BrainMes_C*                      WB_ui_BrainMes;                                    // 0x0798(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Chara_C*                         WB_ui_Chara;                                       // 0x07A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Enemy_C*                         WB_ui_Enemy;                                       // 0x07A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Help_C*                          WB_ui_Help;                                        // 0x07B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MainContents_Parts_4_C*          WB_ui_MainContents_Parts_4;                        // 0x07B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MainContents_Parts_5_C*          WB_ui_MainContents_Parts_5;                        // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MainContents_Parts_6_C*          WB_ui_MainContents_Parts_6_1;                      // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MainContents_Parts_6_C*          WB_ui_MainContents_Parts_6_2;                      // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MainContents_Parts_6_C*          WB_ui_MainContents_Parts_6_3;                      // 0x07D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MainContents_Parts_6_C*          WB_ui_MainContents_Parts_6_4;                      // 0x07E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MainContents_Parts_6_C*          WB_ui_MainContents_Parts_6_5;                      // 0x07E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_MainContents_Parts_6_C*          WB_ui_MainContents_Parts_6_6;                      // 0x07F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Quest_Achievement_Parts_1_C*     WB_ui_Quest_Achievement_Parts_1;                   // 0x07F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Quest_PopUp_1_C*                 WB_ui_Quest_PopUp_1;                               // 0x0800(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Wish_C*                          WB_ui_Wish;                                        // 0x0808(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Books(int32 EntryPoint);
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void UpdateBooksViewerMaterial();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Books_C">();
	}
	static class UWB_ui_Books_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Books_C>();
	}
};
static_assert(alignof(UWB_ui_Books_C) == 0x000008, "Wrong alignment on UWB_ui_Books_C");
static_assert(sizeof(UWB_ui_Books_C) == 0x000810, "Wrong size on UWB_ui_Books_C");
static_assert(offsetof(UWB_ui_Books_C, UberGraphFrame) == 0x0006C0, "Member 'UWB_ui_Books_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, Info_window_out) == 0x0006C8, "Member 'UWB_ui_Books_C::Info_window_out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, Info_window_in) == 0x0006D0, "Member 'UWB_ui_Books_C::Info_window_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, Info_window) == 0x0006D8, "Member 'UWB_ui_Books_C::Info_window' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, Chanege_default) == 0x0006E0, "Member 'UWB_ui_Books_C::Chanege_default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, Change_view) == 0x0006E8, "Member 'UWB_ui_Books_C::Change_view' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, Default_view) == 0x0006F0, "Member 'UWB_ui_Books_C::Default_view' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, Contents_out) == 0x0006F8, "Member 'UWB_ui_Books_C::Contents_out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, Contents_in) == 0x000700, "Member 'UWB_ui_Books_C::Contents_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, Out) == 0x000708, "Member 'UWB_ui_Books_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, In) == 0x000710, "Member 'UWB_ui_Books_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, Default) == 0x000718, "Member 'UWB_ui_Books_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, CanvasPanel_1) == 0x000720, "Member 'UWB_ui_Books_C::CanvasPanel_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, Line_1) == 0x000728, "Member 'UWB_ui_Books_C::Line_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, Line_2) == 0x000730, "Member 'UWB_ui_Books_C::Line_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, Line_3) == 0x000738, "Member 'UWB_ui_Books_C::Line_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, Line_4) == 0x000740, "Member 'UWB_ui_Books_C::Line_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, Line_5) == 0x000748, "Member 'UWB_ui_Books_C::Line_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, Overlay_0) == 0x000750, "Member 'UWB_ui_Books_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, Overlay_2) == 0x000758, "Member 'UWB_ui_Books_C::Overlay_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, PG_All_Color) == 0x000760, "Member 'UWB_ui_Books_C::PG_All_Color' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, PG_Cover_Black) == 0x000768, "Member 'UWB_ui_Books_C::PG_Cover_Black' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, PG_Ghost_Viewer) == 0x000770, "Member 'UWB_ui_Books_C::PG_Ghost_Viewer' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, PG_Picture_set) == 0x000778, "Member 'UWB_ui_Books_C::PG_Picture_set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, PG_REDRetainerBox_Menu) == 0x000780, "Member 'UWB_ui_Books_C::PG_REDRetainerBox_Menu' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, PG_viewer_noise) == 0x000788, "Member 'UWB_ui_Books_C::PG_viewer_noise' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, Picture) == 0x000790, "Member 'UWB_ui_Books_C::Picture' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, WB_ui_BrainMes) == 0x000798, "Member 'UWB_ui_Books_C::WB_ui_BrainMes' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, WB_ui_Chara) == 0x0007A0, "Member 'UWB_ui_Books_C::WB_ui_Chara' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, WB_ui_Enemy) == 0x0007A8, "Member 'UWB_ui_Books_C::WB_ui_Enemy' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, WB_ui_Help) == 0x0007B0, "Member 'UWB_ui_Books_C::WB_ui_Help' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, WB_ui_MainContents_Parts_4) == 0x0007B8, "Member 'UWB_ui_Books_C::WB_ui_MainContents_Parts_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, WB_ui_MainContents_Parts_5) == 0x0007C0, "Member 'UWB_ui_Books_C::WB_ui_MainContents_Parts_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, WB_ui_MainContents_Parts_6_1) == 0x0007C8, "Member 'UWB_ui_Books_C::WB_ui_MainContents_Parts_6_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, WB_ui_MainContents_Parts_6_2) == 0x0007D0, "Member 'UWB_ui_Books_C::WB_ui_MainContents_Parts_6_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, WB_ui_MainContents_Parts_6_3) == 0x0007D8, "Member 'UWB_ui_Books_C::WB_ui_MainContents_Parts_6_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, WB_ui_MainContents_Parts_6_4) == 0x0007E0, "Member 'UWB_ui_Books_C::WB_ui_MainContents_Parts_6_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, WB_ui_MainContents_Parts_6_5) == 0x0007E8, "Member 'UWB_ui_Books_C::WB_ui_MainContents_Parts_6_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, WB_ui_MainContents_Parts_6_6) == 0x0007F0, "Member 'UWB_ui_Books_C::WB_ui_MainContents_Parts_6_6' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, WB_ui_Quest_Achievement_Parts_1) == 0x0007F8, "Member 'UWB_ui_Books_C::WB_ui_Quest_Achievement_Parts_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, WB_ui_Quest_PopUp_1) == 0x000800, "Member 'UWB_ui_Books_C::WB_ui_Quest_PopUp_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Books_C, WB_ui_Wish) == 0x000808, "Member 'UWB_ui_Books_C::WB_ui_Wish' has a wrong offset!");

}

