#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Equip_Parts_2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Equip_Parts_2.WB_ui_Equip_Parts_2_C.ExecuteUbergraph_WB_ui_Equip_Parts_2
// 0x0070 (0x0070 - 0x0000)
struct WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D19[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D1A[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D1B[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D1C[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D1D[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_8;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D1E[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_9;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_10;           // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D1F[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_10;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_11;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D20[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_11;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_12;           // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D21[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_State;                                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_12;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_13;           // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D22[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_13;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2) == 0x000004, "Wrong alignment on WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2");
static_assert(sizeof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2) == 0x000070, "Wrong size on WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, EntryPoint) == 0x000000, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000011, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000018, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x00001C, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x00001D, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000020, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000024, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000028, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000029, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x00002C, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x000030, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x000034, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_8) == 0x000038, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_9) == 0x00003C, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_9) == 0x000040, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_10) == 0x000044, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_10) == 0x000048, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_11) == 0x00004C, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_11) == 0x000050, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_12) == 0x000054, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, K2Node_Event_State) == 0x000058, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, K2Node_Event_SubState) == 0x00005C, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, K2Node_Event_DeltaSeconds) == 0x000060, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_12) == 0x000064, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, K2Node_SwitchInteger_CmpSuccess) == 0x000068, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_13) == 0x000069, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_13) == 0x00006C, "Member 'WB_ui_Equip_Parts_2_C_ExecuteUbergraph_WB_ui_Equip_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_13' has a wrong offset!");

// Function WB_ui_Equip_Parts_2.WB_ui_Equip_Parts_2_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Equip_Parts_2_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_2_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Equip_Parts_2_C_UpdateState");
static_assert(sizeof(WB_ui_Equip_Parts_2_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Equip_Parts_2_C_UpdateState");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Equip_Parts_2_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Equip_Parts_2_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Equip_Parts_2_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Equip_Parts_2.WB_ui_Equip_Parts_2_C.StateNone
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Equip_Parts_2_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D23[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_2_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_Equip_Parts_2_C_StateNone");
static_assert(sizeof(WB_ui_Equip_Parts_2_C_StateNone) == 0x000010, "Wrong size on WB_ui_Equip_Parts_2_C_StateNone");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_Equip_Parts_2_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Equip_Parts_2_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Equip_Parts_2_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_Equip_Parts_2_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Equip_Parts_2_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Equip_Parts_2_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_Equip_Parts_2.WB_ui_Equip_Parts_2_C.StateLoop
// 0x0044 (0x0044 - 0x0000)
struct WB_ui_Equip_Parts_2_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _WorkSubState;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D24[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D25[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D26[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D27[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_1;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D28[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Equip_Parts_2_C_StateLoop) == 0x000004, "Wrong alignment on WB_ui_Equip_Parts_2_C_StateLoop");
static_assert(sizeof(WB_ui_Equip_Parts_2_C_StateLoop) == 0x000044, "Wrong size on WB_ui_Equip_Parts_2_C_StateLoop");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, _WorkSubState) == 0x000004, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::_WorkSubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000008, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, CallFunc_BooleanOR_ReturnValue) == 0x000009, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, K2Node_SwitchInteger_CmpSuccess_1) == 0x00000A, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue) == 0x00000B, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, CallFunc_BooleanOR_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000010, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000014, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000015, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000018, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x00001C, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000020, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000021, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000024, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000028, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x00002C, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000030, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, CallFunc_NotEqual_BoolBool_ReturnValue_1) == 0x000031, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::CallFunc_NotEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, CallFunc_BooleanOR_ReturnValue_2) == 0x000032, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000033, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000034, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000038, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x00003C, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoop, CallFunc_BooleanOR_ReturnValue_3) == 0x000040, "Member 'WB_ui_Equip_Parts_2_C_StateLoop::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");

// Function WB_ui_Equip_Parts_2.WB_ui_Equip_Parts_2_C.StateLoopSelect
// 0x004C (0x004C - 0x0000)
struct WB_ui_Equip_Parts_2_C_StateLoopSelect final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D29[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D2A[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D2B[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D2C[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D2D[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D2E[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D2F[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_1;        // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D30[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_8;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Equip_Parts_2_C_StateLoopSelect) == 0x000004, "Wrong alignment on WB_ui_Equip_Parts_2_C_StateLoopSelect");
static_assert(sizeof(WB_ui_Equip_Parts_2_C_StateLoopSelect) == 0x00004C, "Wrong size on WB_ui_Equip_Parts_2_C_StateLoopSelect");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, SubState) == 0x000000, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000011, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000018, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x00001C, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, CallFunc_BooleanOR_ReturnValue) == 0x000020, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000021, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000024, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, CallFunc_BooleanOR_ReturnValue_1) == 0x000028, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000029, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x00002C, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000030, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000031, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x000034, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000038, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x00003C, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x000040, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, CallFunc_IsPlayUICurrentAnimation_isPlay_1) == 0x000041, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::CallFunc_IsPlayUICurrentAnimation_isPlay_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_8) == 0x000044, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopSelect, CallFunc_BooleanOR_ReturnValue_2) == 0x000048, "Member 'WB_ui_Equip_Parts_2_C_StateLoopSelect::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function WB_ui_Equip_Parts_2.WB_ui_Equip_Parts_2_C.StateLoopLock
// 0x0034 (0x0034 - 0x0000)
struct WB_ui_Equip_Parts_2_C_StateLoopLock final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D31[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D32[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D33[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D34[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D35[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_1;        // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D36[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_2_C_StateLoopLock) == 0x000004, "Wrong alignment on WB_ui_Equip_Parts_2_C_StateLoopLock");
static_assert(sizeof(WB_ui_Equip_Parts_2_C_StateLoopLock) == 0x000034, "Wrong size on WB_ui_Equip_Parts_2_C_StateLoopLock");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopLock, SubState) == 0x000000, "Member 'WB_ui_Equip_Parts_2_C_StateLoopLock::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopLock, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_Equip_Parts_2_C_StateLoopLock::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopLock, CallFunc_MakeLiteralByte_ReturnValue) == 0x000005, "Member 'WB_ui_Equip_Parts_2_C_StateLoopLock::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopLock, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Equip_Parts_2_C_StateLoopLock::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopLock, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Equip_Parts_2_C_StateLoopLock::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopLock, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000010, "Member 'WB_ui_Equip_Parts_2_C_StateLoopLock::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopLock, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000014, "Member 'WB_ui_Equip_Parts_2_C_StateLoopLock::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopLock, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000015, "Member 'WB_ui_Equip_Parts_2_C_StateLoopLock::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopLock, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000018, "Member 'WB_ui_Equip_Parts_2_C_StateLoopLock::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopLock, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x00001C, "Member 'WB_ui_Equip_Parts_2_C_StateLoopLock::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopLock, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000020, "Member 'WB_ui_Equip_Parts_2_C_StateLoopLock::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopLock, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000024, "Member 'WB_ui_Equip_Parts_2_C_StateLoopLock::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopLock, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000028, "Member 'WB_ui_Equip_Parts_2_C_StateLoopLock::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopLock, CallFunc_IsPlayUICurrentAnimation_isPlay_1) == 0x00002C, "Member 'WB_ui_Equip_Parts_2_C_StateLoopLock::CallFunc_IsPlayUICurrentAnimation_isPlay_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopLock, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x00002D, "Member 'WB_ui_Equip_Parts_2_C_StateLoopLock::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_StateLoopLock, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000030, "Member 'WB_ui_Equip_Parts_2_C_StateLoopLock::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");

// Function WB_ui_Equip_Parts_2.WB_ui_Equip_Parts_2_C.SetSelect
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Equip_Parts_2_C_SetSelect final
{
public:
	bool                                          Param_IsSelect;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Equip_Parts_2_C_SetSelect) == 0x000001, "Wrong alignment on WB_ui_Equip_Parts_2_C_SetSelect");
static_assert(sizeof(WB_ui_Equip_Parts_2_C_SetSelect) == 0x000001, "Wrong size on WB_ui_Equip_Parts_2_C_SetSelect");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_SetSelect, Param_IsSelect) == 0x000000, "Member 'WB_ui_Equip_Parts_2_C_SetSelect::Param_IsSelect' has a wrong offset!");

// Function WB_ui_Equip_Parts_2.WB_ui_Equip_Parts_2_C.SetLock
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Equip_Parts_2_C_SetLock final
{
public:
	bool                                          Param_IsLock;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Equip_Parts_2_C_SetLock) == 0x000001, "Wrong alignment on WB_ui_Equip_Parts_2_C_SetLock");
static_assert(sizeof(WB_ui_Equip_Parts_2_C_SetLock) == 0x000001, "Wrong size on WB_ui_Equip_Parts_2_C_SetLock");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_SetLock, Param_IsLock) == 0x000000, "Member 'WB_ui_Equip_Parts_2_C_SetLock::Param_IsLock' has a wrong offset!");

// Function WB_ui_Equip_Parts_2.WB_ui_Equip_Parts_2_C.SetWeapon
// 0x00D8 (0x00D8 - 0x0000)
struct WB_ui_Equip_Parts_2_C_SetWeapon final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D37[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemDataCell                          _ItemData;                                         // 0x0008(0x0080)(Edit, BlueprintVisible)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D38[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Right_ReturnValue;                        // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_2_C_SetWeapon) == 0x000008, "Wrong alignment on WB_ui_Equip_Parts_2_C_SetWeapon");
static_assert(sizeof(WB_ui_Equip_Parts_2_C_SetWeapon) == 0x0000D8, "Wrong size on WB_ui_Equip_Parts_2_C_SetWeapon");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_SetWeapon, ID) == 0x000000, "Member 'WB_ui_Equip_Parts_2_C_SetWeapon::ID' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_SetWeapon, _ItemData) == 0x000008, "Member 'WB_ui_Equip_Parts_2_C_SetWeapon::_ItemData' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_SetWeapon, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000088, "Member 'WB_ui_Equip_Parts_2_C_SetWeapon::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_SetWeapon, CallFunc_Conv_IntToString_ReturnValue) == 0x000090, "Member 'WB_ui_Equip_Parts_2_C_SetWeapon::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_SetWeapon, CallFunc_Concat_StrStr_ReturnValue) == 0x0000A0, "Member 'WB_ui_Equip_Parts_2_C_SetWeapon::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_SetWeapon, CallFunc_Right_ReturnValue) == 0x0000B0, "Member 'WB_ui_Equip_Parts_2_C_SetWeapon::CallFunc_Right_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_SetWeapon, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000C0, "Member 'WB_ui_Equip_Parts_2_C_SetWeapon::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_SetWeapon, CallFunc_Conv_StringToName_ReturnValue) == 0x0000D0, "Member 'WB_ui_Equip_Parts_2_C_SetWeapon::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

// Function WB_ui_Equip_Parts_2.WB_ui_Equip_Parts_2_C.SetAccessory
// 0x00F8 (0x00F8 - 0x0000)
struct WB_ui_Equip_Parts_2_C_SetAccessory final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ID;                                                // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemDataCell                          _ItemData;                                         // 0x0008(0x0080)(Edit, BlueprintVisible)
	TArray<int32>                                 _ThumbnailIndexList;                               // 0x0088(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D39[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Right_ReturnValue;                        // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_2_C_SetAccessory) == 0x000008, "Wrong alignment on WB_ui_Equip_Parts_2_C_SetAccessory");
static_assert(sizeof(WB_ui_Equip_Parts_2_C_SetAccessory) == 0x0000F8, "Wrong size on WB_ui_Equip_Parts_2_C_SetAccessory");
static_assert(offsetof(WB_ui_Equip_Parts_2_C_SetAccessory, Param_Index) == 0x000000, "Member 'WB_ui_Equip_Parts_2_C_SetAccessory::Param_Index' has a wrong offset!");
