#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_BrainMap_LineEffect_2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_BrainMap_LineEffect_2.WB_ui_BrainMap_LineEffect_2_C
// 0x0068 (0x03F0 - 0x0388)
class UWB_ui_BrainMap_LineEffect_2_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Decision_2;                                        // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Decision;                                          // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Line_eff_1;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_eff_2;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_eff_3;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_eff_4;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_eff_5;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_eff_6;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_eff_7;                                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_eff_8;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_eff_9;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_eff_base;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_BrainMap_LineEffect_2(int32 EntryPoint);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_BrainMap_LineEffect_2_C">();
	}
	static class UWB_ui_BrainMap_LineEffect_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_BrainMap_LineEffect_2_C>();
	}
};
static_assert(alignof(UWB_ui_BrainMap_LineEffect_2_C) == 0x000008, "Wrong alignment on UWB_ui_BrainMap_LineEffect_2_C");
static_assert(sizeof(UWB_ui_BrainMap_LineEffect_2_C) == 0x0003F0, "Wrong size on UWB_ui_BrainMap_LineEffect_2_C");
static_assert(offsetof(UWB_ui_BrainMap_LineEffect_2_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_BrainMap_LineEffect_2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_LineEffect_2_C, Decision_2) == 0x000390, "Member 'UWB_ui_BrainMap_LineEffect_2_C::Decision_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_LineEffect_2_C, Decision) == 0x000398, "Member 'UWB_ui_BrainMap_LineEffect_2_C::Decision' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_LineEffect_2_C, Line_eff_1) == 0x0003A0, "Member 'UWB_ui_BrainMap_LineEffect_2_C::Line_eff_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_LineEffect_2_C, Line_eff_2) == 0x0003A8, "Member 'UWB_ui_BrainMap_LineEffect_2_C::Line_eff_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_LineEffect_2_C, Line_eff_3) == 0x0003B0, "Member 'UWB_ui_BrainMap_LineEffect_2_C::Line_eff_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_LineEffect_2_C, Line_eff_4) == 0x0003B8, "Member 'UWB_ui_BrainMap_LineEffect_2_C::Line_eff_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_LineEffect_2_C, Line_eff_5) == 0x0003C0, "Member 'UWB_ui_BrainMap_LineEffect_2_C::Line_eff_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_LineEffect_2_C, Line_eff_6) == 0x0003C8, "Member 'UWB_ui_BrainMap_LineEffect_2_C::Line_eff_6' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_LineEffect_2_C, Line_eff_7) == 0x0003D0, "Member 'UWB_ui_BrainMap_LineEffect_2_C::Line_eff_7' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_LineEffect_2_C, Line_eff_8) == 0x0003D8, "Member 'UWB_ui_BrainMap_LineEffect_2_C::Line_eff_8' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_LineEffect_2_C, Line_eff_9) == 0x0003E0, "Member 'UWB_ui_BrainMap_LineEffect_2_C::Line_eff_9' has a wrong offset!");
static_assert(offsetof(UWB_ui_BrainMap_LineEffect_2_C, Line_eff_base) == 0x0003E8, "Member 'UWB_ui_BrainMap_LineEffect_2_C::Line_eff_base' has a wrong offset!");

}

