#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Sas_frame_01

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Sas_frame_01.WB_ui_Sas_frame_01_C.ExecuteUbergraph_WB_ui_Sas_frame_01
// 0x0020 (0x0020 - 0x0000)
struct WB_ui_Sas_frame_01_C_ExecuteUbergraph_WB_ui_Sas_frame_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 K2Node_Event_image;                                // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Sas_frame_01_C_ExecuteUbergraph_WB_ui_Sas_frame_01) == 0x000008, "Wrong alignment on WB_ui_Sas_frame_01_C_ExecuteUbergraph_WB_ui_Sas_frame_01");
static_assert(sizeof(WB_ui_Sas_frame_01_C_ExecuteUbergraph_WB_ui_Sas_frame_01) == 0x000020, "Wrong size on WB_ui_Sas_frame_01_C_ExecuteUbergraph_WB_ui_Sas_frame_01");
static_assert(offsetof(WB_ui_Sas_frame_01_C_ExecuteUbergraph_WB_ui_Sas_frame_01, EntryPoint) == 0x000000, "Member 'WB_ui_Sas_frame_01_C_ExecuteUbergraph_WB_ui_Sas_frame_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_frame_01_C_ExecuteUbergraph_WB_ui_Sas_frame_01, K2Node_Event_State) == 0x000004, "Member 'WB_ui_Sas_frame_01_C_ExecuteUbergraph_WB_ui_Sas_frame_01::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_frame_01_C_ExecuteUbergraph_WB_ui_Sas_frame_01, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_Sas_frame_01_C_ExecuteUbergraph_WB_ui_Sas_frame_01::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_frame_01_C_ExecuteUbergraph_WB_ui_Sas_frame_01, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_Sas_frame_01_C_ExecuteUbergraph_WB_ui_Sas_frame_01::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_frame_01_C_ExecuteUbergraph_WB_ui_Sas_frame_01, K2Node_Event_image) == 0x000010, "Member 'WB_ui_Sas_frame_01_C_ExecuteUbergraph_WB_ui_Sas_frame_01::K2Node_Event_image' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_frame_01_C_ExecuteUbergraph_WB_ui_Sas_frame_01, K2Node_Event_index) == 0x000018, "Member 'WB_ui_Sas_frame_01_C_ExecuteUbergraph_WB_ui_Sas_frame_01::K2Node_Event_index' has a wrong offset!");

// Function WB_ui_Sas_frame_01.WB_ui_Sas_frame_01_C.setSasGaugeR
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Sas_frame_01_C_SetSasGaugeR final
{
public:
	class UImage*                                 Image;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Sas_frame_01_C_SetSasGaugeR) == 0x000008, "Wrong alignment on WB_ui_Sas_frame_01_C_SetSasGaugeR");
static_assert(sizeof(WB_ui_Sas_frame_01_C_SetSasGaugeR) == 0x000010, "Wrong size on WB_ui_Sas_frame_01_C_SetSasGaugeR");
static_assert(offsetof(WB_ui_Sas_frame_01_C_SetSasGaugeR, Image) == 0x000000, "Member 'WB_ui_Sas_frame_01_C_SetSasGaugeR::Image' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_frame_01_C_SetSasGaugeR, Param_Index) == 0x000008, "Member 'WB_ui_Sas_frame_01_C_SetSasGaugeR::Param_Index' has a wrong offset!");

// Function WB_ui_Sas_frame_01.WB_ui_Sas_frame_01_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Sas_frame_01_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Sas_frame_01_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Sas_frame_01_C_UpdateState");
static_assert(sizeof(WB_ui_Sas_frame_01_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Sas_frame_01_C_UpdateState");
static_assert(offsetof(WB_ui_Sas_frame_01_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Sas_frame_01_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_frame_01_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Sas_frame_01_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_frame_01_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Sas_frame_01_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Sas_frame_01.WB_ui_Sas_frame_01_C.CheckCombinationVisionCost
// 0x0050 (0x0050 - 0x0000)
struct WB_ui_Sas_frame_01_C_CheckCombinationVisionCost final
{
public:
	E_SASKindNative                               Sas;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          _RetValue;                                         // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57D0[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57D1[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IRSGameModeBPInterface_C> K2Node_DynamicCast_AsRSGame_Mode_BPInterface;      // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57D2[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_GetMainPlayerBP_Player;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57D3[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      K2Node_DynamicCast_AsRSBattle_Player;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCombinationVisionCost_bOK;           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Sas_frame_01_C_CheckCombinationVisionCost) == 0x000008, "Wrong alignment on WB_ui_Sas_frame_01_C_CheckCombinationVisionCost");
static_assert(sizeof(WB_ui_Sas_frame_01_C_CheckCombinationVisionCost) == 0x000050, "Wrong size on WB_ui_Sas_frame_01_C_CheckCombinationVisionCost");
static_assert(offsetof(WB_ui_Sas_frame_01_C_CheckCombinationVisionCost, Sas) == 0x000000, "Member 'WB_ui_Sas_frame_01_C_CheckCombinationVisionCost::Sas' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_frame_01_C_CheckCombinationVisionCost, ReturnValue) == 0x000001, "Member 'WB_ui_Sas_frame_01_C_CheckCombinationVisionCost::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_frame_01_C_CheckCombinationVisionCost, _RetValue) == 0x000002, "Member 'WB_ui_Sas_frame_01_C_CheckCombinationVisionCost::_RetValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_frame_01_C_CheckCombinationVisionCost, CallFunc_GetGameMode_ReturnValue) == 0x000008, "Member 'WB_ui_Sas_frame_01_C_CheckCombinationVisionCost::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_frame_01_C_CheckCombinationVisionCost, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000010, "Member 'WB_ui_Sas_frame_01_C_CheckCombinationVisionCost::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_frame_01_C_CheckCombinationVisionCost, K2Node_DynamicCast_AsRSGame_Mode_BPInterface) == 0x000018, "Member 'WB_ui_Sas_frame_01_C_CheckCombinationVisionCost::K2Node_DynamicCast_AsRSGame_Mode_BPInterface' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_frame_01_C_CheckCombinationVisionCost, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WB_ui_Sas_frame_01_C_CheckCombinationVisionCost::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_frame_01_C_CheckCombinationVisionCost, CallFunc_Conv_IntToByte_ReturnValue) == 0x000029, "Member 'WB_ui_Sas_frame_01_C_CheckCombinationVisionCost::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_frame_01_C_CheckCombinationVisionCost, CallFunc_GetMainPlayerBP_Player) == 0x000030, "Member 'WB_ui_Sas_frame_01_C_CheckCombinationVisionCost::CallFunc_GetMainPlayerBP_Player' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_frame_01_C_CheckCombinationVisionCost, CallFunc_GetValidValue_ReturnValue) == 0x000038, "Member 'WB_ui_Sas_frame_01_C_CheckCombinationVisionCost::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_frame_01_C_CheckCombinationVisionCost, K2Node_DynamicCast_AsRSBattle_Player) == 0x000040, "Member 'WB_ui_Sas_frame_01_C_CheckCombinationVisionCost::K2Node_DynamicCast_AsRSBattle_Player' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_frame_01_C_CheckCombinationVisionCost, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'WB_ui_Sas_frame_01_C_CheckCombinationVisionCost::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_frame_01_C_CheckCombinationVisionCost, CallFunc_CheckCombinationVisionCost_bOK) == 0x000049, "Member 'WB_ui_Sas_frame_01_C_CheckCombinationVisionCost::CallFunc_CheckCombinationVisionCost_bOK' has a wrong offset!");

}

