#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Discover_1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Discover_1.WB_ui_Discover_1_C.ExecuteUbergraph_WB_ui_Discover_1
// 0x0048 (0x0048 - 0x0000)
struct WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDiscoverIconType                             K2Node_Event_Type;                                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57BB[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBattleCharacterHudInterface> K2Node_DynamicCast_AsBattle_Character_Hud_Interface; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57BC[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetHpGaugePoint_Point;                    // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable;                              // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1) == 0x000008, "Wrong alignment on WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1");
static_assert(sizeof(WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1) == 0x000048, "Wrong size on WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1");
static_assert(offsetof(WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1, EntryPoint) == 0x000000, "Member 'WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1, K2Node_Event_State) == 0x000004, "Member 'WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1, K2Node_Event_Type) == 0x000010, "Member 'WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1::K2Node_Event_Type' has a wrong offset!");
static_assert(offsetof(WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1, K2Node_DynamicCast_AsBattle_Character_Hud_Interface) == 0x000018, "Member 'WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1::K2Node_DynamicCast_AsBattle_Character_Hud_Interface' has a wrong offset!");
static_assert(offsetof(WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1, CallFunc_GetHpGaugePoint_Point) == 0x00002C, "Member 'WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1::CallFunc_GetHpGaugePoint_Point' has a wrong offset!");
static_assert(offsetof(WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1, Temp_struct_Variable) == 0x000038, "Member 'WB_ui_Discover_1_C_ExecuteUbergraph_WB_ui_Discover_1::Temp_struct_Variable' has a wrong offset!");

// Function WB_ui_Discover_1.WB_ui_Discover_1_C.SetDiscoverIcon
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Discover_1_C_SetDiscoverIcon final
{
public:
	EDiscoverIconType                             Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Discover_1_C_SetDiscoverIcon) == 0x000001, "Wrong alignment on WB_ui_Discover_1_C_SetDiscoverIcon");
static_assert(sizeof(WB_ui_Discover_1_C_SetDiscoverIcon) == 0x000001, "Wrong size on WB_ui_Discover_1_C_SetDiscoverIcon");
static_assert(offsetof(WB_ui_Discover_1_C_SetDiscoverIcon, Type) == 0x000000, "Member 'WB_ui_Discover_1_C_SetDiscoverIcon::Type' has a wrong offset!");

// Function WB_ui_Discover_1.WB_ui_Discover_1_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Discover_1_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Discover_1_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Discover_1_C_UpdateState");
static_assert(sizeof(WB_ui_Discover_1_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Discover_1_C_UpdateState");
static_assert(offsetof(WB_ui_Discover_1_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Discover_1_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Discover_1_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Discover_1_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Discover_1_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Discover_1_C_UpdateState::DeltaSeconds' has a wrong offset!");

}

