#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_TeamKizuna

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_TeamKizuna.WB_ui_TeamKizuna_C.ExecuteUbergraph_WB_ui_TeamKizuna
// 0x0048 (0x0048 - 0x0000)
struct WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_127A[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_127B[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_127C[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_127D[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_127E[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_127F[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna) == 0x000004, "Wrong alignment on WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna");
static_assert(sizeof(WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna) == 0x000048, "Wrong size on WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna");
static_assert(offsetof(WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna, EntryPoint) == 0x000000, "Member 'WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000011, "Member 'WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000018, "Member 'WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x00001C, "Member 'WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000020, "Member 'WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna, K2Node_Event_State) == 0x000024, "Member 'WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna, K2Node_Event_SubState) == 0x000028, "Member 'WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna, K2Node_Event_DeltaSeconds) == 0x00002C, "Member 'WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000030, "Member 'WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000034, "Member 'WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna, K2Node_SwitchInteger_CmpSuccess) == 0x000038, "Member 'WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000039, "Member 'WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x00003C, "Member 'WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000040, "Member 'WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x000044, "Member 'WB_ui_TeamKizuna_C_ExecuteUbergraph_WB_ui_TeamKizuna::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");

// Function WB_ui_TeamKizuna.WB_ui_TeamKizuna_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_TeamKizuna_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_TeamKizuna_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_TeamKizuna_C_UpdateState");
static_assert(sizeof(WB_ui_TeamKizuna_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_TeamKizuna_C_UpdateState");
static_assert(offsetof(WB_ui_TeamKizuna_C_UpdateState, State) == 0x000000, "Member 'WB_ui_TeamKizuna_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_TeamKizuna_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_TeamKizuna_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_TeamKizuna.WB_ui_TeamKizuna_C.StateNone
// 0x000C (0x000C - 0x0000)
struct WB_ui_TeamKizuna_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1280[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_TeamKizuna_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_TeamKizuna_C_StateNone");
static_assert(sizeof(WB_ui_TeamKizuna_C_StateNone) == 0x00000C, "Wrong size on WB_ui_TeamKizuna_C_StateNone");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_TeamKizuna_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_TeamKizuna_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000005, "Member 'WB_ui_TeamKizuna_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_TeamKizuna_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function WB_ui_TeamKizuna.WB_ui_TeamKizuna_C.StateOpen
// 0x001C (0x001C - 0x0000)
struct WB_ui_TeamKizuna_C_StateOpen final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1281[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1282[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1283[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_TeamKizuna_C_StateOpen) == 0x000004, "Wrong alignment on WB_ui_TeamKizuna_C_StateOpen");
static_assert(sizeof(WB_ui_TeamKizuna_C_StateOpen) == 0x00001C, "Wrong size on WB_ui_TeamKizuna_C_StateOpen");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateOpen, SubState) == 0x000000, "Member 'WB_ui_TeamKizuna_C_StateOpen::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_TeamKizuna_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateOpen, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_TeamKizuna_C_StateOpen::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_TeamKizuna_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateOpen, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x00000C, "Member 'WB_ui_TeamKizuna_C_StateOpen::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00000D, "Member 'WB_ui_TeamKizuna_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000010, "Member 'WB_ui_TeamKizuna_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000014, "Member 'WB_ui_TeamKizuna_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000018, "Member 'WB_ui_TeamKizuna_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");

// Function WB_ui_TeamKizuna.WB_ui_TeamKizuna_C.StateLoop
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_TeamKizuna_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1284[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1285[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_TeamKizuna_C_StateLoop) == 0x000004, "Wrong alignment on WB_ui_TeamKizuna_C_StateLoop");
static_assert(sizeof(WB_ui_TeamKizuna_C_StateLoop) == 0x000018, "Wrong size on WB_ui_TeamKizuna_C_StateLoop");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_TeamKizuna_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_TeamKizuna_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_TeamKizuna_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_TeamKizuna_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00000C, "Member 'WB_ui_TeamKizuna_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00000D, "Member 'WB_ui_TeamKizuna_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000010, "Member 'WB_ui_TeamKizuna_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_TeamKizuna_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");

// Function WB_ui_TeamKizuna.WB_ui_TeamKizuna_C.StateClose
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_TeamKizuna_C_StateClose final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1286[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1287[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_TeamKizuna_C_StateClose) == 0x000004, "Wrong alignment on WB_ui_TeamKizuna_C_StateClose");
static_assert(sizeof(WB_ui_TeamKizuna_C_StateClose) == 0x000018, "Wrong size on WB_ui_TeamKizuna_C_StateClose");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateClose, SubState) == 0x000000, "Member 'WB_ui_TeamKizuna_C_StateClose::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_TeamKizuna_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateClose, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_TeamKizuna_C_StateClose::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateClose, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000006, "Member 'WB_ui_TeamKizuna_C_StateClose::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_TeamKizuna_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00000C, "Member 'WB_ui_TeamKizuna_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00000D, "Member 'WB_ui_TeamKizuna_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000010, "Member 'WB_ui_TeamKizuna_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_TeamKizuna_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");

// Function WB_ui_TeamKizuna.WB_ui_TeamKizuna_C.SetBaseText
// 0x0030 (0x0030 - 0x0000)
struct WB_ui_TeamKizuna_C_SetBaseText final
{
public:
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
};
static_assert(alignof(WB_ui_TeamKizuna_C_SetBaseText) == 0x000008, "Wrong alignment on WB_ui_TeamKizuna_C_SetBaseText");
static_assert(sizeof(WB_ui_TeamKizuna_C_SetBaseText) == 0x000030, "Wrong size on WB_ui_TeamKizuna_C_SetBaseText");
static_assert(offsetof(WB_ui_TeamKizuna_C_SetBaseText, CallFunc_GetDataBaseManager_Manager) == 0x000000, "Member 'WB_ui_TeamKizuna_C_SetBaseText::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_SetBaseText, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'WB_ui_TeamKizuna_C_SetBaseText::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_SetBaseText, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WB_ui_TeamKizuna_C_SetBaseText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WB_ui_TeamKizuna.WB_ui_TeamKizuna_C.SetTeamBondsLevel
// 0x0070 (0x0070 - 0x0000)
struct WB_ui_TeamKizuna_C_SetTeamBondsLevel final
{
public:
	int32                                         _TeamBondsMaxLevel;                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _TeamBondsLevel;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1288[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	EPlayerID                                     Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1289[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserParamManager*                      CallFunc_GetUserParamManager_UserParamManager;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTeamBondsMaxLevel_ReturnValue;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_128A[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSCharacterBase*                       CallFunc_GetPlayer_ReturnValue;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IPlayerInterface>      K2Node_DynamicCast_AsPlayer_Interface;             // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_128B[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamBondsLevel_ReturnValue;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_TeamKizuna_C_SetTeamBondsLevel) == 0x000008, "Wrong alignment on WB_ui_TeamKizuna_C_SetTeamBondsLevel");
static_assert(sizeof(WB_ui_TeamKizuna_C_SetTeamBondsLevel) == 0x000070, "Wrong size on WB_ui_TeamKizuna_C_SetTeamBondsLevel");
static_assert(offsetof(WB_ui_TeamKizuna_C_SetTeamBondsLevel, _TeamBondsMaxLevel) == 0x000000, "Member 'WB_ui_TeamKizuna_C_SetTeamBondsLevel::_TeamBondsMaxLevel' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_SetTeamBondsLevel, _TeamBondsLevel) == 0x000004, "Member 'WB_ui_TeamKizuna_C_SetTeamBondsLevel::_TeamBondsLevel' has a wrong offset!");
static_assert(offsetof(WB_ui_TeamKizuna_C_SetTeamBondsLevel, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000008, "Member 'WB_ui_TeamKizuna_C_SetTeamBondsLevel::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
